[
  {
    "title": "Nigel Farage accused of ‘ripping up’ human rights laws after unveiling plans for mass deportations - UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/aug/26/nigel-farage-mass-deportations-reform-migration-small-boats-uk-politics-live",
    "image": "https://media.guim.co.uk/e8b7a1ed496a920d0d07260b55fee2c2779e3160/135_0_5320_4256/500.jpg",
    "summary": "Nigel Farage has unveiled a controversial policy plan proposing the deportation of 600,000 asylum seekers, including women and children, should Reform UK secure victory in the next election. The policy aims to address concerns over immigration in the UK. Critics have raised ethical concerns about the impact on vulnerable populations.",
    "published": "2025-08-26T11:28:35Z"
  },
  {
    "title": "Work with partners on security guarantees ‘must be accelerated,’ Zelenskyy says - Europe live",
    "url": "https://www.theguardian.com/world/live/2025/aug/26/donald-trump-putin-zelenskyy-france-meeting-europe-live",
    "image": "https://media.guim.co.uk/477ac28699b2237288db7470555603ec1d9665f0/2048_2232_2683_2146/500.jpg",
    "summary": "Finnish President Sauli Niinistö stated that details regarding Ukraine's defense strategy will be provided soon. He characterized Russia's actions as employing a \"typical\" delaying tactic. The announcements are anticipated to contribute to the ongoing international response to the conflict.",
    "published": "2025-08-26T11:26:02Z"
  },
  {
    "title": "UK retail stocks tumble as Deutsche Bank cuts ratings, French market drops on political fears - business live",
    "url": "https://www.theguardian.com/business/live/2025/aug/26/trump-fire-federal-reserve-governor-dollar-falls-markets-business-live-news",
    "image": "https://media.guim.co.uk/7fbea4014b19db09e1bfa1684a2ca222ee7681df/421_0_4840_3872/500.jpg",
    "summary": "Financial markets are experiencing fluctuations due to various global economic indicators. Analysts are closely monitoring inflation rates and central bank policies that may impact investor confidence. Additionally, ongoing geopolitical tensions continue to influence market performance and predictions.",
    "published": "2025-08-26T11:23:30Z"
  },
  {
    "title": "UN warns Israel that its probe into IDF attack on Gaza hospital must yield actual results – Middle East crisis live",
    "url": "https://www.theguardian.com/world/live/2025/aug/26/israel-gaza-protest-hostage-war-hospital-benjamin-netanyahu-latest-live-news-updates",
    "image": "https://media.guim.co.uk/7b6384e508dd405aafc1dfe5dde37fd9ff1859c3/912_0_4560_3648/500.jpg",
    "summary": "A UN official noted that while investigations into various issues have been announced, there has been a lack of follow-through, results, and accountability measures. This statement underscores ongoing concerns about the effectiveness of these investigations. The official's remarks highlight a call for improved transparency and actions.",
    "published": "2025-08-26T11:22:52Z"
  },
  {
    "title": "Trump’s attempt to fire Federal Reserve chief denounced as ‘authoritarian power grab’ - US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/aug/26/trump-federal-reserve-lisa-cook-news-updates-us-politics-live",
    "image": "https://media.guim.co.uk/8c0d132cafe709eddec2a9ad2e44629b19958282/0_0_3000_2400/500.jpg",
    "summary": "Donald Trump is accused of fabricating mortgage fraud allegations against Lisa Cook, leading to significant backlash from prominent Democrats. The situation highlights ongoing tensions between Trump and the Democratic Party. Reactions from political leaders underscore the seriousness of the accusations.",
    "published": "2025-08-26T11:15:39Z"
  }
]
