[
  {
    "title": "Denmark v Scotland, Isak in action for Sweden and more: 2026 World Cup qualifiers - clockwatch",
    "url": "https://www.theguardian.com/football/live/2025/sep/05/denmark-v-scotland-isak-in-action-for-sweden-and-more-2026-world-cup-qualifiers-clockwatch",
    "image": "https://media.guim.co.uk/d3f05fe40952e7e2db9c3be10b6f84a7ea32a673/994_0_1546_1237/500.jpg",
    "summary": "Barry Glendenning will provide live updates as Scotland faces Denmark in Copenhagen, along with coverage of nine additional World Cup qualifiers. Fans can expect real-time commentary and match insights. Stay tuned for the latest developments in these crucial matches.",
    "published": "2025-09-05T19:23:33Z"
  },
  {
    "title": "Chelsea v Manchester City: WSL – football live",
    "url": "https://www.theguardian.com/football/live/2025/sep/05/chelsea-v-manchester-city-wsl-football-live",
    "image": "https://media.guim.co.uk/b8031ad562e5d5cd2b578350e3680d594c5c6b90/228_571_2048_1638/500.jpg",
    "summary": "Chelsea hosts Manchester City at Stamford Bridge to open the new Women's Super League (WSL) season. Rob Smyth provides minute-by-minute coverage of the match. Fans can follow the action as both teams compete for an early season advantage.",
    "published": "2025-09-05T19:21:29Z"
  },
  {
    "title": "US Open tennis 2025: Novak Djokovic v Carlos Alcaraz, men’s semi-final – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/05/us-open-tennis-2025-novak-djokovic-carlos-alcaraz-mens-semi-final-live",
    "image": "https://media.guim.co.uk/21e00cac2be4c09296a0c01cd639a8e6c0e703dc/274_256_3669_2935/500.jpg",
    "summary": "Katy Murrells provides live updates from the first men's semi-final at Flushing Meadows. Fans can follow the game-by-game developments as the match progresses. This report highlights key moments and performances in the highly anticipated match.",
    "published": "2025-09-05T19:18:49Z"
  },
  {
    "title": "Most of 475 people arrested by US immigration agents at Georgia Hyundai facility are Korean nationals – live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/05/donald-trump-pentagon-department-of-war-immigration-tariffs-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/044eb5ce3fb7049437c4044c77272848f314af01/996_0_5000_4000/500.jpg",
    "summary": "ICE's investigative division carried out a warrant related to an ongoing criminal investigation. A spokesperson from homeland security confirmed the action to Reuters. Further details about the investigation have not been disclosed.",
    "published": "2025-09-05T19:18:31Z"
  },
  {
    "title": "US added just 22,000 jobs in August, continuing slowdown amid Trump tariffs",
    "url": "https://www.theguardian.com/business/2025/sep/05/us-jobs-report-august-tariffs",
    "image": "https://media.guim.co.uk/1039ce90d54237f459b9d3236b371bd769c7ee56/0_0_2000_1600/500.jpg",
    "summary": "The latest report reveals that the US job market suffered a setback, with a loss of 13,000 jobs in June. This development adds to existing economic concerns. The survey highlights ongoing challenges in sustaining employment growth.",
    "published": "2025-09-05T19:14:36Z"
  }
]