[
  {
    "title": "Trump reportedly asks EU to levy 100% tariffs on India and China; Ozempic maker Novo to cut 9,000 jobs – business live",
    "url": "https://www.theguardian.com/business/live/2025/sep/10/trade-tariffs-eu-trump-ozempic-novo-jobs-markets-business-live-news",
    "image": "https://media.guim.co.uk/a22500b598bb72689541af622cd81fac33541b21/345_0_3452_2761/500.jpg",
    "summary": "The US president aims to increase pressure on Russia to halt its ongoing war in Ukraine. This initiative includes leveraging diplomatic channels and possibly enhancing sanctions. The goal is to reinvigorate international efforts for a peaceful resolution to the conflict.",
    "published": "2025-09-10T13:17:25Z"
  },
  {
    "title": "New French PM takes office as ‘Block Everything’ protests rock country – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/sep/10/france-block-everything-protests-macron-lecornu-europe-live-news-updates",
    "image": "https://media.guim.co.uk/49aa09c6389391c30114a68ffa44f289fbb77b90/258_0_2778_2223/500.jpg",
    "summary": "Sébastien Lecornu has been appointed as a key official in France during a period of widespread protests. Notably, around 1,000 demonstrators attempted to breach the Gare du Nord station in Paris. The protests reflect growing public dissent on various issues in the country.",
    "published": "2025-09-10T13:16:31Z"
  },
  {
    "title": "Surrey v Warwickshire, Somerset v Yorkshire and more: county cricket – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/10/surrey-v-warwickshire-somerset-v-yorkshire-and-more-county-cricket-live",
    "image": "https://media.guim.co.uk/f0ff7d69f121d19d04ce8d7c69d556f5c26cbf89/707_0_2685_2149/500.jpg",
    "summary": "Tanya Alfred provides key updates from day three of the County Championship, covering matches taking place at Lord’s and the Oval. Exciting developments and performances are highlighted from the ongoing games. Stay tuned for the latest scores and insights from the tournament.",
    "published": "2025-09-10T13:16:25Z"
  },
  {
    "title": "Poland closer to conflict than any time since second world war, PM says, as Russia claims drone incursion was unintentional – live",
    "url": "https://www.theguardian.com/world/live/2025/sep/10/poland-pm-condemns-repeated-violation-of-airspace-amid-russian-attack-on-ukraine-follow-live",
    "image": "https://media.guim.co.uk/92578a1472baee91e63f8d63d17b71d38123b961/541_0_2416_1934/500.jpg",
    "summary": "Donald Tusk reported that there were 19 violations of Polish airspace overnight. He stated that it is likely that four drones were shot down during these incidents. This situation raises concerns about national security and airspace integrity in Poland.",
    "published": "2025-09-10T13:14:19Z"
  },
  {
    "title": "White House says it would back forensic analysis of signature on Epstein letter – live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/10/donald-trump-jeffrey-epstein-tariffs-immigration-crime-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/b0e5d7e8b7aa33fd498746bbd3662c425557d965/603_29_1913_1531/500.jpg",
    "summary": "Trump officials maintain that a suggestive note and drawing circulating in the media were not created by the former president. They assert that the content does not reflect his style or intent. The controversy has sparked debate about the authenticity of the items associated with Trump.",
    "published": "2025-09-10T13:12:54Z"
  }
]