[
  {
    "title": "Australia v India: fourth men’s Twenty20 international – live",
    "url": "https://www.theguardian.com/sport/live/2025/nov/06/australia-v-india-mens-cricket-twenty20-international-live-updates",
    "image": "https://media.guim.co.uk/b1b4718cc9f5156fe37148e07965e23db049bf83/357_0_2498_1998/500.jpg",
    "summary": "The T20 series is currently tied 1-1 as the two sides prepare for their crucial penultimate match. Martin Pegan will provide updates throughout the game. Fans can expect an exciting showdown to determine the series lead.",
    "published": "2025-11-06T08:26:44Z"
  },
  {
    "title": "Bank of England to make ‘finely balanced decision’ on whether to cut interest rates at midday – business live",
    "url": "https://www.theguardian.com/business/live/2025/nov/06/bank-of-england-interest-rates-andrew-bailey-stock-markets-pound-budget-business-live-news",
    "image": "https://media.guim.co.uk/cf2749c6401a2fc1124fba5bf11661e1d65ffbe6/1032_0_5908_4727/500.jpg",
    "summary": "Analysts are speculating that the Bank of England (BoE) may lower interest rates in today's meeting. This possibility arises amidst ongoing economic and financial developments. Stay tuned for real-time updates on the outcome and its potential impact.",
    "published": "2025-11-06T08:24:47Z"
  },
  {
    "title": "Inquest finds German backpacker Simone Strobel killed by homicide - but can’t say who attacker was",
    "url": "https://www.theguardian.com/australia-news/2025/nov/06/inquest-german-backpacker-simone-strobel-homicide-lismore",
    "image": "https://media.guim.co.uk/cce759219fa7863618d58fdcda34300106e5f112/0_39_3798_3037/500.jpg",
    "summary": "The latest inquest has overturned earlier findings of a \"very strong suspicion\" regarding a potential connection between a member of Strobel's traveling party and her death near a Lismore campground. This new ruling contradicts previous conclusions drawn in the case. Investigations into Strobel's death continue as authorities seek clarity on the circumstances surrounding it.",
    "published": "2025-11-06T08:22:26Z"
  },
  {
    "title": "Death by Lightning review – absolutely nobody plays losers like Matthew Macfadyen",
    "url": "https://www.theguardian.com/tv-and-radio/2025/nov/06/death-by-lightning-review-matthew-macfadyen-netflix",
    "image": "https://media.guim.co.uk/4bf4040ab5af90148976ef1b0101376d753f5d83/133_0_3000_2400/500.jpg",
    "summary": "The Succession actor delivers an outstanding performance in a captivating historical miniseries. His role as the assassin who killed the U.S. president in 1881 showcases his exceptional talent. This portrayal elevates his craft to new heights.",
    "published": "2025-11-06T08:01:48Z"
  },
  {
    "title": "How Tesla shareholders could make Elon Musk the world’s first trillionaire",
    "url": "https://www.theguardian.com/technology/2025/nov/06/how-tesla-shareholders-elon-musk-trillionaire",
    "image": "https://media.guim.co.uk/146ea600371c47e796f9b3708122efd144613cab/458_0_4583_3667/500.jpg",
    "summary": "Shareholder votes on a $1 trillion pay package will be counted on November 6. The package includes additional milestones beyond just increasing the company’s market cap. This proposal reflects a broader approach to compensation linked to overall company performance.",
    "published": "2025-11-06T08:00:52Z"
  }
]