[
  {
    "title": "Maresca short on Sterling sympathy, Arsenal make boardroom reshuffle: football – live",
    "url": "https://www.theguardian.com/football/live/2025/sep/19/champions-league-reaction-premier-league-news-and-more-football-live",
    "image": "https://media.guim.co.uk/41c34d8d2376d7603d71fc9720b48b3a75b4f5a8/1055_358_4180_3344/500.jpg",
    "summary": "Stay updated with the latest news, previews, and commentary as the weekend approaches. Our writers will provide insightful analysis and highlights. Don't miss out on the discussions shaping the stories of the week.",
    "published": "2025-09-19T14:38:10Z"
  },
  {
    "title": "Congress prepares to vote on short-term funding bill to avert US government shutdown – live updates",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/19/donald-trump-jimmy-kimmel-suspension-abc-federal-reserve-lisa-cook-us-politics-live-news",
    "image": "https://media.guim.co.uk/c00e3f9a6347adc76b9640b15169029986f6ed55/510_0_4240_3392/500.jpg",
    "summary": "A Republican bill to fund the government until November 21 has garnered support from House GOP leadership, who believe it will pass. However, Democrats plan to oppose the measure. The funding extension aims to prevent a government shutdown.",
    "published": "2025-09-19T14:34:50Z"
  },
  {
    "title": "Josh Shapiro and Pete Buttigieg respond to revelations from Kamala Harris’s book",
    "url": "https://www.theguardian.com/us-news/2025/sep/19/kamala-harris-107-days-book-shapiro-buttigieg",
    "image": "https://media.guim.co.uk/dfb9701f6c2265ff48039595326996c30bef9eac/0_0_3000_2400/500.jpg",
    "summary": "In her memoir titled \"107 Days,\" Kamala Harris shares her reflections on potential running mates, specifically mentioning Pennsylvania Governor Josh Shapiro and former Transportation Secretary Pete Buttigieg. The memoir provides insight into her thoughts on their political viability and qualifications. Harris's considerations highlight the ongoing discussions about her future campaign strategies.",
    "published": "2025-09-19T14:34:17Z"
  },
  {
    "title": "World Athletics Championships 2025: Lyles and Jefferson-Wooden take 200m titles, Benjamin and Bol win 400m hurdles – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/19/world-athletics-championships-2025-200m-finals-heptathlon-and-more-live",
    "image": "https://media.guim.co.uk/d9160b48a7783a3975526834a12ac60ed775425d/345_0_3541_2833/500.jpg",
    "summary": "Yara El-Shaboury will provide updates on night seven of the Tokyo events. Highlights include both the men's and women's 200m finals. Expect exciting performances as athletes compete for medals.",
    "published": "2025-09-19T14:30:07Z"
  },
  {
    "title": "Israel army says it will use ‘unprecedented force’ in Gaza City and urges residents to leave – Middle East crisis live",
    "url": "https://www.theguardian.com/world/live/2025/sep/19/palestinian-state-palestine-recognition-gaza-israel-middle-east-latest-news-updates",
    "image": "https://media.guim.co.uk/b6b4bc91900cc8d6234004a75c18df5c2675efe4/417_0_3333_2667/500.jpg",
    "summary": "The Israeli Defense Forces (IDF) have instructed residents of Gaza City to evacuate south for safety. However, they have simultaneously closed the Sala al-Din road, which is a critical route for evacuation. This has raised concerns about the feasibility of the evacuation for those trying to escape the conflict.",
    "published": "2025-09-19T14:19:47Z"
  }
]