[
  {
    "title": "Transfer deadline day: Isak and Wissa deals agreed; Sancho, Jackson, Donnarumma and more – live",
    "url": "https://www.theguardian.com/football/live/2025/sep/01/transfer-deadline-day-guehi-wissa-martinez-ederson-latest-and-more-live",
    "image": "https://media.guim.co.uk/704430d3f382497ffef31e0d9c92a3fdfe269ba2/611_0_4299_3440/500.jpg",
    "summary": "Join John Brewin for real-time updates on an eventful deadline day, featuring the latest transfers and news. Stay tuned for all the significant moves as they happen. Don't miss any action from this lively day in sports.",
    "published": "2025-09-01T11:24:43Z"
  },
  {
    "title": "Afghanistan earthquake live: more than 800 dead after shallow quake strikes country’s east, state media reports",
    "url": "https://www.theguardian.com/world/live/2025/sep/01/afghanistan-earthquake-live-hundreds-after-shallow-quake-strikes-countrys-east-state-media-reports",
    "image": "https://media.guim.co.uk/4a505703b0a4050ac22ad1014630c49509de5ce0/0_0_2333_1867/500.jpg",
    "summary": "Rescue operations are underway in Kunar province following the complete destruction of several villages, according to the ministry for public health. The extent of the damage has prompted urgent humanitarian efforts. The situation remains critical as authorities assess the needs of affected residents.",
    "published": "2025-09-01T11:19:09Z"
  },
  {
    "title": "Tories claim No 10 mini reshuffle shows government ‘in crisis’ – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/01/women-children-home-office-refugee-family-reunions-uk-politics-live-latest-updates-news",
    "image": "https://media.guim.co.uk/0857e134f72cf3dc611a753d014bef613706e6c3/988_176_3858_3087/500.jpg",
    "summary": "Darren Jones has been appointed to a new senior position in Downing Street. Former adviser to Tony Blair, Tim Allan, will take charge of communications. These changes signal a shift in the government's approach and messaging strategy.",
    "published": "2025-09-01T11:06:14Z"
  },
  {
    "title": "Von der Leyen’s plane affected by GPS jamming over weekend, says European Commission – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/sep/01/volodymyr-zelenskyy-ukraine-donald-trump-semi-deadline-war-end-europe-latest-updates-news-live",
    "image": "https://media.guim.co.uk/88f4ae4aad36f581368f70c29bbda6ff911c144e/525_0_5253_4205/500.jpg",
    "summary": "A plane safely landed in Bulgaria amidst suspicions of jamming signals, which authorities attribute to \"blatant interference from Russia.\" The European Commission spokesperson highlighted concerns over the incident. Investigations are underway to determine the extent and cause of the interference.",
    "published": "2025-09-01T11:05:55Z"
  },
  {
    "title": "Arsenal intended to be attacking at Liverpool but still ‘deserved better’, claims Merino",
    "url": "https://www.theguardian.com/football/2025/sep/01/arsenal-intended-attacking-liverpool-deserved-better-mikel-merino",
    "image": "https://media.guim.co.uk/b173ee38e999c518f17d958c574e912653f61793/343_75_3464_2772/500.jpg",
    "summary": "Arsenal's manager, Mikel Merino, noted that despite only managing one shot on target during their match at Anfield, the team had to adjust their gameplan. The comments reflect the challenges faced by the team in securing a favorable outcome. The game highlighted Arsenal's struggles against a strong opponent.",
    "published": "2025-09-01T11:00:35Z"
  }
]