[
  {
    "title": "Rachel Reeves given extra £3bn for budget after VAT error fixed",
    "url": "https://www.theguardian.com/business/2025/oct/08/rachel-reeves-given-extra-3bn-for-budget-after-vat-error-fixed",
    "image": "https://media.guim.co.uk/60c58ff0e5d1aa268dc3bfc08e2356807aa5aae0/873_0_4499_3602/500.jpg",
    "summary": "The Office for National Statistics (ONS) reports that its estimates of public borrowing have been consistently over or under by £200 million to £500 million each month since January. This discrepancy raises concerns about the accuracy of financial reporting. The ongoing issues may impact fiscal policy and economic planning.",
    "published": "2025-10-08T08:20:14Z"
  },
  {
    "title": "Badenoch criticised for ‘nonsensical’ plan to cut student numbers by 100,000 – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/oct/08/conservative-tory-conference-kemi-badenoch-labour-keir-starmer-india-uk-politics-live-news-updates",
    "image": "https://media.guim.co.uk/be7873506bca9015706b6ca9009813df4a731560/239_0_3333_2667/500.jpg",
    "summary": "The Tory leader proposed a plan aimed at safeguarding the interests of taxpayers and students. However, university representatives criticized the proposal as being \"economically illiterate.\" The debate highlights a divide between political intentions and academic concerns.",
    "published": "2025-10-08T08:20:13Z"
  },
  {
    "title": "Gaza ceasefire talks live: Hamas says hostage and prisoner lists exchanged with Israel",
    "url": "https://www.theguardian.com/world/live/2025/oct/08/gaza-ceasefire-talks-israel-hamas-trump-us-qatar-turkey-egypt-live-news-updates",
    "image": "https://media.guim.co.uk/7edff8dee2afbac3984dcf086ad40564c666668a/262_0_3078_2463/500.jpg",
    "summary": "Qatari Prime Minister, along with US officials Witkoff and Kushner, is participating in negotiations between Hamas and Israeli representatives concerning a Gaza plan initiated by Trump. This collaboration aims to address ongoing tensions and outline potential frameworks for peace in the region. The involvement of these key figures underscores the significance of international diplomacy in resolving the Gaza conflict.",
    "published": "2025-10-08T08:19:42Z"
  },
  {
    "title": "Outgoing French PM says ‘there is desire’ to agree budget and talks down prospect of snap election – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/oct/08/france-emmanuel-macron-lecornu-europe-live-news-updates",
    "image": "https://media.guim.co.uk/904ef0e59c88443374c91a959753d34bb663bb86/881_821_2732_2185/500.jpg",
    "summary": "Sébastien Lecornu addressed attendees at the Matignon Palace, expressing confidence that the parliament will remain intact. He emphasized a belief in the stability and functionality of the current legislative body. Lecornu's remarks suggest an expectation of continued governance without the need for dissolution.",
    "published": "2025-10-08T08:18:12Z"
  },
  {
    "title": "The Decadence by Leon Craig review – queer haunted house tale fails to chill",
    "url": "https://www.theguardian.com/books/2025/oct/08/the-decadence-by-leon-craig-review-queer-haunted-house-tale-fails-to-chill",
    "image": "https://media.guim.co.uk/658a6a9c068928be8abb3cb554bfa39521b01e34/188_0_6142_4912/500.jpg",
    "summary": "A group of affluent university friends escape to the countryside in a setting reminiscent of a gothic novel. The narrative focuses on the atmosphere and emotional undercurrents rather than a traditional plot. Their retreat explores themes of privilege, nostalgia, and the complexities of their relationships.",
    "published": "2025-10-08T08:01:19Z"
  }
]