[
  {
    "title": "Starmer says he expects debate about ‘full horror’ of what happened in Gaza when media allowed in – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/oct/14/keir-starmer-china-national-security-spying-gaza-nigel-farage-uk-politics-live-news-updates",
    "image": "https://media.guim.co.uk/a62e2bee5a65addf5e2afa8e22f90a0f32212ab2/388_2_1151_921/500.jpg",
    "summary": "Prime Minister praises Donald Trump's role in the Middle East peace agreement, acknowledging his contributions. However, he emphasizes that the focus must now shift to the effective implementation of the deal. The remarks highlight the importance of actionable steps moving forward.",
    "published": "2025-10-14T15:18:55Z"
  },
  {
    "title": "Obama backs California’s Proposition 50 to counter Texas redistricting",
    "url": "https://www.theguardian.com/us-news/2025/oct/14/obama-california-prop-50-redistricting-texas",
    "image": "https://media.guim.co.uk/0e30b41b0ccdec7e6ac0b9fbaa3d87862d86fdcf/499_0_5001_4002/500.jpg",
    "summary": "The former president is advocating for support of a ballot measure that Democrats claim could potentially add up to five additional seats in the U.S. House of Representatives. This push highlights the ongoing electoral strategies ahead of upcoming elections. The measure is positioned as a key component for shaping future political representation.",
    "published": "2025-10-14T15:17:07Z"
  },
  {
    "title": "‘Under 5ft 5in? Forget about being a prince!’ How the Royal Ballet is kicking out the old rules",
    "url": "https://www.theguardian.com/stage/2025/oct/14/royal-ballet-school-old-rules-next-generation-dancer-future",
    "image": "https://media.guim.co.uk/554be16fa399abd70859ca23014cc8e37b1e0c6f/250_0_2500_2000/500.jpg",
    "summary": "The future of ballet is evolving as new training methods are being implemented at a specialized hunting lodge for young dancers. Innovations in technique, performance, and style are shaping the next generation of ballet artists. These changes aim to redefine the traditional image of ballet dancers and embrace a more diverse range of talent and expression.",
    "published": "2025-10-14T15:16:35Z"
  },
  {
    "title": "House speaker defends administration’s move to keep military paid during government shutdown – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/14/donald-trump-government-shutdown-national-guard-javier-milei-charlie-kirk-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/71f9f04ad27b7d129dea2a5442081efa2fdd331e/616_0_4167_3335/500.jpg",
    "summary": "Mike Johnson stated that the Trump administration is entitled to reallocate funds approved by Congress to the Department of Defense. He emphasized the legality of this action regarding the movement of appropriated dollars. Johnson's comments reflect ongoing discussions about budget control and defense funding.",
    "published": "2025-10-14T15:14:09Z"
  },
  {
    "title": "‘Instability and whiplash’ as CDC slashes 1,300 jobs before reinstating half",
    "url": "https://www.theguardian.com/us-news/2025/oct/14/cdc-job-cuts-partial-reversal",
    "image": "https://media.guim.co.uk/7d1d936b22c00e7cb731a6d5beb6aa1ef75e9897/526_0_5261_4209/500.jpg",
    "summary": "The Trump administration reported that 700 notices were mistakenly sent out, raising concerns about the decision-making process behind it. A former top CDC officer criticized the administration for not fully considering the implications of their actions. The situation highlights ongoing issues related to communication and management during the pandemic.",
    "published": "2025-10-14T15:13:15Z"
  }
]