[
  {
    "title": "News live: Australia and PNG sign defence treaty; Allan says Melbourne’s Metro line to open this year",
    "url": "https://www.theguardian.com/australia-news/live/2025/oct/06/australia-news-live-queensland-bushfire-danger-warnings-moreton-island-croydon-park-shooting-sydney-anthony-albanese-sussan-ley-andrew-hastie-labor-liberal-ntwnfb",
    "image": "https://media.guim.co.uk/66e5dfa086b8389366e5aac1eaedfbcc0608d5e8/839_0_6880_5504/500.jpg",
    "summary": "I'm sorry, but I need the content or details of the news you would like summarized. Could you provide that information?",
    "published": "2025-10-06T02:58:05Z"
  },
  {
    "title": "Australian Gaza flotilla activists detained by Israel complain of ‘degrading and humiliating’ treatment",
    "url": "https://www.theguardian.com/world/2025/oct/06/australian-gaza-flotilla-activists-detained-by-israel-complain-of-degrading-and-humiliating-treatment",
    "image": "https://media.guim.co.uk/235a2e53e0e1500a7a9f024a1f8acea1ecf0dc8f/0_306_1536_1229/500.jpg",
    "summary": "Two individuals have reported severe injuries while interacting with consular officials; one claims to have suffered a dislocated arm and head trauma, while another expresses concern about potentially having a stroke. The incidents highlight ongoing issues surrounding consular treatment and safety. Further investigation may be needed to address these reports.",
    "published": "2025-10-06T02:46:15Z"
  },
  {
    "title": "Louis CK defends decision to perform at Riyadh comedy festival as ‘a good opportunity’",
    "url": "https://www.theguardian.com/culture/2025/oct/06/louis-ck-defends-riyadh-comedy-festival-performance-good-opportunity",
    "image": "https://media.guim.co.uk/4fd3dbf4a8d810f378b2e8c31c7933987980aba2/70_0_1861_1489/500.jpg",
    "summary": "A comedian expressed ambivalence about performing in Saudi Arabia, acknowledging the country's human rights issues. However, he ultimately views the event as a \"positive thing.\" The sentiment highlights the ongoing debate over artistic expression in nations with controversial human rights records.",
    "published": "2025-10-06T01:09:01Z"
  },
  {
    "title": "NRL grand final sets TV ratings record and eclipses AFL for first time in decade",
    "url": "https://www.theguardian.com/sport/2025/oct/06/nrl-grand-final-brisbane-broncos-melbourne-storm-tv-ratings-record-eclipses-afl-first-time-decade",
    "image": "https://media.guim.co.uk/b618d93569974f53e552b46a198dd4076b8a2fc9/423_0_4211_3370/500.jpg",
    "summary": "The Broncos vs. Storm match drew an average audience of 4.46 million viewers, making it the highest-rated program of 2025 so far. This significant viewership highlights the popularity of the event. The match's strong ratings underscore the growing interest in rugby league.",
    "published": "2025-10-06T00:59:08Z"
  },
  {
    "title": "Trump news at a glance: Democrats say administration refusing shutdown talks as president repeats threat of firings",
    "url": "https://www.theguardian.com/us-news/2025/oct/06/trump-administration-news-updates-today-latest",
    "image": "https://media.guim.co.uk/a29060dc2a05ad61dba9f39f2af958cbbe957899/402_0_3331_2666/500.jpg",
    "summary": "Chuck Schumer expressed frustration over the administration's unwillingness to engage in discussions with congressional leaders. This statement highlights ongoing tensions in U.S. politics as key issues remain unresolved. The situation underscores the challenges of bipartisan collaboration in current governance.",
    "published": "2025-10-06T00:46:47Z"
  }
]