[
  {
    "title": "Arsenal 4-1 London City Lionesses: WSL – live reaction",
    "url": "https://www.theguardian.com/football/live/2025/sep/06/arsenal-v-london-city-lionesses-wsl-football-live",
    "image": "https://media.guim.co.uk/278455fa5a1fd0c2db99665ce99cd92601765ecd/784_480_2229_1783/500.jpg",
    "summary": "Newly-promoted team, known for their significant spending, allowed two late goals in a match that ended with a scoreline favoring the European champions. The result highlighted their struggle despite the financial investments. Rob Smyth will provide ongoing updates and reactions to the game.",
    "published": "2025-09-06T14:28:54Z"
  },
  {
    "title": "Italian F1 Grand Prix qualifying – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/06/italian-f1-grand-prix-qualifying-live",
    "image": "https://media.guim.co.uk/37364083a329c6b64bf40dcc35d9bcf02a78f6ce/877_0_4193_3354/500.jpg",
    "summary": "Billy Munday provides live updates on the ongoing Formula One season at Monza. Fans can follow the report for the latest developments and key moments from the event. Stay tuned for real-time coverage of the race.",
    "published": "2025-09-06T14:27:58Z"
  },
  {
    "title": "No early election, says prime minister’s key adviser, as reshuffle to continue with junior ministerial changes – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/06/no-early-election-angela-rayner-resignation-nigel-farage-reform-uk-politics-live-news-latest",
    "image": "https://media.guim.co.uk/ef89e6d973b2d1173f1dff0d29de38013d336ef3/393_0_3928_3143/500.jpg",
    "summary": "Chief Secretary Darren Jones stated that Angela Rayner's resignation accelerated a planned reshuffle within the Labour Party. He emphasized that there is no division within the party despite the leadership changes. The reshuffle comes as part of ongoing strategic adjustments following Rayner's departure.",
    "published": "2025-09-06T14:25:03Z"
  },
  {
    "title": "Trump claims Chicago is ‘world’s most dangerous city’. The four most violent ones are all in red states",
    "url": "https://www.theguardian.com/us-news/2025/sep/06/trump-chicago-crime-red-states-violent",
    "image": "https://media.guim.co.uk/676563a3cd86f7a5637a9fd24c348fe49e1a9d57/822_0_4541_3635/500.jpg",
    "summary": "In 2024, Jackson, Birmingham, St. Louis, and Memphis reported the highest murder rates in the United States. Notably, all four cities are located in Republican-led states. This trend has raised concerns about public safety and governance in these regions.",
    "published": "2025-09-06T14:00:53Z"
  },
  {
    "title": "More than 7,000 under-fives in Gaza put in malnutrition recovery in two-week period",
    "url": "https://www.theguardian.com/world/2025/sep/06/unicef-under-5s-recovery-programmes-acute-malnutrition-gaza",
    "image": "https://media.guim.co.uk/2747f1a5bc59b3baeb63aef9c9f7f2f525057248/559_0_5602_4480/500.jpg",
    "summary": "UNICEF projects that the number of new patients in August will surpass 15,000, significantly increasing from the February total. This marks a rise of more than seven times compared to earlier figures. The surge highlights escalating health concerns and the growing need for support and resources.",
    "published": "2025-09-06T14:00:53Z"
  }
]