[
  {
    "title": "Fired US health official warns of RFK Jr’s risk to public health: ‘We’re going to see kids dying of vaccine-preventable diseases’ – live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/17/donald-trump-charlie-kirk-free-speech-nyt-cdc-rfk-epstein-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/0513a52813319b3e300af54bada3851f8d126040/881_0_4415_3532/500.jpg",
    "summary": "Susan Monarez, former director of the CDC, has stated that the U.S. is unprepared to tackle chronic diseases or respond effectively to future pandemics. Her comments come after her dismissal in August. She emphasizes the need for improved strategies to safeguard public health.",
    "published": "2025-09-17T16:43:21Z"
  },
  {
    "title": "Thousands of anti-Trump protesters march in London as king and senior royals host US president in Windsor – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/17/donald-trump-uk-state-visit-king-charles-windsor-politics-latest-news-updates-labour-keir-starmer",
    "image": "https://media.guim.co.uk/450e777ece049f0c36ae99fb18a04be50795d650/143_0_4728_3783/500.jpg",
    "summary": "Anti-Trump protesters gathered in London while the US president attended events in Windsor. The demonstration coincided with a state banquet held in his honor. Participants voiced their opposition to his policies and actions.",
    "published": "2025-09-17T16:42:39Z"
  },
  {
    "title": "Nationwide chair first major British lender boss to publicly engage with Reform UK",
    "url": "https://www.theguardian.com/business/2025/sep/17/nationwide-chair-first-major-british-lender-boss-to-publicly-engage-with-reform-uk",
    "image": "https://media.guim.co.uk/d278334e79ea58da68fccd5e19fb119638f8354e/856_0_4267_3415/500.jpg",
    "summary": "A building society is supporting Kevin Parry after he attended a breakfast event for a far-right party, sitting next to party leader Richard Tice. The society's defense comes amid scrutiny over the implications of his participation. Parry's attendance raises concerns about his affiliations and the potential impact on the society's reputation.",
    "published": "2025-09-17T16:42:01Z"
  },
  {
    "title": "Labor statistics chief fired by Trump sounds alarm over White House’s ‘dangerous’ interference",
    "url": "https://www.theguardian.com/business/2025/sep/17/labor-statistics-chief-trump-erika-mcentarfer",
    "image": "https://media.guim.co.uk/096d5ad9b818dff18dbadfc4f84457328eba348a/0_41_800_640/500.jpg",
    "summary": "Erika McEntarfer emphasizes that Americans need to be vigilant regarding the autonomy of essential economic institutions. She warns that potential threats to their independence could impact economic stability and policymaking. McEntarfer advocates for awareness and proactive measures to safeguard these institutions.",
    "published": "2025-09-17T16:41:25Z"
  },
  {
    "title": "RFK Jr’s actions have greatly diminished US ability to respond to outbreaks, ousted CDC officials say",
    "url": "https://www.theguardian.com/us-news/2025/sep/17/rfk-jr-senate-hearing-cdc-susan-monarez",
    "image": "https://media.guim.co.uk/7091ebe723a06f8fe00a2c29bce01d75a80dfb42/507_0_4583_3667/500.jpg",
    "summary": "Former officials testified before the U.S. Senate, claiming that the CDC under Dr. Robert Kennedy is endorsing policies not grounded in scientific evidence. Their statements have raised concerns about the agency's decision-making and reliance on data. The testimony may prompt further scrutiny of the CDC's operations and credibility.",
    "published": "2025-09-17T16:40:25Z"
  }
]