[
  {
    "title": "China sends coast guard to Senkaku islands amid row with Japan",
    "url": "https://www.theguardian.com/world/2025/nov/16/china-sends-coast-guard-to-senkaku-islands-amid-row-with-japan",
    "image": "https://media.guim.co.uk/cdceb7494b3a5c2495b55baf3a71c1bba67fe4be/0_5_3148_2518/500.jpg",
    "summary": "Increased activity has been observed around Japanese-held islands, which are also claimed by China. This follows Japanese Prime Minister Sanae Takaichi's statement suggesting Japan may use military force if Taiwan is invaded. The situation highlights escalating tensions in the region concerning territorial claims and security responses.",
    "published": "2025-11-16T07:02:46Z"
  },
  {
    "title": "Britain’s biggest housebuilder urges government to support first-time buyers",
    "url": "https://www.theguardian.com/business/2025/nov/16/britains-biggest-housebuilder-urges-government-to-support-first-time-buyers",
    "image": "https://media.guim.co.uk/1f0cad5501c4b18162afeacb3e30301b13d00215/490_0_6159_4928/500.jpg",
    "summary": "Taylor Wimpey CEO Jennie Daly has urged for the reinstatement of the Help-to-Buy equity loan scheme to boost the struggling property market. She believes this initiative could help increase home purchases and support aspiring homeowners. The call comes as the market faces challenges amid rising costs and economic uncertainty.",
    "published": "2025-11-16T07:00:27Z"
  },
  {
    "title": "Domestic abuse victims who flee with children overseas to be criminalised under new law",
    "url": "https://www.theguardian.com/uk-news/2025/nov/16/domestic-abuse-victims-children-overseas-crime-police-bill-law",
    "image": "https://media.guim.co.uk/1745c80e98e5578b2dec4cdaa0a34f7b259a80cf/526_0_2317_1855/500.jpg",
    "summary": "Fathers' rights groups are advocating for changes to a crime and policing bill to strengthen support for cross-border abduction cases. They aim to address the challenges faced by parents in these situations. The proposed amendments seek to enhance law enforcement's response and resources for affected families.",
    "published": "2025-11-16T07:00:26Z"
  },
  {
    "title": "10 places to stay in the UK and Europe where you can travel back in time",
    "url": "https://www.theguardian.com/travel/2025/nov/16/10-places-to-stay-uk-europe-live-in-the-past-history",
    "image": "https://media.guim.co.uk/38b7316453b7689b98238cd5b7815e6fccbca3bf/845_0_8445_6756/500.jpg",
    "summary": "A selection of historical hotels and guesthouses is showcased, ranging from a Tudor manor in Wales to a vibrant 1960s hotel in Prague. Each establishment carries its own rich legacy and charm, attracting guests seeking unique experiences. These accommodations highlight the blend of history and hospitality across different cultures and eras.",
    "published": "2025-11-16T07:00:25Z"
  },
  {
    "title": "‘Ghost broking’: cut-price car insurance isn’t all it seems",
    "url": "https://www.theguardian.com/money/2025/nov/16/ghost-broking-cut-price-car-insurance-scam-watch",
    "image": "https://media.guim.co.uk/5cb51cece390c42d35a9ec4ab2879ca0d4df44e1/468_0_4680_3744/500.jpg",
    "summary": "Scammers are luring motorists with advertisements promising cheaper insurance policies through social media and AI-generated websites. However, these fraudulent schemes provide fake certificates, leaving individuals uninsured. Authorities warn that victims could face severe financial repercussions without valid coverage.",
    "published": "2025-11-16T07:00:24Z"
  }
]