[
  {
    "title": "Nottingham Forest 2-3 Midtjylland, Feyenoord 0-2 Aston Villa, and more: Europa League – live",
    "url": "https://www.theguardian.com/football/live/2025/oct/02/nottingham-forest-v-midtjylland-feyenoord-v-aston-villa-and-more-europa-league-live",
    "image": "https://media.guim.co.uk/75e21ba2b028f34a6d1545ebf4fdd04a680e1fbc/522_103_3907_3127/500.jpg",
    "summary": "Niall McVeigh will provide updates on Thursday's matches featuring Aston Villa, Nottingham Forest, Celtic, and Rangers. Fans can look forward to insights and key moments from the games. Stay tuned for live coverage and analysis.",
    "published": "2025-10-02T21:15:35Z"
  },
  {
    "title": "Australia news live: retired admiral criticises Aukus deal; decision expected in NSW psychiatrists pay dispute",
    "url": "https://www.theguardian.com/australia-news/live/2025/oct/03/png-agreement-aukus-submarines-pact-anthony-albanese-richard-marles-retired-admiral-slams-aukus-deal-gaza-flotilla-intercepted-ntwnfb",
    "image": "https://media.guim.co.uk/0dc4d4eeb260400394ce1a25afa2c5185b9c6593/237_0_4293_3434/500.jpg",
    "summary": "I cannot provide a summary as you haven't included any specific news content. Please provide the details you'd like summarized!",
    "published": "2025-10-02T21:14:06Z"
  },
  {
    "title": "US government shutdown: Donald Trump promises firings and cuts to ‘Democrats’ favorite projects’ if shutdown continues – live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/02/government-shutdown-trump-democrats-latest-updates",
    "image": "https://media.guim.co.uk/c3e5ae42cde3fc08bf667034b821b3fbbb11cc0d/384_0_4252_3402/500.jpg",
    "summary": "President stated in an interview with OAN that he has the authority to eliminate programs or initiatives that he believes should not have been approved. This remark reflects his commitment to reevaluating and refining government spending. The comment has sparked discussions about fiscal responsibility and executive power.",
    "published": "2025-10-02T21:13:19Z"
  },
  {
    "title": "Manchester synagogue attack suspect named by police after two people killed and three injured – latest updates",
    "url": "https://www.theguardian.com/uk-news/live/2025/oct/02/police-reports-stabbing-synagogue-greater-manchester-live",
    "image": "https://media.guim.co.uk/6da09441c7555ac45dc38234f002d0884a6a8a15/216_0_5000_4000/500.jpg",
    "summary": "Greater Manchester Police have identified Jihad Al-Shamie, 35, as a British citizen linked to terrorism-related activities. Three individuals have been arrested and are currently in custody on charges related to preparing acts of terrorism. The investigation is ongoing as authorities work to uncover further details.",
    "published": "2025-10-02T21:10:44Z"
  },
  {
    "title": "Nottingham Forest horror show on home European return adds to Postecoglou pain",
    "url": "https://www.theguardian.com/football/2025/oct/02/nottingham-forest-midtjylland-europa-league-match-report",
    "image": "https://media.guim.co.uk/df0fcd828439a73e8e6c904c6bc394f34f5f44d2/9_0_2270_1816/500.jpg",
    "summary": "Nottingham Forest faced a disappointing 3-2 loss to Midtjylland in their first home European match at the City Ground in 29 years. The team struggled defensively, particularly during set pieces, which contributed to their defeat. The match marked a challenging return to European competition for the club.",
    "published": "2025-10-02T21:04:37Z"
  }
]