[
  {
    "title": "Arsenal v Crystal Palace, Aston Villa v Manchester City and more: Premier League clockwatch – live",
    "url": "https://www.theguardian.com/football/live/2025/oct/26/arsenal-crystal-palace-aston-villa-manchester-city-premier-league-clockwatch-live",
    "image": "https://media.guim.co.uk/364457f637a985934996ba4a77f44e61c3a38019/8_0_4457_3566/500.jpg",
    "summary": "Arsenal and Manchester City are both looking to strengthen their title prospects in the upcoming matches. Meanwhile, Wolves will face Burnley in a crucial game that could impact early season standings. The action is set to unfold with insights from Emillia Hawkins.",
    "published": "2025-10-26T13:23:43Z"
  },
  {
    "title": "Epping sex offender back in custody after being released from prison in error",
    "url": "https://www.theguardian.com/uk-news/2025/oct/26/epping-sex-offender-back-in-custody-after-being-released-from-prison-in-error",
    "image": "https://media.guim.co.uk/9e732036dc4879dcab45acf1ad2974486c6eb2e2/103_5_2043_1635/500.jpg",
    "summary": "Hadush Gerberslasie Kebatu, whose detention sparked summer protests in Essex, was observed appearing 'confused' following his release from HMP Chelmsford. Concerns over his mental health and wellbeing were raised during this time. The case highlights ongoing debates around immigration and detention policies in the UK.",
    "published": "2025-10-26T13:04:26Z"
  },
  {
    "title": "Clásico buildup, Hearts v Celtic, Arsenal host Crystal Palace and more – matchday live",
    "url": "https://www.theguardian.com/football/live/2025/oct/26/clasico-buildup-hearts-v-celtic-arsenal-host-crystal-palace-and-more-matchday-live",
    "image": "https://media.guim.co.uk/89de0d3e0b41600a9c8a83ec248a7e59587ca79d/0_0_5000_4000/500.jpg",
    "summary": "Reaction has poured in following the surprising outcomes in Saturday's Premier League matches. Meanwhile, updates on the Hearts vs. Celtic game are ongoing, as excitement builds for the upcoming clash between Real Madrid and Barcelona. Fans are eagerly anticipating these key matchups in both Scottish and Spanish football.",
    "published": "2025-10-26T13:03:27Z"
  },
  {
    "title": "Jewish New York’s reckoning with Zohran Mamdani: ‘He’s become a vehicle for our tensions’",
    "url": "https://www.theguardian.com/us-news/2025/oct/26/zohran-mamdani-jewish-voters-new-york",
    "image": "https://media.guim.co.uk/296f3e28a30de49990d606e477366575e10619f3/499_0_5001_4000/500.jpg",
    "summary": "A tour by a mayoral candidate aiming for Jewish support highlights the division within the electorate regarding Israel. Varying perspectives on the candidate's historic bid for office showcase deep-seated differences in the community. The outreach efforts illustrate the complexities of navigating these tensions in the current political landscape.",
    "published": "2025-10-26T13:00:04Z"
  },
  {
    "title": "How to make sweet-and-sour pork – recipe | Felicity Cloake's Masterclass",
    "url": "https://www.theguardian.com/food/2025/oct/26/how-to-make-sweet-and-sour-pork-recipe-felicity-cloake",
    "image": "https://media.guim.co.uk/771547c65c07fdbdbbef754e68048f2f6530455e/46_1677_4921_3937/500.jpg",
    "summary": "This article introduces a straightforward recipe for a beloved Chinese dish that can be made at home. It highlights the simplicity, with only nine easy steps required to prepare the meal. The emphasis is on enjoying a delicious homemade alternative to takeout.",
    "published": "2025-10-26T13:00:04Z"
  }
]