[
  {
    "title": "Strictly Come Dancing: week two – live",
    "url": "https://www.theguardian.com/tv-and-radio/live/2025/oct/04/strictly-come-dancing-week-two-live",
    "image": "https://media.guim.co.uk/3a925c7ab0c93d0f7d458d2239e5605a30e357c3/395_0_3953_3162/500.jpg",
    "summary": "Stefan Dennis showcases his moves while Thomas Skinner performs a salsa and Ellie Goldstein dances to Ellie Goulding's music. The excitement builds as viewers await to see who will be eliminated from the competition. The dancefloor remains buzzing with performances and anticipation.",
    "published": "2025-10-04T20:18:05Z"
  },
  {
    "title": "Police make almost 500 arrests at Palestine Action protest in London",
    "url": "https://www.theguardian.com/world/2025/oct/04/palestine-action-protest-police-arrests-london-demo",
    "image": "https://media.guim.co.uk/51163e7da7d008c6cbcc9a4da5a69a6fa232b354/492_0_5196_4155/500.jpg",
    "summary": "Officers arrested activists during a silent vigil for a banned organization, as protests continued despite the Prime Minister's calls for restraint. The demonstrations aimed to show solidarity with the group amid ongoing tensions. Police presence was heightened as events unfolded, highlighting the clash between authorities and demonstrators.",
    "published": "2025-10-04T20:02:43Z"
  },
  {
    "title": "Tories to pledge to create immigration taskforce modelled on Trump’s Ice",
    "url": "https://www.theguardian.com/politics/2025/oct/04/tories-to-pledge-to-create-immigration-taskforce-modelled-on-trumps-ice",
    "image": "https://media.guim.co.uk/48490adb6e90d8394c7ead4fef115165ebab3ce5/740_269_4664_3731/500.jpg",
    "summary": "A proposed \"removals force\" is set to be established to deport 150,000 undocumented immigrants annually. This initiative aims to address the growing issue of illegal immigration. The plan reflects a government's commitment to strengthen immigration enforcement.",
    "published": "2025-10-04T20:00:14Z"
  },
  {
    "title": "Israel accused of detaining Greta Thunberg in infested cell and making her hold flags",
    "url": "https://www.theguardian.com/world/2025/oct/04/greta-thunberg-israel-gaza-sweden",
    "image": "https://media.guim.co.uk/2735fa231ccf96659c8932566e14cf2a6303a4b5/0_443_900_719/500.jpg",
    "summary": "An activist has reported to Swedish officials that she has experienced severe mistreatment, highlighting issues such as inadequate food and water. She raised these concerns during a recent meeting. The revelations have drawn attention to treatment conditions faced by activists.",
    "published": "2025-10-04T19:51:49Z"
  },
  {
    "title": "Trump says Gaza peace deal ‘very close’ as Israel continues airstrikes",
    "url": "https://www.theguardian.com/us-news/2025/oct/04/trump-gaza-peace-deal",
    "image": "https://media.guim.co.uk/19ba808694dd1815899671459d506b5480e216d5/489_0_4080_3264/500.jpg",
    "summary": "US President Biden announced to Axios that he aims to finalize a deal between Israel and Hamas within the coming days. He emphasized the urgency of reaching an agreement to address the ongoing conflict. The effort reflects the US's commitment to promoting stability in the region.",
    "published": "2025-10-04T19:15:12Z"
  }
]