[
  {
    "title": "Cop30: calls for new urgency to talks as studies show global warming may reach 2.5C – latest updates",
    "url": "https://www.theguardian.com/environment/live/2025/nov/17/cop30-belem-brazil-global-warming-latest-news-updates",
    "image": "https://media.guim.co.uk/327e6fba7b2548a2ca7bdb3f0dfa1f1eb50f4236/427_0_4272_3417/500.jpg",
    "summary": "The summit has entered its second week amid ongoing complex issues. Delegates are increasingly anxious about the potential outcomes of the conference. Tensions are rising as key decisions remain unresolved.",
    "published": "2025-11-17T17:18:59Z"
  },
  {
    "title": "Child among six dead after atmospheric river storm drenches California",
    "url": "https://www.theguardian.com/us-news/2025/nov/17/california-atmospheric-river-storm",
    "image": "https://media.guim.co.uk/ea66450b43f775447bad67139683aa466c15c689/264_0_6113_4891/500.jpg",
    "summary": "Lingering thunderstorms in the Los Angeles area, recently affected by wildfires, are raising concerns about potential mudslides. The combination of saturated soil and steep terrain increases the risk of landslides. Authorities are urging vigilance as weather conditions continue to develop.",
    "published": "2025-11-17T17:17:16Z"
  },
  {
    "title": "Home Office says past ‘hesitancy’ over removal of families and children of failed asylum seekers was wrong – live",
    "url": "https://www.theguardian.com/politics/live/2025/nov/17/immigration-asylum-keir-starmer-labour-shabana-mahmood-uk-politics-live-news-updates",
    "image": "https://media.guim.co.uk/aab163538c09231a41ca48be387938e663e0fbf5/801_153_3831_3065/500.jpg",
    "summary": "A Labour MP has criticized the government's asylum plans as \"dystopian,\" highlighting strong backlash against what he describes as a \"cruel\" policy. The comments come amidst increasing concerns regarding the treatment of asylum seekers. The debate continues as advocates argue for more humane approaches.",
    "published": "2025-11-17T17:16:10Z"
  },
  {
    "title": "UK officials ‘working day and night’ to resolve NHS drug pricing row’",
    "url": "https://www.theguardian.com/business/2025/nov/17/uk-officials-working-to-resolve-nhs-drug-pricing-row-minister-says",
    "image": "https://media.guim.co.uk/1a481d7b2850e28630124230a12178365e12675e/519_0_5188_4150/500.jpg",
    "summary": "Patrick Vallance announced the government's efforts to improve relations with the pharmaceutical industry while outlining ambitions for the life sciences sector. He emphasized the importance of collaboration to foster innovation and growth in healthcare. The initiative aims to strengthen the UK's position in the global life sciences market.",
    "published": "2025-11-17T17:15:35Z"
  },
  {
    "title": "US judge finds evidence of ‘government misconduct’ in federal case against Comey",
    "url": "https://www.theguardian.com/us-news/2025/nov/17/james-comey-case-trump-justice-department",
    "image": "https://media.guim.co.uk/93d1cfd6220247088519cee2b26a6d481805073e/253_0_2536_2028/500.jpg",
    "summary": "A federal judge has ordered the release of grand jury materials to James Comey's defense team. This decision pertains to Comey's involvement in a legal matter related to his tenure as FBI director. The release of these materials may impact ongoing legal proceedings.",
    "published": "2025-11-17T17:14:48Z"
  }
]