[
  {
    "title": "Colombia recalls US ambassador amid spat with Trump over strikes on alleged drug boats",
    "url": "https://www.theguardian.com/world/2025/oct/20/colombia-recalls-us-ambassador-trump",
    "image": "https://media.guim.co.uk/488b1068a4859286fa00a06f1f29b1bee22011c1/0_0_1500_1200/500.jpg",
    "summary": "Colombian President Gustavo Petro has accused the U.S. of being responsible for the death of a local fisherman due to a boat attack. This incident comes amid tensions as former President Trump threatens to reduce aid to Colombia. The situation highlights strained relations and concerns over U.S. actions in the region.",
    "published": "2025-10-20T16:23:33Z"
  },
  {
    "title": "Nandy says it was wrong to exclude Maccabi Tel Aviv fans as safety option for Villa match given rising antisemitism – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/oct/20/uk-politics-latest-news-updates-prince-andrew-covid-starmer-labour-reform-education",
    "image": "https://media.guim.co.uk/522bc7830b55a5151c160821bb27d3f0f4dda619/258_55_1774_1420/500.jpg",
    "summary": "The Culture Secretary addressed an urgent question in the Commons regarding an upcoming match, assuring that adequate policing resources will be available. She emphasized that there will be no issues related to security or law enforcement during the event. The statement aims to reassure the public and stakeholders ahead of the match.",
    "published": "2025-10-20T16:23:12Z"
  },
  {
    "title": "US supreme court to consider whether drug users can legally own guns",
    "url": "https://www.theguardian.com/us-news/2025/oct/20/supreme-court-gun-drug-use-case",
    "image": "https://media.guim.co.uk/933e39dcf32636a87bc7a3e1e81a9b86d4b3ec63/240_0_2400_1921/500.jpg",
    "summary": "The Trump administration defends federal laws that prevent drug users from possessing firearms, asserting they are reasonable restrictions. They argue that such regulations enhance public safety. This position comes amid ongoing debates over gun rights and substance use laws.",
    "published": "2025-10-20T16:22:17Z"
  },
  {
    "title": "Amazon battles to fix Web Services outage after millions of users report disruption to websites and apps – business live",
    "url": "https://www.theguardian.com/business/live/2025/oct/20/china-economic-growth-gdp-low-house-prices-fall-stock-markets-ftse-business-live-news",
    "image": "https://media.guim.co.uk/c243af906d58094cf7e7337e109f67c64d00da26/492_0_4240_3393/500.jpg",
    "summary": "Several popular online services, including Fortnite, Roblox, SnapChat, Lloyds Bank, and Ring doorbells, experienced significant outages. Users reported issues accessing these platforms, leading to widespread frustration. The cause of the disruption has not yet been disclosed.",
    "published": "2025-10-20T16:22:08Z"
  },
  {
    "title": "Donald Trump and Australian prime minister Anthony Albanese sign rare earth minerals deal – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/20/james-comey-donald-trump-charges-shutdown-albanese-politics-live-updates",
    "image": "https://media.guim.co.uk/ab37ce296c0e13307134fc6eacc17025809485fa/639_0_6017_4816/500.jpg",
    "summary": "US President emphasizes discussions on trade and military equipment, particularly submarines. Australian Prime Minister Albanese highlights a significant agreement worth $8.5 billion to supply rare earths to the US. The partnership aims to strengthen economic and security ties between the two countries.",
    "published": "2025-10-20T16:15:21Z"
  }
]