[
  {
    "title": "India v Australia: Women’s Cricket World Cup semi-final – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/30/india-v-australia-womens-cricket-world-cup-semi-final-live",
    "image": "https://media.guim.co.uk/1fe45a467312c9c447b4a0ef0f0fafad72c60595/285_0_2007_1605/500.jpg",
    "summary": "The second semi-final in Navi Mumbai features co-hosts India facing off against the defending champions. Follow our writers for live updates and detailed commentary throughout the match. Stay tuned for the latest developments as the game unfolds.",
    "published": "2025-10-30T13:27:31Z"
  },
  {
    "title": "I Love LA review – Rachel Sennott’s HBO comedy finds itself but takes its time",
    "url": "https://www.theguardian.com/tv-and-radio/2025/oct/30/i-love-la-review-rachel-sennott-hbo",
    "image": "https://media.guim.co.uk/bbf93ac9baff38fe8ea22c620bdb05f93b37c443/496_0_5002_4004/500.jpg",
    "summary": "The star from \"Shiva Baby\" and \"Bottoms\" is set to headline a new glossy sitcom, providing a mixed viewing experience initially. The show encounters some unevenness in its early episodes. However, it starts to find its footing and improve as it progresses towards the finale.",
    "published": "2025-10-30T13:26:51Z"
  },
  {
    "title": "FTSE 100 winning streak ends as WPP shares hit lowest level since 2008, ECB holds rates at 2% - business live",
    "url": "https://www.theguardian.com/business/live/2025/oct/30/oil-price-trump-xi-trade-deal-shell-profit-stocks-business-live-news",
    "image": "https://media.guim.co.uk/02265b379740c2085a4ff74b6da035807caeda7e/330_0_2813_2250/500.jpg",
    "summary": "Economic and financial news is experiencing ongoing developments, with various updates being reported in real-time. Key focus areas include market trends, inflation rates, and fiscal policies impacting global economies. Analysts are closely monitoring these changes to assess their implications for businesses and consumers.",
    "published": "2025-10-30T13:24:51Z"
  },
  {
    "title": "Yvonne Brewster obituary",
    "url": "https://www.theguardian.com/stage/2025/oct/30/yvonne-brewster-obituary",
    "image": "https://media.guim.co.uk/86e855f63c25da7986732dc05a196c513bcff621/937_147_4288_3430/500.jpg",
    "summary": "Theatre director and founder of Talawa, a company dedicated to promoting writers and actors of African and Caribbean descent, has made significant contributions to the arts. Talawa focuses on showcasing diverse narratives and talent within the theatre industry. The director's work has played a crucial role in elevating underrepresented voices.",
    "published": "2025-10-30T13:24:01Z"
  },
  {
    "title": "ECB keeps interest rates on hold despite eurozone inflation fears",
    "url": "https://www.theguardian.com/business/2025/oct/30/ecb-interest-rates-eurozone-inflation",
    "image": "https://media.guim.co.uk/48a042a8249628bf8e757ede36f56f139902a5d0/962_0_6430_5147/500.jpg",
    "summary": "The central bank has maintained the key deposit rate at 2% despite signs of economic recovery that are contributing to rising prices across the region. This decision suggests a cautious approach to monetary policy amid inflationary pressures. Analysts will be closely monitoring the impact of this rate hold on future economic developments.",
    "published": "2025-10-30T13:17:09Z"
  }
]