[
  {
    "title": "Alisson out for Liverpool; Manchester United stadium latest; Palmer out for six weeks – football live",
    "url": "https://www.theguardian.com/football/live/2025/oct/17/premier-league-returns-with-liverpool-v-manchester-united-buildup-football-live",
    "image": "https://media.guim.co.uk/085b54ad151639f57ef3c1775998534233e5227f/27_0_4736_3789/500.jpg",
    "summary": "A rolling report is underway as writers provide updates leading up to an exciting weekend of football. Fans can expect continuous coverage and insights on the matches. Stay tuned for the latest news and developments in the football world.",
    "published": "2025-10-17T09:20:54Z"
  },
  {
    "title": "FTSE 100 heading for worst day since April as US regional bank worries rock markets – business live",
    "url": "https://www.theguardian.com/business/live/2025/oct/17/us-dollar-worst-week-since-august-trade-tensions-stock-markets-bonds-business-live-news",
    "image": "https://media.guim.co.uk/e377b16e9d60276db23a73b8447d47e7d5b2dcec/500_0_5000_4000/500.jpg",
    "summary": "The FTSE 100 index experienced a decline of 150 points in early trading, reflecting negative trends in the economic and financial markets. Ongoing rolling coverage highlights the factors contributing to this downturn. Analysts are closely monitoring the situation for potential impacts on investment and consumer confidence.",
    "published": "2025-10-17T09:19:27Z"
  },
  {
    "title": "Ministers to explore reversing ban on Maccabi Tel Aviv fans attending UK match after PM’s criticism – politics live",
    "url": "https://www.theguardian.com/politics/live/2025/oct/17/keir-starmer-uk-politics-latest-news-updates-maccabi-tel-aviv-fans-banned",
    "image": "https://media.guim.co.uk/ad5ab2cf424cf4344730f6a222e4514c6bb29857/1021_889_3944_3156/500.jpg",
    "summary": "Fans of the Israeli football team have been banned from attending the Europa League match against Aston Villa on November 6. This decision comes amid safety concerns. The situation reflects ongoing tensions and security issues surrounding the event.",
    "published": "2025-10-17T09:19:12Z"
  },
  {
    "title": "Infectious diseases in Gaza ‘spiralling out of control’, says WHO – Middle East live",
    "url": "https://www.theguardian.com/world/live/2025/oct/17/israel-gaza-ceasefire-hostages-hamas-benjamin-netanyahu-middle-east-latest-news-updates",
    "image": "https://media.guim.co.uk/726ed06187054db3c45c835841391d11bdb8de04/199_0_4560_3648/500.jpg",
    "summary": "A UN official highlighted the immense challenges posed by various diseases, including meningitis, diarrhoea, and respiratory illnesses. They emphasized the significant efforts required to address these health issues. The statement underscores the ongoing global health burden and the need for coordinated action.",
    "published": "2025-10-17T09:14:49Z"
  },
  {
    "title": "York and Toulouse complete 14-team Super League as London Broncos miss out",
    "url": "https://www.theguardian.com/sport/2025/oct/17/york-and-toulouse-complete-14-team-super-league-london-broncos-miss-out",
    "image": "https://media.guim.co.uk/1a9cadf35a5ad01aaa9669d41b1b077f02f8b298/30_0_2399_1918/500.jpg",
    "summary": "The Rugby Football League (RFL) has announced that York and Toulouse will join the expanded 14-team Super League for the upcoming season. In contrast, the London Broncos have been excluded from the league. This decision marks a significant change in the league's composition.",
    "published": "2025-10-17T09:04:22Z"
  }
]