[
  {
    "title": "Danish PM warns security situation in Europe will get worse and more serious – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/oct/01/mette-frederiksen-denmark-europe-russia-vladimir-putin-volodymyr-zelenskyy-ukraine-hybrid-war-security-europe-live-news",
    "image": "https://media.guim.co.uk/3a2046c1b05f2c3d33d25b6814cef100f5cbcee9/566_0_5618_4495/500.jpg",
    "summary": "Mette Frederiksen warns that Europe is grappling with threats stemming from the ongoing war in Ukraine and a broader hybrid warfare landscape. She emphasizes the urgency of addressing these challenges to ensure regional security. The remarks highlight the evolving nature of conflicts and the need for a coordinated response from European nations.",
    "published": "2025-10-01T08:25:08Z"
  },
  {
    "title": "UK’s FTSE 100 share index hits record high as investors shrug off US government shutdown – business live",
    "url": "https://www.theguardian.com/business/live/2025/oct/01/uk-house-prices-return-to-growth-us-dollar-shutdown-manufacturing-growth-business-live-news",
    "image": "https://media.guim.co.uk/74ba1d6637e24977b469b130f707df3cecca3f94/196_0_2989_2391/500.jpg",
    "summary": "The latest economic and financial news highlights ongoing developments in global markets, fluctuating interest rates, and investor reactions to economic indicators. Key trends include shifts in inflation rates and central bank policies that may impact growth. Analysts continue to monitor these factors closely as they shape the economic landscape.",
    "published": "2025-10-01T08:24:08Z"
  },
  {
    "title": "New Zealand v Australia: men’s first T20 international cricket – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/01/mens-t20-international-cricket-live-new-zealand-v-australia",
    "image": "https://media.guim.co.uk/2d6e9c7657a758d8f4f098f3dd445b21790fd436/682_0_3438_2750/500.jpg",
    "summary": "Australia faces New Zealand in a three-match Twenty20 series at Bay Oval, Tauranga. Angus Fontaine will provide live updates throughout the matches. Fans can follow the action as two competitive teams clash on the field.",
    "published": "2025-10-01T08:23:28Z"
  },
  {
    "title": "US government shutdown live: first closure since 2018 begins after funding bill fails",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/01/us-government-shutdown-update-2025-shutting-funding-trump-democrats-republicans-live-updates-latest-news",
    "image": "https://media.guim.co.uk/685443f5ce0b4b296a6b29873ed1b20e4a02d776/327_0_4844_3876/500.jpg",
    "summary": "Competing bills aimed at addressing the government shutdown were rejected in the Senate, with Republicans and Democrats blaming each other for partisan politics. The standoff continues to leave the government in limbo as both parties fail to reach an agreement. Updates on the situation are ongoing as the impact of the shutdown unfolds.",
    "published": "2025-10-01T08:22:59Z"
  },
  {
    "title": "What does a government shutdown mean and why is this year’s threat more serious?",
    "url": "https://www.theguardian.com/us-news/2025/sep/27/government-shutdown-explainer",
    "image": "https://media.guim.co.uk/088a5ad99a96b6d6ac8ffba8b9a2958fdbc95cdc/124_0_3111_2488/500.jpg",
    "summary": "The US government has shut down due to Congress's failure to reach a funding agreement. Essential services will continue while non-essential operations are halted, affecting various sectors. Moving forward, negotiations will be crucial for reopening and determining the impact on federal employees and public services.",
    "published": "2025-10-01T08:22:51Z"
  }
]