[
  {
    "title": "New York mayor-elect Zohran Mamdani challenges Donald Trump in victory speech as Democrats win key US election races – live",
    "url": "https://www.theguardian.com/us-news/live/2025/nov/04/nyc-mayor-election-zohran-mamdani-andrew-cuomo-results-latest",
    "image": "https://media.guim.co.uk/a8a175efb88ab9a3e3fab71c8a0ee2e6bf4486ed/349_0_2972_2379/500.jpg",
    "summary": "Mamdani criticizes \"oligarchy and authoritarianism,\" addressing Trump directly in his speech. This follows the Democrats' victory in California's redistricting vote and the gubernatorial elections in New Jersey and Virginia. The speech highlights ongoing political tensions and the implications of these electoral outcomes.",
    "published": "2025-11-05T07:10:08Z"
  },
  {
    "title": "‘Like we won the championship’: New Yorkers celebrate Mamdani’s win with cheers, tears and DSA chants",
    "url": "https://www.theguardian.com/us-news/2025/nov/05/zohran-mamdani-new-york-cheers-tears-dsa-chants",
    "image": "https://media.guim.co.uk/6a782669e1e026bac2283c11ec8d60c4ebac08a7/500_0_5000_4000/500.jpg",
    "summary": "In Brooklyn, Queens, and the Bronx, local bodegas, bars, and clubs were filled with joyous celebrations. The atmosphere was charged with emotion as community members gathered together. The night marked a significant occasion that brought residents closer.",
    "published": "2025-11-05T07:04:04Z"
  },
  {
    "title": "Celebrity chefs urge Britons to ‘bang in some beans’ to boost legume consumption",
    "url": "https://www.theguardian.com/environment/2025/nov/05/celebrity-chefs-urge-britons-to-bang-in-some-beans-to-boost-legume-consumption",
    "image": "https://media.guim.co.uk/c5191ee2bcc463a2dec656bc750c8f2a23d1df34/226_0_5000_4000/500.jpg",
    "summary": "Celebrity chefs Jamie Oliver and Hugh Fearnley-Whittingstall, along with major supermarkets, are advocating for a significant increase in bean consumption among Britons. They aim to double the amount of beans consumed in the UK to promote healthier diets and sustainability. This initiative is part of a broader campaign to encourage plant-based eating and reduce meat dependency.",
    "published": "2025-11-05T07:00:21Z"
  },
  {
    "title": "US supreme court to hear oral arguments on legality of Trump imposing tariffs",
    "url": "https://www.theguardian.com/us-news/2025/nov/04/trump-tariffs-supreme-court-oral-arguments",
    "image": "https://media.guim.co.uk/0102a4e5aea7ff695040c87ed59e1224e3cb6cc8/358_0_3575_2860/500.jpg",
    "summary": "A significant legal challenge will evaluate President's tariffs, which aim to apply tariffs on nearly all US trading partners. This scrutiny is crucial in determining the legitimacy and effectiveness of his trade strategy. The outcome could have substantial implications for international trade relations.",
    "published": "2025-11-05T07:00:21Z"
  },
  {
    "title": "‘A shot of adrenaline’: readers pass on 90s club classics to new generations",
    "url": "https://www.theguardian.com/music/2025/nov/05/a-shot-of-adrenaline-readers-pass-on-90s-club-classics-to-new-generations",
    "image": "https://media.guim.co.uk/92c02031047321de826670ef52a837b2ab28f58a/123_0_3179_2543/500.jpg",
    "summary": "The recent John Lewis Christmas ad has evoked feelings of nostalgia among viewers. In response, readers are sharing their favorite 90s songs that are perfect for celebrating. The discussion highlights the enduring popularity of 90s music during festive gatherings.",
    "published": "2025-11-05T07:00:20Z"
  }
]