[
  {
    "title": "Jenrick’s ideas mostly ‘my thoughts repackaged’, says Badenoch – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/oct/02/reform-uk-zia-yusuf-keir-starmer-nigel-farage-immigration-asylum-labour-climate-change-uk-politics-live",
    "image": "https://media.guim.co.uk/8d5580732613185c2cf1a410494dc70d67c8f37f/70_0_4840_3872/500.jpg",
    "summary": "The leader of the Tory party revealed that when she assumed leadership last year, the party was on the brink of bankruptcy. She emphasized the financial challenges faced and the need for reform. Her comments highlight ongoing efforts to stabilize party finances.",
    "published": "2025-10-02T13:26:53Z"
  },
  {
    "title": "Gaza aid flotilla: Israel intercepts vessels but one ship reported to have got through blockade – live",
    "url": "https://www.theguardian.com/world/live/2025/oct/01/israel-gaza-aid-global-sumud-flotilla-middle-east-crisis-latest-updates",
    "image": "https://media.guim.co.uk/1dc8eff7cd550ab162294c9a1525393e9bf0e162/107_0_705_564/500.jpg",
    "summary": "The boat Mikeno has reportedly evaded a maritime blockade and entered Palestinian territorial waters. This development raises concerns about potential violations of maritime laws in the region. Further details on the situation and implications are still emerging.",
    "published": "2025-10-02T13:25:48Z"
  },
  {
    "title": "Trump to meet with Project 2025 architect on cutting ‘Democrat agencies’ amid government shutdown – live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/02/government-shutdown-trump-democrats-latest-updates",
    "image": "https://media.guim.co.uk/67f0cf364ead08501750764e4c7d8c49cf1252d5/200_0_6588_5271/500.jpg",
    "summary": "Donald Trump highlighted a discussion with Russ Vought, known for his role in Project 2025, to identify possible budget cuts amid the ongoing federal government shutdown. This marks the second consecutive day of the shutdown, emphasizing the urgency for fiscal reform. Trump's focus is on finding solutions to resolve the deadlock and reduce government spending.",
    "published": "2025-10-02T13:24:37Z"
  },
  {
    "title": "Two dead after suspected terror attack on Manchester synagogue, police say, with suspect shot by officers – latest",
    "url": "https://www.theguardian.com/uk-news/live/2025/oct/02/police-reports-stabbing-synagogue-greater-manchester-live",
    "image": "https://media.guim.co.uk/77d275f837e70a4ea986a1b128ddd3f32cafb9be/0_311_739_591/500.jpg",
    "summary": "A man suspected of carrying out an attack on Yom Kippur has been identified in an emerging image. The Prime Minister expressed his appallment over the incident, highlighting its impact during a significant religious observance. Authorities are likely increasing security measures in response to the attack.",
    "published": "2025-10-02T13:21:21Z"
  },
  {
    "title": "Party leaders condemn attack on Manchester synagogue on Yom Kippur",
    "url": "https://www.theguardian.com/uk-news/2025/oct/02/party-leaders-condemn-attack-manchester-synagogue-yom-kippur",
    "image": "https://media.guim.co.uk/09f20100fbf2630c0e0352f448c48247471f5999/429_0_3288_2632/500.jpg",
    "summary": "UK political leaders Keir Starmer, Kemi Badenoch, Ed Davey, and Nigel Farage have united in expressing sympathy for the victims of a recent attack. They have also collectively condemned the assailant responsible for the violence. Their statements reflect a bipartisan stance on supporting those affected and denouncing such acts.",
    "published": "2025-10-02T13:15:40Z"
  }
]