[
  {
    "title": "Rashford wants Barcelona stay, Benítez in at Panathinaikos, Premier League news: football – live",
    "url": "https://www.theguardian.com/football/live/2025/oct/24/premier-league-news-europa-league-reaction-and-more-weekend-football-countdown-live",
    "image": "https://media.guim.co.uk/3067e62d3fcbc32c11c5ddf85324d0a6ae653248/142_0_3290_2632/500.jpg",
    "summary": "A team of writers is preparing to cover an eventful weekend of sports across various leagues. They aim to provide in-depth reporting and analysis as matches unfold. Stay tuned for updates on the developments throughout the weekend.",
    "published": "2025-10-24T09:21:17Z"
  },
  {
    "title": "West Bank residents fear they may be Israel’s next target after Gaza",
    "url": "https://www.theguardian.com/world/2025/oct/24/west-bank-residents-fear-they-may-be-israels-next-target-after-gaza",
    "image": "https://media.guim.co.uk/92d30a76ea9269486f06cfae08a9920329453174/458_0_4583_3667/500.jpg",
    "summary": "As tensions lessen in Gaza, Palestinians express concerns that the Israeli military might now focus operations in the West Bank. This shift raises fears of increased violence and conflict in an already volatile region. The situation remains tense as communities brace for potential escalation.",
    "published": "2025-10-24T09:18:48Z"
  },
  {
    "title": "Caerphilly byelection result live: Plaid Cymru beats challenge from Reform UK to win pivotal Welsh parliament vote",
    "url": "https://www.theguardian.com/politics/live/2025/oct/24/caerphilly-byelection-result-live-reform-plaid-cymru-labour-wales-welsh-government-senedd-latest-voting-news",
    "image": "https://media.guim.co.uk/bc391bde06b1f89b0a3ccbcd49d842f4cd71bf4c/711_0_6880_5504/500.jpg",
    "summary": "Lindsay Whittle successfully captured the Senedd constituency from Labour, marking a significant political shift. He faced a strong challenge from Reform UK but managed to hold his ground. This victory highlights the changing dynamics in the region's political landscape.",
    "published": "2025-10-24T09:18:36Z"
  },
  {
    "title": "Zelenskyy to meet Starmer and ‘coalition of the willing’ to discuss further military support and how to pressure Russia – Europe live ",
    "url": "https://www.theguardian.com/world/live/2025/oct/24/volodmyr-zelenskyy-ukraine-russia-vladimir-putin-sanctions-keir-starmer-coalition-of-the-willing-military-support-europe-live-news",
    "image": "https://media.guim.co.uk/d622c348bca60677af8abf46d1a14cb4c36bcc38/438_0_2683_2146/500.jpg",
    "summary": "The EU has implemented its 19th sanctions package against Russia. In response, UK Prime Minister is advocating for the use of Russia's frozen assets to support Ukraine's defense efforts. This move aligns with ongoing international efforts to bolster Ukraine amid ongoing conflict.",
    "published": "2025-10-24T09:11:57Z"
  },
  {
    "title": "Weather tracker: Tornadoes and Storm Benjamin lash northern France",
    "url": "https://www.theguardian.com/world/2025/oct/24/weather-tracker-tornadoes-and-storm-benjamin-lash-northern-france",
    "image": "https://media.guim.co.uk/9375192113157097f921895ca60323619ac2d4d7/431_0_5000_4000/500.jpg",
    "summary": "Severe storms near Paris have caused heavy rain and strong winds, resulting in over 100,000 homes losing power. A tornado in the area has also led to fatalities. The situation has prompted concerns about safety and infrastructure damage.",
    "published": "2025-10-24T09:10:25Z"
  }
]