[
  {
    "title": "Manchester synagogue attack latest: suspect shot after four people injured in vehicle and stabbing attack, police say",
    "url": "https://www.theguardian.com/uk-news/live/2025/oct/02/police-reports-stabbing-synagogue-greater-manchester-live",
    "image": "https://media.guim.co.uk/e09acd4568b10753396a4af79c31049e92625341/467_0_3289_2632/500.jpg",
    "summary": "Keir Starmer is returning early from Europe to lead a Cobra meeting amid rising concerns. Meanwhile, the mayor of Greater Manchester is advising residents to avoid the area due to escalating issues. Both actions highlight increasing urgency in response to the current situation.",
    "published": "2025-10-02T11:12:59Z"
  },
  {
    "title": "Tory plans to scrap Climate Change Act condemned as ‘economic disaster’ – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/oct/02/reform-uk-zia-yusuf-keir-starmer-nigel-farage-immigration-asylum-labour-climate-change-uk-politics-live",
    "image": "https://media.guim.co.uk/8d5580732613185c2cf1a410494dc70d67c8f37f/70_0_4840_3872/500.jpg",
    "summary": "Labour, the Liberal Democrats, and the Greens have criticized Kemi Badenoch's promise to repeal a key act if the Tories regain power. Ed Miliband described the vow as a \"betrayal of future generations.\" The opposition parties are rallying against what they see as a detrimental move for the environment and society.",
    "published": "2025-10-02T11:11:13Z"
  },
  {
    "title": "Gaza aid flotilla: more than a dozen vessels intercepted by Israeli forces; Greta Thunberg arrested – live",
    "url": "https://www.theguardian.com/world/live/2025/oct/01/israel-gaza-aid-global-sumud-flotilla-middle-east-crisis-latest-updates",
    "image": "https://media.guim.co.uk/1dc8eff7cd550ab162294c9a1525393e9bf0e162/107_0_705_564/500.jpg",
    "summary": "The Israeli foreign ministry shared a video of Greta Thunberg's arrest as part of an operation involving vessels carrying around 500 activists. These boats were intercepted approximately 75 miles off the coast of the conflict-affected region. The incident highlights ongoing tensions related to activism and maritime protests.",
    "published": "2025-10-02T11:06:20Z"
  },
  {
    "title": "‘Russia will not stop until they are forced to do so,’ Danish PM warns European leaders summit – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/oct/02/epc-european-political-community-leaders-copenhagen-denmark-ukraine-russia-europe-live",
    "image": "https://media.guim.co.uk/86bda33912374d018cf93b6a6e5ae0e4f6eb303c/500_224_2066_1653/500.jpg",
    "summary": "More than 45 leaders convened in Copenhagen for the seventh summit of the European Political Community. The meeting focuses on collaboration and addressing pressing European issues. Discussions aim to enhance unity and cooperation among member states.",
    "published": "2025-10-02T11:03:32Z"
  },
  {
    "title": "Trump revives family separations amid drive to deport millions: ‘A tactic to punish’",
    "url": "https://www.theguardian.com/us-news/ng-interactive/2025/oct/02/trump-immigration-family-separations-deportations",
    "image": "https://media.guim.co.uk/1c8a8c18e2edc029a28730662f56f829c11e608b/0_432_1920_1536/500.jpg",
    "summary": "During the first Trump administration, family separations became a key aspect of border policy. Advocates now accuse the current administration of repeating this practice by allegedly splitting migrant families apart as a form of retaliation. This has raised concerns and calls for scrutiny over the treatment of migrant families at the border.",
    "published": "2025-10-02T11:00:47Z"
  }
]