[
  {
    "title": "Italian skier Matteo Franzoso dies at age of 25 after training crash in Chile",
    "url": "https://www.theguardian.com/sport/2025/sep/15/italian-skier-matteo-franzoso-dies-at-25-after-training-crash",
    "image": "https://media.guim.co.uk/2edea0fd4d2eebfae291882eea9e433c940d7eff/0_0_2236_1789/500.jpg",
    "summary": "Mattheo Franzoso tragically passed away due to significant head trauma sustained in a training accident at the La Parva track near Santiago. The incident highlights the dangers associated with training in high-risk sports. His death has brought attention to safety measures in training environments.",
    "published": "2025-09-15T21:26:52Z"
  },
  {
    "title": "Trump announces he will send National Guard to Memphis, with Chicago ‘probably next’ – live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/15/donald-trump-politics-washington-dc-national-emergency-ice-charlie-kirk-live-news-updates",
    "image": "https://media.guim.co.uk/0ac757da2bfa9a7f214155fb02da71980412ebbf/454_0_4774_3819/500.jpg",
    "summary": "The US president announced a military deployment similar to the one in Washington D.C. to ensure security. He also added St. Louis to the list of cities receiving this support. This move aims to address ongoing concerns about safety and order in multiple urban areas.",
    "published": "2025-09-15T21:22:46Z"
  },
  {
    "title": "Australia news live: Sydney airport plans big expansion; social media giants given rules on how child ban must work",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/16/australia-news-live-sydney-airport-social-media-ban-anthony-albanese-chris-bowen-climate-crisis-carbon-emissions-png-treaty-ntwnfb",
    "image": "https://media.guim.co.uk/227ed232cb0103c1a4afbca6a1d1156da11f5b71/0_0_3244_2595/500.jpg",
    "summary": "Please provide the news article you would like summarized, and I will be happy to help!",
    "published": "2025-09-15T21:20:34Z"
  },
  {
    "title": "‘Inappropriate’ comments about Charlie Kirk shooting lead to university firings",
    "url": "https://www.theguardian.com/us-news/2025/sep/15/charlie-kirk-death-university-firing-suspension",
    "image": "https://media.guim.co.uk/42e57f0117dde6658bbea50ec7b8d49cabeb09ed/417_0_4165_3332/500.jpg",
    "summary": "Free speech advocates are criticizing Republican officials for allegedly using intimidation tactics against employees who express their opinions. They claim that disciplinary actions are being taken against individuals for sharing their views. The situation raises concerns about the suppression of free speech in the workplace.",
    "published": "2025-09-15T21:07:29Z"
  },
  {
    "title": "Rev William Barber condemns Kirk’s killing and warns against using religion to ‘sanctify wrong’",
    "url": "https://www.theguardian.com/us-news/2025/sep/15/rev-william-barber-charlie-kirk-killing-religion",
    "image": "https://media.guim.co.uk/cfff14332dcd9fc166d8cfaa23b0d72fc8dabdf0/10_0_2979_2382/500.jpg",
    "summary": "A pastor and social activist has called for a national challenge to eliminate the use of religion as a justification for injustice. He emphasizes the need for accountability and integrity within religious contexts. His statement aims to encourage a more equitable and just society free from the manipulation of faith for harmful purposes.",
    "published": "2025-09-15T21:02:47Z"
  }
]