[
  {
    "title": "Australia news live: First Nations people ‘still have no voice’ two years on from referendum, Uluru Dialogue architects say; SA algal bloom plan to be announced",
    "url": "https://www.theguardian.com/australia-news/live/2025/oct/14/australia-news-live-jim-chalmers-superannuation-concession-tax-cybercrime-anthony-albanese-sussan-ley-coalition-penny-wong-israel-gaza-ntwnfb",
    "image": "https://media.guim.co.uk/935beb22a9c04f1eb6da29bb49710239d683e721/2277_599_1975_1580/500.jpg",
    "summary": "I'm sorry, but I need more information about the news you'd like summarized. Please provide the details or the content of the news article.",
    "published": "2025-10-13T22:16:28Z"
  },
  {
    "title": "US news outlets refuse to sign new Pentagon rules to report only official information",
    "url": "https://www.theguardian.com/us-news/2025/oct/13/defense-department-media-news-rules",
    "image": "https://media.guim.co.uk/0b7eabe448ece090054502ae56e090bd2cfb8eae/816_0_4466_3574/500.jpg",
    "summary": "The Defense Department has implemented a new policy requiring media outlets to promise not to acquire unauthorized files. This policy also limits access to certain areas for reporters. The changes aim to enhance security and control over sensitive information.",
    "published": "2025-10-13T21:33:28Z"
  },
  {
    "title": "Jordan Pickford leads England defensive stability with help further up the pitch",
    "url": "https://www.theguardian.com/football/2025/oct/13/jordan-pickford-england-defensive-stability-latvia-world-cup-qualifier",
    "image": "https://media.guim.co.uk/312b08e790899078763dcbb8a9916b07967b808a/54_0_1071_857/500.jpg",
    "summary": "Jordan Pickford has achieved eight consecutive clean sheets and credits his teammates for their strong defensive performance. He emphasizes the importance of teamwork in their success. The goalkeeper highlights that collective effort is key to maintaining their impressive defensive record.",
    "published": "2025-10-13T21:30:02Z"
  },
  {
    "title": "The Chair Company review – an office rage comedy packed with massive, stupid laughs",
    "url": "https://www.theguardian.com/tv-and-radio/2025/oct/13/the-chair-company-review-tim-robinson-office-rage-comedy-massive-stupid-laughs",
    "image": "https://media.guim.co.uk/d3b519fac6e880c7b17401d9274c598f8eb5c36f/992_0_7200_5760/500.jpg",
    "summary": "Tim Robinson stars in a comedic film where he portrays a man determined to expose a negligent chair manufacturer. The movie features an abundance of slapstick humor and cringe-worthy moments. Robinson's performance is described as hilarious, driving the film's entertaining plot.",
    "published": "2025-10-13T21:25:01Z"
  },
  {
    "title": "Majority of family court cases in England and Wales feature domestic abuse, watchdog says",
    "url": "https://www.theguardian.com/society/2025/oct/10/majority-of-family-court-cases-in-england-and-wales-feature-domestic-abuse-watchdog-says",
    "image": "https://media.guim.co.uk/24c670afd29fa8c38385e44649e2b2ea1b834c49/764_0_4853_3883/500.jpg",
    "summary": "A recent review by the commissioner revealed that 87% of the examined cases involved instances of physical, psychological, or sexual abuse within families. This alarming statistic highlights the prevalence of domestic abuse. The findings underscore the urgent need for increased awareness and interventions to address these issues.",
    "published": "2025-10-13T21:16:23Z"
  }
]