[
  {
    "title": "Quick cryptic crossword No 78",
    "url": "https://www.theguardian.com/crosswords/quick-cryptic/78",
    "summary": "I'm sorry, but I cannot summarize specific content like a crossword without access to the relevant details. If you provide me with more context or the clues from the crossword, I'd be happy to help!",
    "published": "2025-09-26T23:00:26Z"
  },
  {
    "title": "Weekend crossword No 768",
    "url": "https://www.theguardian.com/crosswords/weekend/768",
    "summary": "I apologize, but I am unable to access specific articles or crosswords. If you provide details or key points from the crossword, I can help summarize or discuss them!",
    "published": "2025-09-26T23:00:25Z"
  },
  {
    "title": "Harrods warns customers their data may have been stolen in IT breach",
    "url": "https://www.theguardian.com/business/2025/sep/26/harrods-warns-customers-their-data-may-have-been-stolen-in-it-breach",
    "image": "https://media.guim.co.uk/e542dc2005c30a01f7c5c1c63d0007902366ff06/327_0_3410_2728/500.jpg",
    "summary": "A luxury department store reported an isolated incident involving a security breach. The store assured customers that passwords and payment details remained unaffected. They are taking measures to address the situation and enhance security.",
    "published": "2025-09-26T22:54:48Z"
  },
  {
    "title": "Fleetwood and Rahm stun USA as Europe take three-point Ryder Cup lead on opening day",
    "url": "https://www.theguardian.com/sport/2025/sep/26/tommy-fleetwood-jon-rahm-rory-mcilroy-ryder-cup-europe-usa",
    "image": "https://media.guim.co.uk/1f47d1cb9b13e1cee30c4d208c3e280a05d5ebaf/239_109_2274_1819/500.jpg",
    "summary": "Europe leads 5½-2½ after the first day of the Ryder Cup at Bethpage Black. The European team secured victories in both the foursomes and fourballs sessions. Their strong performance puts them in a solid position heading into the next rounds.",
    "published": "2025-09-26T22:51:55Z"
  },
  {
    "title": "Trump urges Microsoft to fire lawyer who ran investigation into attempt to overturn 2020 US election – live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/26/james-comey-fbi-indictment-donald-trump-executive-orders-tariffs-us-politics-live",
    "image": "https://media.guim.co.uk/ea30745b7e0352485176734657642900fd15ae4f/186_0_2153_1724/500.jpg",
    "summary": "The President has expressed anger towards a former deputy attorney general, who is currently employed at a major tech company, following backlash over actions aimed at former FBI chief James Comey. This escalation highlights ongoing tensions surrounding Comey's controversial targeting. The situation has drawn significant public and media attention.",
    "published": "2025-09-26T22:50:09Z"
  }
]