[
  {
    "title": "Budget 2025 live: Rachel Reeves says tax and spending changes based on ‘fair and necessary’ choices",
    "url": "https://www.theguardian.com/uk-news/live/2025/nov/26/budget-2025-rachel-reeves-tax-cash-isa-minimum-wage-latest-news-updates",
    "image": "https://media.guim.co.uk/86319fd47ede0936031115abe5ad7a88cdf32f4e/1359_0_6830_5464/500.jpg",
    "summary": "The Chancellor is set to present a crucial fiscal statement at 12:30 PM, which is being described as a pivotal moment for the Starmer government. The outcome of this announcement could significantly impact the government's future. Stakeholders are keenly awaiting the details and implications of the statement.",
    "published": "2025-11-26T11:18:17Z"
  },
  {
    "title": "Labour’s plan to slash jury trials at odds with past Starmer calls to expand them",
    "url": "https://www.theguardian.com/law/2025/nov/26/labour-plan-slash-jury-trials-keir-starmer-past-calls-expand",
    "image": "https://media.guim.co.uk/f68dfdcf67c52d39fa14989a6fc536b10cddc17e/5_0_4583_3667/500.jpg",
    "summary": "The Prime Minister previously supported a proposal for all criminal cases, including those at the magistrates' court level, to be tried by juries. This stance has been revealed in recent discussions. The implications of such a change could significantly impact the judicial process.",
    "published": "2025-11-26T11:13:37Z"
  },
  {
    "title": "New Old Trafford due on FA’s stadiums list this week for 2035 Women’s World Cup",
    "url": "https://www.theguardian.com/football/2025/nov/26/new-old-trafford-fa-stadiums-list-2035-womens-world-cup",
    "image": "https://media.guim.co.uk/50580bf8bd193e37e4deb21bd251c26d14ac4b21/346_177_4319_3456/500.jpg",
    "summary": "The Football Association intends to feature a renovated Old Trafford in the UK's bid for hosting matches at the 2035 Women's World Cup. This inclusion highlights the significance of the iconic stadium in the country's plans for the tournament. The redevelopment aims to enhance the venue's capabilities for international events.",
    "published": "2025-11-26T11:11:01Z"
  },
  {
    "title": "Russia’s mindset has not changed since Yalta, says Von der Leyen, as EU discusses Ukraine peace plan – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/nov/26/russia-ukraine-war-peace-plan-europe-latest-news-updates",
    "image": "https://media.guim.co.uk/5e8cb749d8f50161a3d089c9b00ce1c7b01fc343/280_0_3065_2452/500.jpg",
    "summary": "The European Commission president asserts that Russia continues to view Europe through a lens of influence, reminiscent of its perspective during the post-World War II conference aimed at reorganizing the continent. This reflects ongoing tensions and geopolitical challenges in Europe. The statement underscores concerns about Russian ambitions and the need for a united European response.",
    "published": "2025-11-26T11:06:02Z"
  },
  {
    "title": "Texas man, 95, sets record as oldest bus driver: ‘I don’t have no desire to quit’ ",
    "url": "https://www.theguardian.com/us-news/2025/nov/26/texas-man-world-record-oldest-bus-driver",
    "image": "https://media.guim.co.uk/e1df1a179220ee86f443af3622f5ce2a2356bb52/0_22_1672_1337/500.jpg",
    "summary": "Raymond Hager expresses his passion for driving, making it difficult for him to consider retirement. He finds joy in being on the road, which keeps him from focusing on the idea of stepping back. Hager’s love for driving underscores his reluctance to leave his profession.",
    "published": "2025-11-26T11:00:50Z"
  }
]