[
  {
    "title": "Reeves claims Gatwick second runway ‘will mean cheaper holidays’; Trump’s $100,000 H-1B visa fee expected to hurt US growth – business live",
    "url": "https://www.theguardian.com/business/live/2025/sep/22/rachel-reeves-gatwick-second-runway-growth-jobs-environmental-disaster-business-live-news",
    "image": "https://media.guim.co.uk/9443c9de49eb8796461c61ca177c9399cee4024e/692_0_6235_4988/500.jpg",
    "summary": "Green Party's Zack Polanski has criticized the approval of a second runway at Gatwick Airport, calling it \"a disaster.\" This decision has sparked significant debate regarding its environmental and economic implications. The news highlights ongoing concerns about airport expansions and their impact on sustainability.",
    "published": "2025-09-22T13:35:39Z"
  },
  {
    "title": "Reform UK’s immigration plans have ‘no basis in reality’, say Labour – politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/22/reform-labour-keir-starmer-nigel-farage-immigration-latest-uk-politics-updates",
    "image": "https://media.guim.co.uk/0ea9a207de8e6ff0be680ec4acab4cea10278326/625_0_4623_3698/500.jpg",
    "summary": "Nigel Farage asserts that his party could save £234 billion by eliminating the indefinite leave to remain status for immigrants. He argues that this policy could significantly reduce public spending. The proposal is part of a broader immigration reform agenda by Farage's party.",
    "published": "2025-09-22T13:33:21Z"
  },
  {
    "title": "Trump hails Charlie Kirk as ‘a martyr for America’s freedom’ at memorial – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/22/donald-trump-charlie-kirk-autism-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/c13dd63acaa1528daa70e1589a9257bcb54be327/401_0_4008_3207/500.jpg",
    "summary": "The President expressed strong animosity towards his political opponents, stating he \"hates\" them. In a stark contrast, Erika Kirk publicly forgave the man charged with her husband's murder. This juxtaposition highlights differing approaches to conflict and personal loss.",
    "published": "2025-09-22T13:29:03Z"
  },
  {
    "title": "Israel warned not to annex parts of West Bank in response to recognition of Palestinian state – Middle East crisis live",
    "url": "https://www.theguardian.com/world/live/2025/sep/22/palestinian-state-gaza-israel-middle-east-hamas-benjamin-netanyahu-latest-live-updates",
    "image": "https://media.guim.co.uk/b3e994dcbc1989bd01ae3af5616680d9708aaf72/11_0_4458_3566/500.jpg",
    "summary": "UK, Australia, Canada, and Portugal officially recognized Palestinian statehood on Sunday. France is expected to follow suit soon. This development marks a significant diplomatic shift in support of Palestinian sovereignty.",
    "published": "2025-09-22T13:26:58Z"
  },
  {
    "title": "Poland will shoot down objects violating its airspace, PM says, as UN security council to meet over Russian provocations – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/sep/22/latest-europe-news-russia-estonia-un-united-nations-security-live-latest-updates",
    "image": "https://media.guim.co.uk/bede7b5fb8e9922b7fab81bfbbbb8ccb5436a9e4/443_198_1619_1295/500.jpg",
    "summary": "Donald Tusk emphasizes Poland's readiness to shoot down unidentified objects if necessary, but urges caution to avoid escalating into broader conflict. He highlights the importance of balancing national security with diplomatic considerations. Tusk's statement reflects increasing tensions and the need for measured responses in the region.",
    "published": "2025-09-22T13:13:13Z"
  }
]