[
  {
    "title": "Australia news live: Crisafulli declares end to ‘cannoli diplomacy’ with Albanese over lack of hospital funding",
    "url": "https://www.theguardian.com/australia-news/live/2025/nov/09/australia-news-live-sunday-politics-nsw-parliament-royal-tour-weather-ntwnfb",
    "image": "https://media.guim.co.uk/3ff43fbce357048a40a90ca1ff9c8aeea328b086/586_0_3342_2676/500.jpg",
    "summary": "Please provide the specific news details or content you would like me to summarize.",
    "published": "2025-11-09T04:18:39Z"
  },
  {
    "title": "NSW police accused of ‘sickening’ double standard over neo-Nazi rally as Jewish groups demand answers",
    "url": "https://www.theguardian.com/australia-news/2025/nov/09/nsw-police-accused-of-sickening-double-standard-over-neo-nazi-rally-as-jewish-groups-demand-answers",
    "image": "https://media.guim.co.uk/8c7f9f3a362f185550b6afef5c32b76192064e62/546_0_5460_4368/500.jpg",
    "summary": "Pro-Palestine and climate activists are uniting with Jewish voices to condemn what they perceive as inconsistent police responses to protests. They highlight a lack of understanding regarding the police's approval of certain actions while criticizing others. This collaboration emphasizes a call for accountability and coherence in law enforcement's approach to diverse causes.",
    "published": "2025-11-09T03:35:47Z"
  },
  {
    "title": "Trump news at a glance: President suggests scrapping Obamacare as shutdown flight chaos continues",
    "url": "https://www.theguardian.com/us-news/2025/nov/09/trump-news-at-a-glance-president-suggests-scrapping-obamacare-as-shutdown-flight-chaos-continues",
    "image": "https://media.guim.co.uk/2c8b54cf5106c77a8ae86beeb4c5bd95e42c59df/728_0_4234_3388/500.jpg",
    "summary": "On November 8, Donald Trump encouraged Republican senators to shift federal funds to provide direct financial support to individuals. This call highlights his focus on economic relief amid ongoing political discussions. The news underscores the evolving dynamics within the Republican Party and its approach to economic policies.",
    "published": "2025-11-09T02:00:54Z"
  },
  {
    "title": "Malo Gusto’s first professional goal sets up Chelsea cruise past winless Wolves",
    "url": "https://www.theguardian.com/football/2025/nov/08/chelsea-wolves-premier-league-match-report",
    "image": "https://media.guim.co.uk/926579f5921eb0304f788f0f358157ba444229da/614_549_3342_2673/500.jpg",
    "summary": "Chelsea secured a convincing 3-0 victory over Wolves in the Premier League. João Pedro and Pedro Neto both scored, with Neto facing his former club. The win solidifies Chelsea's strong performance at home.",
    "published": "2025-11-09T01:31:15Z"
  },
  {
    "title": "Border patrol chief reprimanded for lying claims shots were fired at immigration officers in Chicago",
    "url": "https://www.theguardian.com/us-news/2025/nov/08/border-patrol-gregory-bovino-chicago",
    "image": "https://media.guim.co.uk/44fe531cdc16622d2adc8a98968bd2f31447956d/175_11_2484_1988/500.jpg",
    "summary": "Gregory Bovino faced legal scrutiny after a judge reprimanded him for falsely claiming he was assaulted by a protester. Just two days prior, this accusation was deemed untruthful. The incident raises questions about Bovino's credibility in court.",
    "published": "2025-11-09T00:35:55Z"
  }
]