[
  {
    "title": "Heat on Postecoglou, Arsenal lead way as Premier League returns – matchday live",
    "url": "https://www.theguardian.com/football/live/2025/oct/18/premier-league-returns-postecoglou-arsenal-matchday-live",
    "image": "https://media.guim.co.uk/00f47bbe7e0c306035d7e512fdeb003379a53460/0_0_5000_4000/500.jpg",
    "summary": "Emillia Hawkins is set to host coverage as the Premier League resumes following the international break. Fans can look forward to updates and analysis of the upcoming matches. The return promises exciting football action after the hiatus.",
    "published": "2025-10-18T07:14:48Z"
  },
  {
    "title": "New Zealand v England: first men’s T20 cricket international – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/18/new-zealand-v-england-first-mens-t20-cricket-international-live",
    "image": "https://media.guim.co.uk/b90dbb32ea26b93ddf93fe90b5c86b9ac25873e4/300_0_3000_2400/500.jpg",
    "summary": "England has commenced their white-ball tour of New Zealand, with live updates provided by James Wallace from Christchurch. The match coverage includes detailed over-by-over reports. Fans can stay informed about the latest developments in the game.",
    "published": "2025-10-18T07:13:24Z"
  },
  {
    "title": "Unbeaten England eye place in semi-finals but results have masked woeful batting displays | Raf Nicholson",
    "url": "https://www.theguardian.com/sport/2025/oct/18/women-cricket-world-cup-england-eye-place-in-semi-finals-but-results-have-masked-woeful-batting",
    "image": "https://media.guim.co.uk/9635f2ed866ebec3a742587decfa0e76498927ad/530_225_4048_3239/500.jpg",
    "summary": "Nat Sciver-Brunt's team has moved away from the extravagant style known as 'Jon-ball' but has yet to fully adopt their new strategy. The team needs to quickly adapt to their new approach to succeed. Continued struggle in this transition could hinder their performance moving forward.",
    "published": "2025-10-18T07:00:40Z"
  },
  {
    "title": "Shows such as Stranger Things and Yellowjackets have become bloated. I’m all for the one-and-done series | Priya Elan",
    "url": "https://www.theguardian.com/commentisfree/2025/oct/18/tv-shows-yellowjackets-stranger-things-series",
    "image": "https://media.guim.co.uk/140afb6549180cbdda4fd597e2a96f947f0e2308/281_0_5031_4024/500.jpg",
    "summary": "Arts writer Priya Elan reflects on the disappointment of fans who desire more seasons of canceled shows, suggesting they should reconsider their wishes. She expresses a sense of relief about her own long-running TV obsession not being extended. This highlights the unpredictable nature of TV series longevity and fan expectations.",
    "published": "2025-10-18T07:00:39Z"
  },
  {
    "title": "Benjamin Sesko is latest player damned by a pitiless conveyor belt of takes and memes | Jonathan Liew",
    "url": "https://www.theguardian.com/football/2025/oct/18/benjamin-sesko-is-latest-player-damned-by-a-pitiless-conveyor-belt-of-takes-and-memes",
    "image": "https://media.guim.co.uk/b44e43e84e71ff9df5f80094f34ef8d6fac36a11/238_0_4115_3292/500.jpg",
    "summary": "Manchester United's striker is facing widespread criticism on social media, where context is often overlooked. This condemnation reflects a broader trend of negative discourse online. The situation highlights how social media can amplify frustration and discontent.",
    "published": "2025-10-18T07:00:38Z"
  }
]