[
  {
    "title": "Pentagon says it is investigating senator Mark Kelly after he joined lawmakers telling military to refuse illegal orders – live",
    "url": "https://www.theguardian.com/us-news/live/2025/nov/24/us-politics-trump-venezuela-marjorie-tayor-greene-latest-updates",
    "image": "https://media.guim.co.uk/116adfe722108a6205fbea3813616ecf5d92b0fb/500_0_5000_4000/500.jpg",
    "summary": "The Pentagon has issued a warning to Democratic Senator Kyrsten Sinema from Arizona, indicating a potential investigation into her for a video urging military personnel to disobey unlawful orders. This move is notable as the Pentagon typically maintains a stance of political neutrality. The situation has sparked concern regarding the balance between military authority and political expression.",
    "published": "2025-11-24T18:30:11Z"
  },
  {
    "title": "Gibb says speculation of BBC boardroom coup is ‘ridiculous charge’ and he will not resign – latest updates",
    "url": "https://www.theguardian.com/media/live/2025/nov/24/bbc-board-mps-select-committee-latest-updates",
    "image": "https://media.guim.co.uk/d80c0420c0820b76642573cb826306e1910205b7/487_0_2456_1965/500.jpg",
    "summary": "A BBC board member, who previously served as a spin doctor for former Prime Minister Theresa May, has rejected insinuations raised by MPs during questioning. The member's comments were seen as a defense against potential conflicts of interest. The exchange highlights ongoing scrutiny of the BBC’s governance and impartiality.",
    "published": "2025-11-24T18:29:52Z"
  },
  {
    "title": "England asked for CCTV footage of Tom Curry’s alleged tunnel scuffle",
    "url": "https://www.theguardian.com/sport/2025/nov/24/argentina-complaint-investigation-tom-curry-tunnel-six-nations-rugby-union",
    "image": "https://media.guim.co.uk/c49d210d223d4621f32aee8a80bdd2f51dcb76d9/447_0_2776_2220/500.jpg",
    "summary": "Argentina has formally complained about an alleged altercation between Tom Curry and Felipe Contepomi in the tunnel. As a result, England is required to provide CCTV footage of the incident. This request follows the escalating tensions between the teams ahead of their upcoming match.",
    "published": "2025-11-24T18:29:27Z"
  },
  {
    "title": "Trump administration cancels temporary asylum for Myanmar nationals living in US",
    "url": "https://www.theguardian.com/us-news/2025/nov/24/trump-cancels-asylum-myanmar",
    "image": "https://media.guim.co.uk/aef4c8315fb8354fc145ed8377996b15e129bc88/667_0_3333_2667/500.jpg",
    "summary": "Homeland Security has announced that a country ruled by military dictatorship no longer qualifies for Temporary Protected Status (TPS). This decision is based on changes in conditions within the country. As a result, individuals from that nation may lose their protected status in the U.S.",
    "published": "2025-11-24T18:19:07Z"
  },
  {
    "title": "US and Israel-backed Gaza Humanitarian Foundation to end operations in territory",
    "url": "https://www.theguardian.com/world/2025/nov/24/us-and-israel-backed-gaza-humanitarian-foundation-to-end-operations-in-territory",
    "image": "https://media.guim.co.uk/f925501b6fa8c7b4991c0881fb171ff6a6ba6fbf/447_0_4012_3209/500.jpg",
    "summary": "Four major food distribution sites run by a controversial company have become hotspots for deadly violence. This unrest has raised concerns about safety and management practices at these locations. Authorities are investigating the underlying causes of the violence.",
    "published": "2025-11-24T18:10:52Z"
  }
]