[
  {
    "title": "Zelenskyy says 3,500 drones launched at Ukraine this month as he calls for Trump to take ‘clear position’ on Russia — Europe live",
    "url": "https://www.theguardian.com/world/live/2025/sep/16/zelenskyy-trump-sanctions-russia-news-updates-europe-live",
    "image": "https://media.guim.co.uk/aa0799c01bbc1a4db48b445f52600b836fbb63fc/467_0_6194_4955/500.jpg",
    "summary": "Ukrainian President emphasizes the need for sanctions and security guarantees as essential components for achieving peace. His comments come in light of former President Trump's upcoming state visit to the UK. The call for these measures highlights the ongoing challenges in the Ukraine conflict.",
    "published": "2025-09-16T09:36:00Z"
  },
  {
    "title": "State pension on course for inflation-busting 4.7% rise under triple lock; JLR production shutdown extended again – business live",
    "url": "https://www.theguardian.com/business/live/2025/sep/16/uk-wage-growth-slows-jobs-market-cools-business-live-news-updates",
    "image": "https://media.guim.co.uk/574b4285f5b7bdd0171d4edd87c7307ebcfc5623/332_0_2336_1868/500.jpg",
    "summary": "Pensioners can look forward to a significant increase in their state pension starting from April next year. Analysts indicate that this rise will exceed the rate of inflation. This news is likely to bring joy to retirees relying on this financial support.",
    "published": "2025-09-16T09:33:22Z"
  },
  {
    "title": "Israel launches ground offensive in Gaza City with residents warned to evacuate - latest updates",
    "url": "https://www.theguardian.com/world/live/2025/sep/16/israel-gaza-war-israels-defence-minister-says-gaza-is-burning-amid-escalation-in-bombardment-latest-updates",
    "image": "https://media.guim.co.uk/f8ba7b6cdf02607277083877e1731416dd9768e6/724_0_6074_4859/500.jpg",
    "summary": "The IDF spokesperson announced that Israeli forces have initiated the dismantling of Hamas infrastructure in Gaza City. Residents have been cautioned that staying in the area poses a risk to their safety. The operation emphasizes the seriousness of the situation and the urgency for civilians to evacuate.",
    "published": "2025-09-16T09:32:46Z"
  },
  {
    "title": "World Athletics Championships 2025: women’s 1500m, men’s 110m hurdles and more – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/16/world-athletics-championships-2025-womens-1500m-mens-110m-hurdles-and-more-live",
    "image": "https://media.guim.co.uk/9e11f5d965d522dd12620617e559041bfe519cad/1376_0_6880_5504/500.jpg",
    "summary": "Tune in for the latest updates from the fourth evening of events in Tokyo, featuring an array of exciting competitions. Daniel Harris will provide expert commentary and insights throughout the evening. Stay informed on all the action as it unfolds.",
    "published": "2025-09-16T09:30:02Z"
  },
  {
    "title": "Starmer to chair cabinet meeting as tensions grow after resignation of top aide — UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/16/starmer-cabinet-resignation-paul-ovenden-news-updates-uk-politics-live",
    "image": "https://media.guim.co.uk/da3f1a3039dc966d042c79e27e7d450820603876/686_0_4917_3933/500.jpg",
    "summary": "Labour MPs are openly discussing the possibility of replacing Prime Minister, following a poll revealing that only 26% of Labour members view him favorably as leader. This reflects growing dissatisfaction within the party. The situation highlights potential challenges for the Prime Minister amid declining support.",
    "published": "2025-09-16T09:27:09Z"
  }
]