[
  {
    "title": "Australia politics live: Pauline Hanson ejected from Senate as ‘disgraceful’ burqa stunt condemned by senators from across political divide",
    "url": "https://www.theguardian.com/australia-news/live/2025/nov/24/australia-politics-live-sussan-ley-andrew-hastie-liberal-leadership-libspill-labor-environment-nature-law-senate-greens-coalition-climate-crisis-ntwnfb",
    "image": "https://media.guim.co.uk/dbc944d66402f58424c9cbcdbb7f76dc46c739f0/974_0_5536_4431/500.jpg",
    "summary": "I'm sorry, but I need more information or details about the news you would like to summarize. Please provide the content or main points you'd like me to summarize.",
    "published": "2025-11-24T06:31:31Z"
  },
  {
    "title": "‘Stone-cold killers’: New Zealand to eradicate feral cats by 2050",
    "url": "https://www.theguardian.com/world/2025/nov/24/new-zealand-to-eradicate-feral-cats-by-2050",
    "image": "https://media.guim.co.uk/ce6077451decf947b2e71fa77a1570d2c67f42ea/32_0_929_744/500.jpg",
    "summary": "Feral cats, already targeted for removal in certain regions, will now face intensified eradication efforts through coordinated programs. These large-scale initiatives aim to significantly reduce their populations. The decision reflects concerns about the impact of feral cats on local ecosystems and wildlife.",
    "published": "2025-11-24T06:12:58Z"
  },
  {
    "title": "TV tonight: what history warns us about being on the brink of disaster",
    "url": "https://www.theguardian.com/tv-and-radio/2025/nov/24/tv-tonight-civilisations-rise-and-fall-british-museum",
    "image": "https://media.guim.co.uk/eddd60657d4fa530a93eec0bbc8f8e32946d4448/356_0_2811_2249/500.jpg",
    "summary": "The British Museum's artifacts may offer insights into addressing contemporary societal issues. Additionally, there's a focus on the recent scandal involving a ticket scam for the Glastonbury festival. Tonight’s viewing includes these intriguing stories.",
    "published": "2025-11-24T06:10:29Z"
  },
  {
    "title": "Princess of Wales calls for end to ‘stigma’ around addiction",
    "url": "https://www.theguardian.com/society/2025/nov/24/princess-of-wales-calls-for-end-to-stigma-around-addiction",
    "image": "https://media.guim.co.uk/14fa027dba98c7b4aa5fbce1c5404d4cfdfec053/409_0_2500_2000/500.jpg",
    "summary": "The patron of Forward Trust emphasizes the importance of compassion and love in addressing the fear and shame experienced by those impacted by addiction and related issues. They advocate for a supportive approach to help individuals heal and recover. The call highlights the need for understanding and empathy in overcoming stigma.",
    "published": "2025-11-24T06:01:29Z"
  },
  {
    "title": "University students in England get two-thirds of funding of a decade ago, analysis finds",
    "url": "https://www.theguardian.com/education/2025/nov/24/university-students-england-funding-drop-uuk-analysis",
    "image": "https://media.guim.co.uk/f812ec7df721a33eda845d6457daa0723b2cfa82/167_0_2666_2134/500.jpg",
    "summary": "University leaders have expressed concern that a proposed levy on international student fees will negatively impact many institutions' financial stability. They argue that the levy could exacerbate existing funding challenges rather than improve them. This move has prompted calls for a reassessment to protect the educational sector's financial health.",
    "published": "2025-11-24T06:00:30Z"
  }
]