[
  {
    "title": "Beasts of the Sea by Iida Turpeinen review – a hypnotic tale of the sea cow’s extinction",
    "url": "https://www.theguardian.com/books/2025/nov/06/beasts-of-the-sea-by-iida-turpeinen-review-a-hypnotic-tale-of-the-sea-cows-extinction",
    "image": "https://media.guim.co.uk/dcb49c94a7a3abe0a98b95c92b36653c64554d44/569_96_2352_1882/500.jpg",
    "summary": "A debut novel from Finland captivates readers with its engaging style. However, it could have explored more deeply the connections between human advancement and environmental degradation. Overall, it offers a compelling narrative but leaves some themes underdeveloped.",
    "published": "2025-11-06T07:00:48Z"
  },
  {
    "title": "Pollution from Ineos’s Antwerp plastic plant ‘will cause more deaths than jobs created’",
    "url": "https://www.theguardian.com/business/2025/nov/06/pollution-ineos-antwerp-plastic-plant-deaths-jobs-created",
    "image": "https://media.guim.co.uk/02d6890821c00f4ea3d8b56fdba8f654c800c382/501_0_2852_2282/500.jpg",
    "summary": "Lawyers are contesting the €4 billion Project One development, arguing that the project's emissions and potential health risks have been significantly underestimated. They claim these inaccuracies could have serious implications for the environment and public health. The legal challenge raises concerns about the project's compliance with environmental standards.",
    "published": "2025-11-06T07:00:47Z"
  },
  {
    "title": "Going to the Dogs review – lovable canines at the heart of a sport in decline",
    "url": "https://www.theguardian.com/film/2025/nov/06/going-to-the-dogs-review-documentary-british-greyhound-racing",
    "image": "https://media.guim.co.uk/71b42cc56458f58635e7d2dee6e38e3eae3342e0/570_0_2700_2160/500.jpg",
    "summary": "A new documentary explores British greyhound racing, presenting it with a sense of affection and respect. While celebrating the sport, it also addresses the concerns raised by animal rights activists regarding the treatment of the dogs. The film aims to provide a balanced perspective on the complex issues surrounding the racing industry.",
    "published": "2025-11-06T07:00:47Z"
  },
  {
    "title": "Liberal party sets date for net zero decision – as it happened",
    "url": "https://www.theguardian.com/australia-news/live/2025/nov/06/australia-politics-live-wfh-working-from-home-banks-net-zero-nationals-liberals-coalition-sussan-ley-anthony-albanese-labor-question-time-ntwnfb",
    "image": "https://media.guim.co.uk/27259ffd90912a2f344e529a4cc42ce50068f681/530_0_5500_4400/500.jpg",
    "summary": "The blog has officially ceased operations. All content is no longer being updated or accessible. Readers are encouraged to seek alternative sources for information.",
    "published": "2025-11-06T06:59:08Z"
  },
  {
    "title": "Thursday briefing: ​Inside Labour’s ambitious rethink of the national curriculum",
    "url": "https://www.theguardian.com/world/2025/nov/06/thursday-briefing-inside-labours-ambitious-rethink-of-the-national-curriculum",
    "image": "https://media.guim.co.uk/85aac2387882f9da78e012c3a70388532b91d2c4/884_0_4467_3574/500.jpg",
    "summary": "A new review of England's national curriculum aims to implement changes smoothly after years of political adjustments. The initiative seeks to enhance the curriculum without causing confusion or excessive burden on educators and students. Concerns remain about the feasibility of adding new content without overwhelming the system.",
    "published": "2025-11-06T06:39:56Z"
  }
]