[
  {
    "title": "India v Australia: Women’s Cricket World Cup semi-final – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/30/india-v-australia-womens-cricket-world-cup-semi-final-live",
    "image": "https://media.guim.co.uk/7793881a7965889672b87e8d2e18e3eb9fdb5308/390_0_3500_2800/500.jpg",
    "summary": "The second semi-final is underway in Navi Mumbai, featuring the co-hosts competing against the defending champions. Writers provide ongoing updates and insights throughout the match. Fans can follow the live commentary for real-time information.",
    "published": "2025-10-30T09:20:03Z"
  },
  {
    "title": "Five key takeaways from Donald Trump’s meeting with Xi Jinping",
    "url": "https://www.theguardian.com/us-news/2025/oct/30/five-key-takeaways-donald-trump-meeting-xi-jinping-china-us-trade-talks",
    "image": "https://media.guim.co.uk/ecfe6a13779ec41a4ed8dcda757e0004cc419edb/233_0_2333_1868/500.jpg",
    "summary": "During critical trade talks, the leaders of China and the US reached significant agreements covering various topics, including tariffs and rare earth materials. This collaboration marks a notable effort to address trade tensions between the two nations. The decisions made are considered a positive step toward improving bilateral economic relations.",
    "published": "2025-10-30T09:16:39Z"
  },
  {
    "title": "Tories say Starmer should sack Reeves for breaking law and breaking ministerial code – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/oct/30/rachel-reeves-labour-keir-starmer-uk-politics-latest-news-updates",
    "image": "https://media.guim.co.uk/042e4d5b2b45b212202ef947cf7e2b8fe3ba3099/295_103_1834_1467/500.jpg",
    "summary": "Reeves has been renting out her south London property without obtaining the necessary £945 licence from the local council. This violation has raised concerns about compliance with local housing regulations. The situation highlights the importance of following legal requirements for rental properties.",
    "published": "2025-10-30T09:15:34Z"
  },
  {
    "title": "Donald Trump says rare earths dispute ‘settled’ after Xi Jinping meeting in South Korea – live updates",
    "url": "https://www.theguardian.com/world/live/2025/oct/30/donald-trump-xi-jinping-meeting-live-updates",
    "image": "https://media.guim.co.uk/bd1c513361c5ea2ab97bd963b56b8b81e60cde38/0_1161_5159_4127/500.jpg",
    "summary": "The recent summit on the sidelines of APEC marked the first meeting between US and Chinese leaders since 2019. This meeting occurs amid ongoing tensions exacerbated by Trump's trade war. The discussion aims to ease relations and address economic concerns between the two nations.",
    "published": "2025-10-30T09:12:12Z"
  },
  {
    "title": "Trey Lance has cost $7m per start. Is there any hope of reclaiming a once hyped prospect?",
    "url": "https://www.theguardian.com/sport/2025/oct/30/trey-lance-los-angeles-chargers-49ers-nfl-quarterback",
    "image": "https://media.guim.co.uk/199bbb348a6e2b27927e1f7c8e601169eb2b190b/304_0_4255_3404/500.jpg",
    "summary": "Quarterbacks like Sam Darnold and Baker Mayfield have transformed from perceived busts to MVP contenders. There's emerging optimism for the Chargers' backup to embark on a similar revitalization. The situation presents an ideal opportunity for him to capitalize on and redefine his career.",
    "published": "2025-10-30T09:00:57Z"
  }
]