[
  {
    "title": "Amorim faces crunch clash, Premier League buildup and more – matchday live",
    "url": "https://www.theguardian.com/football/live/2025/oct/04/amorim-faces-crunch-clash-premier-league-buildup-and-more-matchday-live",
    "image": "https://media.guim.co.uk/cda7d0a172bc3b05a3ebda10268822d4be006bd2/0_0_5000_4000/500.jpg",
    "summary": "Join us for updates, previews, and discussions as we gear up for an exciting day of football. Stay informed and engaged with all the latest happenings. Don't miss out on the action!",
    "published": "2025-10-04T07:12:03Z"
  },
  {
    "title": "Emergency services recover two bodies found in Victorian high country by hikers",
    "url": "https://www.theguardian.com/australia-news/2025/oct/04/two-bodies-found-in-victorian-high-country-by-hikers",
    "image": "https://media.guim.co.uk/8f74427f996aefde56bd4ecb44878dad183bc56f/111_0_3725_2980/500.jpg",
    "summary": "Tasmanian police have confirmed the death of a woman who drowned in the Franklin River. Additionally, 11 stranded hikers were successfully rescued from the area. Authorities are currently investigating the drowning incident.",
    "published": "2025-10-04T07:11:38Z"
  },
  {
    "title": "New Zealand v Australia: men’s third T20 international cricket – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/04/new-zealand-v-australia-mens-third-t20-international-cricket-live",
    "image": "https://media.guim.co.uk/16f505f93423ba54448cafc8e3d7686aa7cb5bb5/169_0_4167_3334/500.jpg",
    "summary": "James Wallace provides live updates on the match through an over-by-over report, offering insights and commentary on key moments. Fans can follow along for real-time scores and player performances. Tune in for a detailed breakdown of the game's progression.",
    "published": "2025-10-04T07:11:11Z"
  },
  {
    "title": "‘This is real progress’: airlines on sustainable aviation fuels and the chances of net zero flying",
    "url": "https://www.theguardian.com/business/2025/oct/03/net-zero-aviation-sustainable-fuel-mandates-eu-uk",
    "image": "https://media.guim.co.uk/428dd1e3198776cc34cf933937584ec5e3c06ce0/795_0_4372_3500/500.jpg",
    "summary": "The EU and UK have implemented mandates that have garnered positive responses from investors regarding their value. However, opinions within the industry remain divided on the effectiveness and implications of these mandates. This divergence highlights ongoing debates about regulations and their impact on the market.",
    "published": "2025-10-04T07:07:31Z"
  },
  {
    "title": "‘The most aesthetic line’: how Kilian Jornet climbed the 73 highest US mountains in 31 days",
    "url": "https://www.theguardian.com/sport/2025/oct/04/kilian-jornet-states-of-elevation-us-fourteeners",
    "image": "https://media.guim.co.uk/5d4e00ea8bc9e75109f763d2cef84c6dcbd8374c/250_0_2500_2001/500.jpg",
    "summary": "Mountain-running legend has achieved a remarkable feat by completing States of Elevation, summiting every fourteener in the contiguous US within a month. He accomplished this incredible challenge using only his legs. This achievement highlights his extraordinary endurance and athleticism.",
    "published": "2025-10-04T07:00:07Z"
  }
]