[
  {
    "title": "Turkish disaster relief experts to help search for bodies in Gaza – Middle East live",
    "url": "https://www.theguardian.com/world/live/2025/oct/17/israel-gaza-ceasefire-hostages-hamas-benjamin-netanyahu-middle-east-latest-news-updates",
    "image": "https://media.guim.co.uk/726ed06187054db3c45c835841391d11bdb8de04/199_0_4560_3648/500.jpg",
    "summary": "Approximately 10,000 individuals are believed to be trapped under rubble and destroyed structures in Gaza. The situation highlights the severe humanitarian crisis in the region. Efforts to rescue survivors face significant challenges due to the scale of destruction.",
    "published": "2025-10-17T08:27:09Z"
  },
  {
    "title": "Alisson out of Liverpool v Manchester United clash as Premier League returns – football live",
    "url": "https://www.theguardian.com/football/live/2025/oct/17/premier-league-returns-with-liverpool-v-manchester-united-buildup-football-live",
    "image": "https://media.guim.co.uk/085b54ad151639f57ef3c1775998534233e5227f/27_0_4736_3789/500.jpg",
    "summary": "A rolling report is underway as writers provide ongoing updates leading up to a packed weekend of football. Fans can expect continuous coverage and insights as the action approaches. Stay tuned for the latest developments!",
    "published": "2025-10-17T08:20:52Z"
  },
  {
    "title": "FTSE 100 heading for worst day since April as US regional bank worries rock markets – business live",
    "url": "https://www.theguardian.com/business/live/2025/oct/17/us-dollar-worst-week-since-august-trade-tensions-stock-markets-bonds-business-live-news",
    "image": "https://media.guim.co.uk/e377b16e9d60276db23a73b8447d47e7d5b2dcec/500_0_5000_4000/500.jpg",
    "summary": "The FTSE 100 share index experienced a decline of 150 points in early trading. This dip highlights ongoing economic and financial challenges affecting the market. Analysts continue to monitor developments closely as rolling coverage of the situation unfolds.",
    "published": "2025-10-17T08:12:33Z"
  },
  {
    "title": "Trump’s anti-truth crusade is not just an attack on facts – it’s an unravelling of the Enlightenment | Polly Toynbee",
    "url": "https://www.theguardian.com/commentisfree/2025/oct/17/trump-anti-truth-crusade-facts-jd-vance-nigel-farage-censorship",
    "image": "https://media.guim.co.uk/5afd20772a65100a366393120e611dcdc689b9ea/680_0_4560_3648/500.jpg",
    "summary": "US President JD Vance and Nigel Farage argue that fact-checking equates to censorship. In response, Guardian columnist Polly Toynbee asserts that true free speech relies on accuracy and being grounded in truth. She emphasizes the importance of fact-checking in maintaining genuine discourse.",
    "published": "2025-10-17T08:10:37Z"
  },
  {
    "title": "Orban to speak with Putin as Zelenskyy prepares for White House talks with Trump – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/oct/17/viktor-orban-vladimir-putin-volodymyr-zelenskyy-donald-trump-europe-latest-news-updates-russia-ukraine-war",
    "image": "https://media.guim.co.uk/1abb5ba40089176680e374ad3db3e5c52da17ce7/489_328_3220_2576/500.jpg",
    "summary": "Trump announced that he will meet with Ukrainian President Zelenskyy today before holding discussions with Russian President Putin in Hungary. This follows his ongoing engagements with international leaders. The meetings are likely to focus on geopolitical tensions and relations between the countries involved.",
    "published": "2025-10-17T08:06:30Z"
  }
]