[
  {
    "title": "World Athletics Championships 2025: Kipyegon wins fourth 1500m title, Tinch storms to 110m hurdles gold – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/16/world-athletics-championships-2025-womens-1500m-mens-110m-hurdles-and-more-live",
    "image": "https://media.guim.co.uk/95bc56392eb422d3a03b5780de42952fe199679c/607_0_5298_4239/500.jpg",
    "summary": "Stay tuned for the latest updates from the fourth evening of action in Tokyo, as Daniel Harris covers all the highlights and events. Don't miss out on the key moments and stories unfolding in the competition!",
    "published": "2025-09-16T13:35:08Z"
  },
  {
    "title": "Starmer urged to apologise to Epstein victims as MPs debate Mandelson appointment — UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/16/starmer-cabinet-resignation-paul-ovenden-news-updates-uk-politics-live",
    "image": "https://media.guim.co.uk/fe7b2e213d3debf842a0d82ea4f21e113ba99507/631_0_6310_5048/500.jpg",
    "summary": "Kemi Badenoch and Ed Davey have criticized the Prime Minister's record after the appointment of the new US ambassador. They argue that it reflects poorly on the government's international relations and diplomatic priorities. The exchange highlights ongoing tensions in UK political leadership regarding foreign diplomacy.",
    "published": "2025-09-16T13:33:49Z"
  },
  {
    "title": "Israel turning Gaza City into mass graveyard, Palestinian foreign ministry says, as IDF launches ground offensive - latest updates",
    "url": "https://www.theguardian.com/world/live/2025/sep/16/israel-gaza-war-israels-defence-minister-says-gaza-is-burning-amid-escalation-in-bombardment-latest-updates",
    "image": "https://media.guim.co.uk/a4d7a85267e7d155742b505afdbeac4f69642df7/836_0_5600_4480/500.jpg",
    "summary": "The Palestinian foreign ministry has accused the Israel Defense Forces (IDF) of intentionally targeting civilians amid recent escalations. They allege that such actions are part of a broader strategy during armed conflicts. This accusation highlights ongoing tensions and humanitarian concerns in the region.",
    "published": "2025-09-16T13:32:30Z"
  },
  {
    "title": "Surrey v Nottinghamshire, Sussex v Yorkshire, and more: county cricket, day two – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/16/surrey-v-nottinghamshire-sussex-v-yorkshire-and-more-county-cricket-day-two-live",
    "image": "https://media.guim.co.uk/2f17c2e7f5aeeb89077071e376ee9bcac13c95e3/117_0_1375_1100/500.jpg",
    "summary": "Tanya Aldred provides updates on the most recent County Championship fixtures. The report covers key matches and highlights from the series. Fans can expect insights into team performances and standings.",
    "published": "2025-09-16T13:31:49Z"
  },
  {
    "title": "UK faces ‘fight of our times’ after far-right march, says Keir Starmer",
    "url": "https://www.theguardian.com/world/2025/sep/16/uk-faces-fight-of-our-times-after-far-right-march-says-keir-starmer",
    "image": "https://media.guim.co.uk/cc5e3f6771ce21ec3d737930c402209f6ba63862/231_0_5000_4000/500.jpg",
    "summary": "No 10 has criticized Elon Musk for his comments that could incite violence, suggesting they may intimidate ethnic minority Britons. The government expressed concern over the potential impact of such statements on community safety and cohesion. This marks an escalation in the UK's stance on online speech and responsibility.",
    "published": "2025-09-16T13:31:38Z"
  }
]