[
  {
    "title": "Australia news live: Victorian premier condemns anti-immigration protests; Sydney marathon under way with Olympic champions",
    "url": "https://www.theguardian.com/australia-news/live/2025/aug/31/australia-news-live-victoria-premier-anti-immigrant-protests-sydney-marathon-porepunkah-shooting-sunday-ntwnfb",
    "image": "https://media.guim.co.uk/e858f643c97e74758325e889b4f4ce8576735a6d/747_0_3736_2989/500.jpg",
    "summary": "I'm sorry, but I cannot summarize the news without specific details or content to work from. Please provide the text or details you would like summarized.",
    "published": "2025-08-30T23:25:05Z"
  },
  {
    "title": "Women’s Super League 2025-26 previews No 7: Liverpool",
    "url": "https://www.theguardian.com/football/2025/aug/31/womens-super-league-2025-26-previews-no-7-liverpool",
    "image": "https://media.guim.co.uk/2b5543a3686144f6806a28903d763d55b2c709dc/178_0_2738_2191/500.jpg",
    "summary": "Gareth Taylor has been appointed as the new head coach, raising hopes for the team's future. However, concerns have emerged regarding the level of investment from the club owners in the squad. This has led to questions about the team's competitiveness moving forward.",
    "published": "2025-08-30T23:01:13Z"
  },
  {
    "title": "Tories would maximise North Sea oil and gas extraction, Badenoch to say",
    "url": "https://www.theguardian.com/politics/2025/aug/30/tories-would-maximise-north-sea-oil-and-gas-extraction-badenoch-expected-to-say",
    "image": "https://media.guim.co.uk/a5ce324267f724364af0e2770adc741a63d29191/602_87_3257_2606/500.jpg",
    "summary": "The Conservative leader criticized the move away from fossil fuels, calling it \"absurd\" to neglect vital energy resources. He emphasized the importance of utilizing these resources for economic stability. The statement reflects ongoing debates surrounding energy policies and environmental concerns.",
    "published": "2025-08-30T22:38:42Z"
  },
  {
    "title": "Medvedev, Tsitsipas, Ostapenko: why does anger keep boiling over at US Open?",
    "url": "https://www.theguardian.com/sport/2025/aug/30/anger-keeps-boiling-over-at-a-tempestuous-flushing-meadows",
    "image": "https://media.guim.co.uk/b54ee53a2b9b582f610c5b386ad436237387a19d/434_0_4339_3471/500.jpg",
    "summary": "Tensions have risen among players at Flushing Meadows, driven by the season's end and the lively atmosphere of New York crowds. This has led to notable flare-ups during matches. The combination of high stakes and passionate spectators contributes to the heightened emotions on the court.",
    "published": "2025-08-30T22:00:37Z"
  },
  {
    "title": "Pep Guardiola confident of good season for Manchester City after seeing improvement",
    "url": "https://www.theguardian.com/football/2025/aug/30/pep-guardiola-confident-of-good-season-for-manchester-city-after-seeing-improvement",
    "image": "https://media.guim.co.uk/0893d2608be4fd471e5b2c718723a776e0771e52/248_0_2490_1992/500.jpg",
    "summary": "Pep Guardiola expressed optimism about his Manchester City players' performances in training, noting their efforts to align with his tactical vision. He feels encouraged by their progress as they strive to implement his playing style. Guardiola's positive outlook reflects confidence in the team's development.",
    "published": "2025-08-30T21:30:11Z"
  }
]