[
  {
    "title": "News live: Australia and PNG sign defence treaty; Michaelia Cash says Sussan Ley has ‘toughest job in history’",
    "url": "https://www.theguardian.com/australia-news/live/2025/oct/06/australia-news-live-queensland-bushfire-danger-warnings-moreton-island-croydon-park-shooting-sydney-anthony-albanese-sussan-ley-andrew-hastie-labor-liberal-ntwnfb",
    "image": "https://media.guim.co.uk/d76a16ba695ef1814e4cf64bbeeb0394bf113bdd/312_0_3119_2496/500.jpg",
    "summary": "Please provide the news content that you would like summarized in three lines.",
    "published": "2025-10-06T05:16:28Z"
  },
  {
    "title": "‘Non-stop bang bang bang’: man arrested after about 50 shots fired from Sydney flat into street, injuring 16",
    "url": "https://www.theguardian.com/australia-news/2025/oct/06/man-arrested-shots-fired-from-unit-croydon-park-ntwnfb",
    "image": "https://media.guim.co.uk/ef05d1db257500c447b13565866917a9bdf86864/269_0_5000_4002/500.jpg",
    "summary": "Multiple individuals were treated for injuries following a shooting incident in Croydon Park, located in the city's inner west, on Sunday night. Authorities seized a firearm in connection with the event. The investigation is ongoing as officials work to determine the circumstances surrounding the shooting.",
    "published": "2025-10-06T05:02:29Z"
  },
  {
    "title": "Water bills: millions of households in England could face even bigger rises",
    "url": "https://www.theguardian.com/money/2025/oct/06/water-bills-millions-of-households-in-england-could-face-even-bigger-rises",
    "image": "https://media.guim.co.uk/9ed29074fda4a84feba454e909d61da0a645cb39/1051_0_4939_3954/500.jpg",
    "summary": "The Competition and Markets Authority (CMA) is set to deliver a verdict following an appeal by five firms seeking approval to raise their bills above limits set by Ofwat. This decision could impact consumers and the regulatory landscape in the water sector. The outcome will clarify the balance between company financial needs and consumer protections.",
    "published": "2025-10-06T05:00:54Z"
  },
  {
    "title": "Don’t despair, Tories: look upon Reform and see your rightful and fitting legacy | Nesrine Malik",
    "url": "https://www.theguardian.com/commentisfree/2025/oct/06/tories-reform-legacy-kemi-badenoch-conservative-party-conference",
    "image": "https://media.guim.co.uk/8294a8e8bfd156872729d0fd09561524c6cecf72/0_0_2437_1949/500.jpg",
    "summary": "Nesrine Malik, a Guardian columnist, suggests that Kemi Badenoch should consider the impact of the Conservative Party's 14 years in power when questioning the current atmosphere of their party conference. The event appears to have a sideshow vibe, reflecting broader concerns about the party's relevance. The comments highlight discontent and challenges faced by the Conservatives in maintaining their appeal.",
    "published": "2025-10-06T05:00:04Z"
  },
  {
    "title": "Biryani and chunky chilli pumpkin: Maunika Gowardhan’s recipes for Indian-style squash",
    "url": "https://www.theguardian.com/food/2025/oct/06/indian-style-squash-recipes-biryani-achari-kaddu-maunika-gowardhan",
    "image": "https://media.guim.co.uk/7ab4d2f40fea3f88e164dea907640b27d6c75966/0_1030_4475_3581/500.jpg",
    "summary": "A new recipe features a one-pot mushroom and squash biryani that blends flavors seamlessly. Additionally, a chunky squash dish is prepared with a savory spice coating. Together, these creations offer a delicious plant-based meal option.",
    "published": "2025-10-06T05:00:03Z"
  }
]