[
  {
    "title": "Europe live: New French PM to be named ‘in days’ as Bayrou loses confidence vote amid political turmoil",
    "url": "https://www.theguardian.com/world/live/2025/sep/08/europe-live-macron-france-prime-minister-francois-bayrou-confidence-vote-latest-news",
    "image": "https://media.guim.co.uk/27d25520fffb3884efcb6e72485f947141dc0929/132_0_5380_4304/500.jpg",
    "summary": "French President Emmanuel Macron plans to appoint a successor to François Bayrou as minister after over 350 lawmakers voted against Bayrou's candidacy for Prime Minister. This decision calls attention to the challenges facing Macron's administration amidst political opposition. The new appointment aims to solidify governance as Macron navigates a complex legislative landscape.",
    "published": "2025-09-08T18:47:30Z"
  },
  {
    "title": "Belarus v Scotland: World Cup 2026 qualifying Group C – live",
    "url": "https://www.theguardian.com/football/live/2025/sep/08/belarus-v-scotland-world-cup-2026-qualifying-group-c-live",
    "image": "https://media.guim.co.uk/36644913e458369cf47fc20d81eee1bb890916d3/831_0_4478_3584/500.jpg",
    "summary": "Steve Clarke's team aims for their first victory in the group stage, facing a challenge against the world's 97th-ranked team. The match is highly anticipated, with potential for an upset. Michael Butler provides a minute-by-minute report on the unfolding action.",
    "published": "2025-09-08T18:46:41Z"
  },
  {
    "title": "Several senior female Labour MPs drop out of party deputy leader contention",
    "url": "https://www.theguardian.com/politics/2025/sep/08/several-senior-female-labour-mps-drop-out-of-party-deputy-leader-contention",
    "image": "https://media.guim.co.uk/d4a171d3e8968342accaaded78a2e29d20d94a65/1570_0_1538_1230/500.jpg",
    "summary": "The nomination period to replace Rayner has been shortened, leading to concerns about a potentially negative environment within the selection process. These factors have resulted in a smaller pool of candidates for the position. The situation highlights the challenges faced in ensuring a smooth leadership transition.",
    "published": "2025-09-08T18:46:27Z"
  },
  {
    "title": "Surrey all out for 246, McKinney punishes Essex: county cricket day one – as it happened",
    "url": "https://www.theguardian.com/sport/live/2025/sep/08/county-championship-cricket-surrey-warwickshire-somerset-yorkshire-live",
    "image": "https://media.guim.co.uk/0ffae68889e0686b32aa62f43ae8d10aa43bb5f8/169_0_3500_2800/500.jpg",
    "summary": "County cricket re-commenced with Ben McKinney impressing by scoring a stylish 121 runs. His performance highlights why he is favored by England selectors. McKinney's innings showcased his talent and potential for future international engagements.",
    "published": "2025-09-08T18:43:07Z"
  },
  {
    "title": "US supreme court backs Trump on aggressive immigration raids – live updates",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/08/donald-trump-immigration-hyundai-tariffs-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/176e8758304c8d935223d4f6e1714433ce3bec83/683_0_6827_5464/500.jpg",
    "summary": "A court has granted federal agents permission to conduct raids in Southern California aimed at deporting individuals based on race or language. This controversial decision raises concerns about racial profiling and discrimination. Advocates warn that such actions could exacerbate tensions in affected communities.",
    "published": "2025-09-08T18:32:33Z"
  }
]