[
  {
    "title": "At least 21,000 children disabled in Gaza during war, says UN committee – Middle East crisis live",
    "url": "https://www.theguardian.com/world/live/2025/sep/03/gaza-graveyard-international-humanitarian-law-unrwa-israel-middle-east-crisis-latest-updates-news",
    "image": "https://media.guim.co.uk/8cb9b5b1581e9177dc6696f13ad9ce3e5754b0df/191_0_3780_3024/500.jpg",
    "summary": "The UN Committee on the Rights of Persons with Disabilities reports that over 40,000 individuals have sustained new war-related injuries, with a majority left disabled. This highlights the severe impact of ongoing conflicts on civilian populations. The findings underscore the urgent need for support and rehabilitation for affected individuals.",
    "published": "2025-09-03T13:18:35Z"
  },
  {
    "title": "Post your questions for Biffy Clyro frontman Simon Neil",
    "url": "https://www.theguardian.com/music/2025/sep/03/post-your-questions-for-biffy-clyro-frontman-simon-neil",
    "image": "https://media.guim.co.uk/c3285f39b5f0643bc677ee04a29b86133b46d1a4/0_469_6000_4799/500.jpg",
    "summary": "The band's singer-guitarist will be answering questions in anticipation of their upcoming 10th album, \"Futique,\" set to release this month. Fans are encouraged to engage and submit their inquiries. Excitement builds as the release date approaches.",
    "published": "2025-09-03T13:17:52Z"
  },
  {
    "title": "Volodymyr Zelenskyy in Denmark to discuss support for Ukraine as Polish president prepares to visit Donald Trump – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/sep/03/volodymyr-zelenskyy-denmark-support-ukraine-karol-nawrocki-meet-donald-trump-europe-latest-updates-news",
    "image": "https://media.guim.co.uk/0b7981b437f18d29f797a5fcde41747e79e80dca/39_0_4680_3744/500.jpg",
    "summary": "Ukrainian President Volodymyr Zelensky met with leaders from Nordic and Baltic countries to discuss regional security and support for Ukraine. Meanwhile, Polish politician Karol Nawrocki is scheduled to meet with the U.S. president at the White House. Both meetings signify ongoing international discussions concerning cooperation and assistance amid the ongoing conflict in Ukraine.",
    "published": "2025-09-03T13:16:55Z"
  },
  {
    "title": "More than 1,000 health workers urge Kennedy to quit over anti-vax policies",
    "url": "https://www.theguardian.com/us-news/2025/sep/03/hhs-letter-rfk-resign-vaccines",
    "image": "https://media.guim.co.uk/858d7a4146db506dee4c8ae940b4c5c77f8ecd99/1015_0_7202_5760/500.jpg",
    "summary": "A letter has accused Kennedy of endangering U.S. health by prioritizing ideology over science and disregarding concerns raised by staff at the CDC. It highlights a growing number of resignations within the organization as a result of his leadership approach. Critics argue that such actions jeopardize public health efforts.",
    "published": "2025-09-03T13:16:47Z"
  },
  {
    "title": "‘I told my family, I’ll probably die’: US immigration sends Russian asylum seekers back to Moscow",
    "url": "https://www.theguardian.com/us-news/2025/sep/03/i-told-my-family-ill-probably-die-us-immigration-sends-russian-asylum-seekers-back-to-moscow",
    "image": "https://media.guim.co.uk/4828c4c9998f9c012abe49001765bcbed2238c4b/519_0_3983_3186/500.jpg",
    "summary": "A Russian national seeking asylum in the U.S. on political grounds has reported experiencing inhumane treatment while in custody. The individual detailed harsh conditions and mistreatment during their detention. The case raises concerns over the treatment of asylum seekers within the U.S. immigration system.",
    "published": "2025-09-03T13:16:04Z"
  }
]