[
  {
    "title": "Liberals hold cordial party room after public brawling but chasm on net zero remains",
    "url": "https://www.theguardian.com/australia-news/2025/oct/31/liberals-sussan-ley-party-room-chasm-on-net-zero-remains",
    "image": "https://media.guim.co.uk/4ce8522c0f07a3a807a5c8d1798ae5772c3026a6/448_1_5386_4311/500.jpg",
    "summary": "Regional and metropolitan MPs are in conflict, with tensions rising amid warnings from party leadership against publicly criticizing one another. The disagreement centers on unresolved issues impacting both constituencies. Calls for unity and constructive dialogue have been issued to prevent further escalation.",
    "published": "2025-10-31T07:06:36Z"
  },
  {
    "title": "Sports quiz of the week: prizes, punches, persistence and set-piece perfection",
    "url": "https://www.theguardian.com/sport/2025/oct/31/sports-quiz-week-prizes-punches-football-cricket-rugby-boxing-darts-baseball-swimming",
    "image": "https://media.guim.co.uk/715c1ce788ced1be33cd0e23653ec99b6c0c0e0e/0_0_5000_4000/500.jpg",
    "summary": "The article highlights ongoing excitement in various sports, including football, cricket, rugby, boxing, darts, baseball, and swimming. Fans are urged to keep up with the latest developments and performances across these disciplines. It emphasizes the dynamic nature of these sports and their continued relevance to audiences.",
    "published": "2025-10-31T07:02:15Z"
  },
  {
    "title": "Attention by Anne Enright review – sparkling reflections on life and literature",
    "url": "https://www.theguardian.com/books/2025/oct/31/attention-by-anne-enright-review-sparkling-reflections-on-life-and-literature",
    "image": "https://media.guim.co.uk/eb59d8a25db3cc462f7cdadad74002f4fa30ca48/887_0_5693_4555/500.jpg",
    "summary": "The Booker Prize winner is celebrated for their bold and morally generous writing style. Their work combines sharp wit with a sense of humor, portraying themes of fallibility and redemption. The author is described as a \"fallen angel,\" suggesting a complex, compelling narrative voice.",
    "published": "2025-10-31T07:00:21Z"
  },
  {
    "title": "Pluribus to All’s Fair: the seven best shows to stream this week",
    "url": "https://www.theguardian.com/tv-and-radio/2025/oct/31/pluribus-to-alls-fair-the-seven-best-shows-to-stream-this-week",
    "image": "https://media.guim.co.uk/222c87e41589ddf44fd7cd77d8d72d087a1f8478/692_42_6789_5431/500.jpg",
    "summary": "Vince Gilligan returns with a captivating new show blending humor and suspense, while Kim Kardashian features in a campy drama centered on divorce lawyers. Additionally, \"Squid Game: The Challenge\" makes a thrilling comeback. These highlights promise an exciting lineup of entertainment.",
    "published": "2025-10-31T07:00:21Z"
  },
  {
    "title": "Woman who booked flight to Italy but did not board has child benefits stopped ",
    "url": "https://www.theguardian.com/society/2025/oct/31/woman-flight-italy-did-not-board-child-benefits-stopped",
    "image": "https://media.guim.co.uk/908975382d3ea83f5be378aca02dc47c2e925f3f/484_0_4840_3872/500.jpg",
    "summary": "A family was denied entry at the airport gate after one of their children experienced an epileptic seizure. However, HM Revenue and Customs (HMRC) later stated that the family successfully boarded a one-way flight. This incident highlights potential miscommunication or misunderstandings regarding the family's travel situation.",
    "published": "2025-10-31T07:00:20Z"
  }
]