[
  {
    "title": "Charlie Kirk shooting latest: FBI shares photos of person of interest and offers reward for information",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/11/charlie-kirk-shot-latest-news-updates-utah-university-donald-trump",
    "image": "https://media.guim.co.uk/76c0230ab358372bf02a0a59e55b7ea5d8ab10ca/0_399_1092_873/500.jpg",
    "summary": "The FBI is offering a $100,000 reward for information regarding a suspect linked to a high-powered bolt action rifle discovered in a wooded area. Authorities are seeking public assistance in identifying the individual connected to this weapon. The investigation is ongoing as they aim to ensure community safety.",
    "published": "2025-09-11T18:42:07Z"
  },
  {
    "title": "Leicestershire promoted, Nottinghamshire beat Worcs: county cricket – as it happened",
    "url": "https://www.theguardian.com/sport/live/2025/sep/11/worcestershire-v-nottinghamshire-surrey-v-warwickshire-and-more-county-cricket-day-four-live",
    "image": "https://media.guim.co.uk/c9338ed7ff2603bb7eca744ca009251feff8c0e3/51_0_2250_1800/500.jpg",
    "summary": "Leicestershire remains in contention after a draw in their recent match, while Nottinghamshire secured a victory to advance. This sets the stage for an anticipated clash against Surrey. The upcoming showdown promises to be a significant encounter in the competition.",
    "published": "2025-09-11T18:25:46Z"
  },
  {
    "title": "UK should work with Nato on new missile defence system to counter Russia, experts say",
    "url": "https://www.theguardian.com/politics/2025/sep/11/britain-should-work-with-nato-on-new-missile-defence-system-to-counter-russia-experts-say",
    "image": "https://media.guim.co.uk/cefd39889e9ee1384ab24166ccd1f7c07d35e5a8/420_291_2552_2042/500.jpg",
    "summary": "Two authors of the UK strategic defense review emphasized the necessity for Europe to strengthen its defenses following the incursion of Russian drones into Polish airspace. They highlighted the increasing threats posed by such actions. The call for enhanced military readiness reflects growing concerns about regional security dynamics.",
    "published": "2025-09-11T18:19:52Z"
  },
  {
    "title": "Charlie Kirk shooting: FBI says weapon found as hunt for suspect continues",
    "url": "https://www.theguardian.com/us-news/2025/sep/11/charlie-kirk-shooting-police-search-for-suspect-amid-condemnation-of-targeted-killing",
    "image": "https://media.guim.co.uk/3726e22b0eda208b058475b02739ddaf060188af/155_0_4870_3895/500.jpg",
    "summary": "A rifle was discovered in a wooded area linked to a shooter who fled the scene. In response, former President Trump announced plans to award the Medal of Freedom posthumously to Kirk. The incident is under investigation as authorities gather more information.",
    "published": "2025-09-11T18:18:27Z"
  },
  {
    "title": "Does my vagina really need a ‘facial’?",
    "url": "https://www.theguardian.com/global/2025/sep/11/vagina-wellness-products-feminine-intimate-care",
    "image": "https://media.guim.co.uk/af003d59ecfa5418c1cd00537a7c80d80465d378/0_0_5000_3999/500.jpg",
    "summary": "The pressure for women to conform to unrealistic standards of vaginal smell and appearance can be dehumanizing and detrimental to health. Emphasizing naturalness is important for self-acceptance and well-being. Challenging these societal norms promotes a more positive understanding of women's bodies.",
    "published": "2025-09-11T18:18:08Z"
  }
]