[
  {
    "title": "TV tonight: Niamh Algar and Tom Hollander’s big hide-and-seek thriller",
    "url": "https://www.theguardian.com/tv-and-radio/2025/oct/16/tv-tonight-niamh-algar-and-tom-hollanders-big-hide-and-seek-thriller",
    "image": "https://media.guim.co.uk/fb85221ad1dc747c061ff2e2e2b20b8a9c628502/798_0_6627_5304/500.jpg",
    "summary": "In \"The Iris Affair,\" a massive piece of technology leads to significant complications. Meanwhile, viral prankster Oobah Butler aims to make a million with his latest venture. Tune in this evening to catch both stories.",
    "published": "2025-10-16T05:15:57Z"
  },
  {
    "title": "Australia news live: dog-whistle politics ‘now a set of bagpipes’, Tony Burke says; controversial APY exhibition to return",
    "url": "https://www.theguardian.com/australia-news/live/2025/oct/16/australia-news-live-tony-burke-crypto-atms-crime-real-income-aihw-wellbeing-bluey-coins-mint-ntwnfb",
    "image": "https://media.guim.co.uk/3a27e062daf1aa33bee5afaf1c58c1e30d2911b9/39_0_4325_3460/500.jpg",
    "summary": "It seems there's been a misunderstanding as \"Follow live\" doesn't provide specific news content to summarize. If you could provide details or context about the news story you'd like summarized, I'd be happy to help!",
    "published": "2025-10-16T05:13:30Z"
  },
  {
    "title": "San Francisco opposes ‘authoritarian crackdown’ as Trump threatens to send troops",
    "url": "https://www.theguardian.com/us-news/2025/oct/15/san-francisco-trump-national-guard-troops",
    "image": "https://media.guim.co.uk/a9c8b3f0ee3fcbe14c70bb83434bb90c1f3a131b/249_0_2501_2001/500.jpg",
    "summary": "President makes exaggerated statements about rampant crime, while city leaders assert that there's no requirement for a federal force reminiscent of \"Trump's personal army.\" They emphasize local security measures instead. The tension highlights differing views on public safety and federal intervention.",
    "published": "2025-10-16T05:00:59Z"
  },
  {
    "title": "Unseen Bohemian Rhapsody verses to feature in Freddie Mercury lyric book",
    "url": "https://www.theguardian.com/music/2025/oct/16/unseen-bohemian-rhapsody-verses-to-feature-in-freddie-mercury-lyric-book",
    "image": "https://media.guim.co.uk/968dfe2b7d3a289b106dc011a4cca83fc54a828d/250_0_2455_1964/500.jpg",
    "summary": "The upcoming exhibition \"A Life in Lyrics\" will showcase drafts of iconic Queen songs alongside personal photographs from the band's private archive. This collection provides a unique glimpse into the creative process and history of the legendary group. Fans can look forward to an intimate experience highlighting Queen's musical journey.",
    "published": "2025-10-16T05:00:58Z"
  },
  {
    "title": "Rachel Reeves should consider welfare cuts in budget, IFS says",
    "url": "https://www.theguardian.com/uk-news/2025/oct/16/rachel-reeves-should-consider-welfare-cuts-in-budget-ifs-says",
    "image": "https://media.guim.co.uk/34f18f5766fd18c44f9d2cbb073383ccfa7c8597/0_0_4619_3697/500.jpg",
    "summary": "A thinktank is urging the chancellor to implement significant changes to benefits and pensions in order to calm anxious financial markets. The recommendation comes amid growing economic uncertainty and concerns over fiscal stability. The call for action emphasizes the need for decisive measures to restore confidence among investors.",
    "published": "2025-10-16T05:00:58Z"
  }
]