[
  {
    "title": "Bledisloe Cup: New Zealand beat Australia in the Rugby Championship – reaction",
    "url": "https://www.theguardian.com/sport/live/2025/sep/27/bledisloe-cup-live-updates-new-zealand-all-blacks-vs-wallabies-australia-rugby-championship-scores-results-kick-off-time-eden-park-auckland",
    "image": "https://media.guim.co.uk/3009d57c3bf074a9683aa6434e0c983b1de54730/136_0_2750_2201/500.jpg",
    "summary": "The Wallabies were unable to defeat the All Blacks at Eden Park, where the hosts secured a 33-24 victory. New Zealand maintained their stronghold at the venue, continuing their winning streak. The match showcased a competitive performance from both teams, but the Wallabies ultimately fell short.",
    "published": "2025-09-27T07:14:46Z"
  },
  {
    "title": "Brentford v Manchester United buildup, Madrid derby and WSL action – matchday live",
    "url": "https://www.theguardian.com/football/live/2025/sep/27/brentford-v-manchester-united-buildup-madrid-derby-and-wsl-action-matchday-live",
    "image": "https://media.guim.co.uk/d53934446e07ffe23418a5768b721a58d05dd52d/0_0_5000_4000/500.jpg",
    "summary": "Ruben Amorim seeks a crucial victory for his team amidst a hectic day of football. Meanwhile, the highly anticipated Madrid derby is on the horizon, adding to the excitement. Join us for a discussion on these key matchups.",
    "published": "2025-09-27T07:13:55Z"
  },
  {
    "title": "AFL grand final 2025 live updates: Geelong Cats v Brisbane Lions",
    "url": "https://www.theguardian.com/sport/live/2025/sep/27/afl-grand-final-2025-live-updates-geelong-vs-lions-blog-scores-results-start-time-cats-v-lions-mcg",
    "image": "https://media.guim.co.uk/d6c3103a8c95a2ea023ba7b9c39936182d909b50/332_0_3307_2647/500.jpg",
    "summary": "The report covers the buildup to a highly anticipated match where the Cats aim for a third premiership under coach Chris Scott's leadership. Meanwhile, the Lions strive to defend their title and achieve back-to-back championships. Writers will provide ongoing updates throughout the game.",
    "published": "2025-09-27T07:13:28Z"
  },
  {
    "title": "Farewell Amazon Fresh: the no tills thing was all a bit too awkward | Jason Okundaye",
    "url": "https://www.theguardian.com/commentisfree/2025/sep/27/amazon-fresh-store-closing-technology-shopping",
    "image": "https://media.guim.co.uk/5f4b64599819b00e7a80749dc77a61c2f4b6eb28/382_0_4856_3885/500.jpg",
    "summary": "The \"just walk out\" shopping technology initially aimed to enhance convenience but is now being questioned as people seek to reduce their reliance on tech. Assistant newsletter editor Jason Okundaye suggests that a simpler, less tech-driven approach to shopping may be preferable. There is a growing sentiment that embracing less technology could lead to a more satisfying shopping experience.",
    "published": "2025-09-27T07:00:37Z"
  },
  {
    "title": "Gianni Infantino’s Faustian pacts face biggest test as prospect of Israel ban moves closer",
    "url": "https://www.theguardian.com/football/2025/sep/27/gianni-infantinos-faustian-pacts-face-biggest-test-as-prospect-of-israel-ban-moves-closer",
    "image": "https://media.guim.co.uk/ee4f0f2c3c8de0802d5cfd8b3bfdf9861aacd72d/66_79_2487_1990/500.jpg",
    "summary": "The article argues that sports should not legitimize or normalize inappropriate behavior. It emphasizes that Israel's participation in international sports events is increasingly being questioned. The sentiment reflects a growing consensus that Israel's involvement is not acceptable at this time.",
    "published": "2025-09-27T07:00:36Z"
  }
]