[
  {
    "title": "Danish PM warns security situation in Europe will get worse and more serious – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/oct/01/mette-frederiksen-denmark-europe-russia-vladimir-putin-volodymyr-zelenskyy-ukraine-hybrid-war-security-europe-live-news",
    "image": "https://media.guim.co.uk/3a2046c1b05f2c3d33d25b6814cef100f5cbcee9/566_0_5618_4495/500.jpg",
    "summary": "Danish Prime Minister Mette Frederiksen warns that Europe is confronting significant threats due to the ongoing conflict in Ukraine. She highlights the emergence of a broader hybrid war that complicates the security landscape. Frederiksen's comments underscore the urgency for European nations to address these challenges collectively.",
    "published": "2025-10-01T09:21:10Z"
  },
  {
    "title": "US government shutdown live: first closure since 2018 begins after funding bill fails",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/01/us-government-shutdown-update-2025-shutting-funding-trump-democrats-republicans-live-updates-latest-news",
    "image": "https://media.guim.co.uk/685443f5ce0b4b296a6b29873ed1b20e4a02d776/327_0_4844_3876/500.jpg",
    "summary": "In the Senate, competing bills aimed at addressing the government shutdown were rejected amid accusations of partisan politics from both Republicans and Democrats. The deadlock highlights ongoing tensions in Congress as the government remains unfunded. Updates continue to unfold as the situation develops.",
    "published": "2025-10-01T09:19:47Z"
  },
  {
    "title": "Palestine Action protest in London could set record for number of arrests, say organisers",
    "url": "https://www.theguardian.com/uk-news/2025/oct/01/palestine-action-protest-london-could-set-record-number-arrests-say-organisers",
    "image": "https://media.guim.co.uk/d494e4d926a57fc11a438043242d77d0bd17d6f1/597_360_4055_3244/500.jpg",
    "summary": "Defend Our Juries has garnered 1,500 pledges for an upcoming demonstration. They anticipate receiving hundreds more registrations by Saturday. The event highlights growing public engagement in the cause.",
    "published": "2025-10-01T09:19:37Z"
  },
  {
    "title": "Women’s Cricket World Cup: Australia v New Zealand – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/01/womens-cricket-world-cup-live-australia-v-new-zealand",
    "image": "https://media.guim.co.uk/3a01d879d5d025c6e76938f131c163cf010d09be/192_0_3458_2766/500.jpg",
    "summary": "Australia begins their title defense in a 50-over match at Holkar Stadium in Indore. Megan Maurice will provide live updates throughout the game. Fans can follow her reports for all the latest action.",
    "published": "2025-10-01T09:17:57Z"
  },
  {
    "title": "New Zealand v Australia: men’s first T20 international cricket – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/01/mens-t20-international-cricket-live-new-zealand-v-australia",
    "image": "https://media.guim.co.uk/2d6e9c7657a758d8f4f098f3dd445b21790fd436/682_0_3438_2750/500.jpg",
    "summary": "Australia faces New Zealand in a three-match T20 series at Bay Oval, Tauranga. Follow updates from Angus Fontaine as the match progresses. The excitement builds for this competitive clash between the two cricketing nations.",
    "published": "2025-10-01T09:17:42Z"
  }
]