[
  {
    "title": "Judge blocks suspension of Snap food aid during shutdown – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/31/donald-trump-filibuster-shutdown-snap-food-refugees-drug-boats-latest-news-updates",
    "image": "https://media.guim.co.uk/07b229d1eac114f30d6758b19b617cbe5a13903d/421_0_6569_5254/500.jpg",
    "summary": "A federal court ruling was issued just before a critical deadline, potentially affecting over 40 million Americans facing loss of food stamp benefits. The ruling adds uncertainty to the future of assistance programs as many rely on these benefits for basic sustenance. Advocates are concerned about the implications for food security among vulnerable populations.",
    "published": "2025-10-31T20:09:04Z"
  },
  {
    "title": "No mountain too high for Itoje and England with Australia first up in autumn series",
    "url": "https://www.theguardian.com/sport/2025/oct/31/maro-itoje-england-australia-autumn-nations-series-rugby-union",
    "image": "https://media.guim.co.uk/cb95c678540e4a8aa1e6b687a006d50595eccd10/500_0_5000_4000/500.jpg",
    "summary": "England's captain emphasizes the importance of the team showcasing their full strength in the upcoming match, which is the first of four home internationals scheduled for November. The call to action highlights the team's need for a strong performance. Fans are eagerly anticipating the display of their capabilities on Saturday.",
    "published": "2025-10-31T20:00:14Z"
  },
  {
    "title": "Peter Watkins, Oscar-winning director of The War Game, dies aged 90",
    "url": "https://www.theguardian.com/film/2025/oct/31/peter-watkins-director-war-game-dead",
    "image": "https://media.guim.co.uk/2ea35effb42a1b1809fcd2440708bbbbbac0913d/0_1158_3556_2841/500.jpg",
    "summary": "A controversial English director faced conflict with the BBC due to his alarming film on nuclear war. As a result of the backlash, he sought opportunities overseas to continue his filmmaking career. His radical approach has sparked significant debate within the industry.",
    "published": "2025-10-31T19:47:01Z"
  },
  {
    "title": "Andrew in line for six-figure payout and annual stipend from king, sources say",
    "url": "https://www.theguardian.com/uk-news/2025/oct/31/andrew-in-line-for-six-figure-payment-and-annual-stipend-from-king-sources-say",
    "image": "https://media.guim.co.uk/ac0a66808c4ec3c978ee1afc0e8e5ad50109ca57/130_0_2657_2126/500.jpg",
    "summary": "Buckingham Palace is finalizing plans for the future of a former prince, who remains under scrutiny. The transition involves his adjustment to life as a commoner. Details regarding his role and obligations are still being determined.",
    "published": "2025-10-31T19:24:41Z"
  },
  {
    "title": "Trump administration blocked from suspending Snap benefits for millions of Americans",
    "url": "https://www.theguardian.com/us-news/2025/oct/31/judge-blocks-trump-snap-suspension",
    "image": "https://media.guim.co.uk/f9d2e6cdc61b8fdc2a7babec150550ec6eea7d7f/392_0_3900_3122/500.jpg",
    "summary": "A judge granted a temporary restraining order, while another ruled that the government must continue funding a program supporting low-income households. This decision aims to ensure ongoing assistance for vulnerable families. The legal developments indicate a significant commitment to the program amidst potential funding challenges.",
    "published": "2025-10-31T19:11:56Z"
  }
]