[
  {
    "title": "India set New Zealand 325 from 44 overs: Women’s Cricket World Cup – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/23/india-v-new-zealand-womens-cricket-world-cup-live",
    "image": "https://media.guim.co.uk/6d3b154760dd3a65ea0746ab8115cafba3fe054b/109_0_2256_1805/500.jpg",
    "summary": "India, facing three consecutive losses, has a chance to secure the final semi-final spot with a win in their upcoming match. Enthusiasts can join the writers for live updates and insights. The match is crucial for India's chances in the tournament.",
    "published": "2025-10-23T17:15:46Z"
  },
  {
    "title": "Putin calls new US sanctions an ‘unfriendly act’ but claims they won’t affect Russian economy – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/oct/23/russia-sanctions-ukraine-loan-assets-zelenskyy-putin-european-council-latest-news-updates",
    "image": "https://media.guim.co.uk/f62bdb97383a153229b882c2e9f69c1b8ae1ce1c/12_0_3252_2601/500.jpg",
    "summary": "Russian President Vladimir Putin warned that Moscow would launch an \"overwhelming\" response to any strikes targeting Russian territory. This statement follows recent attacks within Russia, heightening tensions in the region. The Kremlin's commitment underscores its intention to retaliate decisively against perceived aggressions.",
    "published": "2025-10-23T17:15:44Z"
  },
  {
    "title": "Trump calling off troop deployment to San Francisco, mayor says, as protests ramp up in northern California – live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/23/trump-san-francisco-federal-agents-white-house-ice-immigration-latest-news-updates",
    "image": "https://media.guim.co.uk/49cdf0ca20316d0fb844988838e98fb352a1c28c/802_0_5040_4032/500.jpg",
    "summary": "Protesters rallied outside a US Coast Guard base in the Bay Area to voice their opposition to the deployment of 100 Customs and Border Protection and other federal agents. The demonstration reflects concerns over federal enforcement practices. The gathering aimed to highlight issues related to immigration and border control policies.",
    "published": "2025-10-23T17:10:10Z"
  },
  {
    "title": "Asking immigrants for ‘A-level English’ is absurd | Letters",
    "url": "https://www.theguardian.com/uk-news/2025/oct/23/asking-immigrants-for-a-level-english-is-absurd",
    "image": "https://media.guim.co.uk/00342dcd321632a9068bf9eac4278bf5dbb188a9/640_0_4680_3744/500.jpg",
    "summary": "In response to Nesrine Malik's article, Pam Marshall, Christine Lehman, Bryn Jones, and Peter West express their views on the government's stricter immigration policies. They highlight concerns about the implications these conditions might have on immigrants. Their letters reflect a range of reactions to the government's approach to immigration reform.",
    "published": "2025-10-23T17:06:19Z"
  },
  {
    "title": "London’s dominance of the Mercury prize | Letter",
    "url": "https://www.theguardian.com/music/2025/oct/23/londons-dominance-of-the-mercury-prize",
    "image": "https://media.guim.co.uk/11b089e55b442829ac4514b1f20cf0ea5418902a/492_0_3413_2731/500.jpg",
    "summary": "Simon Frith highlights in a letter that the absence of shortlisted acts from outside London emphasizes the city's growing dominance in the arts sector. He argues this trend is becoming increasingly pronounced. The issue raises concerns about the representation of diverse talent beyond the capital.",
    "published": "2025-10-23T17:06:15Z"
  }
]