[
  {
    "title": "David Gow, former Guardian Germany correspondent, dies aged 80",
    "url": "https://www.theguardian.com/media/2025/nov/03/david-gow-former-guardian-germany-correspondent-dies",
    "image": "https://media.guim.co.uk/398dc94af3b078c6261985ec8d8606a5c703ccd8/0_535_2048_1638/500.jpg",
    "summary": "The news highlights the passing of a highly regarded journalist known for their professionalism and dedication to social justice. In addition to their advocacy, they also served as the European business editor. Their contributions to both journalism and social issues will be remembered.",
    "published": "2025-11-03T18:26:34Z"
  },
  {
    "title": "Releasing a suspect’s nationality will do nothing to satisfy those who are not looking for the truth | Zoe Williams",
    "url": "https://www.theguardian.com/commentisfree/2025/nov/03/releasing-a-suspects-nationality-will-do-nothing-to-satisfy-those-who-are-not-looking-for-the-truth",
    "image": "https://media.guim.co.uk/61b86d04de974d450defe29a6067435370266c49/358_0_5411_4329/500.jpg",
    "summary": "Zoe Williams argues that grifters continually seek new lows in their attempts to vilify migrants. Their efforts are relentless and unappeasable, driven by a desire to spread negativity. Ultimately, their actions reflect a broader pattern of denouncing vulnerable groups without any constructive purpose.",
    "published": "2025-11-03T18:24:09Z"
  },
  {
    "title": "Trump administration says it will partially fund Snap food aid benefits– live",
    "url": "https://www.theguardian.com/us-news/live/2025/nov/03/us-government-shutdown-donald-trump-latest-politics-news",
    "image": "https://media.guim.co.uk/c77959f8bedd35ba713f13cb326bde041092e86f/461_0_3901_3122/500.jpg",
    "summary": "The Trump administration has announced in a court filing that it will utilize emergency funds to help cover November SNAP benefits for millions of Americans. This decision comes as a response to funding challenges related to the food assistance program. The administration aims to ensure support for those in need during this critical time.",
    "published": "2025-11-03T18:22:39Z"
  },
  {
    "title": "UN resolution on international stabilisation force for Gaza could be ready within two weeks",
    "url": "https://www.theguardian.com/world/2025/nov/03/un-resolution-on-international-stabilisation-force-for-gaza-could-be-ready-within-two-weeks",
    "image": "https://media.guim.co.uk/84d40564e088df57541aa1f8ebd9fb74b2ff1ea4/446_0_4458_3566/500.jpg",
    "summary": "The resolution regarding the situation may face delays due to a lack of consensus on the force's mandate and the timeline for Israel's withdrawal. Disagreements persist among involved parties, complicating the path forward. A timely resolution is crucial to address ongoing tensions.",
    "published": "2025-11-03T18:22:25Z"
  },
  {
    "title": "Starmer was briefed on Mandelson’s Epstein links before appointing him, say civil servants",
    "url": "https://www.theguardian.com/politics/2025/nov/03/starmer-briefed-on-peter-mandelson-jeffrey-epstein-links-before-appointing-him-say-civil-servants",
    "image": "https://media.guim.co.uk/c07d84b6f076607ac3574c51f6231bdbd5c70ef6/1983_76_3813_3050/500.jpg",
    "summary": "MPs revealed that the Prime Minister received a summary of reputational risks but was unaware of the specific contents of emails prior to Prime Minister's Questions (PMQs). This disclosure raises questions about the Prime Minister's preparedness for the session. The situation highlights potential gaps in communication within the government.",
    "published": "2025-11-03T18:22:21Z"
  }
]