[
  {
    "title": "Australia politics live: super fund sends ‘hands off’ message to government; Marles says army joining search for Dezi Freeman",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/03/australia-politics-live-labor-coalition-greens-anthony-albanese-sussan-ley-question-time-nauru-immigration-asylum-ntwnfb",
    "image": "https://media.guim.co.uk/4fb146847a87c4aee28bb36b89f28f0c25f23abe/620_0_5863_4693/500.jpg",
    "summary": "Could you please provide the content or context of the news you'd like summarized?",
    "published": "2025-09-02T21:24:27Z"
  },
  {
    "title": "Trump makes false claims about US tariffs revenue and says White House trash video is ‘AI-generated’ – live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/02/congress-returns-government-shutdown-funding-trump-announcement-us-politics-live-latest-updates",
    "image": "https://media.guim.co.uk/37dd38e8ca0e0fcabf8e02a039a62a031d60968c/694_509_4364_3491/500.jpg",
    "summary": "Following the announcement from Space Command, the president held his first White House pool press briefing in a week. During the session, he provided answers that were later criticized as misleading. The press expressed concerns over the clarity and accuracy of his responses.",
    "published": "2025-09-02T21:13:27Z"
  },
  {
    "title": "Ice obtains access to Israeli-made spyware that can hack phones and encrypted apps",
    "url": "https://www.theguardian.com/us-news/2025/sep/02/trump-immigration-ice-israeli-spyware",
    "image": "https://media.guim.co.uk/c9895a5d04d90015d4216bb6fc8d3efb9661c574/309_0_3751_3001/500.jpg",
    "summary": "The Trump administration awarded a contract to Paragon Solutions, granting the immigration agency access to advanced stealth cyberweapons. This deal raises concerns about cybersecurity and surveillance implications. Critics argue that such powerful tools could be misused in enforcing immigration policies.",
    "published": "2025-09-02T21:11:23Z"
  },
  {
    "title": "Morning Mail: Warning on Nauru plan, neo-Nazi charged over Camp Sovereignty attack, 40-year-old ‘megaburg’ crumbles",
    "url": "https://www.theguardian.com/australia-news/2025/sep/03/morning-mail-wednesday-ntwnfb",
    "image": "https://media.guim.co.uk/715baff02a40a7de11f69569f912670be17dcb05/89_0_1500_1200/500.jpg",
    "summary": "Lawyers have condemned the decision to deny non-citizens natural justice, labeling it as an \"extreme overreach.\" This follows the case of Thomas Sewell, who is set to appear in a Melbourne magistrates court today. The legal community is voicing concerns about the implications of such policies on justice and human rights.",
    "published": "2025-09-02T20:54:57Z"
  },
  {
    "title": "US conducts ‘lethal strike’ against drug boat from Venezuela, Rubio says",
    "url": "https://www.theguardian.com/us-news/2025/sep/02/trump-venezuela-boat-lethal-strike",
    "image": "https://media.guim.co.uk/1c2acbd6bd19bbe47426ae062e31e4b6cab1240a/4_74_3837_3071/500.jpg",
    "summary": "Donald Trump stated that U.S. forces \"took it out\" amid rising tensions between the U.S. and Caracas, though it remains unclear whether the incident happened within Venezuelan waters. The remarks come amid heightened military and diplomatic conflicts between the two nations. The situation reflects ongoing concerns over territorial disputes and military presence in the region.",
    "published": "2025-09-02T20:51:00Z"
  }
]