[
  {
    "title": "AFL grand final 2025: Geelong Cats v Brisbane Lions – live build-up",
    "url": "https://www.theguardian.com/sport/live/2025/sep/27/afl-grand-final-2025-live-updates-geelong-vs-lions-blog-scores-results-start-time-cats-v-lions-mcg",
    "image": "https://media.guim.co.uk/ce4b93d1be24bb7b3880d433f72da7dda4aee39f/649_0_5599_4481/500.jpg",
    "summary": "The upcoming match will determine if the Cats can claim a third championship under coach Chris Scott's 15-year leadership, or if the Lions can successfully defend their title for a second consecutive year. Writers will provide a goal-by-goal report during the game. Fans are eagerly anticipating the build-up to this crucial showdown.",
    "published": "2025-09-27T02:44:29Z"
  },
  {
    "title": "Cradle Mountain tourist dies after walking group overwhelmed by extreme weather at national park",
    "url": "https://www.theguardian.com/australia-news/2025/sep/27/cradle-mountain-tourist-dies-after-walking-group-overwhelmed-by-extreme-weather-at-national-park",
    "image": "https://media.guim.co.uk/47cd295c695730bbad9afd87427a1ba53805c9d2/2_6_2283_1827/500.jpg",
    "summary": "Tasmania police reported that a group of four Chinese nationals was discovered by fellow hikers on Friday. Unfortunately, one woman from the group has died. Authorities are investigating the incident further.",
    "published": "2025-09-27T02:27:18Z"
  },
  {
    "title": "Trump urges Microsoft to fire lawyer who ran investigation into attempt to overturn 2020 US election – as it happened",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/26/james-comey-fbi-indictment-donald-trump-executive-orders-tariffs-us-politics-live",
    "image": "https://media.guim.co.uk/ea30745b7e0352485176734657642900fd15ae4f/186_0_2153_1724/500.jpg",
    "summary": "The President has expressed anger towards a former deputy attorney general, who is now employed at a major tech company, in light of criticism surrounding the targeting of former FBI chief James Comey. This incident has escalated tensions regarding Comey's actions and the ongoing political fallout. The situation highlights the complexities of government relationships with the tech industry amid heightened scrutiny.",
    "published": "2025-09-27T02:05:55Z"
  },
  {
    "title": "US Ryder Cup captain Keegan Bradley vows to stick to plan despite opening day struggles",
    "url": "https://www.theguardian.com/sport/2025/sep/27/ryder-cup-us-captain-keegan-bradley-v-europe-day-one-reaction",
    "image": "https://media.guim.co.uk/d04fe51b3a128e3a708abd32e29b91e7dcab4277/725_0_3625_2900/500.jpg",
    "summary": "Keegan Bradley is under criticism for his rigid approach to team pairings in the Saturday morning foursomes. His decisions have raised concerns about player autonomy and effectiveness. The unusual combinations have sparked debate among fans and analysts alike.",
    "published": "2025-09-27T01:58:56Z"
  },
  {
    "title": "Trump fires US attorney who told border agents to follow law on immigration raids",
    "url": "https://www.theguardian.com/us-news/2025/sep/26/trump-fires-prosecutor-sacramento",
    "image": "https://media.guim.co.uk/becd7ce534af34df18c1470bc18e1d560300f472/418_0_4178_3342/500.jpg",
    "summary": "Michele Beckwith was fired from her position after reminding Border Patrol officials of their obligation to comply with court orders. Her dismissal has raised concerns about adherence to legal standards within the agency. The New York Times highlighted the potential implications of her firing on accountability and oversight in border enforcement.",
    "published": "2025-09-27T01:48:42Z"
  }
]