[
  {
    "title": "Reeves dismisses Tory claims of ‘Benefits Street budget’ – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/nov/27/rachel-reeves-budget-2025-mansion-tax-labour-keir-starmer-conservatives-uk-politics-latest-news-updates",
    "image": "https://media.guim.co.uk/1a4a0c0f2ee12029ccba6022b9aef418619448c1/1282_374_3649_2919/500.jpg",
    "summary": "The Chancellor announced that 60% of families expected to benefit from the abolishment of the two-child limit are employed. This policy change aims to support working families facing financial challenges. The move has generated discussions on its impact on family welfare and labor market participation.",
    "published": "2025-11-27T09:15:30Z"
  },
  {
    "title": "Hong Kong fire latest: rescue crews search for survivors after 55 killed and hundreds reported missing",
    "url": "https://www.theguardian.com/world/live/2025/nov/27/hong-kong-fire-arrests-dead-killed-hundreds-missing-housing-complex-blaze",
    "image": "https://media.guim.co.uk/cfe6885eb8e18815f333c6e53cc6426c77efff4b/620_0_5000_4000/500.jpg",
    "summary": "I'm unable to access real-time updates or specific news articles. However, if you provide the text or main points of the news you'd like summarized, I'd be happy to help!",
    "published": "2025-11-27T09:12:39Z"
  },
  {
    "title": "Europe scrambles to join Ukraine talks as EU nations attempt to bolster militaries – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/nov/27/russia-ukraine-war-peace-deal-eu-europe-latest-news-updates",
    "image": "https://media.guim.co.uk/562448be5b4cb6c2f4eaba964dfdd1302eee3c80/916_0_4584_3666/500.jpg",
    "summary": "French President Emmanuel Macron is set to reveal plans for a new voluntary military service aimed at strengthening France's defenses. This proposal is intended as an alternative to reinstating regular conscription. The initiative reflects a commitment to enhance national security while respecting civil liberties.",
    "published": "2025-11-27T09:12:05Z"
  },
  {
    "title": "Betting company share drop after budget tax hike; Reeves ‘has confidence’ in OBR chief after leak – business live",
    "url": "https://www.theguardian.com/business/live/2025/nov/27/uk-fiscal-repair-budget-bond-markets-fiscal-headroom-gambling-companies-rachel-reeves-business-live-updates",
    "image": "https://media.guim.co.uk/a9b684ebd5ab312eea74d213d18cc5cfc9e7b0f1/1_0_2500_2000/500.jpg",
    "summary": "JP Morgan highlighted the UK government's focus on economic growth while unveiling its plans for a new headquarters in Canary Wharf. The move underscores the bank's commitment to expanding its presence in the UK. This development is seen as a boost to the local economy amidst broader growth initiatives.",
    "published": "2025-11-27T09:05:54Z"
  },
  {
    "title": "Labor strikes deal with Greens on nature laws overhaul amid criticism ‘dirty deal’ being ‘rammed through’",
    "url": "https://www.theguardian.com/australia-news/2025/nov/27/labor-strikes-deal-with-greens-to-pass-long-awaited-overhaul-of-nature-protection-laws",
    "image": "https://media.guim.co.uk/4af3185c0b00947f53779baa1c8f4f1ff196d8e5/242_0_4456_3566/500.jpg",
    "summary": "A new agreement has been reached to overhaul the Environment Protection and Biodiversity Conservation Act, concluding a five-year effort to amend the flawed system. This reform aims to enhance environmental protection and biodiversity conservation in Australia. Advocates hope the changes will lead to more effective safeguarding of natural resources.",
    "published": "2025-11-27T09:00:37Z"
  }
]