[
  {
    "title": "Richard Tice has 15-year record of supporting ‘net stupid zero’ initiatives",
    "url": "https://www.theguardian.com/uk-news/2025/oct/10/richard-tice-15-year-business-record-supporting-net-stupid-zero",
    "image": "https://media.guim.co.uk/613797cdc389b1d14657ab10af312217bde96e19/720_0_4840_3872/500.jpg",
    "summary": "Firms led by the deputy leader of Reform UK since 2011 are actively focused on energy conservation and reducing carbon dioxide emissions. Their efforts underline a commitment to sustainability and environmental responsibility. This initiative aligns with broader trends in business towards eco-friendly practices.",
    "published": "2025-10-10T10:19:57Z"
  },
  {
    "title": "Tuchel criticises England fans, World Cup qualifying news, referee Taylor on abuse: football – live",
    "url": "https://www.theguardian.com/football/live/2025/oct/10/tuchel-criticises-silent-england-fans-world-cup-qualifying-news-and-more-football-live",
    "image": "https://media.guim.co.uk/c6d3ed7dc2cb30c8d0ec6be759c0bc0acfc58299/1261_0_5838_4671/500.jpg",
    "summary": "Writers are providing live updates and reactions to the England vs. Wales match as part of the World Cup qualifying events. The report covers key moments and insights from the game. Additional updates on World Cup qualifying developments are also included.",
    "published": "2025-10-10T10:19:56Z"
  },
  {
    "title": "Power returns after Kyiv plunged into darkness by ‘massive’ Russian attack on Ukraine energy sector – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/oct/10/kyiv-ukraine-russia-france-europe-latest-live-news-updates",
    "image": "https://media.guim.co.uk/547923f94d51bc478ade5cb35092c7cf2f33fb8f/262_84_1519_1216/500.jpg",
    "summary": "Ukrainian President Volodymyr Zelenskyy reported that Russia launched a large-scale attack involving over 450 drones and 30 missiles across Ukraine. The assault highlights the ongoing escalation of military tensions between the two nations. Zelenskyy condemned the attack, emphasizing the continued threat to Ukrainian sovereignty.",
    "published": "2025-10-10T10:19:31Z"
  },
  {
    "title": "Yvette Cooper defends children as young as 13 needing digital ID – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/oct/10/uk-politics-latest-live-news-labour-reform-plaid-cymru-snp-conservatives",
    "image": "https://media.guim.co.uk/b89470e423fed5c8dcd44a6d00b035bc70b45338/1004_279_1890_1512/500.jpg",
    "summary": "The Foreign Secretary has expressed support for implementing digital IDs for young teenagers, stating it is the \"right way forward.\" This initiative aims to enhance security and streamline access to various services for minors. Advocates believe digital IDs can aid in identifying and protecting young individuals in an increasingly digital world.",
    "published": "2025-10-10T10:18:43Z"
  },
  {
    "title": "Letitia James accuses Donald Trump of ‘weaponizing’ US justice system after her indictment – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/10/letitia-james-donald-trump-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/4d0114ef50ca1dfd8805fb7ab4f3879c1e64ba3f/303_0_3026_2420/500.jpg",
    "summary": "The prosecutor who spearheaded the civil fraud investigation into Donald Trump in 2023 has declared that the charges filed against her are without merit. She maintains her actions were justified and within her legal duties. The situation continues to escalate as both sides prepare for further legal challenges.",
    "published": "2025-10-10T10:18:25Z"
  }
]