[
  {
    "title": "Asian stocks tumble on fresh US-China trade spat; Chinese exports top forecasts – business live",
    "url": "https://www.theguardian.com/business/live/2025/oct/13/asian-stocks-tumble-fresh-us-china-trade-spat-chinese-exports-top-forecasts-business-live",
    "image": "https://media.guim.co.uk/15429d443a0ee3b7848f5029e64c0d4a137dc14d/333_0_3325_2660/500.jpg",
    "summary": "In September, China's exports and imports surged beyond expectations, indicating a potential rebound in trade activity. The increase reflects strong global demand and improvements in supply chains. This trend may bolster China's economic recovery amid ongoing challenges.",
    "published": "2025-10-13T07:16:29Z"
  },
  {
    "title": "Israeli hostage release: Netanyahu welcomes Trump with second group of hostages expected to be released shortly – live updates",
    "url": "https://www.theguardian.com/world/live/2025/oct/13/gaza-ceasefire-live-updates-israel-hostages-release-hamas-trump-middle-east",
    "image": "https://media.guim.co.uk/1c923d2f1c5069bfd3032fbc2af40868d1e3b603/367_0_3398_2719/500.jpg",
    "summary": "Israeli Prime Minister greeted US President at Ben Gurion Airport amid ongoing developments in the region. The Red Cross is coordinating efforts to retrieve a second group of living captives. This highlights the ongoing humanitarian and diplomatic efforts amidst regional tensions.",
    "published": "2025-10-13T07:11:45Z"
  },
  {
    "title": "UK charities say toxic immigration rhetoric leading to threats against staff",
    "url": "https://www.theguardian.com/politics/2025/oct/13/uk-charities-toxic-immigration-rhetoric-threats-staff",
    "image": "https://media.guim.co.uk/05bda860a0b21a07d48aac4f49b0b3b3be6fc43d/500_0_5000_4000/500.jpg",
    "summary": "Voluntary organizations are implementing comprehensive security measures to ensure the safety of their staff and property. This response comes in light of increasing concerns over security threats. The measures aim to protect both personnel and assets effectively.",
    "published": "2025-10-13T07:00:17Z"
  },
  {
    "title": "All beliefs are welcome in London – we cannot allow extremists to divide us | Sadiq Khan",
    "url": "https://www.theguardian.com/commentisfree/2025/oct/13/london-islamophobia-antisemitism-sadiq-khan",
    "image": "https://media.guim.co.uk/39b26a059cd49eaaf4da8ec436fec91243129039/0_0_4975_3980/500.jpg",
    "summary": "London Mayor Sadiq Khan has announced a worrying increase in attacks against Jewish and Muslim communities. He criticized politicians for inflaming these tensions and appealing to divisive instincts. The call emphasizes the need for unity and understanding amid rising intercommunal violence.",
    "published": "2025-10-13T07:00:16Z"
  },
  {
    "title": "Unflappable, indispensable: centurion Ben Davies is the glue that holds Wales together",
    "url": "https://www.theguardian.com/football/2025/oct/13/unflappable-indispensable-ben-davies-wales",
    "image": "https://media.guim.co.uk/769379ae7833c75c54d62929dfb5d8e560989eb0/110_0_2079_1663/500.jpg",
    "summary": "Ben Davies is set to earn his 100th cap for Wales in a match against Belgium, marking a significant achievement in his career. Known for his professionalism and old-school values, Davies's milestone reflects his dedication to the sport. His contributions have made him a respected figure in Welsh football.",
    "published": "2025-10-13T07:00:16Z"
  }
]