[
  {
    "title": "Tories and Reform offer only ‘easy answers and snake oil’ on UK-EU relationship, minister warns – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/aug/27/conservatives-consider-deal-afghanistan-migrants-uk-politics-latest-updates-news",
    "image": "https://media.guim.co.uk/47b36a7511c83493f2c6693221763aeda1c34683/1923_356_3689_2951/500.jpg",
    "summary": "Nick Thomas-Symonds criticized Nigel Farage for his role in creating division among communities and inciting anger. He emphasized the negative impact of Farage's rhetoric on societal cohesion. The comments highlight ongoing tensions in political discourse.",
    "published": "2025-08-27T13:29:28Z"
  },
  {
    "title": "Trump’s 50% tariffs on India come into force as president puts pressure on country over buying Russian oil – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/aug/27/donald-trump-tariffs-india-us-politics-latest-updates-news",
    "image": "https://media.guim.co.uk/dbf56b9eac9b3c76aef3dc2fd49774f3edb80066/623_0_7200_5760/500.jpg",
    "summary": "An Indian commerce ministry official announced plans to encourage exporters to explore and diversify their markets, particularly targeting regions like China and the Middle East. This initiative aims to strengthen India's trade relationships and reduce reliance on traditional markets. The move reflects a strategic shift to enhance global trade opportunities for Indian businesses.",
    "published": "2025-08-27T13:21:14Z"
  },
  {
    "title": "Israeli military carries out raid in West Bank city of Nablus – Middle East crisis live",
    "url": "https://www.theguardian.com/world/live/2025/aug/27/donald-trump-meeting-white-house-gaza-israel-middle-east-crisis-latest-updates-news",
    "image": "https://media.guim.co.uk/ce39f24c39b81909aa863d5c6c12c0aa4d61e30c/670_0_4910_3928/500.jpg",
    "summary": "Israeli military confirms that soldiers and armored vehicles have entered a city in the northern occupied West Bank. Residents report that soldiers are conducting house searches in the area. This incursion reflects ongoing tensions in the region.",
    "published": "2025-08-27T13:17:54Z"
  },
  {
    "title": "Nigel Farage rolls back on vow to deport all small-boat arrivals to the UK",
    "url": "https://www.theguardian.com/politics/2025/aug/27/nigel-farage-rolls-back-on-vow-to-deport-all-small-boat-arrivals-to-the-uk",
    "image": "https://media.guim.co.uk/23e8d3c382017c8ac460a47302b0d0d65fb4ea17/717_28_4024_3219/500.jpg",
    "summary": "A reform leader spoke at an event in Scotland, stating that deporting women and children is not included in their party's agenda for the next five years. This announcement highlights a focus on more humane immigration policies. The leader's remarks aim to reassure constituents about compassionate governance.",
    "published": "2025-08-27T13:14:39Z"
  },
  {
    "title": "White House threatens sex education funds unless states nix references to transgender people in curriculums",
    "url": "https://www.theguardian.com/us-news/2025/aug/27/white-house-sex-education-funds-transgender-people",
    "image": "https://media.guim.co.uk/90b6bd4bcc34407a21f77db39aee722aff4db48f/0_0_6940_5555/500.jpg",
    "summary": "The Trump administration issued a letter urging states, territories, and Washington, D.C. to eliminate all references to gender ideology from their policies and practices. This directive reflects the administration's stance on gender issues, emphasizing a return to traditional definitions. The move has sparked controversy and discussions about the implications for LGBTQ+ rights and education.",
    "published": "2025-08-27T13:05:40Z"
  }
]