[
  {
    "title": "Zelenskyy says he would join Trump-Putin summit in Hungary if invited – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/oct/20/zelenskyy-trump-putin-russia-ukraine-war-eu-france-latest-news-updates",
    "image": "https://media.guim.co.uk/7f50f8118db3cfa760d016680c884cb41e67cac3/661_0_3373_2699/500.jpg",
    "summary": "Ukrainian President Volodymyr Zelensky criticized the selection of Budapest for a meeting amid ongoing discussions over the war in Ukraine. His remarks came as former President Donald Trump suggested that Ukraine should consider ceding territory to achieve peace. The comments highlight ongoing tensions surrounding territorial integrity and diplomatic negotiations.",
    "published": "2025-10-20T13:25:49Z"
  },
  {
    "title": "Louvre museum robbery: how the thieves broke in, what they stole and what happens next",
    "url": "https://www.theguardian.com/world/2025/oct/20/louvre-museum-robbery-thieves-stolen-jewellery",
    "image": "https://media.guim.co.uk/751197a2a220d8f91916cb4b9d76cd17bbfc6862/986_0_6483_5187/500.jpg",
    "summary": "The French culture ministry reported that eight pieces of art were stolen, but the crown of Napoleon III's wife, Empress Eugénie, was inadvertently dropped by the thieves during their escape. This incident highlights ongoing concerns about art theft in France. The situation underscores the vulnerability of cultural heritage to criminal activity.",
    "published": "2025-10-20T13:23:35Z"
  },
  {
    "title": "Gaza ceasefire live: Trump’s envoys arrive in Israel amid scramble to shore up fragile truce – Middle East crisis live",
    "url": "https://www.theguardian.com/world/live/2025/oct/20/gaza-ceasefire-israel-hamas-palestine-hostages-middle-east-crisis-live-news-updates",
    "image": "https://media.guim.co.uk/4d421cd7593d209915c3d8bfb3af4dffd31e91bc/602_0_4560_3648/500.jpg",
    "summary": "US envoy Steve Witkoff and Trump's son-in-law Jared Kushner are currently in Israel, while Vice President JD Vance is scheduled to arrive tomorrow. Their visit highlights ongoing diplomatic efforts and engagement in the region. The details of their discussions have not been disclosed.",
    "published": "2025-10-20T13:21:00Z"
  },
  {
    "title": "‘Signs of recovery’ claims Amazon Web Services after internet outage hits many websites and apps – business live",
    "url": "https://www.theguardian.com/business/live/2025/oct/20/china-economic-growth-gdp-low-house-prices-fall-stock-markets-ftse-business-live-news",
    "image": "https://media.guim.co.uk/c243af906d58094cf7e7337e109f67c64d00da26/492_0_4240_3393/500.jpg",
    "summary": "Fortnite, Roblox, SnapChat, Lloyds Bank, and Ring doorbells experienced disruptions due to an online outage. The outage affected users' ability to access and utilize these popular services. Details regarding the cause of the outage have not been fully disclosed.",
    "published": "2025-10-20T13:18:21Z"
  },
  {
    "title": "Son of former England footballer Stuart Pearce dies in tractor crash in Cotswolds",
    "url": "https://www.theguardian.com/uk-news/2025/oct/20/son-of-former-england-footballer-stuart-pearce-harley-pearce-dies-in-tractor-crash-in-cotswolds",
    "image": "https://media.guim.co.uk/ca0660de2bd78bbc4cec42c5b6aa80e8049fcfeb/1_0_1816_1452/500.jpg",
    "summary": "Harley Pearce, a 21-year-old farmer, tragically died at the scene of an accident in Witcombe. He was remembered as a cherished son and devoted brother. The community mourns the loss of a young life full of promise.",
    "published": "2025-10-20T13:13:33Z"
  }
]