[
  {
    "title": "Australia politics live: Speaker ejects Nationals MP from question time after Ed Husic booted for shouted reference to Mamdani",
    "url": "https://www.theguardian.com/australia-news/live/2025/nov/06/australia-politics-live-wfh-working-from-home-banks-net-zero-nationals-liberals-coalition-sussan-ley-anthony-albanese-labor-question-time-ntwnfb",
    "image": "https://media.guim.co.uk/c7bb0e9904923628a81ea7884135f58bdb190e78/535_0_4217_3374/500.jpg",
    "summary": "Could you please provide the content or details of the news you would like summarized?",
    "published": "2025-11-06T04:23:28Z"
  },
  {
    "title": "Should Newcastle to Sydney bullet train really be first link built of Melbourne to Brisbane route?",
    "url": "https://www.theguardian.com/australia-news/2025/nov/06/should-newcastle-to-sydney-bullet-train-really-be-first-link-built-of-melbourne-to-brisbane-route",
    "image": "https://media.guim.co.uk/9942ab21d2bdc658ba98b9f37e392178fa233191/1249_69_3550_2840/500.jpg",
    "summary": "Infrastructure Australia is seeking clarification on why the New South Wales segment of the high-speed rail project should be prioritized over sections in Victoria, the Australian Capital Territory, and Queensland. The inquiry reflects ongoing discussions about the allocation of resources and planning for the rail initiative. Stakeholders are encouraged to provide input on the project’s regional impacts and benefits.",
    "published": "2025-11-06T03:52:17Z"
  },
  {
    "title": "US to cut airline traffic by 10% due to shutdown, Trump transport chief says",
    "url": "https://www.theguardian.com/us-news/2025/nov/05/government-shutdown-duffy-airspace-closures",
    "image": "https://media.guim.co.uk/9f0085b20564bf3f79ca0f38bf2c5fcb2f4899f6/436_0_2554_2043/500.jpg",
    "summary": "Sean Duffy announced that cuts at 40 air traffic control locations will begin Friday if a resolution is not reached to alleviate stress on controllers. The measures aim to address ongoing concerns about controller workload and safety. Urgent discussions are underway to find alternatives before the cuts take effect.",
    "published": "2025-11-06T02:32:08Z"
  },
  {
    "title": "Ukraine war briefing: Bulgaria moves to seize Russian refinery while Poland seeks to be US gas conduit",
    "url": "https://www.theguardian.com/world/2025/nov/06/ukraine-war-briefing-bulgaria-moves-to-seize-russian-refinery-while-poland-seeks-to-be-us-gas-conduit",
    "image": "https://media.guim.co.uk/f3e9d27f7dbf9783aa0aa157b3236f33bab08374/760_0_4750_3802/500.jpg",
    "summary": "Lukoil's Burgas plant is Bulgaria's sole refinery, underscoring the country's reliance on this facility. Meanwhile, Slovakia is increasingly finding alternatives to Russian gas as a deal for US imports develops. This situation continues to evolve as the energy landscape changes.",
    "published": "2025-11-06T02:19:22Z"
  },
  {
    "title": "Prosecutors asked if manslaughter charge will be considered if Greg Lynn overturns high country murder conviction",
    "url": "https://www.theguardian.com/australia-news/2025/nov/06/will-manslaughter-charge-be-considered-if-greg-lynn-overturns-high-country-conviction-ntwnfb",
    "image": "https://media.guim.co.uk/4c65128647bbb782fa1ec34802a2a3e1709513a7/529_1_1733_1387/500.jpg",
    "summary": "Appeal judges are seeking guidance on whether the motive of a former Jetstar pilot should be considered during a potential retrial for the death of Carol Clay. This inquiry may impact the legal proceedings surrounding the case. The decision could have significant implications for the prosecution's strategy.",
    "published": "2025-11-06T02:04:19Z"
  }
]