[
  {
    "title": "Israeli minister says ‘last opportunity’ for Gaza City residents to flee – Middle East crisis live",
    "url": "https://www.theguardian.com/world/live/2025/oct/01/israel-gaza-offensive-benjamin-netanyahu-hamas-donald-trump-middle-east-crisis-live-news",
    "image": "https://media.guim.co.uk/5c74d93af9a3b45d92f3212627f646a7721700d4/325_0_4914_3933/500.jpg",
    "summary": "Israeli military operations are escalating in response to ongoing tensions in Gaza. Reports indicate that Hamas is looking to revise Trump's proposed plan for Gaza. The situation remains fluid, with potential implications for regional stability.",
    "published": "2025-10-01T14:19:07Z"
  },
  {
    "title": "Women’s Cricket World Cup: Australia v New Zealand – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/01/womens-cricket-world-cup-live-australia-v-new-zealand",
    "image": "https://media.guim.co.uk/f09646df7b62f59fb7c410977b3e389941e49d84/198_110_3829_3063/500.jpg",
    "summary": "Australia begins their title defense in the 50-over format at Holkar Stadium in Indore. James Wallace will provide live updates on the match. Fans can follow along for all the action as the tournament kicks off.",
    "published": "2025-10-01T14:18:08Z"
  },
  {
    "title": "France investigates oil tanker suspected of being part of Russia’s shadow fleet",
    "url": "https://www.theguardian.com/world/2025/oct/01/france-oil-tanker-russia-drone-denmark",
    "image": "https://media.guim.co.uk/76cba43f95bd227d33ef2282f2695c30282b1cb8/1088_0_5738_4590/500.jpg",
    "summary": "A French naval vessel intercepted a tanker suspected of being one of four ships connected to recent airport closures in Denmark. The incident raises concerns over potential disruptions and security issues. Authorities are investigating the tanker’s links to the closures.",
    "published": "2025-10-01T14:17:37Z"
  },
  {
    "title": "David Beckham earned $23.6m in dividends from business empire last year",
    "url": "https://www.theguardian.com/football/2025/oct/01/david-beckham-earned-236m-in-dividends-from-business-empire-last-year",
    "image": "https://media.guim.co.uk/3dcf89072f3a159872793fb094c2bce30e96ad1e/462_879_3536_2829/500.jpg",
    "summary": "DRJB Holdings reported a 44% increase in pre-tax profit, boosted by new brand partnerships with Stella Artois and SharkNinja. The company’s growth reflects successful expansion in its brand portfolio. This positive financial performance highlights the effectiveness of its marketing strategies.",
    "published": "2025-10-01T14:16:38Z"
  },
  {
    "title": "Hunter S Thompson’s death to be reviewed more than 20 years later",
    "url": "https://www.theguardian.com/books/2025/oct/01/hunter-s-thompsons-death-reviewed",
    "image": "https://media.guim.co.uk/2f1d6d0fb50f311247d23604fbdae5f95dfbd279/0_1_2096_1676/500.jpg",
    "summary": "The wife of a journalist and author, whose death was ruled a suicide in 2005, has requested the Colorado FBI to conduct a \"fresh look\" into the case. She seeks further investigation to reassess the circumstances surrounding his death. This appeal comes after lingering questions and doubts about the initial ruling.",
    "published": "2025-10-01T14:13:49Z"
  }
]