[
  {
    "title": "Australia news live: Julie Bishop says she intends to stay on as ANU after vice-chancellor quits",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/11/australia-news-live-sydney-storm-weather-anthony-albanese-solomon-islands-pacific-sussan-ley-jacinta-nampijinpa-price-ntwnfb",
    "image": "https://media.guim.co.uk/91b127b57800851f551cb5b363e4a9d489c73d74/0_423_2877_2301/500.jpg",
    "summary": "I'm sorry, but I need more context or information about the specific news you'd like me to summarize. Please provide details or a brief description of the news article.",
    "published": "2025-09-11T04:38:43Z"
  },
  {
    "title": "Country diary: A bumper harvest awaits the autumn visitors | Sean Wood",
    "url": "https://www.theguardian.com/environment/2025/sep/11/country-diary-a-bumper-harvest-awaits-the-autumn-visitors",
    "image": "https://media.guim.co.uk/bb3bab3b05f472111b0cd95c586edecce94e60f6/0_0_1920_1536/500.jpg",
    "summary": "In Kirkcudbright, Dumfries and Galloway, trees such as hawthorns, rowans, and rose hips are heavily laden with fruit. This abundance is particularly appealing to migratory birds like redwings and fieldfares. The area's rich harvest offers a bountiful food source for these species.",
    "published": "2025-09-11T04:30:22Z"
  },
  {
    "title": "Charlie Kirk shooting: Trump blames ‘radical left’, but does not mention attacks on Democrats as search for suspect continues – follow live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/10/donald-trump-jeffrey-epstein-tariffs-immigration-crime-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/2673fb19ee0d09b38b7c9c4de993bd283a9eb6e7/313_215_3046_2437/500.jpg",
    "summary": "In a recent Oval Office address, Trump promised retribution without addressing the murder of Melissa Hortman, the attack on Paul Pelosi, or threats against Mike Pence. His speech focused on other issues, omitting these significant violent incidents. Critics have pointed out the lack of acknowledgment for such attacks amidst his rhetoric.",
    "published": "2025-09-11T04:13:27Z"
  },
  {
    "title": "Sydney Water failed to properly test before declaring ‘no known Pfas hotspots’ in catchments, inquiry finds",
    "url": "https://www.theguardian.com/environment/2025/sep/11/sydney-water-erred-when-claiming-there-were-no-known-pfas-hotspots-in-drinking-water-catchments-committee-finds",
    "image": "https://media.guim.co.uk/1e5afc6b9db428edfdf5660328b6c51d9f8f6a72/0_0_2254_1803/500.jpg",
    "summary": "A committee chair is urging increased focus on the urgent problem of waterway contamination by \"forever chemicals.\" These persistent pollutants pose significant risks to environmental and public health. The call for action highlights the need for immediate measures to address this evolving issue.",
    "published": "2025-09-11T04:07:19Z"
  },
  {
    "title": "Politicians in at least 51 countries used anti-LGBTQ+ rhetoric during elections, NGO finds",
    "url": "https://www.theguardian.com/world/2025/sep/11/politicians-in-at-least-51-countries-used-anti-lgbtq-rhetoric-during-elections-ngo-finds",
    "image": "https://media.guim.co.uk/18fa98a30b59e94bf888515da81e64f4f29c323a/318_0_6637_5311/500.jpg",
    "summary": "A rights group reports an increase in openly gay, bisexual, and transgender individuals seeking political office in 36 countries. This trend reflects growing acceptance and representation for LGBTQ+ communities globally. The finding underscores significant progress in human rights and political diversity.",
    "published": "2025-09-11T04:01:22Z"
  }
]