[
  {
    "title": "Strictly Come Dancing: week seven  results – live",
    "url": "https://www.theguardian.com/tv-and-radio/live/2025/nov/08/strictly-come-dancing-week-seven-live",
    "image": "https://media.guim.co.uk/cd2c1becfa3120fb43fce3c7638d2201ecf05b37/382_0_3818_3055/500.jpg",
    "summary": "Vicky Pattison's impressive tango secured the highest score, while Balvinder Sopal infused the ballroom with Bollywood charm. La Voix ended up at the bottom of the leaderboard following a disappointing foxtrot. The competition is heating up as the show approaches its midway point, raising questions about who might be eliminated next.",
    "published": "2025-11-09T19:13:23Z"
  },
  {
    "title": "Kingdom review – David Attenborough never fails to make nature awe-inspiring",
    "url": "https://www.theguardian.com/tv-and-radio/2025/nov/09/kingdom-review-david-attenborough-bbc-one-iplayer-natural-history-unit",
    "image": "https://media.guim.co.uk/a3f17e9165de93906e3d889df058cb56960830bb/386_0_3571_2857/500.jpg",
    "summary": "David Attenborough's latest documentary features intense wildlife drama reminiscent of \"Game of Thrones,\" with hyenas taking center stage. However, its airing was delayed due to a scheduling conflict with \"Strictly Come Dancing.\" Fans are disappointed it didn’t garner the prime viewing slot it deserves.",
    "published": "2025-11-09T19:10:39Z"
  },
  {
    "title": "Premier League top scorers 2025-26: who is leading race for golden boot?",
    "url": "https://www.theguardian.com/football/2025/sep/15/premier-league-top-scorers-2025-26-who-is-leading-race-for-golden-boot",
    "image": "https://media.guim.co.uk/7467a90a5a415f45959903d6d1b0c6942de5a2ce/1263_152_3876_3100/500.jpg",
    "summary": "The latest update highlights the top goal scorers in the English Premier League for the current season. Key players are showcasing impressive performances, vying for the coveted position at the top of the scoring charts. Fans can track the ongoing competition among these talented athletes as the season progresses.",
    "published": "2025-11-09T19:10:24Z"
  },
  {
    "title": "NFL week 10: Bucs v Patriots, Vikings v Ravens, Colts edge Falcons in Berlin and more – live",
    "url": "https://www.theguardian.com/sport/live/2025/nov/09/nfl-week-10-live-vikings-ravens-jets-browns-dolphins-bills-live",
    "image": "https://media.guim.co.uk/d06916770b69eecbe97501962643046d09d15d7b/407_0_5208_4167/500.jpg",
    "summary": "Seven NFL games are set to start at 6pm UK time following the Indianapolis Colts' thrilling overtime victory over the Atlanta Falcons. Jonathan Taylor scored the decisive touchdown, securing the win for the Colts. Fans can look forward to an exciting lineup of games this evening.",
    "published": "2025-11-09T19:09:18Z"
  },
  {
    "title": "Manchester City 3-0 Liverpool: Premier League – as it happened",
    "url": "https://www.theguardian.com/football/live/2025/nov/09/manchester-city-v-liverpool-premier-league-live",
    "image": "https://media.guim.co.uk/5778bef50966e15a3752957ba0d29bcf9aae5a3c/720_117_3255_2604/500.jpg",
    "summary": "Jérémy Doku delivered a standout performance, leading Manchester City to a convincing win. This match marked Pep Guardiola's milestone 1,000th game as a manager. The victory showcased Doku's impact on the team's success.",
    "published": "2025-11-09T19:08:47Z"
  }
]