[
  {
    "title": "New business secretary Peter Kyle going to China for trade talks this week",
    "url": "https://www.theguardian.com/politics/2025/sep/07/uk-business-secretary-peter-kyle-visit-beijing",
    "image": "https://media.guim.co.uk/81140f5364b5a23ff475ca76f779963d0ec11ac0/183_0_4455_3565/500.jpg",
    "summary": "In a recent government reshuffle, the former science secretary has been promoted, highlighting the UK's commitment to enhancing its trade relationship with Beijing. This move aims to strengthen economic ties and increase collaboration between the two nations. The promotion reflects the UK’s strategic focus on international trade amidst evolving global dynamics.",
    "published": "2025-09-07T18:38:07Z"
  },
  {
    "title": "US Open tennis 2025: Jannik Sinner v Carlos Alcaraz, men’s singles final – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/07/us-open-tennis-2025-jannik-sinner-v-carlos-alcaraz-mens-singles-final-live",
    "image": "https://media.guim.co.uk/26d1e6a182f2a444933ab98195b816468d8ef1ca/1685_1095_4960_3968/500.jpg",
    "summary": "Daniel Harris provides ongoing updates from the men’s singles final at Flushing Meadows. The report captures key moments and highlights of the match. Stay tuned for real-time insights and developments as the event unfolds.",
    "published": "2025-09-07T18:37:05Z"
  },
  {
    "title": "France 57-10 South Africa: Women’s Rugby World Cup – as it happened",
    "url": "https://www.theguardian.com/sport/live/2025/sep/07/france-v-south-africa-womens-rugby-world-cup-live",
    "image": "https://media.guim.co.uk/e1dee9b686a17221f6f3cec97ad7ed19c78d564c/455_0_4542_3634/500.jpg",
    "summary": "France dominated South Africa with a score of nine tries, showcasing their strength in the match. Despite the loss, South Africa also secured a spot in the quarter-finals. Both teams are poised to advance in the tournament.",
    "published": "2025-09-07T18:18:00Z"
  },
  {
    "title": "Pressure from Australia ‘exactly what England wanted’, says Natasha Hunt",
    "url": "https://www.theguardian.com/sport/2025/sep/07/australia-england-pressure-natasha-hunt-womens-rugby-world-cup",
    "image": "https://media.guim.co.uk/f87ba170b65f5e91c9ea1fc687413467c16f8bfb/804_0_3643_2915/500.jpg",
    "summary": "England scum-half Natasha Hunt expressed that the pressure of their final pool match against Australia was exactly what the team desired. She believes such challenges help the team perform at their best. The match is seen as an opportunity to showcase their skills and resilience.",
    "published": "2025-09-07T18:01:03Z"
  },
  {
    "title": "Tuchel prepares to change tactics in pursuit of England World Cup glory",
    "url": "https://www.theguardian.com/football/2025/sep/07/thomas-tuchel-tactics-england-2026-world-cup-qualifiers-serbia-andorra",
    "image": "https://media.guim.co.uk/839859e33467a30a4b1d5c8877b607550770d745/375_0_2881_2305/500.jpg",
    "summary": "The head coach is contemplating incorporating more long throws and high balls into their strategy. This decision follows a successful 2-0 World Cup qualifying victory against Andorra. The change aims to enhance their gameplay based on recent performance.",
    "published": "2025-09-07T18:00:27Z"
  }
]