[
  {
    "title": "US Open tennis 2025: Pegula v Azarenka, Shelton and Paolini in action, Alcaraz flies through – live",
    "url": "https://www.theguardian.com/sport/live/2025/aug/29/us-open-tennis-2025-emma-raducanu-carlos-alcaraz-shelton-paolini-day-six-live",
    "image": "https://media.guim.co.uk/20dde2b9bb93692f33b13cfc40636600d3c61998/416_0_4174_3339/500.jpg",
    "summary": "Katy Murrells is providing live updates from the third round of an event in New York. Follow along for the latest information and developments. Stay tuned for ongoing coverage of the action.",
    "published": "2025-08-29T18:44:18Z"
  },
  {
    "title": "Labour won the legal battle over asylum hotels, but the right is running the story",
    "url": "https://www.theguardian.com/uk-news/2025/aug/29/labour-won-the-legal-battle-over-asylum-hotels-but-the-right-is-running-the-story",
    "image": "https://media.guim.co.uk/c228196fe65879f31418788b87ad7ac829b4bf0f/500_0_5000_4000/500.jpg",
    "summary": "A recent ruling has provided the government with additional time to strategize closures, yet it has intensified grievances from Nigel Farage and the Conservative Party. This development has sparked further criticism and debate regarding government actions. The situation presents both an opportunity for planning and a challenge in managing dissent.",
    "published": "2025-08-29T18:38:17Z"
  },
  {
    "title": "Leicester v Birmingham: Championship – live",
    "url": "https://www.theguardian.com/football/live/2025/aug/29/leicester-v-birmingham-championship-live",
    "image": "https://media.guim.co.uk/96b4a0fa6f640f0fffe4e20bca0095949190e6bc/559_0_5000_4000/500.jpg",
    "summary": "John Brewin provides a live minute-by-minute report from the King Power Stadium, covering a significant Championship match tonight. Stay tuned for timely updates and key moments from the game. Fans can follow along for comprehensive insights and developments.",
    "published": "2025-08-29T18:35:05Z"
  },
  {
    "title": "Trump accused of using mortgage fraud allegations as ‘weapon of choice’ to attack Fed",
    "url": "https://www.theguardian.com/business/2025/aug/29/trump-administration-lisa-cook-federal-reserve",
    "image": "https://media.guim.co.uk/1a6b55ebdf051365a7b90ce84cd99fe42ec96f84/118_0_2999_2400/500.jpg",
    "summary": "During a hearing regarding the lawsuit filed by a Federal Reserve governor over his firing, an attorney argued that the president resorts to \"litigation by tweet.\" This statement highlights concerns over the impact of the president's public statements on legal proceedings. The case underscores tensions between the executive branch and the independence of the Federal Reserve.",
    "published": "2025-08-29T18:34:48Z"
  },
  {
    "title": "Epping council leader calls for calm after judges rule on asylum seeker hotel – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/aug/29/latest-live-uk-politics-news-updates-asylum-hotels-labour-conservatives-reform",
    "image": "https://media.guim.co.uk/69db6f531143c0c52f448704b7123eb50758b45e/396_137_3832_3066/500.jpg",
    "summary": "The Home Office and the owner of the Bell Hotel have contested an injunction issued by the council aimed at preventing the accommodation of numerous asylum seekers at the hotel. The council sought to halt the housing arrangement due to concerns over community impact. The legal challenge highlights ongoing tensions surrounding asylum seeker placements in local facilities.",
    "published": "2025-08-29T18:32:55Z"
  }
]