[
  {
    "title": " Extracting hangovers from beer: inside Budweiser owner’s ‘nolo’ brewery in south Wales",
    "url": "https://www.theguardian.com/business/2025/dec/08/extracting-hangovers-from-beer-inside-the-worlds-biggest-nolo-brewery-in-south-wales",
    "image": "https://media.guim.co.uk/f6b17a8356cf289ed79370132b2c8f7115f33d6e/180_0_2833_2266/500.jpg",
    "summary": "AB InBev has opened a new 'de-alcoholisation' annex at its Magor site in response to the growing demand for low- and no-alcohol beers. This initiative reflects a significant shift in consumer preferences towards healthier drinking options. The company aims to enhance its production capabilities for these beverages, which have seen a rise in popularity.",
    "published": "2025-12-08T08:27:59Z"
  },
  {
    "title": "China’s trade surplus hits $1tn for first time despite Trump’s tariffs – business live",
    "url": "https://www.theguardian.com/business/live/2025/dec/08/china-trade-surplus-trump-tariffs-stock-market-ftse-pound-business-live-latest-news",
    "image": "https://media.guim.co.uk/a8a8e884064b63796db597744e3dfe86e6aa72a1/166_0_2880_2304/500.jpg",
    "summary": "In November, China's exports exceeded expectations, largely fueled by a significant increase in shipments to markets outside the United States. This surge in trade indicates resilient demand for Chinese goods globally. Analysts view this as a positive sign for China's economy amid ongoing tensions with the US.",
    "published": "2025-12-08T08:21:57Z"
  },
  {
    "title": "Farage urged to ‘come clean’ over alleged election spending breaches in Clacton",
    "url": "https://www.theguardian.com/politics/2025/dec/08/nigel-farage-reform-uk-election-spending-clacton-expenses",
    "image": "https://media.guim.co.uk/a1e96f4d7cd45d3017902f41a7089c3acad0aabd/480_0_4803_3842/500.jpg",
    "summary": "A former councillor has accused a reform campaign of incorrectly reporting expenses related to Nigel Farage's recent run for MP. The allegations suggest that financial disclosures made during the campaign were misleading. This controversy raises questions about campaign finance and transparency.",
    "published": "2025-12-08T08:10:06Z"
  },
  {
    "title": "Israeli surveillance targets US and allies at joint base planning Gaza aid and security, say sources",
    "url": "https://www.theguardian.com/world/2025/dec/08/israel-mass-surveillance-us-base-planning-gaza-future",
    "image": "https://media.guim.co.uk/a8661d1b5c2c62b1c2d023187d78c6ac0ee9bddd/567_0_3750_3000/500.jpg",
    "summary": "Concerns have arisen regarding meetings at a coordination center designed to support Trump’s Gaza plan, which reportedly excluded Palestinian representatives. Critics are worried about the transparency and inclusivity of the discussions taking place. This exclusion has prompted fears of a lack of genuine support for Palestinian interests in the negotiations.",
    "published": "2025-12-08T08:00:47Z"
  },
  {
    "title": "Premier League: 10 talking points from the weekend’s football",
    "url": "https://www.theguardian.com/football/2025/dec/08/premier-league-10-talking-points-from-the-weekends-football",
    "image": "https://media.guim.co.uk/72c1a857bd738caa1e9477e48aff91f4dc6a6a98/0_0_5000_4000/500.jpg",
    "summary": "Arsenal is impacted by defensive injuries, affecting their performance. Liverpool faces criticism due to Ibrahima Konaté's errors in defense. Meanwhile, Brentford continues to struggle in away matches, hindering their progress.",
    "published": "2025-12-08T08:00:47Z"
  }
]