[
  {
    "title": "Donald Trump to chair meeting on Gaza as US says it expects ‘to settle this before the end of this year’ – Middle East crisis live",
    "url": "https://www.theguardian.com/world/live/2025/aug/27/donald-trump-meeting-white-house-gaza-israel-middle-east-crisis-latest-updates-news",
    "image": "https://media.guim.co.uk/14257060759189e256012480593eb6627e45dde5/574_0_5600_4480/500.jpg",
    "summary": "US special envoy Steve Witkoff expressed confidence in reaching a resolution soon. Meanwhile, Senator Marco Rubio plans to meet with Gideon Saar. The discussions indicate ongoing diplomatic efforts to address key issues.",
    "published": "2025-08-27T09:35:35Z"
  },
  {
    "title": "Tory chair says party would consider deal with Taliban to return Afghan migrants – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/aug/27/conservatives-consider-deal-afghanistan-migrants-uk-politics-latest-updates-news",
    "image": "https://media.guim.co.uk/3ad4c223194faed8b0d96489fb7df90509d30478/0_29_1741_1394/500.jpg",
    "summary": "Kevin Hollinrake stated that the party might establish a returns agreement with a country, emphasizing that their deportation plan is \"far more comprehensive\" than that of the Reform party. His remarks suggest a focus on enhancing immigration policies. The proposal indicates a strategic approach to managing deportations effectively.",
    "published": "2025-08-27T09:32:36Z"
  },
  {
    "title": "Annual energy bills set to rise £35 in October, Trump slaps 50% tariff on India – business live",
    "url": "https://www.theguardian.com/business/live/2025/aug/27/energy-price-cap-rise-trump-tariff-india-business-live-news",
    "image": "https://media.guim.co.uk/6658a30250556fbd333d6b0a9a28fd2689e034ce/704_0_2796_2238/500.jpg",
    "summary": "This report provides ongoing updates on significant developments in the economic and financial sectors. It highlights trends, market movements, and noteworthy events impacting the global economy. Analysts and experts offer insights into potential implications for businesses and investors.",
    "published": "2025-08-27T09:31:38Z"
  },
  {
    "title": "Denmark summons US charge d’affaires over alleged attempts to interfere with Greenland’s status – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/aug/27/volodymyr-zelenskyy-substantive-talks-eu-us-security-guarantees-ukraine-europe-latest-updates-news",
    "image": "https://media.guim.co.uk/bf28ad6adfac60e4a982aa9dd07dba4d7df6509c/567_0_3333_2666/500.jpg",
    "summary": "Danish Foreign Minister Lars Løkke Rasmussen declared that any interference in Denmark's internal affairs is unacceptable. This statement underscores the country's commitment to sovereignty and self-governance. Rasmussen's comments come amid rising concerns over external pressures on domestic policies.",
    "published": "2025-08-27T09:26:32Z"
  },
  {
    "title": "JD Sports sales slump in UK as fragile consumer confidence concerns retailers",
    "url": "https://www.theguardian.com/business/2025/aug/27/jd-sports-sales-slump-in-uk-as-fragile-consumer-confidence-concerns-retailers",
    "image": "https://media.guim.co.uk/ebccd1808f2fa972318ef72f1031812af122eedc/565_0_5073_4059/500.jpg",
    "summary": "A leisurewear company has reduced online prices in response to challenging market comparisons. The firm expresses caution regarding the current trading environment. This decision reflects their efforts to navigate a competitive landscape.",
    "published": "2025-08-27T09:26:08Z"
  }
]