[
  {
    "title": "Tories claim they could save £47bn by slashing welfare, overseas aid and civil service – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/oct/06/conservative-tory-party-conference-spending-welfare-immigration-labour-starmer-reform-uk-politics-live-news-updates",
    "image": "https://media.guim.co.uk/9add19123acfc62b1b4f9ed143473300bf9cd54c/1153_374_3351_2681/500.jpg",
    "summary": "Shadow Chancellor Mel Stride has unveiled a series of cost-cutting measures during the Tory party conference in Manchester. The proposals aim to address economic challenges and reduce government spending. The plans come amid ongoing discussions about financial stability and fiscal responsibility within the party.",
    "published": "2025-10-06T07:16:05Z"
  },
  {
    "title": "Jets, Ravens … Eagles? Which team is most miserable after five weeks of the NFL season?",
    "url": "https://www.theguardian.com/sport/2025/oct/06/nfl-weeks-five-jets-eagles-ravens",
    "image": "https://media.guim.co.uk/f2cf1c2c3d5fae51bdf2910e0786491ec68b7ea5/287_0_2868_2294/500.jpg",
    "summary": "As the season progresses, teams' strengths and weaknesses have become evident. Fans are particularly disappointed with one team's performance. The analysis explores which team is failing to meet expectations.",
    "published": "2025-10-06T07:15:03Z"
  },
  {
    "title": "Yen slumps and Nikkei hits record after Sanae Takaichi wins Japan’s ruling party election; gold nears $4,000 as rally continues – business live",
    "url": "https://www.theguardian.com/business/live/2025/oct/06/yen-slumps-nikkei-record-sanae-takaichi-wins-election-gold-nears-4000-rally-continues-business-live-news",
    "image": "https://media.guim.co.uk/33eb7bf82fab3ed36343f70ed9c029be56150666/463_0_3980_3184/500.jpg",
    "summary": "This news provides ongoing updates on key developments in the economy and financial markets. It covers trends, forecasts, and significant events influencing economic conditions. The coverage aims to keep readers informed about important financial news as it unfolds.",
    "published": "2025-10-06T07:11:36Z"
  },
  {
    "title": "‘Am I a bad person because you can see my nipples?’ Elouise Eftos on making standup sexy",
    "url": "https://www.theguardian.com/stage/2025/oct/06/elouise-eftos-sexy-standup-australias-first-attractive-comedian",
    "image": "https://media.guim.co.uk/4fef0040e56c87a65d477ed7959494ecd35d3bb1/0_619_1365_1091/500.jpg",
    "summary": "A former cabaret star is causing controversy among fellow comedians by labeling herself as \"Australia's first attractive comedian.\" She embraces her sex appeal on stage, which has led to criticism and frustration from other stand-up performers. This bold self-promotion is challenging the norms of self-deprecation in the comedy scene.",
    "published": "2025-10-06T07:00:57Z"
  },
  {
    "title": "Is it true that … you get shorter as you get older?",
    "url": "https://www.theguardian.com/lifeandstyle/2025/oct/06/is-it-true-that-you-get-shorter-as-you-get-older",
    "image": "https://media.guim.co.uk/f1876e886215a8ec760f3ff76864cc2870c81496/354_0_2126_1701/500.jpg",
    "summary": "Some height loss is natural with age, but maintaining a healthy lifestyle through diet and exercise can slow the decline in bone and muscle mass. Engaging in regular physical activity and proper nutrition is key to mitigating age-related changes. Adopting these healthy habits can enhance overall wellbeing as one ages.",
    "published": "2025-10-06T07:00:03Z"
  }
]