[
  {
    "title": "TV tonight: what happened to Jay Slater? His parents search for answers",
    "url": "https://www.theguardian.com/tv-and-radio/2025/sep/28/tv-tonight-what-happened-to-jay-slater-his-parents-search-for-answers",
    "image": "https://media.guim.co.uk/559c451299bb3531eb5586382291cb115091bc95/257_0_1350_1080/500.jpg",
    "summary": "A teenager's disappearance and subsequent death sparked worldwide conspiracy theories last year. Additionally, Eva Longoria has launched an engaging travel series. Tonight's viewing options include both of these captivating stories.",
    "published": "2025-09-28T05:15:02Z"
  },
  {
    "title": "Australia news live: Lions coach hails AFL grand final win as ‘better than last year’; Greens call for date to end old growth logging",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/28/australia-news-live-albanese-king-charles-afl-brisbane-coalition-liberals-western-australia-gst-queensland-nsw-victoria-labor-ntwnfb",
    "image": "https://media.guim.co.uk/04db23bfc529decea7d380d18b5fb8262ee0d709/756_0_6608_5286/500.jpg",
    "summary": "For live updates on today's news, tune in to our ongoing coverage that brings you the latest events and developments as they unfold. Stay informed with real-time reporting across various topics. Check back frequently for updates and breaking stories.",
    "published": "2025-09-28T05:03:21Z"
  },
  {
    "title": "‘You have to live’: Ukrainians on frontline practice normality despite Russian bombings",
    "url": "https://www.theguardian.com/news/ng-interactive/2025/sep/28/you-have-to-live-ukrainians-on-frontline-practice-normality-despite-russian-bombings",
    "image": "https://media.guim.co.uk/521275a0d011ebbb8f89415cca298e2f42002620/804_0_5600_4480/500.jpg",
    "summary": "In Sloviansk, a city once occupied during the conflict, air-raid sirens have become a mundane part of daily life, with citizens largely indifferent to their warnings. The ongoing war has normalized the presence of danger, leading to a desensitization among residents. This reflects the broader impact of prolonged conflict on communities and their coping mechanisms.",
    "published": "2025-09-28T05:00:04Z"
  },
  {
    "title": "As my daughter got sicker and sicker, our quest for answers dragged on. How did we all miss the bacteria taking over her body?",
    "url": "https://www.theguardian.com/world/2025/sep/28/as-my-daughter-got-sicker-and-sicker-our-quest-for-answers-dragged-on-how-did-we-all-miss-the-bacteria-taking-over-her-body",
    "image": "https://media.guim.co.uk/693a99e95e5f275a7eb47453d064916c8dee2248/0_1971_5504_4403/500.jpg",
    "summary": "The author, who typically writes about nature, reflects on the unexpected illness of their dog, Milly. They realize that a previously overlooked tick bite might be the cause of her mysterious condition. This revelation highlights the often unrecognized dangers of nature and the impact on pets.",
    "published": "2025-09-28T05:00:03Z"
  },
  {
    "title": "Brasserie Constance, London SW6: ‘A souped-up corporate box with meticulous food’ – restaurant review | Grace Dent on restaurants",
    "url": "https://www.theguardian.com/food/2025/sep/28/brasserie-constance-london-sw6-grace-dent-restaurant-review",
    "image": "https://media.guim.co.uk/330048f6c1e40b7dbbbc610118162d9faf5b1938/0_0_5600_4480/500.jpg",
    "summary": "Brasserie Constance exemplifies Adam Byatt's culinary excellence, featuring high-quality ingredients expertly prepared. However, an unexpected event occurred, hinting at a twist in the dining experience. The details of this surprise remain to be explored.",
    "published": "2025-09-28T05:00:03Z"
  }
]