[
  {
    "title": "Bolsonaro claims after arrest he tampered with ankle tag from ‘curiousity’",
    "url": "https://www.theguardian.com/world/2025/nov/22/far-right-former-president-jair-bolsonaro-arrested-in-brazil",
    "image": "https://media.guim.co.uk/28299cd26cb005726bef0fc856481cef483cd627/124_0_2434_1947/500.jpg",
    "summary": "The ex-president is in custody after claiming he used a soldering iron on a device. Authorities are concerned he might attempt to flee. The situation highlights ongoing legal issues surrounding his actions.",
    "published": "2025-11-22T21:16:16Z"
  },
  {
    "title": "Strictly Come Dancing: Blackpool special – as it happened",
    "url": "https://www.theguardian.com/tv-and-radio/live/2025/nov/22/strictly-come-dancing-blackpool-special-live",
    "image": "https://media.guim.co.uk/d55b9629dc9adc20a5759aac6483440a3e40f6bb/395_0_3953_3162/500.jpg",
    "summary": "Due to La Voix's injury withdrawal, the annual Tower Ballroom event will not feature a dance-off tomorrow. Scores and votes will be carried over to next week, raising anticipation for the upcoming performances. Participants are left wondering who will excel and who will stumble in the seaside competition.",
    "published": "2025-11-22T21:03:41Z"
  },
  {
    "title": "Cop30 live: Deal agreed at Cop after long negotiations",
    "url": "https://www.theguardian.com/environment/live/2025/nov/22/cop30-climate-talks-deal-overtime-live-news",
    "image": "https://media.guim.co.uk/410e6c1216e81f2d331e156e15d1703df652b560/346_0_3449_2761/500.jpg",
    "summary": "After prolonged all-night discussions and worries of a potential collapse, a deal was successfully finalized at Cop30. The agreement marks a significant milestone in negotiations. Participants expressed relief over the resolution reached after intense deliberations.",
    "published": "2025-11-22T20:59:46Z"
  },
  {
    "title": "‘The Amazon insisted on being heard’: seven key takeaways from Cop30",
    "url": "https://www.theguardian.com/environment/2025/nov/22/roadmaps-adaptations-and-transitions-what-climate-measures-were-agreed-at-cop30",
    "image": "https://media.guim.co.uk/037a5a1f3bc501c6f59891bed429b1289c51258b/112_0_2478_1983/500.jpg",
    "summary": "Negotiations nearly failed but resulted in a deal that offers incremental progress in addressing the climate crisis. Although significant breakthroughs were not achieved, the agreement outlines steps aimed at combating environmental challenges. This outcome reflects ongoing efforts to find common ground in the fight against climate change.",
    "published": "2025-11-22T20:33:16Z"
  },
  {
    "title": "Starmer says Andrew should give evidence in US investigation into Jeffrey Epstein",
    "url": "https://www.theguardian.com/uk-news/2025/nov/22/starmer-says-andrew-should-give-evidence-in-us-investigation-into-jeffrey-epstein",
    "image": "https://media.guim.co.uk/ff0841a15191d4d21c4c96b9be4d3e5fdeb86094/329_0_4221_3378/500.jpg",
    "summary": "The Prime Minister has emphasized that anyone with information regarding child sexual offense cases should come forward and disclose what they know. This statement highlights the government's commitment to addressing and combating child abuse. The call for transparency aims to encourage more individuals to report such offenses.",
    "published": "2025-11-22T20:30:48Z"
  }
]