[
  {
    "title": "UK manufacturing downturn continues as new orders slide; Trump’s attack on Fed is ‘a serious danger’ – business live",
    "url": "https://www.theguardian.com/business/live/2025/sep/01/factory-activity-us-tariffs-uk-house-price-drop-mortgage-interest-rates-business-live-news-updates",
    "image": "https://media.guim.co.uk/931d11a23666de0b8a2b0e280544fbe3feee3900/215_0_3366_2692/500.jpg",
    "summary": "Factory orders have declined due to weak market conditions, the impact of US tariffs, and decreased client confidence. These factors have created a challenging environment for manufacturers. Economic uncertainties continue to affect overall demand in the sector.",
    "published": "2025-09-01T13:35:52Z"
  },
  {
    "title": "Transfer deadline day: Isak and Wissa deals agreed; Muani, Sancho, Jackson and more – live",
    "url": "https://www.theguardian.com/football/live/2025/sep/01/transfer-deadline-day-guehi-wissa-martinez-ederson-latest-and-more-live",
    "image": "https://media.guim.co.uk/87e4cc411634a2b99bfd8bff1c161155735d1d62/98_0_4633_3706/500.jpg",
    "summary": "Will Magee is providing a rolling report on the lively deadline day, keeping readers updated on the latest moves and news. Stay tuned for real-time updates and developments throughout the day. Don't miss out on any important highlights!",
    "published": "2025-09-01T13:35:36Z"
  },
  {
    "title": "How can the UK avoid trouble in the gilts market? | Sushil Wadhwani",
    "url": "https://www.theguardian.com/business/2025/sep/01/uk-gilts-market-autumn-budget",
    "image": "https://media.guim.co.uk/24e43cfdc15bb2bf6a406d0bf8bdbcd711350ae4/27_269_3387_2711/500.jpg",
    "summary": "The government is urged to implement bold policies in the upcoming autumn budget. These measures aim to shift the economic narrative while ensuring stability in the financial markets. The focus is on creating impactful changes without causing investor panic.",
    "published": "2025-09-01T13:34:05Z"
  },
  {
    "title": "‘Coalition of the willing’ to meet on Thursday, Élysée confirms – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/sep/01/volodymyr-zelenskyy-ukraine-donald-trump-semi-deadline-war-end-europe-latest-updates-news-live",
    "image": "https://media.guim.co.uk/6f57d86e1fc76dcc5cd4b710aa3d3889da4b0246/1331_0_6656_5325/500.jpg",
    "summary": "A meeting co-chaired by France's Emmanuel Macron and UK's Keir Starmer is set to discuss security guarantees for Ukraine amid ongoing conflict. The agenda will prioritize responses to Russia's refusal to cease hostilities. The discussions aim to strengthen support for Ukraine in the face of continued aggression.",
    "published": "2025-09-01T13:31:22Z"
  },
  {
    "title": "Lowry and Rahm headline Luke Donald’s six wildcard picks for Europe’s Ryder Cup defence",
    "url": "https://www.theguardian.com/sport/2025/sep/01/lowry-rahm-luke-donald-six-wildcard-picks-europe-ryder-cup-defence-united-states",
    "image": "https://media.guim.co.uk/bc70a5520e024a85797d479bfdc6bc87f369713c/446_0_4180_3346/500.jpg",
    "summary": "Luke Donald has chosen to prioritize experience for his six wildcard selections for the Ryder Cup. Remarkably, 11 of the 12 Team Europe players who triumphed in Rome will be returning to defend their title in the US. This strategy indicates a strong commitment to continuity and proven performance.",
    "published": "2025-09-01T13:25:11Z"
  }
]