[
  {
    "title": "Justice department will release Epstein files within 30 days, says US attorney general – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/nov/19/us-congress-epstein-files-donald-trump-saudi-arabia-redistricting-latest-news-updates",
    "image": "https://media.guim.co.uk/ab112c869b28d2d647fc8f754d5adade2334ef7f/484_0_3091_2473/500.jpg",
    "summary": "Pam Bondi addressed the US Senate's passage of a bill aimed at releasing certain files. However, the agency involved may withhold materials that could impact an ongoing investigation ordered by former President Trump. This situation raises concerns about transparency and potential implications for the investigation.",
    "published": "2025-11-19T19:15:58Z"
  },
  {
    "title": "Wolfsburg v Manchester United: Women’s Champions League – live",
    "url": "https://www.theguardian.com/football/live/2025/nov/19/wolfsburg-v-manchester-united-womens-champions-league-live",
    "image": "https://media.guim.co.uk/aaa93cd8ee4f9f9189b14b497ff34e532ba7ed20/311_0_2358_1886/500.jpg",
    "summary": "Manchester United looks to build on their strong start in the Champions League as they face German giants. Taha Hashim provides a minute-by-minute report on the match. Fans are eager to see if United can maintain their momentum against tough competition.",
    "published": "2025-11-19T19:15:27Z"
  },
  {
    "title": "Cop30 live: Brazil aims for early agreement on ‘big four’ issues",
    "url": "https://www.theguardian.com/environment/live/2025/nov/19/cop30-live-brazilian-president-lula-climate-summit-belem-latest-news-updates",
    "image": "https://media.guim.co.uk/35357afced045243f6ac8a856c43cd9dc01e4699/646_0_6455_5164/500.jpg",
    "summary": "Brazilian organizers of the climate summit plan to address the most challenging topics two days ahead of schedule. This unconventional approach is intended to facilitate a more efficient discussion and resolution of key issues. The decision underscores a proactive strategy in tackling climate-related challenges.",
    "published": "2025-11-19T19:13:53Z"
  },
  {
    "title": "The infidelity saga of RFK Jr, Nuzzi and her ex is unspooling in real time: ‘It’s like they’ve opened all their trench coats’",
    "url": "https://www.theguardian.com/media/2025/nov/19/rfk-jr-olivia-nuzzi-ryan-lizza",
    "image": "https://media.guim.co.uk/63502aa30d0163046f6d42811eb8f5a0b6ac1800/0_0_1200_960/500.jpg",
    "summary": "Olivia Nuzzi's memoir release has prompted Ryan Lizza to discuss her purported affairs, sparking controversy. This situation is contributing to harmful stereotypes about journalists. Critics argue it undermines the integrity of the profession by focusing on personal lives instead of work.",
    "published": "2025-11-19T19:00:21Z"
  },
  {
    "title": "Inside the dawn patrols where San Diego teachers track ICE: ‘We have to resist’",
    "url": "https://www.theguardian.com/us-news/2025/nov/19/san-diego-teachers-ice-patrols",
    "image": "https://media.guim.co.uk/7411fe967cd3375b20fc74c11c0df5feba88a0eb/372_0_4081_3264/500.jpg",
    "summary": "As students face increased fear and rising arrests, educators are taking on activist roles. They are monitoring streets, sharing safety alerts, and advocating for the right to feel secure in their environment. This shift underscores the urgent need for a safe educational atmosphere.",
    "published": "2025-11-19T19:00:03Z"
  }
]