[
  {
    "title": "Transfer deadline day: Guéhi move hits snag; Isak, Jackson and Wissa deals agreed – live",
    "url": "https://www.theguardian.com/football/live/2025/sep/01/transfer-deadline-day-guehi-wissa-martinez-ederson-latest-and-more-live",
    "image": "https://media.guim.co.uk/aa4d060273b35ea2fcd3c48387d741cf266a6f87/472_0_2598_2079/500.jpg",
    "summary": "John Brewin will provide live updates on the latest transfers and significant developments as deadline day unfolds, promising an exciting atmosphere. Stay tuned for real-time information on player movements and club activities. Don't miss any crucial news throughout the day!",
    "published": "2025-09-01T17:30:05Z"
  },
  {
    "title": "Luke Donald warns US team: Don’t expect ‘rinse and repeat’ from Europe at Ryder Cup",
    "url": "https://www.theguardian.com/sport/2025/sep/01/lowry-rahm-luke-donald-six-wildcard-picks-europe-ryder-cup-defence-united-states",
    "image": "https://media.guim.co.uk/bc70a5520e024a85797d479bfdc6bc87f369713c/446_0_4180_3346/500.jpg",
    "summary": "Luke Donald selected experienced players for his six wildcard spots for Team Europe, retaining 11 of the 12 members from the winning squad in Rome. This strategy emphasizes continuity and experience for the upcoming Ryder Cup in the US. The team aims to build on their previous success in the tournament.",
    "published": "2025-09-01T17:30:00Z"
  },
  {
    "title": "US Open 2025: Swiatek in action, De Minaur through, and Osaka v Gauff on day nine – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/01/us-open-tennis-2025-swiatek-osaka-gauff-de-minaur-musetti-day-nine-live",
    "image": "https://media.guim.co.uk/09d163a0ebb7b21d1b288a93dcf68a53f905439d/0_578_2973_2377/500.jpg",
    "summary": "Taha Hashim will provide live updates on day nine of the tournament, featuring a match between former champions Naomi Osaka and Coco Gauff. The two tennis stars will compete in the fourth round. Fans can tune in for real-time coverage of this exciting matchup.",
    "published": "2025-09-01T17:27:27Z"
  },
  {
    "title": "Home secretary suspends refugee family reunion applications until new, tighter rules are put in place – as it happened",
    "url": "https://www.theguardian.com/politics/live/2025/sep/01/women-children-home-office-refugee-family-reunions-uk-politics-live-latest-updates-news",
    "image": "https://media.guim.co.uk/3ee18b90e03550120005d83bf16f70a29e34f1f2/214_0_3452_2761/500.jpg",
    "summary": "Yvette Cooper asserts that existing rules, originally intended to assist families separated by war, are now being misapplied. She emphasizes the need to address this misuse. The situation highlights the growing disconnect between the original purpose of the rules and their current implementation.",
    "published": "2025-09-01T17:15:19Z"
  },
  {
    "title": "Woman, 81, among latest people charged over Palestine Action protests",
    "url": "https://www.theguardian.com/uk-news/2025/sep/01/woman-81-among-latest-people-charged-over-palestine-action-protests",
    "image": "https://media.guim.co.uk/e3d7195ddf427e17141e892671a60dd7ac80e3f1/178_0_5000_4000/500.jpg",
    "summary": "Yvonne Hayward and 46 others, including a senior NHS doctor, have been charged under section 13 of the Terrorism Act. The charges relate to activities deemed supportive of terrorism. The case highlights concerns regarding extremist actions within the healthcare sector.",
    "published": "2025-09-01T17:10:37Z"
  }
]