[
  {
    "title": "Melanie Quin obituary",
    "url": "https://www.theguardian.com/science/2025/nov/21/melanie-quin-obituary",
    "image": "https://media.guim.co.uk/68661e5d73031f2c8e0f00c412710f5b06f64c41/0_125_449_359/master/449.jpg",
    "summary": "A prominent science communicator has passed away, leaving a lasting impact on the development of hands-on science centres across the UK. Their efforts significantly contributed to making science accessible and engaging for the public. This legacy will continue to inspire future generations of learners and science enthusiasts.",
    "published": "2025-11-21T20:19:09Z"
  },
  {
    "title": "Zohran Mamdani arrives at White House for first meeting with Trump – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/nov/21/donald-trump-democrats-republicans-zohran-mamdani-us-politics-latest-news-updates",
    "image": "https://media.guim.co.uk/79ea45a51134286414408c4817b21fb4efcf84c5/0_0_3000_2400/500.jpg",
    "summary": "The US House of Representatives passed a resolution condemning socialism, highlighting its negative impacts. The resolution aims to acknowledge and address the historical consequences associated with socialist regimes. This move reflects ongoing debates over economic systems in American political discourse.",
    "published": "2025-11-21T20:17:15Z"
  },
  {
    "title": "Cop30 live: summit president says ‘everybody will lose’ as fears rise that conference will end without a deal",
    "url": "https://www.theguardian.com/world/live/2025/nov/21/cop30-live-fossil-fuel-phaseout-final-text-brazil-belem-latest-news-updates",
    "image": "https://media.guim.co.uk/5cc152a6c307c33163354cf4014fe785febcde3f/237_749_2736_2188/500.jpg",
    "summary": "André Corrêa do Lago has urged for the preservation of the Paris Agreement as negotiations continue on their final scheduled day. Many countries remain far from reaching a consensus on key issues. The plea highlights the urgency of addressing global climate goals amid ongoing discussions.",
    "published": "2025-11-21T20:12:36Z"
  },
  {
    "title": "Chris Robertson obituary",
    "url": "https://www.theguardian.com/education/2025/nov/21/chris-robertson-obituary",
    "image": "https://media.guim.co.uk/71950436be4141075b1822dcb658d3d80c63fc86/409_247_1191_953/500.jpg",
    "summary": "A prominent teacher educator, who was instrumental in leading the Worcester University Institute of Education, has passed away. Colleagues and students remember their impactful contributions and dedication to educational development. The educator's legacy will continue to inspire future generations in the field.",
    "published": "2025-11-21T20:11:29Z"
  },
  {
    "title": "‘He keeps a clear head’: how Slot’s last slump offers blueprint for Liverpool revival",
    "url": "https://www.theguardian.com/football/2025/nov/21/arne-slot-rebuild-slump-feyenoord-can-help-return-liverpool-winning-ways",
    "image": "https://media.guim.co.uk/e9ed9867ec21720a8012b736d789d0b5a313b300/0_0_5000_4000/500.jpg",
    "summary": "The assistant coach at Feyenoord, who faced challenges during a difficult period at the club, observes similarities in the struggles his former boss currently faces at Liverpool. He highlights the parallel issues that need to be addressed at Anfield. This reflection underscores the ongoing difficulties experienced by both teams.",
    "published": "2025-11-21T20:00:18Z"
  }
]