[
  {
    "title": "TV tonight: the heartbreaking story of a forbidden affair during the Troubles ",
    "url": "https://www.theguardian.com/tv-and-radio/2025/nov/09/tv-tonight-the-heartbreaking-story-of-a-forbidden-affair-during-the-troubles",
    "image": "https://media.guim.co.uk/898081c862979361cfc9aaf45d6168aa33661043/1000_0_5000_4000/500.jpg",
    "summary": "In the emotional drama \"Trespasses,\" a Catholic and a Protestant navigate their love amidst religious tensions. Additionally, David Attenborough's new nature series showcases environmental issues with a passionate perspective. Tune in this evening for a compelling mix of romance and impactful storytelling.",
    "published": "2025-11-09T06:15:24Z"
  },
  {
    "title": "Royal College of Psychiatrists faces member backlash over Qatar partnership ",
    "url": "https://www.theguardian.com/society/2025/nov/09/royal-college-of-psychiatrists-faces-member-backlash-over-qatar-partnership",
    "image": "https://media.guim.co.uk/7c53fd1f5df828fb97a9fa5d408b48c0258653fd/95_0_3228_2582/500.jpg",
    "summary": "Over 150 psychiatrists have collectively signed a letter opposing a contract to hold exams in a country known for its significant human rights violations. They express concern about the ethical implications of conducting exams in a location associated with such abuses. The letter calls for reconsideration of the decision in light of these issues.",
    "published": "2025-11-09T06:00:25Z"
  },
  {
    "title": "‘It seemed like quite a do’: why East Grinstead hosts one of Scientology’s glitziest evenings",
    "url": "https://www.theguardian.com/world/2025/nov/09/east-grinstead-hosts-scientology-uk-headquarters-event-tom-cruise",
    "image": "https://media.guim.co.uk/8b20bdec76b12b4350d6b8237006214a7168688b/425_0_5002_4000/500.jpg",
    "summary": "Last week, 7,000 attendees, including celebrity Tom Cruise, flocked to a West Sussex town for a highly divisive event. The gathering sparked mixed reactions among locals. Opinions in the community remain split regarding the event's impact.",
    "published": "2025-11-09T06:00:25Z"
  },
  {
    "title": "Amid squabbles, bombast and competing interests, what can Cop30 achieve? ",
    "url": "https://www.theguardian.com/news/ng-interactive/2025/nov/09/amid-squabbles-bombast-and-competing-interests-what-can-cop30-achieve",
    "image": "https://media.guim.co.uk/4fe92ff84f28d06ee3dcc492cdf93a03eae6556c/0_562_6030_4827/500.jpg",
    "summary": "The climate summit in Brazil faces urgent challenges as delegates aim to address the accelerating global heating crisis. Sharp divisions among nations complicate efforts to reach consensus on effective solutions. Participants are under pressure to collaborate and devise actionable strategies to mitigate climate change impacts.",
    "published": "2025-11-09T06:00:24Z"
  },
  {
    "title": "‘You Britons go to the pub, we go to the swimming pool!’: the European health habits worth adopting",
    "url": "https://www.theguardian.com/lifeandstyle/2025/nov/09/european-health-habits-worth-adopting",
    "image": "https://media.guim.co.uk/f4e2aa9968ea747cfea8b16565156e9d6abdb489/503_0_4130_3304/500.jpg",
    "summary": "Daily swims, power naps, and a regimen of five meals a day are traditional practices that have contributed to the health and well-being of people in countries like Iceland, Ukraine, and France. These habits, passed down through generations, highlight the importance of lifestyle in maintaining good health. They serve as valuable reminders of the benefits of incorporating simple, healthy routines into daily life.",
    "published": "2025-11-09T06:00:24Z"
  }
]