[
  {
    "title": "Democrats ramp up pressure on Mike Johnson to swear in lawmaker who would vote to release Epstein files – live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/08/donald-trump-james-comey-justice-department-national-guard-chicago-antifa-government-shutdown-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/874f9004fa934fecc91ea0c502b2d17a2abc62ec/284_0_3274_2619/500.jpg",
    "summary": "House Democrats allege that Republicans are postponing the swearing-in of an Arizona congresswoman to avoid a vote on certain contentious files. They claim this delay is a strategic move to sidestep potential political challenges. The situation highlights ongoing tensions between the two parties in Congress.",
    "published": "2025-10-08T20:20:53Z"
  },
  {
    "title": "Manchester United v Vålerenga: Women’s Champions League – live",
    "url": "https://www.theguardian.com/football/live/2025/oct/08/manchester-united-v-valerenga-womens-champions-league-live",
    "image": "https://media.guim.co.uk/ad36396319dcb62721e2741eb27f4f6fe4239173/858_106_3168_2536/500.jpg",
    "summary": "This article provides live updates on Manchester United's performance in European competitions, focusing on whether they can replicate their strong form from the domestic league. Sarah Rendell reports on key moments and developments during the match. Fans are eager to see how the team's resilience translates to the international stage.",
    "published": "2025-10-08T20:20:32Z"
  },
  {
    "title": "Australia politics live: Judges to rule on Opera House Palestine protest; capital gains discount claimed by wealthiest",
    "url": "https://www.theguardian.com/australia-news/live/2025/oct/09/australia-politics-live-opera-house-rally-palestine-gaza-parliament-senate-estimates-anthony-albanese-sussan-ley-question-time-ntwnfb",
    "image": "https://media.guim.co.uk/de8087e580e519ce8bf47df9aad2215eae07379d/1273_0_6595_5276/500.jpg",
    "summary": "I'm sorry, but I don't have the capability to follow live updates or access real-time news. If you provide the specific news content you'd like summarized, I'll be happy to help!",
    "published": "2025-10-08T20:20:04Z"
  },
  {
    "title": "Last of 10 inmates who escaped from New Orleans jail captured by police ",
    "url": "https://www.theguardian.com/us-news/2025/oct/08/new-orleans-jailbreak-fugitives",
    "image": "https://media.guim.co.uk/a79d96ce4b1f930bd17482d3e6dfa730a30a645b/0_0_2562_2050/500.jpg",
    "summary": "Authorities apprehended convicted killer Derrick Groves following a standoff at a residence in southwest Atlanta. The situation unfolded as officials worked to locate him. Groves' capture brings to an end a tense search operation.",
    "published": "2025-10-08T20:17:07Z"
  },
  {
    "title": "‘The enemy of Israel’: Australian Gaza flotilla activist vows to return despite ‘terrifying’ detention",
    "url": "https://www.theguardian.com/world/2025/oct/09/the-enemy-of-israel-australian-gaza-flotilla-activist-vows-to-return-despite-terrifying-detention",
    "image": "https://media.guim.co.uk/235a2e53e0e1500a7a9f024a1f8acea1ecf0dc8f/0_306_1536_1229/500.jpg",
    "summary": "Juliet Lamont alleges she suffered physical and verbal abuse from Israeli prison guards during her detention. Despite this, she remains determined to continue her efforts to advocate for breaking the siege on Gaza. Lamont's experiences highlight the ongoing tensions and humanitarian issues in the region.",
    "published": "2025-10-08T20:15:27Z"
  }
]