[
  {
    "title": "World Cup draw buildup, Slot wants ‘top four’ return for Liverpool, and more – football live",
    "url": "https://www.theguardian.com/football/live/2025/dec/05/world-cup-draw-buildup-premier-league-news-and-more-football-live",
    "image": "https://media.guim.co.uk/1940afce9288c1cdea07d24523994b4e98260ff4/523_0_4606_3685/500.jpg",
    "summary": "Writers provide updates on the latest news as England and Scotland prepare for the World Cup. The weekend promises to be busy for both teams; fans eagerly anticipate the outcome. Stay tuned for key developments leading up to the tournament.",
    "published": "2025-12-05T12:42:18Z"
  },
  {
    "title": "Labour announces plans to lift 550,000 children out of poverty – UK politics live ",
    "url": "https://www.theguardian.com/politics/live/2025/dec/05/labour-child-poverty-keir-starmer-nigel-farage-reform",
    "image": "https://media.guim.co.uk/4c98ab731c2fe8f13d41d15c70d6016406710eb5/804_71_4425_3540/500.jpg",
    "summary": "Labour leader Keir Starmer has described the party's child poverty strategy as a \"moral mission.\" The strategy plans to introduce measures aimed at improving childcare and assisting families in transitioning out of temporary housing. Starmer emphasizes tackling child poverty as a priority for the government.",
    "published": "2025-12-05T12:39:10Z"
  },
  {
    "title": "Liverpool are not playing to Alexander Isak’s strengths, Arne Slot admits",
    "url": "https://www.theguardian.com/football/2025/dec/05/liverpool-not-playing-to-alexander-isak-strengths-arne-slot-admits",
    "image": "https://media.guim.co.uk/bec17965da15649df08bd786ab3c82f69596672c/941_486_1005_804/500.jpg",
    "summary": "Arne Slot expressed intentions to enhance Alexander Isak's impact on the field by positioning him in more threatening situations. The focus is on maximizing Isak's potential to contribute offensively. Slot's comments highlight the team's strategy to improve their attacking play.",
    "published": "2025-12-05T12:37:33Z"
  },
  {
    "title": "US airstrike survivors clung to boat wreckage for an hour before second deadly attack, video shows",
    "url": "https://www.theguardian.com/us-news/2025/dec/05/us-airstrike-survivors-clung-to-boat-wreckage-for-an-hour-before-second-deadly-attack-video-shows",
    "image": "https://media.guim.co.uk/1376e52f394a965b6f8649fd4eaf09f50bfc7865/300_0_1502_1201/500.jpg",
    "summary": "US senators were shown footage depicting two unarmed, shirtless men battling to stay afloat before they were fatally shot. The incident raises concerns about the use of force and accountability in such situations. Further investigation into the circumstances surrounding their deaths is anticipated.",
    "published": "2025-12-05T12:37:29Z"
  },
  {
    "title": "Wayward England pace attack fumble their golden chance to strike with new ball | Simon Burnton",
    "url": "https://www.theguardian.com/sport/2025/dec/05/england-pace-attack-fumble-new-ball-ashes-australia-cricket",
    "image": "https://media.guim.co.uk/837acd45942561fcad1c0e689d22452a51b2d280/344_0_2755_2204/500.jpg",
    "summary": "England's bowlers performed excellently in the first innings of the Perth match but struggled during the opening session of day two. Their poor showing allowed Australia to recover and escape a tricky situation. This shift in momentum may impact the outcome of the match.",
    "published": "2025-12-05T12:36:57Z"
  }
]