[
  {
    "title": "Australia news live: Optus CEO to speak to media about network outage; baby dies in horror crash on side of Queensland freeway",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/21/australia-news-live-anthony-albanese-donald-trump-new-york-sunday-ntwnfb",
    "image": "https://media.guim.co.uk/2a5c2347f73c4b19e0c95baad5148b8497b27ab7/768_0_5003_4003/500.jpg",
    "summary": "I currently don't have access to live news updates; please provide specific news content or details for summarization.",
    "published": "2025-09-21T04:26:21Z"
  },
  {
    "title": "I have a dirty TV secret – and there’s a 50/50 chance that you do too | Polly Hudson",
    "url": "https://www.theguardian.com/commentisfree/2025/sep/21/i-have-a-dirty-tv-secret-and-theres-a-5050-chance-that-you-do-too",
    "image": "https://media.guim.co.uk/ef6749a137626736db178696708307ed1bb1b731/282_0_2500_2000/500.jpg",
    "summary": "A study reveals that over half of the UK population exaggerates or downplays their media preferences, often pretending to be interested in documentaries and serious drama. Polly Hudson admits to being among those guilty of this behavior. The trend raises questions about authenticity in media consumption.",
    "published": "2025-09-21T04:00:32Z"
  },
  {
    "title": "The race to find a way to recycle old turbine blades from windfarms",
    "url": "https://www.theguardian.com/business/2025/sep/21/recycle-turbine-blades-windfarms-uk-europe",
    "image": "https://media.guim.co.uk/969b75621a2e83fe9f6326def7aa040b05f24342/805_0_6875_5504/500.jpg",
    "summary": "Carbon fiber materials are challenging to recycle, leading to significant waste issues. However, the UK and other European countries are developing strategies to address this problem. These plans aim to enhance sustainability and reduce the environmental impact of carbon fiber disposal.",
    "published": "2025-09-21T04:00:32Z"
  },
  {
    "title": "‘Abhorrent behaviour’: calls for Optus to face stiff penalties after triple-zero outage deaths",
    "url": "https://www.theguardian.com/business/2025/sep/21/abhorrent-behaviour-call-for-optus-to-face-stiff-penalties-after-triple-zero-outage-deaths",
    "image": "https://media.guim.co.uk/6a6acb5a1bb3a224452cdca6fd2229ce02bc2b89/539_0_4931_3945/500.jpg",
    "summary": "Senior politicians have criticized a telecommunications company, calling for a wider investigation into its emergency network capabilities. The Coalition is particularly pressing for scrutiny as bushfire season approaches, emphasizing the importance of reliable communication during disasters. The demand follows concerns over the telco's preparedness and response during previous emergencies.",
    "published": "2025-09-21T03:36:19Z"
  },
  {
    "title": "Trump news at a glance: fears president will seize on Kirk’s murder for campaign of vengeance",
    "url": "https://www.theguardian.com/us-news/2025/sep/21/trump-administration-news-updates-today-latest",
    "image": "https://media.guim.co.uk/a282ada00eed6fdeebc20a385c17dc3c7dce6efc/9_0_4568_3654/500.jpg",
    "summary": "Critics are concerned that Donald Trump may exploit the memorial service for Charlie Kirk to leverage collective grief for a revenge campaign against the \"radical left.\" This potential move raises fears about politicizing a sensitive event. The discussion is part of ongoing scrutiny of Trump's political strategies leading into the next election cycle.",
    "published": "2025-09-21T01:58:33Z"
  }
]