[
  {
    "title": "US appeals court rules most of Trump’s sweeping global tariffs illegal – as it happened",
    "url": "https://www.theguardian.com/us-news/live/2025/aug/29/cdc-robert-f-kennedy-jr-donald-trump-federal-reserve-lisa-cook-latest-us-politics-news-live-updates",
    "image": "https://media.guim.co.uk/6bce69080a23d3223d079aa0d8e609bfdd276535/0_1463_3174_2537/500.jpg",
    "summary": "A ruling has confirmed a decision from a trade court regarding tariffs, despite criticism from the president. He denounced the court as a \"Highly Partisan Appeals Court\" while expressing confidence in ultimately winning the tariff dispute. The president's ongoing campaign against the tariffs continues to spark controversy.",
    "published": "2025-08-30T01:58:54Z"
  },
  {
    "title": "Australia signs $400m deal to deport foreign-born former detainees to Nauru",
    "url": "https://www.theguardian.com/australia-news/2025/aug/30/australia-signs-400m-deal-to-deport-foreign-born-former-detainees-to-nauru",
    "image": "https://media.guim.co.uk/c17a144cce0cd6567e332e6037b4927a91eacb75/534_0_6089_4872/500.jpg",
    "summary": "Home Affairs Minister Tony Burke signed an agreement on Friday concerning the NZYQ cohort, who were previously subject to indefinite immigration detention. This agreement aims to address their indefinite detention status. Further details on the implications of the agreement have yet to be disclosed.",
    "published": "2025-08-30T01:46:50Z"
  },
  {
    "title": "Trump news at a glance: court ruling threatens to upend Trump’s tariffs; Kamala’s security detail revoked",
    "url": "https://www.theguardian.com/us-news/2025/aug/30/trump-administration-news-today",
    "image": "https://media.guim.co.uk/5ff19eaf49588a48a6d16b490801fb71cfd14d57/1080_0_6914_5534/500.jpg",
    "summary": "A recent ruling undermines former President Trump's tariffs, marking a significant setback for his economic policies. Critics have condemned a move against the vice-president as an \"act of revenge.\" This news highlights ongoing tensions and controversies in US political dynamics.",
    "published": "2025-08-30T00:45:38Z"
  },
  {
    "title": "Most of Trump’s tariffs are illegal, federal court rules",
    "url": "https://www.theguardian.com/us-news/2025/aug/29/trump-tariffs-illegal-appeal-court-ruling",
    "image": "https://media.guim.co.uk/5f6de30e8ecd826706e5f0681ba5d3b5f04b46ac/310_0_5001_4000/500.jpg",
    "summary": "A court determined that Trump exceeded his authority with certain tariff policies during his presidency. In response, Trump has accused the court of political bias against him. The ruling underscores ongoing legal challenges related to his administration's trade practices.",
    "published": "2025-08-30T00:16:52Z"
  },
  {
    "title": "Cigarette prices to jump by almost 7% amid growing concern about Australia’s booming black market",
    "url": "https://www.theguardian.com/australia-news/2025/aug/30/cigarette-prices-to-jump-by-almost-7-amid-growing-concern-about-australias-booming-black-market",
    "image": "https://media.guim.co.uk/2740dd9ce6abffb1c4c50669410da1261be94e55/546_150_4748_3798/500.jpg",
    "summary": "A rise in tobacco excise taxes is set to take effect on Monday, aiming to reduce smoking rates. However, experts caution that a \"prohibition-style\" strategy may not be effective in combating tobacco use. They emphasize the need for comprehensive measures rather than punitive approaches.",
    "published": "2025-08-30T00:00:46Z"
  }
]