[
  {
    "title": "Australia news live: Hastie says he backs Ley but is ‘a little bolder’ about policy; Andrew Forrest describes ‘real pain’ about Trump’s climate denialism",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/25/australia-news-live-penny-wong-anthony-albanese-climate-crisis-united-nations-donald-trump-turkey-cop-politics-ntwnfb",
    "image": "https://media.guim.co.uk/a82b8854334df8a044a523e87270d11a9cc6b683/1657_0_4214_3371/500.jpg",
    "summary": "I'm unable to summarize without specific news content provided. Please share the news article or details you want summarized.",
    "published": "2025-09-25T04:39:18Z"
  },
  {
    "title": "Country diary: It doesn’t pay to be a brightly coloured pigeon | Claire Stares",
    "url": "https://www.theguardian.com/environment/2025/sep/25/country-diary-it-doesnt-pay-to-be-a-brightly-coloured-pigeon",
    "image": "https://media.guim.co.uk/d48c265c7e488b3cd4d550bcfe524da198547e33/688_0_6880_5504/500.jpg",
    "summary": "In Langstone, Hampshire, the local feral pigeon colony is actively participating in their breeding season. These pigeons contribute significantly to the ecosystem around them. Their presence highlights the ongoing cycle of life in the area.",
    "published": "2025-09-25T04:30:26Z"
  },
  {
    "title": "Victoria’s crime rate surges with theft and family violence driving arrests",
    "url": "https://www.theguardian.com/australia-news/2025/sep/25/victoria-crime-rate-increase-up-theft-family-violence",
    "image": "https://media.guim.co.uk/21a159251487dad0f6b9aa491b8ca912be360388/139_0_3220_2577/500.jpg",
    "summary": "In the 2024-25 financial year, a total of 638,640 criminal offenses were recorded in the state. This marks a significant statistic reflecting ongoing crime trends. The data underscores the need for continued efforts in public safety and law enforcement.",
    "published": "2025-09-25T04:26:05Z"
  },
  {
    "title": "Fake Labubu dolls account for 90% of counterfeit toys seized at UK border",
    "url": "https://www.theguardian.com/lifeandstyle/2025/sep/25/fake-labubu-dolls-counterfeit-toys-seized-uk-border",
    "image": "https://media.guim.co.uk/a9c8aaa0f62dcbefbb763bfccdf7667c4c7b289e/399_0_1145_916/500.jpg",
    "summary": "This year, 236,000 counterfeit fluffy figures have been identified, with many containing banned chemicals or posing a choking hazard. Safety concerns have been raised regarding these imitations. Authorities are urging consumers to be cautious when purchasing such products.",
    "published": "2025-09-25T04:00:28Z"
  },
  {
    "title": "Paris court to rule on Nicolas Sarkozy corruption charge",
    "url": "https://www.theguardian.com/world/2025/sep/25/paris-court-to-rule-on-nicolas-sarkozy-corruption-charge",
    "image": "https://media.guim.co.uk/c66cd3a9370c70bf8efa08691203bebb7063e26c/0_0_7200_5760/500.jpg",
    "summary": "Former President Nicolas Sarkozy and several associates are accused of accepting millions of euros in illegal campaign funding from Libya's Muammar Gaddafi during Sarkozy's 2007 presidential election. Investigations have revealed alleged financial support from the Libyan regime, raising significant concerns about election integrity. Sarkozy has denied the allegations, calling them unfounded.",
    "published": "2025-09-25T04:00:28Z"
  }
]