[
  {
    "title": "Scotland v Belarus: World Cup 2026 qualifying – live",
    "url": "https://www.theguardian.com/football/live/2025/oct/12/scotland-v-belarus-world-cup-2026-qualifying-live",
    "image": "https://media.guim.co.uk/9cf0716f9e51685e7d721a1be6b4fec3d5cd2eb2/154_0_2372_1898/500.jpg",
    "summary": "Steve Clarke's team aims to advance towards qualification with a crucial match against Belarus. Rob Smyth provides a minute-by-minute report as the game unfolds. Fans are eager to see if Clarke's side can secure the win.",
    "published": "2025-10-12T16:20:30Z"
  },
  {
    "title": "Women’s Cricket World Cup: Australia v India – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/12/womens-cricket-world-cup-australia-v-india-live-updates-scores-results-teams-squads-start-time-visakhapatnam",
    "image": "https://media.guim.co.uk/01ff01a0477df68bec3efe45d65f1b017d19fbba/408_0_3070_2457/500.jpg",
    "summary": "In Visakhapatnam, two strong teams are set to make a statement in the group stage of an ODI match. The over-by-over report will provide insights as the game unfolds. Join Megan Maurice for live updates.",
    "published": "2025-10-12T16:17:37Z"
  },
  {
    "title": "Gaza ceasefire live: Trump to meet with Israeli hostages after their release by Hamas on Monday, says Vance",
    "url": "https://www.theguardian.com/world/live/2025/oct/12/gaza-ceasefire-live-aid-relief-hamas-release-israel-hostages",
    "image": "https://media.guim.co.uk/b826099457fa74a398182d2a2a34105b1b0e6877/500_0_5000_4000/500.jpg",
    "summary": "US Vice President JD Vance indicates that a potential release related to Middle East negotiations could occur \"any moment.\" He expresses optimism, stating that the region is on the verge of achieving sustainable peace. These remarks reflect a significant shift in diplomatic efforts in the area.",
    "published": "2025-10-12T16:11:39Z"
  },
  {
    "title": "Looking for signs of life in centre-right politics in Britain | Letters",
    "url": "https://www.theguardian.com/politics/2025/oct/12/looking-for-signs-of-life-in-centre-right-politics-in-britain",
    "image": "https://media.guim.co.uk/9dd45d2a0f891707fa22cde9611f74c26b292167/0_0_4675_3740/500.jpg",
    "summary": "In letters responding to articles about the recent Conservative party conference, David Redshaw expresses optimism about the enduring influence of Thatcherism. The correspondence also includes insights from Des Senior, William Wallace, Les Bright, Katy Jennison, and Peter Brooker. The collective views highlight ongoing discussions about the party's direction and ideological legacy.",
    "published": "2025-10-12T16:06:46Z"
  },
  {
    "title": "Try these habits to reinvigorate your reading | Letters",
    "url": "https://www.theguardian.com/books/2025/oct/12/try-these-habits-to-reinvigorate-your-reading",
    "image": "https://media.guim.co.uk/86bb92af06efcdbccd011ce2ea33b80c6d6be5ef/0_290_2362_1889/500.jpg",
    "summary": "Readers contribute their personal strategies for maximizing the benefits of reading. Various techniques are shared, including note-taking, discussing books with others, and setting reading goals. The letters highlight the diverse approaches people use to enhance their reading experience.",
    "published": "2025-10-12T16:06:01Z"
  }
]