[
  {
    "title": "Trump says US must be ‘very careful’ in removing mandates for ‘vaccines that are so amazing’ – live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/05/donald-trump-pentagon-department-of-war-immigration-tariffs-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/c5ee76f694f27f0db8755b2b176519585a37c399/1376_0_6880_5504/500.jpg",
    "summary": "The President criticized Florida's decision to lift COVID-19 mandates, describing it as a \"tough stance.\" He emphasized the importance of exercising caution in such actions. The remarks reflect concerns about public health measures amid ongoing pandemic challenges.",
    "published": "2025-09-05T23:25:59Z"
  },
  {
    "title": "US Open tennis 2025: Jannik Sinner v Félix Auger-Aliassime, men’s semi-final – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/05/us-open-tennis-2025-jannik-sinner-v-felix-auger-aliassime-mens-semi-final-live",
    "image": "https://media.guim.co.uk/92f8ee1419f5a1adad096a1799700611152928d6/128_0_3744_2996/500.jpg",
    "summary": "Bryan Armen Graham will provide live updates from the second men's semi-final at Flushing Meadows. The report will cover key moments and performances throughout the match. Fans can stay tuned for real-time insights and analysis.",
    "published": "2025-09-05T23:18:31Z"
  },
  {
    "title": "As censure increases over war in Gaza, Israel finds support among Pacific Islands",
    "url": "https://www.theguardian.com/world/2025/sep/06/as-censure-increases-over-war-in-gaza-israel-finds-support-among-pacific-islands",
    "image": "https://media.guim.co.uk/f17fd2cc46190041c3b631312ab2d1c38a130f57/310_0_2500_2000/500.jpg",
    "summary": "Countries such as Fiji, Papua New Guinea, and Tonga have expressed strong support for Israel during a recent United Nations discussion. Their backing highlights the diplomatic relationships these nations maintain with Israel. This endorsement comes amid ongoing geopolitical tensions and debates within the UN regarding Israel's actions.",
    "published": "2025-09-05T23:00:36Z"
  },
  {
    "title": "Prize crossword No 29,793",
    "url": "https://www.theguardian.com/crosswords/prize/29793",
    "summary": "I don't have specific content from the prize crossword No 29,793 to summarize. If you provide details or key points from the crossword, I'd be happy to help with a summary!",
    "published": "2025-09-05T23:00:35Z"
  },
  {
    "title": "Weekend crossword No 765",
    "url": "https://www.theguardian.com/crosswords/weekend/765",
    "summary": "The weekend crossword No. 765 has been released, featuring a variety of clues and answers for puzzle enthusiasts to enjoy. Participants can test their wordplay skills and knowledge across different categories. Solutions are typically provided the following weekend, allowing solvers to check their answers.",
    "published": "2025-09-05T23:00:35Z"
  }
]