[
  {
    "title": "Australia news live: Minns government makes fresh push to limit protests outside places of worship after supreme court ruling",
    "url": "https://www.theguardian.com/australia-news/live/2025/nov/11/australia-news-live-net-zero-nationals-liberals-coalition-sussan-ley-remembrance-day-nsw-neo-nazi-rally-police-chris-minns-ntwnfb",
    "image": "https://media.guim.co.uk/69957af51fcb026a62a3b2a1e035acc971ef5059/115_0_3040_2432/500.jpg",
    "summary": "Could you please provide the specific news article or details that you would like summarized?",
    "published": "2025-11-11T04:24:30Z"
  },
  {
    "title": "Planes came within metres of hitting Melbourne airport workers in ‘terrifying’ incidents after runway shortened",
    "url": "https://www.theguardian.com/australia-news/2025/nov/11/planes-narrowly-avoided-collision-with-melbourne-airport-workers-after-runway-shortened-by-1600-metres",
    "image": "https://media.guim.co.uk/723e0dd9ce1cef136311868e996644c597f8f37b/536_0_864_691/500.jpg",
    "summary": "An Australian safety investigation revealed that two plane incidents in September 2023 nearly resulted in serious accidents, with outcomes determined largely by chance. The findings highlight critical safety concerns within the aviation sector. Authorities are urged to implement measures to prevent future occurrences.",
    "published": "2025-11-11T03:53:14Z"
  },
  {
    "title": "‘I can’t breathe in this city’: inaction over Delhi’s suffocating pollution sparks rare protest",
    "url": "https://www.theguardian.com/world/2025/nov/11/delhi-air-pollution-protest",
    "image": "https://media.guim.co.uk/ac9e8e72ef606c77b644bd97542aaac112c532a7/322_0_5579_4462/500.jpg",
    "summary": "State governments have largely ignored pollution issues, leading to public apathy. However, a recent protest highlighted widespread anger and frustration over the lack of action. Citizens are increasingly demanding accountability and solutions to environmental concerns.",
    "published": "2025-11-11T03:42:31Z"
  },
  {
    "title": "Protests as rightwing Charlie Kirk activist group makes final campus tour stop",
    "url": "https://www.theguardian.com/us-news/2025/nov/10/charlie-kirk-turning-point-usa-berkeley",
    "image": "https://media.guim.co.uk/a9443baca51b5c04e85885d1c5f82a8870cda5ac/435_0_2700_2160/500.jpg",
    "summary": "Protesters rallied in Berkeley, voicing their opposition to Turning Point USA's presence on campus, chanting “Fascists out of Berkeley.” The event sparked tensions due to the university's reputation for left-wing activism. The confrontation highlighted the ongoing ideological battles within college environments.",
    "published": "2025-11-11T03:22:03Z"
  },
  {
    "title": "Trump news at a glance: Senate passes funding package to end shutdown after Democrats break ranks",
    "url": "https://www.theguardian.com/us-news/2025/nov/10/trump-administration-news-updates-today-latest",
    "image": "https://media.guim.co.uk/fa663a33788297e4c676873f251fcc2eca3630bd/247_0_3333_2667/500.jpg",
    "summary": "Donald Trump indicated his intention to adhere to the agreement made by U.S. lawmakers. His statement comes amid ongoing political negotiations. The specifics of the deal have not been detailed in the announcement.",
    "published": "2025-11-11T03:11:55Z"
  }
]