[
  {
    "title": "Reform conference shows a party keen to present itself as normal | Peter Walker",
    "url": "https://www.theguardian.com/politics/2025/sep/05/reform-conference-party-keen-to-present-as-normal-farage",
    "image": "https://media.guim.co.uk/8a0f56d27b61a09055cf545c752736d9cd59e0cc/625_0_6245_4996/500.jpg",
    "summary": "This year's event featured various fringe activities, business exhibitions, and diverse viewpoints. However, the attendance of MPs was notably scarce. The lack of parliamentary representatives highlighted a disconnect between the event and political engagement.",
    "published": "2025-09-05T15:31:18Z"
  },
  {
    "title": "Suede: Antidepressants review – edgy post-punk proves reunited Britpoppers remain on the up",
    "url": "https://www.theguardian.com/music/2025/sep/05/suede-antidepressants-review",
    "image": "https://media.guim.co.uk/48b5cbd8a15ca4d56a9823bf5ec4f526907ac30e/0_3288_8504_6803/500.jpg",
    "summary": "The band's latest album, their tenth, stands out as a remarkable achievement, showcasing powerful riffs and an eerie atmosphere. It effectively captures midlife reflections, resonating deeply with listeners. Overall, it reaffirms the band's artistic evolution and depth.",
    "published": "2025-09-05T15:31:03Z"
  },
  {
    "title": "Pentagon expected to become ‘Department of War’ as US cities brace for Trump’s next national guard deployment – live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/05/donald-trump-pentagon-department-of-war-immigration-tariffs-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/19d6d7e1c78a05cbf47a9397f76d18e5be650679/315_0_3826_3061/500.jpg",
    "summary": "The potential renaming of the Pentagon may incur expenses in the tens of millions due to the need for updated letterheads and signage. Meanwhile, Chicago and Boston are preparing for possible military deployments following threats made by Trump this week. Both developments highlight increasing tensions and significant financial implications for government operations.",
    "published": "2025-09-05T15:30:29Z"
  },
  {
    "title": "US labor market ‘has headed off a cliff-edge’ with just 22,000 jobs added in August – business live",
    "url": "https://www.theguardian.com/business/live/2025/sep/05/ons-crisis-retail-sales-error-uk-house-prices-record-high-us-jobs-report-business-live-news-updates",
    "image": "https://media.guim.co.uk/0070e71e0122b1d8877cd732b7eea519a348c0aa/715_0_4183_3347/500.jpg",
    "summary": "The latest US jobs report reveals a significant slowdown in hiring during the summer months, falling short of expectations. This decline raises concerns about the economic outlook and potential impacts on consumer spending. Analysts are closely monitoring these trends as they assess the overall health of the labor market.",
    "published": "2025-09-05T15:30:14Z"
  },
  {
    "title": "Lammy to be new deputy PM, say No 10 sources, with Cooper as foreign secretary and Mahmood at Home Office – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/05/angela-rayner-stamp-duty-labour-starmer-reform-nigel-farage-uk-politics-live-news-updates",
    "image": "https://media.guim.co.uk/913b9d574a8deaf211dcd44ce2b6bec9036a29d1/0_0_5000_4000/500.jpg",
    "summary": "Labour leader Keir Starmer is restructuring his senior team following Angela Rayner's resignation over a mishandling of stamp duty policy. Rayner stepped down after facing criticism for her oversight in the matter. Starmer aims to reinforce his leadership and address concerns within the party after the incident.",
    "published": "2025-09-05T15:27:40Z"
  }
]