[
  {
    "title": "Chelsea v Liverpool: Premier League – live",
    "url": "https://www.theguardian.com/football/live/2025/oct/04/chelsea-v-liverpool-premier-league-live-score-updates",
    "image": "https://media.guim.co.uk/72a66c9bb069886e3302a654d4053ad21efd67b8/404_0_5375_4300/500.jpg",
    "summary": "Rob Smyth provides a minute-by-minute report as the champions head to London for an important match before the upcoming international break. Fans can expect detailed updates on the game's progress. Don't miss this crucial encounter.",
    "published": "2025-10-04T17:14:00Z"
  },
  {
    "title": "Strictly Come Dancing: week two – live",
    "url": "https://www.theguardian.com/tv-and-radio/live/2025/oct/04/strictly-come-dancing-week-two-live",
    "image": "https://media.guim.co.uk/48f8fc29b32cf08882f655e94c526043a1598ca1/395_0_3952_3163/500.jpg",
    "summary": "Stefan Dennis, Thomas Skinner, and Ellie Goldstein are showcasing their dance moves in a lively performance. As the excitement builds, the question remains about who will be eliminated from the competition. The atmosphere is electric as the dancers continue to impress.",
    "published": "2025-10-04T17:09:24Z"
  },
  {
    "title": "Verstappen points finger at Norris after Russell grabs brilliant pole in Singapore",
    "url": "https://www.theguardian.com/sport/2025/oct/04/impressive-russell-holds-off-verstappen-to-grab-pole-for-singapore-grand-prix",
    "image": "https://media.guim.co.uk/3778bf6feb53ed9755ad75755d9664baaa4e59ae/540_0_4974_3978/500.jpg",
    "summary": "George Russell secured an impressive pole position in Singapore, managing to fend off Max Verstappen. Verstappen expressed frustration, claiming that Lando Norris had impeded his final lap. The qualifying session highlighted a competitive battle among the top drivers.",
    "published": "2025-10-04T17:09:11Z"
  },
  {
    "title": "Police given permission to hold Manchester synagogue attack suspects until Wednesday",
    "url": "https://www.theguardian.com/uk-news/2025/oct/04/police-given-permission-to-hold-manchester-synagogue-attack-suspects-until-wednesday",
    "image": "https://media.guim.co.uk/372fde5b3d1d75e1f8a22130f6c9230e824f459f/347_0_4296_3437/500.jpg",
    "summary": "Six individuals have been arrested in connection with a terrorist attack that resulted in three fatalities. They are suspected of involvement in the planning and execution of the violence. Authorities are continuing their investigation into the incident.",
    "published": "2025-10-04T17:05:03Z"
  },
  {
    "title": "How Democrats are trying to bust Republican lies about healthcare for undocumented immigrants",
    "url": "https://www.theguardian.com/us-news/2025/oct/04/government-shutdown-republican-lies-healthcare-immigrants",
    "image": "https://media.guim.co.uk/bc35f7a75229090e21955ab57b94a0f25a6fc9fb/456_0_4560_3648/500.jpg",
    "summary": "The government shutdown is primarily fueled by disagreements over healthcare policies linked to Trump's controversial legislation. Many lawmakers are concerned that proposed cuts will negatively impact American citizens' access to healthcare. This debate continues to escalate tensions in Congress as the shutdown persists.",
    "published": "2025-10-04T17:00:11Z"
  }
]