[
  {
    "title": "Gaza ceasefire live: JD Vance has ‘great optimism’ truce will hold as he prepares to meet Netanyahu",
    "url": "https://www.theguardian.com/world/live/2025/oct/22/israel-gaza-ceasefire-jd-vance-netanyahu-hamas-hostages-middle-east-latest-news-updates",
    "image": "https://media.guim.co.uk/1bffe3905643d4be2400e85b72a23d77ea791c0d/481_0_5059_4047/500.jpg",
    "summary": "During a visit to Israel, the US Vice President announced that Washington will not impose a deadline for the group to disarm as part of the US-brokered agreement. This statement emphasizes the ongoing commitment to diplomatic negotiations in the region. The approach highlights a flexible timeline aimed at fostering cooperation.",
    "published": "2025-10-22T09:20:44Z"
  },
  {
    "title": "The Spin | The Shane Warne effect: why some cricketers are loved by fans of their fiercest rivals",
    "url": "https://www.theguardian.com/sport/2025/oct/22/the-shane-warne-effect-why-some-cricketers-are-loved-by-fans-of-their-fiercest-rivals",
    "image": "https://media.guim.co.uk/6317892766029931459bd8dfdc540ea3fb048ffc/237_0_2565_2053/500.jpg",
    "summary": "Rivalries in cricket are intense and genuine, leading to captivating stories that showcase the sport's dynamic nature. These competitive encounters often transform opponents into unforgettable heroes. The emotional drama and unpredictability of the game contribute to its appeal and narrative richness.",
    "published": "2025-10-22T09:17:12Z"
  },
  {
    "title": "Australia v England: Women’s Cricket World Cup – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/22/australia-v-england-womens-cricket-world-cup-live",
    "image": "https://media.guim.co.uk/bc9f6e82d5ab2c0f40c2a08a8728027827ebd462/377_0_5408_4325/500.jpg",
    "summary": "Two unbeaten teams face off in Indore, marking an exciting clash in the competition. Writers provide live updates and commentary as the match unfolds. Stay tuned for over-by-over reports.",
    "published": "2025-10-22T09:14:46Z"
  },
  {
    "title": "Russia and Ukraine trade missile attacks after Putin-Trump talks shelved – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/oct/22/russia-ukraine-war-kyiv-attack-latest-news-updates-europe",
    "image": "https://media.guim.co.uk/a7c5520b23006e06e8f0db5c581a58593bbecd97/93_167_792_634/500.jpg",
    "summary": "A Russian missile attack on Kyiv resulted in multiple fatalities following Ukraine's strike on a chemical plant in Bryansk that produced gunpowder, explosives, and fuel. The incident highlights ongoing tensions and military actions between the two nations. The conflict continues to escalate, with civilian casualties contributing to the humanitarian crisis.",
    "published": "2025-10-22T09:13:18Z"
  },
  {
    "title": "UK inflation stays at 3.8% as food price rises slow for first time since March – business live",
    "url": "https://www.theguardian.com/business/live/2025/oct/22/uk-inflation-stays-at-38-as-food-price-rises-slow-for-first-time-since-march-business-live",
    "image": "https://media.guim.co.uk/fe487c9aa140b572bb41664e2ba45075ec3215ba/644_0_6436_5149/500.jpg",
    "summary": "Inflation data suggests a potential interest rate cut in December, boosting market optimism. Meanwhile, gold prices have surged following their largest sell-off in five years. Investors are reacting to these economic signals as they reassess their portfolios.",
    "published": "2025-10-22T09:12:20Z"
  }
]