[
  {
    "title": "Europe’s population crisis: see how your country compares – visualised",
    "url": "https://www.theguardian.com/world/ng-interactive/2025/feb/18/europes-population-crisis-see-how-your-country-compares-visualised",
    "image": "https://media.guim.co.uk/5701749bc435597e38617639286de0cee5b1afaa/0_0_5000_3000/500.png",
    "summary": "Anti-immigration politics in the EU is increasingly at odds with demographic trends, as many countries face aging populations and declining birth rates. This paradox has led to debates over the need for migrant labor to sustain economic growth and social systems. Solutions to reconcile these conflicting dynamics are crucial for future stability and prosperity in the region.",
    "published": "2025-09-03T08:42:04Z"
  },
  {
    "title": "UK long-term borrowing costs hit fresh 27-year high amid global bond sell-off – business live",
    "url": "https://www.theguardian.com/business/live/2025/sep/03/global-bond-sell-off-japan-government-debt-uk-us-eurozone-pound-falls-business-live-news-updates",
    "image": "https://media.guim.co.uk/33043e635ce2b16bdd760078e1df4511ce16a2d7/500_0_5000_4002/500.jpg",
    "summary": "UK 30-year bond yields have increased, surpassing the levels seen on Tuesday. This rise continues the trend of fluctuating economic indicators. Analysts are closely monitoring these developments for potential implications on the broader financial landscape.",
    "published": "2025-09-03T08:39:48Z"
  },
  {
    "title": "Australia politics live: Jacinta Nampijinpa Price quickly walks back claim Labor encouraging migration from ‘particular countries’",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/03/australia-politics-live-labor-coalition-greens-anthony-albanese-sussan-ley-question-time-nauru-immigration-asylum-ntwnfb",
    "image": "https://media.guim.co.uk/49f8277abb3c01fba56b5138a6b0082426ff0a2b/496_0_4961_3969/500.jpg",
    "summary": "Could you please provide the specific news article or topic you would like summarized?",
    "published": "2025-09-03T08:38:21Z"
  },
  {
    "title": "Farage condemns UK’s ‘authoritarian censorship regime’ ahead of giving evidence at US congress - UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/03/farage-starmer-badenoch-pmqs-news-updates-uk-politics-live",
    "image": "https://media.guim.co.uk/73f706ba3192a6a252b1ffdf4898e17e7d44ff18/302_0_4840_3872/500.jpg",
    "summary": "Reform UK leader will address the House judiciary committee regarding the Online Safety Act. The government is also expected to announce the date of the upcoming budget during Prime Minister's Questions (PMQs). These developments highlight ongoing discussions about online safety regulations and fiscal planning.",
    "published": "2025-09-03T08:33:40Z"
  },
  {
    "title": "Gaza is becoming ‘graveyard of international humanitarian law’, says Unrwa boss – Middle East crisis live",
    "url": "https://www.theguardian.com/world/live/2025/sep/03/gaza-graveyard-international-humanitarian-law-unrwa-israel-middle-east-crisis-latest-updates-news",
    "image": "https://media.guim.co.uk/9501ef62e035f4fe4233e091a9265ecc8af5446a/247_0_2891_2312/500.jpg",
    "summary": "Philippe Lazzarini, head of UNRWA, has expressed concern about the escalating famine and violence in Gaza, highlighting that the agency has been warning about these issues for months. He criticized the blatant disregard for international law in the region. Lazzarini's statements underscore the urgent need for humanitarian support amidst the crisis.",
    "published": "2025-09-03T08:30:20Z"
  }
]