[
  {
    "title": "Australia politics live: Alex Hawke calls out Labor for trying to send FoI bill to ‘legislation clearing house’",
    "url": "https://www.theguardian.com/australia-news/live/2025/nov/04/australia-politics-live-keating-trump-anthony-albanese-sussan-ley-david-littleproud-net-zero-policy-coalition-question-time-energy-policy-ntwnfb",
    "image": "https://media.guim.co.uk/b9f5660518ee564230686c0af4db47a4cedd7527/606_0_6240_4992/500.jpg",
    "summary": "I'm sorry, but I can't summarize the news without specific details. Could you please provide the text or key points of the news story you'd like summarized?",
    "published": "2025-11-04T01:37:13Z"
  },
  {
    "title": "Zohran Mamdani called out Donald Trump’s threat to withhold federal funding in New York City– live",
    "url": "https://www.theguardian.com/us-news/live/2025/nov/03/us-government-shutdown-donald-trump-latest-politics-news",
    "image": "https://media.guim.co.uk/139a25c4e14a11363858c7bc3965c8693914226b/436_0_4631_3703/500.jpg",
    "summary": "US President supports independent candidate Andrew Cuomo, the former New York governor who resigned in disgrace amid scandals. This endorsement highlights a significant political shift as Cuomo seeks to re-enter the political landscape. The backing raises eyebrows given Cuomo's controversial past.",
    "published": "2025-11-04T01:31:11Z"
  },
  {
    "title": "Worker dies after being rescued from partially collapsed medieval tower in Rome",
    "url": "https://www.theguardian.com/world/2025/nov/03/rome-tower-collapse-torre-dei-conti-italy",
    "image": "https://media.guim.co.uk/fadff127ec6291de745b406d9a400ef8e6f43851/512_0_2560_2048/500.jpg",
    "summary": "A Romanian worker was rescued from the rubble of Torre dei Conti and taken to the hospital in serious condition. Unfortunately, he succumbed to his injuries shortly after arriving at the medical facility. The incident highlights the dangers of construction work and the need for safety measures.",
    "published": "2025-11-04T00:35:01Z"
  },
  {
    "title": "Two courts urge ICE to halt deportation of man wrongfully imprisoned for more than 40 years",
    "url": "https://www.theguardian.com/us-news/2025/nov/03/subu-vedam-ice-deportation-overturned-conviction",
    "image": "https://media.guim.co.uk/a407cbc15b94a40a300fe4bda076808981f83b5a/14_0_1761_1409/500.jpg",
    "summary": "Legal resident 'Subu' Vedam is currently detained in a short-term facility following the overturning of his murder conviction earlier this year. His case has drawn attention due to the complexities surrounding his legal status. Details regarding the circumstances of his detention remain unclear.",
    "published": "2025-11-04T00:21:37Z"
  },
  {
    "title": "Counter-terror police investigate claim UK university halted research after Chinese pressure",
    "url": "https://www.theguardian.com/education/2025/nov/04/counter-terror-police-investigate-claim-uk-university-halted-research-after-chinese-pressure",
    "image": "https://media.guim.co.uk/22b04ada04e07169d22d07c40bc8787a3cbeb86c/2313_161_3443_2754/500.jpg",
    "summary": "Sheffield Hallam University has directed a professor to stop his research on human rights concerning the forced labor of Uyghurs in China. The decision has raised concerns about academic freedom and the university's stance on sensitive geopolitical issues. The situation highlights tensions between institutional policies and human rights advocacy.",
    "published": "2025-11-04T00:08:37Z"
  }
]