[
  {
    "title": "Guéhi to leave Palace, heat on Postecoglou as Premier League returns – matchday live",
    "url": "https://www.theguardian.com/football/live/2025/oct/18/premier-league-returns-postecoglou-arsenal-matchday-live",
    "image": "https://media.guim.co.uk/00f47bbe7e0c306035d7e512fdeb003379a53460/0_0_5000_4000/500.jpg",
    "summary": "Emillia Hawkins hosts coverage of the Premier League's return following the international break. Fans can expect in-depth analysis and updates on teams and players. This season's excitement reignites as clubs are back in action.",
    "published": "2025-10-18T09:17:35Z"
  },
  {
    "title": "Parents will be able to block Meta bots from talking to their children under new safeguards",
    "url": "https://www.theguardian.com/technology/2025/oct/18/parents-will-be-able-to-block-meta-bots-from-talking-to-their-children-under-new-safeguards",
    "image": "https://media.guim.co.uk/313ae48b4b3f1e52efff3d14fcf42b59ebcedbad/477_204_3846_3079/500.jpg",
    "summary": "Concerns are rising over generative AI characters engaging in inappropriate discussions with users under the age of 18. In response, new measures are being implemented to enhance the safety and regulation of these interactions. The goal is to protect minors from potential harm while using AI technologies.",
    "published": "2025-10-18T09:14:47Z"
  },
  {
    "title": "New Zealand v England: first men’s T20 cricket international hit by rain – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/18/new-zealand-v-england-first-mens-t20-cricket-international-live",
    "image": "https://media.guim.co.uk/21705969e8d702b2818faa8d92b7ed22752edf6c/290_13_2887_2310/500.jpg",
    "summary": "James Wallace provides live updates from Christchurch as England kicks off their white-ball tour of New Zealand. The report includes detailed over-by-over commentary on the match. Fans can follow the action as England aims to perform well in this series.",
    "published": "2025-10-18T09:12:02Z"
  },
  {
    "title": "‘We don’t celebrate Black creativity enough’: why the Black British book festival is bigger than ever",
    "url": "https://www.theguardian.com/books/2025/oct/18/fifth-black-british-book-festival-barbican-london",
    "image": "https://media.guim.co.uk/96d5e2231b21019c59db37c28fdaa33be0b2b7de/91_0_2000_1600/500.jpg",
    "summary": "Ahead of the BBBF this weekend, attending authors discuss the challenges facing publishing in Black writing. They emphasized the importance of collaboration and unity as a means to address this ongoing crisis. The event aims to foster connections and support within the community.",
    "published": "2025-10-18T09:10:40Z"
  },
  {
    "title": "‘A world detached from struggles of urban life’: a rare exhibition of Renoir drawings",
    "url": "https://www.theguardian.com/artanddesign/2025/oct/18/renoir-drawings-exhibition-new-york",
    "image": "https://media.guim.co.uk/d3116d4a6897ff25f3696febd6fb00c7018fca02/15_0_3289_2632/500.jpg",
    "summary": "A new exhibition showcases lesser-known drawings by a renowned impressionist painter, highlighting the stages of his artistic process. Visitors can explore the evolution of his work through these intimate pieces. The exhibition aims to provide a deeper understanding of the painter's creative journey.",
    "published": "2025-10-18T09:01:40Z"
  }
]