[
  {
    "title": "NWSL Championship: Washington Spirit v Gotham FC  – live",
    "url": "https://www.theguardian.com/football/live/2025/nov/22/nwsl-championship-washington-spirit-v-gotham-fc-live",
    "image": "https://media.guim.co.uk/f55f1759641b63e9fdb0e7c2ae3051ab1e6e1a47/0_3_5000_4000/500.jpg",
    "summary": "Live updates are being provided on the ongoing battle for the title among competing teams. Follow Beau Dure for the latest news and developments in the competition. Stay tuned to see which team emerges victorious.",
    "published": "2025-11-23T01:51:05Z"
  },
  {
    "title": "News live: Cyclone Fina leaves trail of damage as heavy rain hits Top End; Cop30 statement ‘sliding doors’ moment for fossil fuels phase-out",
    "url": "https://www.theguardian.com/australia-news/live/2025/nov/23/severe-tropical-cyclone-fina-darwin-nt-bom-cop30-fossil-fuel-transition-g20-climate-declaration-ntwnfb",
    "image": "https://media.guim.co.uk/6a5b7b9e4eeeeef97d47535764556266aac67b79/277_0_2832_2268/500.jpg",
    "summary": "Please provide the news article or details you would like summarized, and I'll be happy to help!",
    "published": "2025-11-23T01:44:12Z"
  },
  {
    "title": "Trump says Ukraine deal is not ‘final offer’ as officials gather for Geneva summit",
    "url": "https://www.theguardian.com/world/2025/nov/23/trump-says-ukraine-deal-is-not-final-offer-as-officials-gather-for-geneva-summit",
    "image": "https://media.guim.co.uk/03004c413878d8d2de8cdb5ecb46971b837a63c6/495_133_1759_1407/500.jpg",
    "summary": "President Biden indicated there might be flexibility in U.S. support for Ukraine following President Zelenskyy's concern that proposed measures may pressure Ukraine to sacrifice its national dignity. Zelenskyy emphasized the importance of maintaining Ukraine's sovereignty while receiving U.S. aid. The dialogue suggests ongoing discussions about the terms of U.S. assistance amidst the conflict.",
    "published": "2025-11-23T01:26:36Z"
  },
  {
    "title": "Wallabies fans are entitled to be frustrated but it’s not all grim for this tired, talented side",
    "url": "https://www.theguardian.com/sport/blog/2025/nov/23/wallabies-fans-are-entitled-to-be-frustrated-but-its-not-all-grim-for-this-tired-talented-side",
    "image": "https://media.guim.co.uk/b272ae7cf5abc84e63e945210c903890585502e6/0_113_1782_1426/500.jpg",
    "summary": "Australia's performance in Europe indicates the team is at the start of a promising journey rather than reaching its conclusion. Their sparks of talent and intent reflect potential for growth and improvement. This suggests an optimistic future for Australian football.",
    "published": "2025-11-23T00:07:34Z"
  },
  {
    "title": "Quiptic crossword No 1,357",
    "url": "https://www.theguardian.com/crosswords/quiptic/1357",
    "summary": "Quiptic crossword No. 1,357 features a variety of clues designed to challenge and entertain solvers. It maintains the signature style of engaging wordplay and accessible difficulty. Fans of puzzles can enjoy this latest installment, which encourages both novice and experienced crossword enthusiasts to participate.",
    "published": "2025-11-23T00:00:52Z"
  }
]