[
  {
    "title": "Stride defends Tory plan to slash overseas aid spending to 0.1% of national income – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/oct/06/conservative-tory-party-conference-spending-welfare-immigration-labour-starmer-reform-uk-politics-live-news-updates",
    "image": "https://media.guim.co.uk/9add19123acfc62b1b4f9ed143473300bf9cd54c/1153_374_3351_2681/500.jpg",
    "summary": "The Shadow Chancellor has announced a series of cost-cutting measures during the ongoing Tory party conference in Manchester. The plans aim to address fiscal challenges and improve economic efficiency. This move comes amid ongoing discussions within the party regarding their financial strategy.",
    "published": "2025-10-06T09:20:53Z"
  },
  {
    "title": "France gripped by political turmoil as PM resigns – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/oct/06/france-pm-resigns-lecornu-macron-europe-live-news-updates",
    "image": "https://media.guim.co.uk/f0d937cf8be510811273abb715ade1cea98dfd07/841_369_3652_2921/500.jpg",
    "summary": "Sébastien Lecornu has resigned from his position after just under a month in office, following intense criticism of President Macron's new cabinet. His departure reflects the challenges the government is facing amid public discontent. The reshuffle raises questions about the administration's stability and direction.",
    "published": "2025-10-06T09:17:13Z"
  },
  {
    "title": "‘Obedient, yielding and happy to follow’: the troubling rise of AI girlfriends",
    "url": "https://www.theguardian.com/technology/2025/oct/06/rise-of-ai-girlfriends-adult-dating-websites",
    "image": "https://media.guim.co.uk/dc587addc9fbebbdf42ac9fe41bdc86246976661/0_0_4800_3840/500.jpg",
    "summary": "AI dating sites argue that they eliminate exploitation risks by using algorithms to match users more safely. However, critics contend that these platforms may inadvertently reinforce harmful stereotypes and biases. The debate raises concerns about the ethical implications of AI in personal relationships.",
    "published": "2025-10-06T09:09:17Z"
  },
  {
    "title": "Euro and Paris stock market slide amid French political crisis; gold at record high near $4,000 per ounce – business live",
    "url": "https://www.theguardian.com/business/live/2025/oct/06/yen-slumps-nikkei-record-sanae-takaichi-wins-election-gold-nears-4000-rally-continues-business-live-news",
    "image": "https://media.guim.co.uk/bcc4965e0a3de7e5575e75c132ebc3449419bcc8/553_0_5525_4420/500.jpg",
    "summary": "France's prime minister has resigned unexpectedly, prompting significant attention in economic and financial circles. Analysts are closely monitoring the potential implications for the country's fiscal policies and markets. The political shift could impact ongoing economic reforms and investor confidence in France.",
    "published": "2025-10-06T09:05:05Z"
  },
  {
    "title": "Christian group ‘deceived’ supreme court about LGBTQ+ research, cited scholars say",
    "url": "https://www.theguardian.com/us-news/2025/oct/06/alliance-defending-freedom-supreme-court-conversion-therapy",
    "image": "https://media.guim.co.uk/433ccdc1572851eedb91fea7c6a06ca9d4181424/496_0_4903_3922/500.jpg",
    "summary": "Experts have criticized Alliance Defending Freedom for misrepresenting their research in a case aimed at reviving conversion therapy, which poses risks to transgender and queer youth. The group's arguments have been deemed misleading and harmful. Concerns arise about the implications this case could have on vulnerable communities.",
    "published": "2025-10-06T09:00:05Z"
  }
]