[
  {
    "title": "Manchester City 3-0 Manchester United: Premier League – live",
    "url": "https://www.theguardian.com/football/live/2025/sep/14/manchester-city-v-manchester-united-premier-league-live",
    "image": "https://media.guim.co.uk/fb5017c6c02310b94abb40f74aac4e3d47839bf5/179_0_1818_1454/500.jpg",
    "summary": "Manchester City won the first Manchester derby of the season, showcasing their dominance in the match. Rob Smyth reported on the game, highlighting key moments and performances. The victory adds to City's strong start in the league.",
    "published": "2025-09-14T17:25:04Z"
  },
  {
    "title": "England 40-8 Scotland: Women’s Rugby World Cup 2025 quarter-final – live reaction",
    "url": "https://www.theguardian.com/sport/live/2025/sep/14/england-v-scotland-womens-rugby-world-cup-2025-quarter-final-live",
    "image": "https://media.guim.co.uk/d9e7a3e3ba89ff9200d551f8f7884bb0133caee1/85_117_2716_2173/500.jpg",
    "summary": "In a thrilling match, the hosts secured a spot in the semi-finals by eliminating Scotland from the competition. Niall McVeigh provided live updates throughout the game. The victory marks a significant achievement for the hosts as they advance in the tournament.",
    "published": "2025-09-14T17:16:49Z"
  },
  {
    "title": "Britain will ‘never surrender flag’ to far-right protesters, Starmer says",
    "url": "https://www.theguardian.com/uk-news/2025/sep/14/britain-far-right-protesters-flag-keir-starmer",
    "image": "https://media.guim.co.uk/a42dcc4bc53a4ee3f05dac799d357a9ebc3f7d9b/458_0_4577_3661/500.jpg",
    "summary": "The Prime Minister has condemned recent attacks on police officers and the racist intimidation directed at minority communities. He emphasized the inappropriate use of national symbols to instill fear among these groups. The statement highlights the government's commitment to uphold safety and unity in society.",
    "published": "2025-09-14T17:16:37Z"
  },
  {
    "title": "Shooting suspect had ‘very different ideology’ than conservative family, Utah governor says",
    "url": "https://www.theguardian.com/us-news/2025/sep/14/charlie-kirk-shooting-suspect-roommate",
    "image": "https://media.guim.co.uk/062781ef63026eb5bd39b0accd636396bf2e7e62/267_0_2667_2133/500.jpg",
    "summary": "Utah Governor Spencer Cox stated that the suspect in a recent incident had been \"radicalized.\" Additionally, it was revealed that the suspect had a romantic partner undergoing a transition from male to female. These details have raised concerns about the influences that may have contributed to the suspect's actions.",
    "published": "2025-09-14T17:16:30Z"
  },
  {
    "title": "Nigel Farage admits breaching parliamentary rules over Trump event",
    "url": "https://www.theguardian.com/politics/2025/sep/14/nigel-farage-admits-breaching-parliamentary-rules-over-trump-event",
    "image": "https://media.guim.co.uk/9dd5f4bef909466abe5b331c60390be8a64cc0ab/0_0_4330_3464/500.jpg",
    "summary": "A reform leader has attributed his failure to register for a speaking engagement at a Florida Republican Party dinner to an oversight by his office. He clarified that the mishap was unintended and not a deliberate decision. The incident has raised questions about communication and protocol within his team.",
    "published": "2025-09-14T17:04:30Z"
  }
]