[
  {
    "title": "Gaza aid flotilla: more than a dozen vessels intercepted by Israeli forces; Greta Thunberg arrested – live",
    "url": "https://www.theguardian.com/world/live/2025/oct/01/israel-gaza-aid-global-sumud-flotilla-middle-east-crisis-latest-updates",
    "image": "https://media.guim.co.uk/1dc8eff7cd550ab162294c9a1525393e9bf0e162/107_0_705_564/500.jpg",
    "summary": "The Israeli foreign ministry shared a video of environmental activist Greta Thunberg's arrest amid protests. Around 500 activists were intercepted approximately 75 miles off the coast of a conflict-affected area. The incident highlights ongoing tensions and activism around environmental issues in global conflict zones.",
    "published": "2025-10-02T06:22:59Z"
  },
  {
    "title": "News live: PNG approves delayed defence treaty with Australia; Commonwealth Bank restores services after outage",
    "url": "https://www.theguardian.com/australia-news/live/2025/oct/02/australia-news-live-dan-tehan-liberals-nuclear-sussan-ley-coalition-anthony-albanese-labor-flotilla-bhp-china-ntwnfb",
    "image": "https://media.guim.co.uk/0cb351cd3bbd5ad603c69dbeb8b0ad88b2cf1aee/297_0_5946_4757/500.jpg",
    "summary": "Please provide the news article or content you'd like summarized, and I'll be happy to help!",
    "published": "2025-10-02T06:06:22Z"
  },
  {
    "title": "One of Us by Elizabeth Day review – the inner lives of Tory MPs",
    "url": "https://www.theguardian.com/books/2025/oct/02/one-of-us-by-elizabeth-day-review-the-inner-lives-of-tory-mps",
    "image": "https://media.guim.co.uk/2aeec8c6d54c28ce327daa7c9586d237e2b95882/379_417_3094_2476/500.jpg",
    "summary": "The sequel to \"The Party\" offers a gripping whodunnit narrative centered around a family intricately involved in British political affairs. The story explores themes of power, intrigue, and personal dynamics within the political landscape. It promises to provide a fresh perspective on contemporary issues facing the nation.",
    "published": "2025-10-02T06:00:43Z"
  },
  {
    "title": "Don’t Let’s Go to the Dogs Tonight review – heartfelt child’s-eye view of last days of Rhodesia",
    "url": "https://www.theguardian.com/film/2025/oct/02/dont-lets-go-to-the-dogs-tonight-review-heartfelt-childs-eye-view-of-last-days-of-rhodesia",
    "image": "https://media.guim.co.uk/499cb35a306cb50b52418b9877864b498e895407/120_0_4469_3574/500.jpg",
    "summary": "Embeth Davidtz stars in and directs a powerful film that highlights the end of white minority rule. The film features standout performances from Zikhona Bali and young Lexi Venter as Bobo. Together, they bring deep emotional resonance to the story.",
    "published": "2025-10-02T06:00:41Z"
  },
  {
    "title": "Cats, coffins and sick notes: discovering Egypt’s forgotten workers in broken pottery",
    "url": "https://www.theguardian.com/culture/2025/oct/02/egypt-uk-cambridge-museum-exhibition-culture-art-history",
    "image": "https://media.guim.co.uk/a385838189d313d34926436588eb824d0f2e7e7b/519_0_5000_4000/500.jpg",
    "summary": "A new exhibition in Cambridge highlights the lives of skilled workers responsible for constructing renowned ancient Egyptian sites. The display offers insights into their craftsmanship and the social dynamics of their communities. It aims to celebrate their contributions and shed light on their historical significance.",
    "published": "2025-10-02T06:00:41Z"
  }
]