[
  {
    "title": "Donald Trump and Xi Jinping to hold meeting in South Korea amid hopes for trade deal – live updates",
    "url": "https://www.theguardian.com/world/live/2025/oct/30/donald-trump-xi-jinping-meeting-live-updates",
    "image": "https://media.guim.co.uk/bd1c513361c5ea2ab97bd963b56b8b81e60cde38/0_1161_5159_4127/500.jpg",
    "summary": "The summit on the sidelines of APEC marks the first meeting between US and Chinese leaders since 2019. This meeting is significant as it follows years of strained relations exacerbated by Trump's trade war. The discussions aim to address key issues and potentially ease tensions between the two nations.",
    "published": "2025-10-30T01:40:08Z"
  },
  {
    "title": "Australia politics live: PM won’t confirm COP attendance; surprise amendment to give federal police powers to cancel welfare payments",
    "url": "https://www.theguardian.com/australia-news/live/2025/oct/30/anthony-albanese-donald-trump-meeting-murray-watt-epbc-nature-laws-press-club-parliament-labor-coalition-sussan-ley-ntwnfb",
    "image": "https://media.guim.co.uk/b1259abe3d4bb3efdc5364524ad9fbe6abc65bcc/0_0_1993_1595/500.jpg",
    "summary": "I'm sorry, but I need more context or specific news content to summarize it. Please provide the details or main points you'd like me to summarize.",
    "published": "2025-10-30T01:39:20Z"
  },
  {
    "title": "National guard deployment in Washington DC extended until February",
    "url": "https://www.theguardian.com/us-news/2025/oct/29/hegseth-washington-dc-national-troops",
    "image": "https://media.guim.co.uk/28ee69291c9fa11e441e0653d86da0e14fd362fb/379_0_3236_2590/500.jpg",
    "summary": "Pentagon chief Pete Hegseth has authorized troops to stay in the U.S. capital beyond the end of November. This decision was reported by CNN. The reasons for the extension have not been detailed.",
    "published": "2025-10-30T01:28:53Z"
  },
  {
    "title": "‘The town is devastated’: the mayor picking up the pieces at Hurricane Melissa’s ‘ground zero’",
    "url": "https://www.theguardian.com/world/2025/oct/30/hurricane-melissa-jamaica-devastated-picking-up-the-pieces-ground-zero",
    "image": "https://media.guim.co.uk/4c6261ce6219b591128df3f3e515d8c5069f70c9/766_32_3590_2872/500.jpg",
    "summary": "Richard Solomon, the mayor of Black River, recounts the terrifying experience of 16-foot storm surges and intense winds during the recent storm. With the immediate danger passed, attention is shifting towards aid and rescue operations for affected residents. Efforts are underway to assess damage and provide support to the community.",
    "published": "2025-10-30T01:25:00Z"
  },
  {
    "title": "Hurricane Melissa death toll rises as storm wreaks destruction across Caribbean – latest updates",
    "url": "https://www.theguardian.com/world/live/2025/oct/29/hurricane-melissa-live-updates-strengthens-cuba-extensive-damage-parts-of-jamaica",
    "image": "https://media.guim.co.uk/556fba4f8b291c7c54388fc5d148ebad70038534/403_0_3613_2891/500.jpg",
    "summary": "Four people have been confirmed dead in Jamaica, while dozens have lost their lives in Haiti due to severe weather conditions. A hurricane warning is currently active for regions including Bermuda. Authorities are closely monitoring the situation as the storm continues to impact the area.",
    "published": "2025-10-30T01:19:33Z"
  }
]