[
  {
    "title": "New Zealand v England: third men’s cricket one-day international – live",
    "url": "https://www.theguardian.com/sport/live/2025/nov/01/new-zealand-v-england-third-mens-cricket-one-day-international-live",
    "image": "https://media.guim.co.uk/8f289e61ec3a939c4e19dee846600b23d2fabd9a/479_0_4689_3752/500.jpg",
    "summary": "In Wellington, the third ODI between New Zealand and England is underway, with live updates provided by our writers. Stay tuned for over-by-over commentary and analysis as the match progresses. Fans can follow the action closely as the teams compete for victory.",
    "published": "2025-11-01T04:13:46Z"
  },
  {
    "title": "Gumnuts, baby! How two abseiling horticulturalists rescued specimens from an endangered tree",
    "url": "https://www.theguardian.com/environment/2025/nov/01/gumnuts-baby-how-two-abseiling-horticulturalists-rescued-specimens-from-an-endangered-tree",
    "image": "https://media.guim.co.uk/11967b33fe46549ed7dcbd35d4b4726947da517b/162_0_4860_3888/500.jpg",
    "summary": "The threatened Jillaga Ash tree (<em>Eucalyptus stenostoma</em>) was discovered at a depth of 90 meters down a cliff in Wadbilliga National Park, southern New South Wales. This sighting highlights the tree's rare habitat. Conservation efforts may be necessary to protect this endangered species.",
    "published": "2025-11-01T04:00:23Z"
  },
  {
    "title": "World Series Game 6: Los Angeles Dodgers 3-1 Toronto Blue Jays – as it happened",
    "url": "https://www.theguardian.com/sport/live/2025/oct/31/world-series-game-6-los-angeles-dodgers-v-toronto-blue-jays-live-buildup",
    "image": "https://media.guim.co.uk/9255cfc06151e1e5bee3e3f92ae1539f61151e2e/366_0_2716_2173/500.jpg",
    "summary": "The Los Angeles Dodgers triumphed over the Toronto Blue Jays with a score of 3-1, resulting in a decisive Game 7. This playoff victory has set the stage for an exciting final matchup in Toronto on Saturday. Fans, including David Lengel, eagerly anticipate the showdown.",
    "published": "2025-11-01T03:19:00Z"
  },
  {
    "title": "LA Dodgers hold on in Toronto to force winner-take-all Game 7 in World Series",
    "url": "https://www.theguardian.com/sport/2025/oct/31/world-series-game-6-dodgers-blue-jays-report",
    "image": "https://media.guim.co.uk/1e93ca149dc65b1b269b0433d3f47e8bc19f223e/125_0_2803_2243/500.jpg",
    "summary": "The Dodgers avoided elimination in Game 6 of the World Series by defeating the Blue Jays 3-1. Yoshinobu Yamamoto delivered another strong performance, contributing to the team's success. The win forces a decisive Game 7 in the championship series.",
    "published": "2025-11-01T03:17:39Z"
  },
  {
    "title": "History secured: There is no telling where the record-breaking Roos’ AFLW dominance will end I Nino Bucci",
    "url": "https://www.theguardian.com/sport/blog/2025/nov/01/aflw-north-melbourne-kangaroos-24-consecutive-wins-history-record-breaking-roos",
    "image": "https://media.guim.co.uk/102625f01f8771489c41e7461b5985627090ad82/239_0_2050_1641/500.jpg",
    "summary": "North Melbourne has achieved a historic feat by winning 24 consecutive games, more than any other team in VFL/AFL/AFLW history. The team is now focusing on the goal of securing back-to-back premierships. This remarkable streak highlights their dominance in the league.",
    "published": "2025-11-01T03:02:12Z"
  }
]