[
  {
    "title": "Australia news live: Labor’s Kiama win was a ‘gift from voters’ and shouldn’t be taken for granted, Minns says",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/14/australia-news-live-albanese-papua-new-guinea-aldi-solar-environment-richard-marles-sunday-ntwnfb",
    "image": "https://media.guim.co.uk/eb4144027fba711abad39835176a7caa0e16d8e7/3328_998_3342_2674/500.jpg",
    "summary": "I'm sorry, but I need more information about the specific news you'd like summarized. Could you provide details or the key points of the news article?",
    "published": "2025-09-14T03:09:16Z"
  },
  {
    "title": "Canelo Álvarez v Terence Crawford: undisputed super middleweight championship – live buildup",
    "url": "https://www.theguardian.com/sport/live/2025/sep/13/canelo-alvarez-v-terence-crawford-undisputed-super-middleweight-championship-live-buildup",
    "image": "https://media.guim.co.uk/f689fe92b311d71ceeb91f0bb6e4f0824731d3a2/547_0_5448_4360/500.jpg",
    "summary": "Canelo Álvarez and Terence Crawford are set to face off at Allegiant Stadium in a highly anticipated boxing match. This event is being hailed as one of the biggest fights in recent years. Bryan Graham provides ongoing coverage of the matchup.",
    "published": "2025-09-14T03:00:05Z"
  },
  {
    "title": "Trump news at a glance: Kirk critics lose jobs amid rancour after killing",
    "url": "https://www.theguardian.com/us-news/2025/sep/14/trump-administration-charlie-kirk-news-updates-latest",
    "image": "https://media.guim.co.uk/56d028a61547d09365f557ce56321e58693d3246/960_155_4037_3230/500.jpg",
    "summary": "On September 13, 2025, multiple firings occurred as authorities sought out comments considered offensive regarding the killing of a conservative free speech advocate. The incident triggered a significant backlash, highlighting tensions surrounding free speech. Key stories from the day reflected ongoing controversies and debates over freedom of expression in light of the event.",
    "published": "2025-09-14T02:21:03Z"
  },
  {
    "title": "Questions linger about alleged shooter’s motivation for killing Charlie Kirk",
    "url": "https://www.theguardian.com/us-news/2025/sep/13/charlie-kirk-killing-alleged-shooter-motivation",
    "image": "https://media.guim.co.uk/f06a1614b64328d1c4c910def1df62c1a5fdf9ed/0_0_4916_3933/500.jpg",
    "summary": "Authorities are investigating the background and political affiliations of a suspect involved in the killing of a far-right influencer. The incident has sparked discussions on extremist views and their implications. Analysts are examining the potential motives behind the crime in the context of current political tensions.",
    "published": "2025-09-14T00:29:56Z"
  },
  {
    "title": "The RBA wants to ban debit and credit card surcharges. Banks are fighting back",
    "url": "https://www.theguardian.com/australia-news/2025/sep/14/rba-plans-ban-debit-credit-card-surcharge-banks-fighting-back",
    "image": "https://media.guim.co.uk/d90e9d34a021def8105aeabb4aef615fa7e88661/106_0_3408_2728/500.jpg",
    "summary": "Banks claim that the RBA and government are not adequately informing consumers about the true costs of recent changes, which include increased fees and diminished loyalty programs. They argue this lack of transparency could mislead customers regarding the impact of these adjustments. The banks are urging for clearer communication to ensure consumers understand the full implications of these financial alterations.",
    "published": "2025-09-14T00:00:18Z"
  }
]