[
  {
    "title": "Arsenal v Chelsea: Women’s Super League – live",
    "url": "https://www.theguardian.com/football/live/2025/nov/08/arsenal-v-chelsea-womens-super-league-live",
    "image": "https://media.guim.co.uk/26787568ccec301a9a823d58b15f94c26b1ab19a/628_0_4283_3426/500.jpg",
    "summary": "The league leaders are set to face the European champions in an eagerly anticipated match. Rob Smyth will provide live, minute-by-minute updates on the game's progress. Fans are excited to see how the two top teams will clash on the field.",
    "published": "2025-11-08T12:36:08Z"
  },
  {
    "title": "Tottenham Hotspur v Manchester United: Premier League – live",
    "url": "https://www.theguardian.com/football/live/2025/nov/08/tottenham-hotspur-v-manchester-united-premier-league-live",
    "image": "https://media.guim.co.uk/f9b795245df7d8a52b55a5ec5e0a86f76fb111e5/904_0_4828_3862/500.jpg",
    "summary": "Ruben Amorim's team aims to continue their unbeaten streak against Spurs. Tim de Lisle provides live updates on the match. Fans can expect an exciting report as the game unfolds.",
    "published": "2025-11-08T12:33:56Z"
  },
  {
    "title": "UK to announce plans to emulate stringent Danish immigration system",
    "url": "https://www.theguardian.com/uk-news/2025/nov/08/uk-to-announce-plans-to-emulate-stringent-danish-immigration-system",
    "image": "https://media.guim.co.uk/ac29920aac59d93ff46d21184a0b92c5e24c337e/1485_50_3787_3030/500.jpg",
    "summary": "Some Labour MPs criticize proposals as a \"dangerous path,\" expressing strong opposition. Meanwhile, other party members urge the government to take more decisive action. The divide highlights differing perspectives within the Labour Party on the issue.",
    "published": "2025-11-08T12:33:52Z"
  },
  {
    "title": "Davina McCall reveals she has undergone surgery for breast cancer",
    "url": "https://www.theguardian.com/tv-and-radio/2025/nov/08/davina-mccall-reveals-she-has-undergone-surgery-for-breast-cancer",
    "image": "https://media.guim.co.uk/617807696077b7441f5499cce4e2b296dc5a08fe/452_0_4996_4000/500.jpg",
    "summary": "The presenter shares her optimism following a successful lumpectomy, reflecting on her positive mindset after early detection of cancer. She emphasizes the importance of proactive health measures in her recovery journey. Her experience serves as an encouraging message about the benefits of early intervention.",
    "published": "2025-11-08T12:30:49Z"
  },
  {
    "title": "Israel’s underground jail, where Palestinians are held without charge and never see daylight",
    "url": "https://www.theguardian.com/world/2025/nov/08/israel-underground-jail-rakefet-palestinians-gaza-detainees",
    "image": "https://media.guim.co.uk/652e619b025bf3802fd8aed957047d7ecdab10cb/164_0_2942_2353/500.jpg",
    "summary": "Detainees at Rakefet include a nurse who has been deprived of natural light since January and a teenager who has been held for nine months. Reports highlight the concerning conditions faced by individuals in custody. Calls for improved treatment and rights for detainees are growing amid these revelations.",
    "published": "2025-11-08T12:24:02Z"
  }
]