[
  {
    "title": "Ex-FBI director James Comey indicted on two charges as Trump pushes to prosecute political enemies",
    "url": "https://www.theguardian.com/us-news/2025/sep/25/james-comey-fbi-director-indictment",
    "image": "https://media.guim.co.uk/0631ddd3b2ed282013f109f7a835197fd8991bb2/1616_265_3188_2550/500.jpg",
    "summary": "James Comey, the former FBI director and frequent target of Donald Trump, has been indicted on charges of making false statements and obstructing a congressional proceeding. This indictment adds to the ongoing scrutiny surrounding Comey's actions during his tenure. The legal developments have reignited debates over his role in high-profile investigations.",
    "published": "2025-09-26T11:15:12Z"
  },
  {
    "title": "Benjamin Netanyahu set for defiant UN speech as Trump warns on annexation of West Bank - Middle East crisis live",
    "url": "https://www.theguardian.com/world/live/2025/sep/26/gaza-israel-benjamin-netanyahu-un-united-nations-unga-west-bank-donald-trump-middle-east-crisis-live",
    "image": "https://media.guim.co.uk/1fc57891ee0a2f8bc46d0b0ee6d7172966c3ac3c/691_0_4466_3572/500.jpg",
    "summary": "Israeli Prime Minister is poised to deliver a strong statement at the UN General Assembly, opposing the establishment of a Palestinian state. His remarks are anticipated to reflect Israel's steadfast position on the issue. The speech comes amid ongoing tensions in the region.",
    "published": "2025-09-26T11:14:32Z"
  },
  {
    "title": "Ryder Cup 2025: USA v Europe day one updates – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/26/ryder-cup-2025-day-one-golf-europe-usa-bethpage-black-live",
    "image": "https://media.guim.co.uk/4c8bbd7847e8c8e7b22e5f0cdec1d135dc3d85c9/977_0_5000_4000/500.jpg",
    "summary": "Live updates are being provided for the opening rounds of the foursomes and fourballs at Bethpage. Writers are offering hole-by-hole coverage to keep fans informed. Stay tuned for the latest developments from the event.",
    "published": "2025-09-26T11:14:32Z"
  },
  {
    "title": "Liverpool’s Leoni out for season with ACL injury: Premier League and WSL news – live",
    "url": "https://www.theguardian.com/football/live/2025/sep/26/premier-league-and-wsl-team-news-europa-league-reaction-and-more-live",
    "image": "https://media.guim.co.uk/6a018a92ffeeaf94c474270cd9f8cc7a9fab2a06/415_0_3431_2746/500.jpg",
    "summary": "This weekend features an action-packed schedule in both the Premier League and Women's Super League (WSL). Our writers will provide insights, previews, and commentary as teams prepare for their matches. Stay tuned for updates on player performances and key matchups.",
    "published": "2025-09-26T11:13:25Z"
  },
  {
    "title": "Digested week: Jimmy Kimmel becomes unexpected hero of history",
    "url": "https://www.theguardian.com/uk-news/2025/sep/26/digested-week-jimmy-kimmel-unexpected-hero-history",
    "image": "https://media.guim.co.uk/2cc920ad3c10ae1281dcda215083179814a48120/879_91_3571_2857/500.jpg",
    "summary": "At the UN, Trump publicly criticizes Europe, sparking significant backlash. Meanwhile, Hollywood provides a moment of levity amid the tension. The contrasting events highlight the ongoing political divide and the need for balance in public discourse.",
    "published": "2025-09-26T11:11:20Z"
  }
]