[
  {
    "title": "Utah officials share video of Charlie Kirk shooting suspect as governor pledges death penalty - live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/11/charlie-kirk-shot-latest-news-updates-utah-university-donald-trump",
    "image": "https://media.guim.co.uk/d8cfa6157556efb50498631a804138f433f155df/0_0_2500_2000/500.jpg",
    "summary": "A briefing was held after four new images of a suspect were released in a criminal case. Authorities are seeking information from the public and have offered a reward of $100,000 for tips leading to the suspect's capture. The investigation continues as efforts intensify to gather leads.",
    "published": "2025-09-12T03:00:56Z"
  },
  {
    "title": "News live: former Virgin Australia boss Jayne Hrdlicka exits with $50m package; NSW police seize $1m of cannabis plants at suburban home",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/12/anthony-albanese-pacific-islands-forum-woodside-north-west-shelf-decision-sussan-ley-labor-coalition-ntwnfb",
    "image": "https://media.guim.co.uk/a376a6ee2ccfd8b633347bf4d96bfc177158ecec/1226_0_6880_5504/500.jpg",
    "summary": "Stay informed with real-time updates on current events. Access the latest news developments as they unfold. Get timely insights and information from various sources.",
    "published": "2025-09-12T02:52:09Z"
  },
  {
    "title": "A one-man headline machine? Murdoch tabloid spins Ray Hadley’s sprays as ‘exclusive’ news stories | Weekly Beast",
    "url": "https://www.theguardian.com/media/commentisfree/2025/sep/12/murdoch-tabloid-daily-telegraph-spins-ray-hadleys-content-as-exclusive-news-stories",
    "image": "https://media.guim.co.uk/4b8ade70468be18054b29c4c09688f3df8916172/1086_375_1930_1544/500.jpg",
    "summary": "Short videos featuring the former shock jock are receiving increased attention and prominence. In addition, ABC has announced the hiring of new investigative reporters to enhance its journalistic coverage. This move reflects the network's commitment to bolstering its news team and storytelling capabilities.",
    "published": "2025-09-12T02:44:38Z"
  },
  {
    "title": "Charlie Kirk’s body flown back to Arizona as search for suspect continues",
    "url": "https://www.theguardian.com/us-news/2025/sep/11/charlie-kirk-shooting-police-search-for-suspect-amid-condemnation-of-targeted-killing",
    "image": "https://media.guim.co.uk/3726e22b0eda208b058475b02739ddaf060188af/155_0_4870_3895/500.jpg",
    "summary": "Vice President JD Vance accompanied a casket during a recent flight as authorities revealed that a rifle had been discovered in connection with an ongoing investigation. Images of the suspect were also made public to aid in the investigation. This incident highlights ongoing concerns regarding safety and law enforcement response.",
    "published": "2025-09-12T02:36:59Z"
  },
  {
    "title": "The Crunch: dwindling support for Keir Starmer; tracking US deportation flights; and the decline in religion",
    "url": "https://www.theguardian.com/news/2025/sep/12/the-crunch-dwindling-support-for-keir-starmer-tracking-us-deportation-flights-and-the-decline-in-religion",
    "image": "https://media.guim.co.uk/8becc8f33212235bbb8a31231597ef227b0263f2/373_0_1440_1152/500.jpg",
    "summary": "The British prime minister is gaining attention internationally, largely for his low approval rating among voters. This situation highlights a disconnect between his government policies and public sentiment. The prime minister's struggles could influence his effectiveness in international diplomacy and domestic governance.",
    "published": "2025-09-12T01:59:07Z"
  }
]