[
  {
    "title": "Australia news live: PM meets Xi on Apec summit sidelines; Ley and Tehan spruik nuclear after Coalition’s net zero meeting",
    "url": "https://www.theguardian.com/australia-news/live/2025/oct/31/australia-news-live-politics-parliament-coalition-labor-net-zero-anthony-albanese-sussan-ley-epbc-nature-laws-ntwnfb",
    "image": "https://media.guim.co.uk/db704c65440bebfcd1ee82daa80ca073ea9ee4bc/0_621_1639_1311/500.jpg",
    "summary": "I apologize, but I need more context or details about the news you would like summarized. Could you please provide the information you want me to summarize?",
    "published": "2025-10-31T04:07:20Z"
  },
  {
    "title": "Australia’s first formal treaty with Indigenous traditional owners passed in Victoria",
    "url": "https://www.theguardian.com/australia-news/2025/oct/31/australia-first-formal-treaty-indigenous-traditional-owners-passed-victoria",
    "image": "https://media.guim.co.uk/713b977cb99c0ff12e4349b43b8170675f4a56a5/558_0_5580_4464/500.jpg",
    "summary": "Premier Jacinta Allan described a recent development as a historic moment for reconciliation, empowering Aboriginal Australians to influence policies that impact their lives. This step is seen as a significant advancement towards greater inclusion and recognition of Indigenous voices in governance. The move has been widely praised for its potential to foster a more equitable society.",
    "published": "2025-10-31T02:52:44Z"
  },
  {
    "title": "More than half of Americans disapprove of Trump demolishing East Wing – poll",
    "url": "https://www.theguardian.com/us-news/2025/oct/30/americans-disapprove-trump-east-wing-poll",
    "image": "https://media.guim.co.uk/f7ef9c9cdf0f0891743c53e071da9e4e554c48f9/313_61_1000_801/500.jpg",
    "summary": "A recent survey indicates that while one-third of respondents support the president, 56% oppose a specific action he has taken. This suggests a significant level of discontent with his policies among the populace. The findings highlight a divide in public opinion regarding the president's decisions.",
    "published": "2025-10-31T01:50:45Z"
  },
  {
    "title": "Hurricane Melissa heads to Bermuda as relief efforts intensify in Jamaica",
    "url": "https://www.theguardian.com/world/2025/oct/30/hurricane-melissa-bermuda-leaving-devastation-jamaica",
    "image": "https://media.guim.co.uk/54e96ff0deedfce38d5b975b2657bf6c5ef333f5/60_0_2500_2000/500.jpg",
    "summary": "Kingston airport has resumed operations for aid flights as parts of Jamaica experience severe flooding, impacting several towns and causing downed power lines. The recent storm has led to an increased death toll, now reaching 44. Efforts are underway to provide assistance to those affected by the disaster.",
    "published": "2025-10-31T01:50:16Z"
  },
  {
    "title": "‘Yes, we’ve been to the moon before’: Nasa rebuffs Kim Kardashian conspiracy theory",
    "url": "https://www.theguardian.com/science/2025/oct/30/nasa-kim-kardashian-moon-landings",
    "image": "https://media.guim.co.uk/d169fa810e9dc81d087407451d08e5c338e73084/326_0_5319_4255/500.jpg",
    "summary": "NASA chief Sean Duffy reaffirmed the authenticity of the 1969 moon landing after a U.S. celebrity claimed on a TV show that it was fake. Duffy emphasized the extensive evidence supporting the historic event. The statement comes amid ongoing conspiracy theories surrounding the moon landing.",
    "published": "2025-10-31T01:25:08Z"
  }
]