[
  {
    "title": "Five Great Reads: mafia-adjacent snails, the first Aboriginal bilingual school in NSW, and the best songs of 2025",
    "url": "https://www.theguardian.com/australia-news/2025/dec/06/five-great-reads-snails-indigenous-school-best-songs",
    "image": "https://media.guim.co.uk/43f0fb8ba230d259f2f92ae2bc448ecea724a489/0_1515_4000_3200/500.jpg",
    "summary": "Guardian Australia provided a weekly overview of key articles curated by Imogen Dewey, highlighting significant news and insights from the past week. The wrap covers various topics, offering readers essential context and perspectives. This selection aims to keep audiences informed about crucial developments in Australia and beyond.",
    "published": "2025-12-05T21:00:33Z"
  },
  {
    "title": "Corrections and clarifications",
    "url": "https://www.theguardian.com/news/2025/dec/05/corrections-and-clarifications",
    "summary": "The Weirdos Book Club is hosting a summit at Fools Gold, focusing on eclectic literature and community engagement. Attendees will discuss unique book selections and share their perspectives in a welcoming environment. The event aims to foster creativity and connection among book enthusiasts.",
    "published": "2025-12-05T21:00:33Z"
  },
  {
    "title": "US citizen chased by ICE in New Orleans says she was targeted because ‘I’m brown’",
    "url": "https://www.theguardian.com/us-news/2025/dec/05/us-citizen-chased-ice-agents-new-orleans",
    "image": "https://media.guim.co.uk/fd0f28054645fd05ab4d56202420a6092b74ffe9/690_0_6895_5516/500.jpg",
    "summary": "Home security footage captures 23-year-old Jacelynn Guzman confronting masked federal agents who were pursuing her. In the video, she can be heard telling the agents to “leave me alone.” The incident highlights ongoing concerns about federal enforcement actions.",
    "published": "2025-12-05T20:54:18Z"
  },
  {
    "title": "World Cup 2026 draw: England to meet Croatia, Brazil await Scotland, USA will face Australia – as it happened",
    "url": "https://www.theguardian.com/football/live/2025/dec/05/world-cup-2026-draw-updates-usa-mexico-canada",
    "image": "https://media.guim.co.uk/e375aa0f1405face2949e5854c716080a2bd03a6/607_83_3860_3088/500.jpg",
    "summary": "In a bizarre ceremony, Donald Trump entertained attendees by dancing to the Village People's music, creating a spectacle that felt both captivating and surreal. The event blurred the lines between reality and a dreamlike experience. Observers were left both amused and bewildered by the unique performance.",
    "published": "2025-12-05T20:54:11Z"
  },
  {
    "title": "Supreme court to decide legality of Trump’s order to restrict birthright citizenship – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/dec/05/trump-pete-hegseth-signal-politics-updates",
    "image": "https://media.guim.co.uk/c55cb65a49483a4c16aed7253602e734516d69ec/456_0_4560_3648/500.jpg",
    "summary": "The court has not set a date for oral arguments but is expected to do so in the coming months. This indicates ongoing legal proceedings. Further updates are anticipated soon.",
    "published": "2025-12-05T20:54:02Z"
  }
]