[
  {
    "title": "Tory plan to scrap green energy measures called ‘contradictory nonsense’ by environment groups – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/oct/06/conservative-tory-party-conference-spending-welfare-immigration-labour-starmer-reform-uk-politics-live-news-updates",
    "image": "https://media.guim.co.uk/4f5940c689bb3410e38d346c06667ed9988d8ece/575_0_6830_5464/500.jpg",
    "summary": "The shadow energy secretary's proposals for energy policy have been criticized as \"dead wrong\" by various environmental groups. They argue that the plans do not align with necessary climate action and sustainable practices. This backlash highlights ongoing tensions between political agendas and environmental priorities.",
    "published": "2025-10-06T13:28:14Z"
  },
  {
    "title": "Bari Weiss named editor-in-chief of CBS News as Paramount buys Free Press startup",
    "url": "https://www.theguardian.com/media/2025/oct/06/bari-weiss-cbs-news-paramount-free-press",
    "image": "https://media.guim.co.uk/a817f12baf2b9c9dab4e95908a083dada00f1e71/387_0_4349_3479/500.jpg",
    "summary": "A prominent commentator is set to lead a renowned U.S. news network, marking a significant return to the media landscape. This appointment comes five years after a contentious departure from the New York Times. The move has generated considerable interest in how it may reshape the network's direction and reporting style.",
    "published": "2025-10-06T13:26:26Z"
  },
  {
    "title": "Greta Thunberg among 171 Gaza flotilla activists deported by Israel; ceasefire negotiations due to begin in Egypt – Middle East crisis live",
    "url": "https://www.theguardian.com/world/live/2025/oct/06/gaza-ceasefire-peace-talks-hamas-israel-trump-egypt-middle-east-crisis-live-news-updates",
    "image": "https://media.guim.co.uk/de1040bdee960f6c30a1c07feece2f53da23ae6a/114_17_688_550/500.jpg",
    "summary": "Activists have been deported to Greece and Slovakia amid ongoing tensions. Simultaneously, negotiations involving the US, Israel, and Hamas are set to commence. The discussions are aimed at addressing the escalating conflict.",
    "published": "2025-10-06T13:26:01Z"
  },
  {
    "title": "Judge blocks Trump’s bid to deploy national guard to Oregon – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/06/donald-trump-national-guard-ice-government-shutdown-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/9722523b75c9a89a5eb36f832f76e5a48ed481b9/139_0_4583_3667/500.jpg",
    "summary": "A ruling by US District Judge Karin Immergut has temporarily halted any deployment to Portland for two weeks. This decision comes as legal disputes surrounding the situation continue. The delay allows for further examination of the ongoing legal issues.",
    "published": "2025-10-06T13:20:43Z"
  },
  {
    "title": "Jimmy Kimmel more popular than Trump after show suspension, poll finds",
    "url": "https://www.theguardian.com/us-news/2025/oct/06/jimmy-kimmel-trump-poll",
    "image": "https://media.guim.co.uk/34434b4557a0891aaf070475eeaf86d269fb1005/250_0_2500_2000/500.jpg",
    "summary": "A recent Economist and YouGov poll revealed that the president has a 16-point popularity deficit compared to a late-night host. This indicates a significant gap in public favorability between the two figures. The findings may reflect broader trends in public opinion regarding political leadership and entertainment.",
    "published": "2025-10-06T13:10:36Z"
  }
]