[
  {
    "title": "Formula One: Qatar Grand Prix qualifying after Piastri wins sprint race – live",
    "url": "https://www.theguardian.com/sport/live/2025/nov/29/formula-one-qatar-sprint-race-grand-prix-qualifying-live-updates",
    "image": "https://media.guim.co.uk/94630f1dbbe40442bda1b4fe87b61810a52103de/1059_405_1689_1351/500.jpg",
    "summary": "In a dramatic conclusion in Las Vegas, attention turns to who will step up and take the lead. Philip Cornwall will provide insights and updates on the situation. Stay tuned for developments in this unfolding story.",
    "published": "2025-11-29T18:27:04Z"
  },
  {
    "title": "Strictly Come Dancing: week 10 – live",
    "url": "https://www.theguardian.com/tv-and-radio/live/2025/nov/29/strictly-come-dancing-week-10-live",
    "image": "https://media.guim.co.uk/5a28522e7f74e6e68d8798508147cd93c12b0c6e/0_311_2841_2271/500.jpg",
    "summary": "The couples return to Elstree Studios for the inaugural Instant Dance challenge, featuring routines set to music by Lady Gaga, Frank Sinatra, and Tina Turner. The competition promises to be exciting as participants strive to impress the judges. Ultimately, the question remains: who will emerge as the best performer of the night?",
    "published": "2025-11-29T18:25:42Z"
  },
  {
    "title": "Everton v Newcastle: Premier League – live",
    "url": "https://www.theguardian.com/football/live/2025/nov/29/everton-v-newcastle-premier-league-live",
    "image": "https://media.guim.co.uk/acfc8f5cce78d5036496d387659c20080a841a5c/1053_268_2262_1809/500.jpg",
    "summary": "David Moyes' team seeks to extend their winning streak while Eddie Howe's Newcastle looks to recover from a recent loss in Marseille. The match promises high tension as both sides aim for a crucial victory. Follow the minute-by-minute updates provided by Rob Smyth.",
    "published": "2025-11-29T18:25:38Z"
  },
  {
    "title": "England v China: women’s friendly football international – live",
    "url": "https://www.theguardian.com/football/live/2025/nov/29/england-v-china-womens-friendly-football-international-live",
    "image": "https://media.guim.co.uk/55a342d88b001fa28892eaa2c8636ad64eea3444/94_147_1904_1523/500.jpg",
    "summary": "Sarina Wiegman's team aims to capitalize on their recent win over Australia as they face China in an upcoming match. The excitement builds around whether they can maintain momentum or if China will deliver an unexpected result. Coverage will be provided by Sarah Rendell in a minute-by-minute report.",
    "published": "2025-11-29T18:24:26Z"
  },
  {
    "title": "With his restless imagination, Tom Stoppard showed us a mind on the move",
    "url": "https://www.theguardian.com/stage/2025/nov/29/tom-stoppard-czech-playwright-intellectual-farce-drama-verbal-language",
    "image": "https://media.guim.co.uk/8540caceebfccc9048637e6ed3fd270a52314307/0_1101_5448_3266/500.jpg",
    "summary": "The Czech-born playwright explored themes of an unrealistic utopia and the complexities of home in his works. His plays often depicted a quest for an implausible paradise. Through his storytelling, he invited audiences to reflect on the nature of aspiration and belonging.",
    "published": "2025-11-29T17:47:57Z"
  }
]