[
  {
    "title": "Aston Villa v Bologna, Rangers v Genk, and more: Europa League – live",
    "url": "https://www.theguardian.com/football/live/2025/sep/25/aston-villa-v-bologna-rangers-v-genk-and-more-europa-league-live",
    "image": "https://media.guim.co.uk/30709c2ad7302a2814ac3e5b1e959fe8c2f26c74/993_211_3689_2951/500.jpg",
    "summary": "Daniel Harris will provide updates on Thursday's Europa League matches featuring Unai Emery's team as they kick off their campaign. The coverage will include key highlights and developments from the games. Fans can expect timely insights and analysis throughout the matches.",
    "published": "2025-09-25T20:17:32Z"
  },
  {
    "title": "Sonny Curtis obituary",
    "url": "https://www.theguardian.com/music/2025/sep/25/sonny-curtis-obituary",
    "image": "https://media.guim.co.uk/46e3f0cfec2b1d4a1d756b4c34b524e266af7fc4/127_830_3351_2681/500.jpg",
    "summary": "The singer and guitarist of the Crickets, known for writing hundreds of songs, including the iconic track \"I Fought the Law,\" has passed away. This song gained renewed fame when it was covered by the Clash. The artist's contributions to music have left a lasting impact on the rock genre.",
    "published": "2025-09-25T20:07:51Z"
  },
  {
    "title": "Dallas shooting suspect left ‘anti-Ice’ notes but wasn’t part of any specific group, officials say",
    "url": "https://www.theguardian.com/us-news/2025/sep/25/dallas-texas-ice-shooting-suspect",
    "image": "https://media.guim.co.uk/b369f4038d75f9540247c89fec9458902c16e19d/718_0_6582_5264/500.jpg",
    "summary": "Texas authorities report that the shooting at an ICE detention center involved significant premeditation. The incident is being investigated thoroughly to determine the intentions behind the attack. No further details about the shooter or casualties have been disclosed at this time.",
    "published": "2025-09-25T20:06:35Z"
  },
  {
    "title": "Washington backing plan for Tony Blair to head transitional Gaza authority",
    "url": "https://www.theguardian.com/world/2025/sep/25/washington-backing-plan-for-tony-blair-to-head-transitional-gaza-authority",
    "image": "https://media.guim.co.uk/5c440a4316513164229fe33111e12ea35f667de2/297_0_4190_3354/500.jpg",
    "summary": "A new proposal suggests establishing an international authority to govern Gaza for up to five years, challenging the UN's initiative for a quicker transition to Palestinian self-rule. This plan aims to stabilize the region amid ongoing conflict. The contrasting approaches underscore differing visions for Gaza's future governance.",
    "published": "2025-09-25T20:03:53Z"
  },
  {
    "title": "I am 86 and on my own. How do I get to know my nice neighbour better? | Leading questions",
    "url": "https://www.theguardian.com/lifeandstyle/2025/sep/26/i-am-86-and-on-my-own-how-do-i-get-to-know-my-nice-neighbour-better",
    "image": "https://media.guim.co.uk/0afe109464265434a661f1eed19b1fd77b85dfda/496_0_3435_2748/500.jpg",
    "summary": "Advice columnist Eleanor Gordon-Smith discusses the awkwardness of advancing a relationship. She suggests that finding a specific activity to do together can help ease this tension. Engaging in shared experiences can strengthen connections and make the process smoother.",
    "published": "2025-09-25T20:00:46Z"
  }
]