[
  {
    "title": "Lecornu bemoans lack of compromise across political spectrum as he resigns as French PM – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/oct/06/france-pm-resigns-lecornu-macron-europe-live-news-updates",
    "image": "https://media.guim.co.uk/4d8af5f1370c2a742772a6054812c2fbd671885c/903_0_4489_3592/500.jpg",
    "summary": "The departure comes after intense backlash against President Macron's new cabinet. This criticism arose within just a month of its formation. The swift exit highlights ongoing tensions surrounding Macron's government choices.",
    "published": "2025-10-06T10:21:22Z"
  },
  {
    "title": "Gaza ceasefire talks live: Israeli airstrikes continue with negotiations due to begin in Egypt",
    "url": "https://www.theguardian.com/world/live/2025/oct/06/gaza-ceasefire-peace-talks-hamas-israel-trump-egypt-middle-east-crisis-live-news-updates",
    "image": "https://media.guim.co.uk/77ffa5338dab959754bd7baa17c38be9d8403031/357_0_4748_3798/500.jpg",
    "summary": "Negotiators from the US, Israel, and Hamas are set to commence talks in Egypt. The US president indicated that the initial phase of discussions should be wrapped up within the week. This engagement aims to address ongoing tensions and conflicts in the region.",
    "published": "2025-10-06T10:19:44Z"
  },
  {
    "title": "Fianna Fáil’s Jim Gavin withdraws from Irish presidential race",
    "url": "https://www.theguardian.com/world/2025/oct/06/fianna-fail-jim-gavin-withdraws-ireland-presidential-election-race",
    "image": "https://media.guim.co.uk/ef002bfbb5983d20a190a85ca1cb2a3562b1452d/200_0_3500_2800/500.jpg",
    "summary": "The upcoming election has turned into an unpredictable two-horse race after a political novice withdrew from the competition due to revelations about their debts. This development has reshaped the political landscape, leaving the remaining candidates to vie for voter support. The exit of the novice highlights the impact of personal financial issues on public perception and electoral viability.",
    "published": "2025-10-06T10:15:42Z"
  },
  {
    "title": "Euro and Paris stock market slide amid French political crisis; gold at record high near $4,000 per ounce – business live",
    "url": "https://www.theguardian.com/business/live/2025/oct/06/yen-slumps-nikkei-record-sanae-takaichi-wins-election-gold-nears-4000-rally-continues-business-live-news",
    "image": "https://media.guim.co.uk/bcc4965e0a3de7e5575e75c132ebc3449419bcc8/553_0_5525_4420/500.jpg",
    "summary": "France's Prime Minister has resigned unexpectedly, creating uncertainty in the government's economic policies. This development has prompted rolling coverage as analysts assess potential impacts on the country's financial landscape. Markets are closely watching for any immediate effects on economic stability and leadership succession.",
    "published": "2025-10-06T10:15:37Z"
  },
  {
    "title": "US to deport 11 more people to Eswatini in deal criticised by lawyers and NGOs",
    "url": "https://www.theguardian.com/world/2025/oct/06/us-deportees-eswatini-lawyers-ngos",
    "image": "https://media.guim.co.uk/d5c4426fa57707b960e9d53904d4d7669a245546/821_0_4092_3275/500.jpg",
    "summary": "An African kingdom has announced plans to detain migrants in a secured area and repatriate them to their countries of origin. The move comes amid growing human rights concerns regarding the treatment of migrants. Critics argue that such measures could violate international human rights standards.",
    "published": "2025-10-06T10:08:47Z"
  }
]