[
  {
    "title": "US government shutdown: Donald Trump promises firings and cuts to ‘Democrats’ favorite projects’ if shutdown continues – live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/02/government-shutdown-trump-democrats-latest-updates",
    "image": "https://media.guim.co.uk/c3e5ae42cde3fc08bf667034b821b3fbbb11cc0d/384_0_4252_3402/500.jpg",
    "summary": "In a recent interview with OAN, the President expressed a desire to \"survive\" when questioned about his future plans for the 2026 elections. His comments hint at uncertainty regarding his political future. The statement has drawn attention as it reflects ongoing challenges within his administration.",
    "published": "2025-10-03T01:17:05Z"
  },
  {
    "title": "Australia news live: police and pro-Palestine protesters to meet over Opera House march; Mokbel convictions overturned in Lawyer X appeal",
    "url": "https://www.theguardian.com/australia-news/live/2025/oct/03/png-agreement-aukus-submarines-pact-anthony-albanese-richard-marles-retired-admiral-slams-aukus-deal-gaza-flotilla-intercepted-ntwnfb",
    "image": "https://media.guim.co.uk/3cd44eb05131cb8c2ba8fc9bc70f7eb6917f1f11/322_0_2500_2000/500.jpg",
    "summary": "I'm unable to access live news updates, but I can help summarize information if you can provide specific articles or topics. Let me know what you'd like to know more about!",
    "published": "2025-10-03T01:14:11Z"
  },
  {
    "title": "Public hospital psychiatrists to receive 20% pay rise after winning dispute with NSW Health",
    "url": "https://www.theguardian.com/australia-news/2025/oct/03/public-hospital-psychiatrists-to-receive-20-pay-rise-after-winning-dispute-with-nsw-health",
    "image": "https://media.guim.co.uk/4f626dddb54822f02d1819ab3c4bba42575757b6/126_47_3649_2919/500.jpg",
    "summary": "The State's Industrial Relations Commission issued a decision following a threat by 200 doctors to resign in January. This move highlighted ongoing tensions in the healthcare sector regarding working conditions. The ruling aims to address these issues and prevent a potential staffing crisis.",
    "published": "2025-10-03T00:56:28Z"
  },
  {
    "title": "Wallabies look to end Rugby Championship on high with turbulent times ahead | Jack Snape",
    "url": "https://www.theguardian.com/sport/blog/2025/oct/03/wallabies-look-to-end-rugby-championship-on-high-with-turbulent-times-ahead",
    "image": "https://media.guim.co.uk/6b0b67d2c8dead19ef506c5b61d00d5fc455f8d9/859_0_4296_3437/500.jpg",
    "summary": "Australia is concentrating on defeating the All Blacks this Saturday; however, significant upheaval is expected in their Rugby 360 (R360) program. A coaching change is anticipated in the coming months. This dual focus on immediate competition and future restructuring highlights the challenges ahead for Australian rugby.",
    "published": "2025-10-03T00:41:47Z"
  },
  {
    "title": "Working these school holidays? Lower your expectations, ditch the plans and embrace the ‘good enough’ parenting approach | Sarah Ayoub",
    "url": "https://www.theguardian.com/commentisfree/2025/oct/03/working-these-school-holidays-lower-your-expectations-ditch-the-plans-and-embrace-the-good-enough-parenting-approach",
    "image": "https://media.guim.co.uk/3ab109dcbedc9e8ea1581d08d5a86da6a07d4f28/71_0_5445_4357/500.jpg",
    "summary": "The author reflects on an unexpected downturn during the holidays. They share how adopting a day-by-day approach helped them cope with the situation. This shift in perspective brought a sense of relief amidst the challenges.",
    "published": "2025-10-03T00:26:43Z"
  }
]