[
  {
    "title": "WSL: Chelsea v Tottenham, Everton v Manchester United and more – matchday live",
    "url": "https://www.theguardian.com/football/live/2025/oct/12/world-cup-qualifiers-wsl-updates-and-football-news-matchday-live",
    "image": "https://media.guim.co.uk/3aa18b8eab43cb4b24b0449ce960d107a69ef89d/204_149_4377_3502/500.jpg",
    "summary": "Today's Women's Super League matches are underway, with live updates provided by our writers. Stay tuned for breaking football news as the games progress. Follow along for the latest insights and developments.",
    "published": "2025-10-12T11:12:21Z"
  },
  {
    "title": "Women’s Cricket World Cup: Australia v India – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/12/womens-cricket-world-cup-australia-v-india-live-updates-scores-results-teams-squads-start-time-visakhapatnam",
    "image": "https://media.guim.co.uk/3d568fb2464b9a30c51a5e1d5118cc9772978aa6/237_0_2929_2343/500.jpg",
    "summary": "In a high-stakes ODI match in Visakhapatnam, two heavyweight teams aim to establish dominance during the group stage. The game promises to showcase top-level cricket as both sides compete fiercely. Megan Maurice will provide an over-by-over report on the unfolding action.",
    "published": "2025-10-12T11:11:50Z"
  },
  {
    "title": "‘I wanted to write more than I wanted to have children’: author Sarah Perry on rejecting motherhood",
    "url": "https://www.theguardian.com/books/2025/oct/12/i-wanted-to-write-more-than-i-wanted-to-have-children-author-sarah-perry-on-rejecting-motherhood",
    "image": "https://media.guim.co.uk/6bb033306c2454184164875187eccf11169298b4/0_517_6192_4954/500.jpg",
    "summary": "When a novelist grappled with the choice between undergoing fertility treatment and advancing her career, she chose to prioritize her literary ambitions. This decision highlights the tension many face between personal desires and professional goals. Ultimately, her passion for writing took precedence over starting a family.",
    "published": "2025-10-12T11:00:52Z"
  },
  {
    "title": "Trump officials reportedly consider selling student loan debt to private investors",
    "url": "https://www.theguardian.com/us-news/2025/oct/12/trump-sell-student-loan-debt",
    "image": "https://media.guim.co.uk/b7344aabdd1d092b27ff2a1764e7f0c72d781965/499_0_5001_4000/500.jpg",
    "summary": "Experts warn that a recent decision may undermine the federal government's authority to cancel student loans. This change could have significant implications for borrowers seeking relief from educational debt. The potential shift raises concerns about the future of student loan forgiveness programs.",
    "published": "2025-10-12T11:00:51Z"
  },
  {
    "title": "Dining across the divide: ‘He was shocked when I told him that schools weaponise anxiety’",
    "url": "https://www.theguardian.com/lifeandstyle/2025/oct/12/dining-across-the-divide-patrick-molly",
    "image": "https://media.guim.co.uk/6bf4be49feb42be2ae242d4a69f2ff7fe6623290/491_0_4811_3849/500.jpg",
    "summary": "Two individuals with differing views on the school system and a shared interest in knitting are exploring their perspectives on artificial intelligence. Despite their disagreements, they are open to dialogue. The discussion highlights the potential for finding common ground on complex topics.",
    "published": "2025-10-12T11:00:51Z"
  }
]