[
  {
    "title": "Reform branded ‘threat to democracy’ over Farage plan to remove thousands of migrants with leave to be in UK – politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/22/reform-labour-keir-starmer-nigel-farage-immigration-latest-uk-politics-updates",
    "image": "https://media.guim.co.uk/cb6480b92e020a06bd2a4baec6b416ebe942839b/884_0_4549_3640/500.jpg",
    "summary": "Nigel Farage announced that Reform UK plans to eliminate the primary pathway for migrants seeking British citizenship. The proposal aims to overhaul existing immigration policies. This move reflects ongoing debates around immigration and citizenship in the UK.",
    "published": "2025-09-22T10:40:18Z"
  },
  {
    "title": "European officials warn Israel not to annex parts of West Bank in response to recognition of Palestinian state – Middle East crisis live",
    "url": "https://www.theguardian.com/world/live/2025/sep/22/palestinian-state-gaza-israel-middle-east-hamas-benjamin-netanyahu-latest-live-updates",
    "image": "https://media.guim.co.uk/1c0672a7b0933d95884d80f89d0fadb88553a74f/293_0_4583_3667/500.jpg",
    "summary": "On Sunday, the UK, Australia, Canada, and Portugal officially recognized Palestinian statehood. France is expected to follow suit shortly. This move highlights increasing international support for Palestine amid ongoing geopolitical tensions.",
    "published": "2025-09-22T10:40:05Z"
  },
  {
    "title": "Trump hails Charlie Kirk as ‘a martyr for America’s freedom’ at memorial – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/22/donald-trump-charlie-kirk-autism-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/7ea196a4961df85559e748f9058e338b0e938f27/193_0_1815_1452/500.jpg",
    "summary": "The president's expression of animosity towards his rivals starkly contrasts with Erika Kirk's heartfelt forgiveness of the individual charged with her husband's murder. While the president's message emphasizes division, Kirk's response highlights compassion and reconciliation in a time of grief. This juxtaposition raises questions about leadership styles and personal responses to tragedy.",
    "published": "2025-09-22T10:35:15Z"
  },
  {
    "title": "UN security council to meet to discuss growing concerns over Russian provocations in eastern Europe – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/sep/22/latest-europe-news-russia-estonia-un-united-nations-security-live-latest-updates",
    "image": "https://media.guim.co.uk/bede7b5fb8e9922b7fab81bfbbbb8ccb5436a9e4/443_198_1619_1295/500.jpg",
    "summary": "Warnings have been issued about a potential \"serious conflict\" if Russia continues its provocative actions by infringing on NATO airspace. NATO officials express concern over escalating tensions due to these violations. The situation highlights the fragility of European security in the face of ongoing geopolitical challenges.",
    "published": "2025-09-22T10:32:52Z"
  },
  {
    "title": "Reeves says Gatwick second runway will boost UK; Trump’s $100,000 H-1B fee ‘will hurt US growth’ – business live",
    "url": "https://www.theguardian.com/business/live/2025/sep/22/rachel-reeves-gatwick-second-runway-growth-jobs-environmental-disaster-business-live-news",
    "image": "https://media.guim.co.uk/98d32f79f771396c5070d1197b355c9d7ee69fd2/421_0_4448_3558/500.jpg",
    "summary": "Green Party spokesperson Zack Polanski has criticized the decision to approve a second runway at Gatwick Airport, calling it a \"disaster.\" The news highlights ongoing debates surrounding economic and environmental impacts of airport expansions. Coverage continues to provide insights into the implications for local communities and climate change.",
    "published": "2025-09-22T10:28:55Z"
  }
]