[
  {
    "title": "Novak Djokovic fights past Cameron Norrie to become oldest man to reach US Open fourth round since 1991",
    "url": "https://www.theguardian.com/sport/2025/aug/30/us-open-tennis-novak-djokovic-cameron-norrie",
    "image": "https://media.guim.co.uk/86d6d32551e0b2ddb70d2d23e76d6a40627484da/556_0_4922_3937/500.jpg",
    "summary": "The Serbian tennis player achieved victory in his best performance of the tournament, showcasing impressive skills on the court. However, he expressed frustration over ongoing difficulties with his movement. Despite the win, he acknowledged the challenges he faces physically during matches.",
    "published": "2025-08-30T05:24:03Z"
  },
  {
    "title": "Australian government criticised over ‘disgraceful’ $400m deal to deport foreign-born former detainees to Nauru",
    "url": "https://www.theguardian.com/australia-news/2025/aug/30/australia-signs-400m-deal-to-deport-foreign-born-former-detainees-to-nauru",
    "image": "https://media.guim.co.uk/c17a144cce0cd6567e332e6037b4927a91eacb75/534_0_6089_4872/500.jpg",
    "summary": "Home Affairs Minister Tony Burke signed an agreement regarding the NZYQ cohort, who had been subject to indefinite immigration detention. This new agreement aims to address the situation of these individuals. The development marks a significant change in their immigration status.",
    "published": "2025-08-30T05:03:57Z"
  },
  {
    "title": "From Caught Stealing to CMAT: your complete entertainment guide to the week ahead",
    "url": "https://www.theguardian.com/culture/2025/aug/30/going-out-staying-in-conmplete-guide-weeks-entertainment",
    "image": "https://media.guim.co.uk/dae2fcc2ee9bf5048b67ac84212bc085c6c65cb1/0_0_5000_4000/500.jpg",
    "summary": "Darren Aronofsky has announced a new crime film featuring Austin Butler. Meanwhile, a popular singer-songwriter is set to release her highly anticipated third album. Both projects are generating excitement in the entertainment industry.",
    "published": "2025-08-30T05:00:55Z"
  },
  {
    "title": "Blind date: ‘She loves rock music and even knew the song lyrics on my arms – Nick Cave and Roberta Flack’",
    "url": "https://www.theguardian.com/lifeandstyle/2025/aug/30/blind-date-jane-bryn",
    "image": "https://media.guim.co.uk/e228cf45a6a5b006d00a9c898ea6f1776ae7f4b9/0_0_5000_4000/500.jpg",
    "summary": "Bryn, a social worker, crosses paths with Jane, a mental health support worker, and they discover shared experiences and insights from their respective fields. Both women, aged 63, form a connection rooted in their dedication to supporting others. Their meeting highlights the importance of collaboration in promoting mental health and social well-being among their communities.",
    "published": "2025-08-30T05:00:55Z"
  },
  {
    "title": "Parents in England to pay more for school lunches as caterers blame rising costs",
    "url": "https://www.theguardian.com/education/2025/aug/30/parents-england-pay-more-school-lunches-caterers-blame-rising-costs",
    "image": "https://media.guim.co.uk/65b1aa5c0cd79b95a43afc46dfb69b37c1d30c90/0_0_2912_2330/500.jpg",
    "summary": "As the new academic year starts, providers report that rising national insurance costs and food price inflation have led to increased prices. These financial pressures are affecting educational services and related sectors. Stakeholders are concerned about the impact on families and accessibility to education.",
    "published": "2025-08-30T05:00:54Z"
  }
]