[
  {
    "title": "Mourinho sacked by Fenerbahce, Simons to join Spurs and more: football news – live",
    "url": "https://www.theguardian.com/football/live/2025/aug/29/mourinho-sacked-by-fenerbahce-simmons-to-join-spurs-and-more-football-news-live",
    "image": "https://media.guim.co.uk/f5e18711b7c04d54b38b60bf801af56d02b415b9/176_0_4283_3427/500.jpg",
    "summary": "Join our writers for the latest updates as we gear up for an exciting weekend in the top flight, highlighting key events and match previews. Stay informed about the teams, players, and matchups that will shape the upcoming games. Don't miss out on any of the action as we count down to the weekend!",
    "published": "2025-08-29T08:43:45Z"
  },
  {
    "title": "Gaza starvation is real and it is happening now, UN World Food Programme says – Middle East crisis live",
    "url": "https://www.theguardian.com/world/live/2025/aug/29/gaza-famine-israel-middle-east-lastest-news-updates",
    "image": "https://media.guim.co.uk/5f526fffd32bc3d398611569b929248dcf6d5fa3/654_0_5600_4480/500.jpg",
    "summary": "Cindy McCain discussed with Israeli Prime Minister Benjamin Netanyahu the possibility of increasing food aid to the Gaza Strip. The conversation highlights ongoing humanitarian concerns in the region. Efforts are being made to alleviate the situation for those affected by the conflict.",
    "published": "2025-08-29T08:41:04Z"
  },
  {
    "title": "Immediate closure of asylum hotels could lead to migrants ‘living destitute in the streets’, says minister – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/aug/29/latest-live-uk-politics-news-updates-asylum-hotels-labour-conservatives-reform",
    "image": "https://media.guim.co.uk/ce98a439324cf0ec721f78c26607e0cdcd8d57b5/137_0_2501_2001/500.jpg",
    "summary": "Stephen Kinnock cautions that a \"disorderly discharge\" from the European Union could result in outcomes more severe than the current challenges faced. He emphasizes the potential for increased instability and negative repercussions. Kinnock advocates for a more managed approach to ensure better outcomes for all parties involved.",
    "published": "2025-08-29T08:37:48Z"
  },
  {
    "title": "Tottenham poised to sign £51.8m Xavi Simons after Chelsea leave path clear",
    "url": "https://www.theguardian.com/football/2025/aug/29/tottenham-poised-sign-xavi-simons-chelsea-rb-leipzig",
    "image": "https://media.guim.co.uk/bb95fac1b9f30705c42b8bcd284ccddd89eb8450/203_194_3248_2598/500.jpg",
    "summary": "Tottenham is set to finalize the £51.8 million transfer of Xavi Simons from RB Leipzig. The club has reportedly agreed on personal terms with the attacking midfielder. This move is expected to bolster Tottenham's offensive lineup.",
    "published": "2025-08-29T08:37:47Z"
  },
  {
    "title": "UK bank shares fall as City fears budget tax raid – business live",
    "url": "https://www.theguardian.com/business/live/2025/aug/29/uk-business-confidence-rises-economy-fears-stock-market-bonds-inflation-business-live-news-updates",
    "image": "https://media.guim.co.uk/f9f48faa306af40f2e67443a8e4d50574e623b44/608_0_4264_3412/500.jpg",
    "summary": "There are increasing calls for a tax on bank profits reminiscent of Thatcher-era policies, aimed at generating billions of pounds in revenue. This proposal has caused uncertainty in the markets, leading to a decline in bank shares. Investors are reacting to the potential impact of such a tax on the banking sector's profitability.",
    "published": "2025-08-29T08:34:02Z"
  }
]