[
  {
    "title": "US Open quarter-finals: Alcaraz faces Lehecka after Pegula powers past Krejcikova – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/02/us-open-tennis-2025-pegula-alcaraz-quarter-finals-day-ten-live",
    "image": "https://media.guim.co.uk/e1c702c31af1892876033c311688e603be2cc552/524_0_4720_3778/500.jpg",
    "summary": "Carlos Alcaraz is set to face Jiri Lehecka after Jessica Pegula's victory over Barbora Krejcikova at the US Open. The matches are part of the exciting lineup at Flushing Meadows. Writers will provide insights and updates on the action.",
    "published": "2025-09-02T18:41:40Z"
  },
  {
    "title": "Home secretary risks ‘Windrush-type consequences’ over asylum response, says Tory predecessor",
    "url": "https://www.theguardian.com/uk-news/2025/sep/02/yvette-cooper-risks-windrush-type-consequences-asylum-migration-amber-rudd",
    "image": "https://media.guim.co.uk/531e1ffefbfb7fe921d83e8515b969f23819e787/524_0_5583_4465/500.jpg",
    "summary": "Yvette Cooper has received a warning from Amber Rudd about the dangers of repeating the Conservative Party's 'hostile environment' policies. Rudd cautioned Cooper to avoid similar mistakes as she navigates immigration issues. The advice comes amid discussions on how to handle sensitive topics within the Labour Party.",
    "published": "2025-09-02T18:39:38Z"
  },
  {
    "title": "‘Two-tier Britain’: how Lucy Connolly became a cause célèbre for the right",
    "url": "https://www.theguardian.com/politics/2025/sep/02/two-tier-britain-how-lucy-connolly-became-a-cause-celebre-for-the-right",
    "image": "https://media.guim.co.uk/2f99bfc0211563e62d82955c8014eebdc588e021/0_138_558_446/500.jpg",
    "summary": "A woman was imprisoned for a social media post related to the Southport attack, sparking debates over free speech in the UK. Critics argue her case exemplifies a troubling trend where expressions of opinion are increasingly constrained. The incident highlights ongoing tensions between public safety and the right to free expression.",
    "published": "2025-09-02T18:37:41Z"
  },
  {
    "title": "Ice obtains access to Israeli-made spyware that can hack phones and encrypted apps",
    "url": "https://www.theguardian.com/us-news/2025/sep/02/trump-immigration-ice-israeli-spyware",
    "image": "https://media.guim.co.uk/c9895a5d04d90015d4216bb6fc8d3efb9661c574/309_0_3751_3001/500.jpg",
    "summary": "The Trump administration has awarded a contract to Paragon Solutions, granting the immigration agency access to advanced stealth cyberweapons. This move raises concerns about privacy and surveillance capabilities. Critics argue that such tools could be misused in immigration enforcement.",
    "published": "2025-09-02T18:02:30Z"
  },
  {
    "title": "Jay Vine takes Vuelta stage nine as Juan Ayuso attacks UAE team ‘dictatorship’",
    "url": "https://www.theguardian.com/sport/2025/sep/02/vuelta-espana-cycling-jay-vine-juan-ayuso-jonas-vingegaard",
    "image": "https://media.guim.co.uk/97750277fb5abfbb7c4f0f91df1fdfeb97b2b7b9/290_0_3019_2416/500.jpg",
    "summary": "Jay Vine claimed victory in stage nine following an attack from his former UAE Team Emirates teammate, Juan Ayuso. Ayuso expressed discontent regarding Vine's upcoming departure from the team. The conflict highlighted the tensions surrounding team dynamics as the race unfolded.",
    "published": "2025-09-02T18:01:55Z"
  }
]