[
  {
    "title": "TV tonight: full-throttle action with Alfie Allen and Shazad Latif ",
    "url": "https://www.theguardian.com/tv-and-radio/2025/sep/04/tv-tonight-full-throttle-action-with-alfie-allen-and-shazad-latif",
    "image": "https://media.guim.co.uk/102dde7ac1ff1300d1ec8a07958977b9a68856f0/492_192_3093_2476/500.jpg",
    "summary": "In tonight's episode of \"Atomic,\" reluctant partners are secretly transporting uranium. Meanwhile, viewers can follow the search for a new home for Fox, the pomeranian. Don't miss out on these intriguing stories!",
    "published": "2025-09-04T05:20:43Z"
  },
  {
    "title": "Australia politics live: Coalition continues question time pressure on PM over ‘former flatmate’ Daniel Andrews’ China trip; NZYQ bill passes",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/04/australia-politics-live-bob-carr-daniel-andrews-beijing-putin-question-time-labor-coalition-anthony-albanese-sussan-ley-ntwnfb",
    "image": "https://media.guim.co.uk/75d3034b9b25a83efea87d6a66fb62e27c48c22b/688_0_6880_5504/500.jpg",
    "summary": "I'm sorry, but I need more information about the specific news you'd like summarized. Could you please provide the details or content of the news?",
    "published": "2025-09-04T05:20:39Z"
  },
  {
    "title": "Cross-party commission urges UK government to scrap two-child benefit limit",
    "url": "https://www.theguardian.com/society/2025/sep/04/commission-uk-government-benefit-welfare-poverty",
    "image": "https://media.guim.co.uk/e1ce13fa5059e6a207a787f4f2978bba8e876266/389_0_2744_2195/500.jpg",
    "summary": "The Poverty Strategy Commission recommends abolishing the cap on welfare benefits to address hardship and elevate families from deep poverty. They argue that the removal of the cap will provide necessary support to those in need. The strategy aims to create a more effective response to tackling poverty in society.",
    "published": "2025-09-04T05:00:44Z"
  },
  {
    "title": "Sycamore Gap tree was at least 100-120 years old, ring count finds",
    "url": "https://www.theguardian.com/uk-news/2025/sep/04/sycamore-gap-tree-age-ring-count",
    "image": "https://media.guim.co.uk/19ccf17a3dcfddf62fedf804bd2106fa11acb908/848_0_4680_3744/500.jpg",
    "summary": "A recent study indicates that an ancient tree, believed to have been planted in the 19th century by a landowner dubbed \"the man who saved Hadrian's Wall,\" has ties to significant historical theories. This discovery highlights the importance of the tree in understanding the region's historical landscape. The finding adds both ecological and cultural value to the area's heritage.",
    "published": "2025-09-04T05:00:44Z"
  },
  {
    "title": "Martha’s rule now in operation at every acute hospital in England",
    "url": "https://www.theguardian.com/society/2025/sep/04/marthas-rule-now-in-operation-at-every-acute-hospital-in-england",
    "image": "https://media.guim.co.uk/642696c76ea7e1778a18347b9c91e73e4af85fb9/0_124_1629_1302/500.jpg",
    "summary": "A new system has been implemented allowing patients, their families, and NHS staff to request a review of care. This initiative aims to enhance patient involvement in their treatment processes. It seeks to improve transparency and accountability within the healthcare system.",
    "published": "2025-09-04T05:00:44Z"
  }
]