[
  {
    "title": "Australia news live: severe thunderstorm warning for Porepunkah as manhunt continues; Bob Katter could face formal censure after threatening journalist, Watt says",
    "url": "https://www.theguardian.com/australia-news/live/2025/aug/29/australia-news-live-porepunkah-shooting-dezi-freeman-manhunt-police-latest-updates-ntwnfb",
    "image": "https://media.guim.co.uk/e0664638668b7fd4f151cfa0fd41e3710dea3c04/0_0_4640_3712/500.jpg",
    "summary": "Please provide the news article or details you'd like summarized, and I'll be happy to help!",
    "published": "2025-08-29T07:30:20Z"
  },
  {
    "title": "Nova Twins: Parasites & Butterflies review – fearless rock duo balance anthems and introspection",
    "url": "https://www.theguardian.com/music/2025/aug/29/nova-twins-parasites-and-butterflies-review",
    "image": "https://media.guim.co.uk/b23cc11f9c7050981582bd153a278e46309b4995/0_971_5334_4264/500.jpg",
    "summary": "Trailblazers Amy Love and Georgia South are redefining their unique hybrid rock sound, addressing mental health themes in their music. They also tackle criticism from naysayers, showcasing resilience and artistic growth. Their innovative approach aims to inspire and empower listeners facing similar challenges.",
    "published": "2025-08-29T07:30:15Z"
  },
  {
    "title": "UK bank shares fall as City fears budget tax raid – business live",
    "url": "https://www.theguardian.com/business/live/2025/aug/29/uk-business-confidence-rises-economy-fears-stock-market-bonds-inflation-business-live-news-updates",
    "image": "https://media.guim.co.uk/f9f48faa306af40f2e67443a8e4d50574e623b44/608_0_4264_3412/500.jpg",
    "summary": "There are growing demands for a tax on bank profits reminiscent of Margaret Thatcher's era, aimed at generating billions of pounds. Advocates argue that such a measure could significantly contribute to public finances. The proposal reflects ongoing concerns about income inequality and the need for increased funding for public services.",
    "published": "2025-08-29T07:28:52Z"
  },
  {
    "title": "Porepunkah police shooting: wife of alleged killer Dezi Freeman arrested in late-night raid as manhunt continues",
    "url": "https://www.theguardian.com/news/2025/aug/29/porepunkah-raid-arrests-search-for-alleged-police-killer-dezi-freeman-continues-ntwnfb",
    "image": "https://media.guim.co.uk/21345a5e32399145d4e45218bdef6f7f0cbd2f4c/227_0_4640_3712/500.jpg",
    "summary": "Victoria police have arrested a 42-year-old woman and a 15-year-old boy. Both individuals were interviewed and subsequently released. Authorities are continuing their investigation.",
    "published": "2025-08-29T07:25:02Z"
  },
  {
    "title": "Gaza starvation is real and it is happening now, UN World Food Programme says – Middle East crisis live",
    "url": "https://www.theguardian.com/world/live/2025/aug/29/gaza-famine-israel-middle-east-lastest-news-updates",
    "image": "https://media.guim.co.uk/5f526fffd32bc3d398611569b929248dcf6d5fa3/654_0_5600_4480/500.jpg",
    "summary": "Cindy McCain announced that she has held discussions with Israeli Prime Minister Benjamin Netanyahu. The talks focused on the possibility of increasing food supplies to the Gaza Strip. This initiative aims to address humanitarian needs in the region.",
    "published": "2025-08-29T07:23:36Z"
  }
]