[
  {
    "title": "Seven Israeli soldiers wounded in explosion in Gaza City, IDF says",
    "url": "https://www.theguardian.com/world/2025/aug/30/israeli-soldiers-wounded-gaza-city-explosion-armoured-vehicle",
    "image": "https://media.guim.co.uk/4272a4acabc361a3b24367fa4cea2ccb6325c2ff/780_0_4632_3707/500.jpg",
    "summary": "An armored vehicle was targeted in the Zeitoun neighborhood amid reports of intense clashes, according to Arab media. The situation suggests escalating violence in the area. Details on casualties or the nature of the conflict remain unclear.",
    "published": "2025-08-30T14:28:20Z"
  },
  {
    "title": "Manchester United v Burnley, Tottenham v Bournemouth: Premier League, EFL and more – live",
    "url": "https://www.theguardian.com/football/live/2025/aug/30/manchester-united-v-burnley-tottenham-v-bournemouth-premier-league-efl-and-more-live",
    "image": "https://media.guim.co.uk/e57c59615a5ae8d81772afced7eacda8f9dc99f0/2170_71_4750_3800/500.jpg",
    "summary": "Emillia Hawkins will provide updates on the latest matches from the Premier League, EFL, Bundesliga, and more. Fans can stay informed about key events and scores as they unfold. Tune in for real-time coverage of the action on the pitch.",
    "published": "2025-08-30T14:27:43Z"
  },
  {
    "title": "Dutch F1 Grand Prix qualifying: Piastri pips Norris to pole as both McLarens break track record – live",
    "url": "https://www.theguardian.com/sport/live/2025/aug/30/dutch-f1-grand-prix-qualifying-live",
    "image": "https://media.guim.co.uk/dfefa770c7a088ae9cac579804d09a91c5594647/932_0_4680_3744/500.jpg",
    "summary": "Tom Bassam provides live updates as the Formula One season continues at Circuit Zandvoort. Fans can expect real-time information on the latest developments during the event. Stay tuned for highlights and key moments from the race.",
    "published": "2025-08-30T14:26:06Z"
  },
  {
    "title": "New drug hailed as ‘gamechanger’ in tackling stubbornly high blood pressure",
    "url": "https://www.theguardian.com/society/2025/aug/30/drug-baxdrostat-gamechanger-high-blood-pressure-hypertension",
    "image": "https://media.guim.co.uk/2a7c40c2eb92936a956ae604f66adaf105d19020/724_0_7240_5792/500.jpg",
    "summary": "Trials of baxdrostat have shown promising results for individuals with difficult-to-control hypertension. The drug has been characterized as ‘exciting’ due to its potential effectiveness. These findings could offer new hope for patients struggling with managing their high blood pressure.",
    "published": "2025-08-30T14:15:02Z"
  },
  {
    "title": "Chelsea 2-0 Fulham: Premier League – as it happened",
    "url": "https://www.theguardian.com/football/live/2025/aug/30/chelsea-v-fulham-premier-league-live",
    "image": "https://media.guim.co.uk/3e053f968e4577f9a9d053c33859e64f53252dbb/249_0_3057_2446/500.jpg",
    "summary": "Chelsea secured victory with goals from Joao Pedro and Enzo Fernandez. Fulham expressed frustration over two VAR decisions that they believed affected the outcome. The match ended with Chelsea claiming crucial points in the league.",
    "published": "2025-08-30T14:13:52Z"
  }
]