[
  {
    "title": "Chelsea v Paris FC: Women’s Champions League – live",
    "url": "https://www.theguardian.com/football/live/2025/oct/15/chelsea-v-paris-fc-womens-champions-league-live",
    "image": "https://media.guim.co.uk/ff89d0b005b077b11b66817d23b680c34bf834f8/734_0_4928_3942/500.jpg",
    "summary": "Sonia Bompastor's team aims for their first European victory of the season. Follow Taha Hashim's minute-by-minute updates for all the action. Stay tuned for key moments and highlights from the match.",
    "published": "2025-10-15T18:25:42Z"
  },
  {
    "title": "Federal judge says she’s ‘inclined’ to block mass layoffs as Trump official estimates 10,000 could be affected – live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/15/donald-trump-federal-government-shutdown-redistricting-voting-rights-act-kash-patel-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/1236457b37a4d0de48d9e8308a7fd9ef4b884464/282_0_4116_3293/500.jpg",
    "summary": "Judge Susan Illston criticized the administration for exploiting a gap in government operations. Russell Vought stated that his office aims to be proactive in closing down bureaucratic functions. The exchange highlights tensions between judicial oversight and executive efforts to streamline government.",
    "published": "2025-10-15T18:22:38Z"
  },
  {
    "title": "Gavin Newsom again denies parole for Manson follower Patricia Krenwinkel",
    "url": "https://www.theguardian.com/us-news/2025/oct/15/charles-manson-follower-parole-patricia-krenwinkel-gavin-newsom",
    "image": "https://media.guim.co.uk/0913b3834e3bbbe9671963c4afc045a3b8aafe2e/275_0_2501_2000/500.jpg",
    "summary": "California Governor Gavin Newsom has denied parole for a 77-year-old inmate for the second time, citing concerns that she poses an \"unreasonable danger to society.\" The decision emphasizes the balance between public safety and the rights of long-term prisoners. This case highlights ongoing debates around aging inmates and their rehabilitation potential.",
    "published": "2025-10-15T18:22:19Z"
  },
  {
    "title": "An Eric Trump crypto company is relying on close ties to a Chinese company",
    "url": "https://www.theguardian.com/us-news/2025/oct/15/eric-trump-crypto-china-bitmain",
    "image": "https://media.guim.co.uk/b9846a8768ae5431482b533afb80aa1de551edac/0_0_3332_2666/500.jpg",
    "summary": "SEC filings reveal that Bitmain, a Chinese cryptocurrency hardware manufacturer, provided Eric Trump's cryptocurrency firm with exceptionally favorable terms for equipment purchases. This arrangement has raised eyebrows regarding potential conflicts of interest. The details of the deal suggest a significant financial advantage for Trump's firm in the competitive crypto market.",
    "published": "2025-10-15T18:21:36Z"
  },
  {
    "title": "Rachel Reeves says higher taxes on wealthy ‘part of the story’ for November budget",
    "url": "https://www.theguardian.com/politics/2025/oct/15/rachel-reeves-says-higher-taxes-on-wealthy-part-of-the-story-for-november-budget",
    "image": "https://media.guim.co.uk/934218e6696f83a93d45c820797ef1a9e520d086/688_0_6880_5504/500.jpg",
    "summary": "The Chancellor suggested potential tax increases while addressing previous concerns about VAT on private schools and changes to non-domicile tax status. He criticized past alarmist claims regarding these issues. The remarks indicate a focus on fiscal adjustments without the drastic measures previously feared.",
    "published": "2025-10-15T18:15:51Z"
  }
]