[
  {
    "title": "Airspace over Danish city of Aalborg closed again last night after reports of drone sightings – Europe live ",
    "url": "https://www.theguardian.com/world/live/2025/sep/26/denmark-drone-sightings-airport-russia-ukraine-europe-live-news",
    "image": "https://media.guim.co.uk/8638c1137db75e745a8e1c320dde49c36812af1d/1314_245_5329_4263/500.jpg",
    "summary": "Denmark briefly closed its airspace due to unconfirmed sightings, prompting heightened security measures. The Prime Minister indicated that further developments could be expected. Authorities are remaining vigilant in assessing the situation.",
    "published": "2025-09-26T08:26:38Z"
  },
  {
    "title": "Farage endangering women by failing to condemn paracetamol claims, says Bridget Phillipson",
    "url": "https://www.theguardian.com/politics/2025/sep/26/nigel-farage-endangering-womens-health-paracetamol-claims-bridget-phillipson-labour",
    "image": "https://media.guim.co.uk/462f91fd6c000a5f55b0179bdd98d9c78cf7014d/185_91_1743_1393/500.jpg",
    "summary": "A candidate for Labour's deputy leader has condemned what she describes as 'scaremongering' regarding autism discussions within the party. She emphasized the need for a stronger stance against Reform policies. The candidate advocates for a more robust approach to ensuring inclusive dialogue and support for autism-related issues.",
    "published": "2025-09-26T08:26:35Z"
  },
  {
    "title": "Keir Starmer says digital ID cards are an ‘enormous opportunity’ and will make it tougher to work illegally - UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/26/keir-starmer-digital-id-cards-immigration-borders-reform-uk-politics-live",
    "image": "https://media.guim.co.uk/4b97cc6b081483fb8c46eaac32defe55d8031476/0_0_4164_3333/500.jpg",
    "summary": "The Prime Minister announced that a new digital ID system, stored on people's phones, will be implemented. This ID will be mandatory for verifying the right to work. The initiative aims to streamline identification processes in the workforce.",
    "published": "2025-09-26T08:23:26Z"
  },
  {
    "title": "Trump rattles investors with new tariffs on pharmaceuticals, trucks and kitchen cabinets – business live",
    "url": "https://www.theguardian.com/business/live/2025/sep/26/trump-investors-tariffs-pharmaceuticals-trucks-kitchen-cabinets-markets-uk-borrowing-costs-business-live-news",
    "image": "https://media.guim.co.uk/b6e9c41d11c16f906c88625cc595cbbbed746bf2/263_0_3333_2667/500.jpg",
    "summary": "The latest economic and financial news highlights ongoing developments in markets, indicating fluctuations in stock prices and shifts in investor sentiment. Key indicators, such as inflation rates and employment figures, are closely monitored for their impact on economic stability. Analysts continue to assess the implications of these trends on global economies and monetary policy decisions.",
    "published": "2025-09-26T08:16:16Z"
  },
  {
    "title": "Various Artists – Pasé Bél Tan: Francophonies and Creolities in Louisiana review – foot-stomping joy",
    "url": "https://www.theguardian.com/music/2025/sep/26/various-artists-pase-bel-tan-francophonies-and-creolities-in-louisiana-review",
    "image": "https://media.guim.co.uk/d1bbe79864c8f9c3984bb533d6024decf5a89e89/77_70_1837_1469/500.jpg",
    "summary": "A new collection showcases African American folk music from the 1950s to the 1980s, highlighting its influences from jazz and early blues. The music ranges from heartfelt, poignant lyrics to vibrant, celebratory tunes. This compilation celebrates the rich cultural heritage and diverse emotions within this musical tradition.",
    "published": "2025-09-26T08:01:00Z"
  }
]