[
  {
    "title": "Nato looks to bolster defences in response to Russian air incursions – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/oct/15/russia-ukraine-nato-france-latest-europe-live-news-updates",
    "image": "https://media.guim.co.uk/bf1ca470dd90bcdb3f6abe8e8203b11bff522874/606_0_4145_3316/500.jpg",
    "summary": "Concerns are rising that Moscow is probing the West's resolve by making incursions into NATO territory, blurring the lines between war and peace. This strategy is seen as a test of NATO's response to aggression. Analysts warn that such actions could escalate tensions and undermine regional stability.",
    "published": "2025-10-15T08:27:22Z"
  },
  {
    "title": "Rachel Reeves to pitch UK as ‘beacon of stability and growth’ at IMF, amid budget pressure – business live",
    "url": "https://www.theguardian.com/business/live/2025/oct/15/rachel-reeves-uk-beacon-of-stability-growth-imf-budget-tax-spending-stock-markets-business-live-news",
    "image": "https://media.guim.co.uk/5b8bdff87a5b43e5629205086456b5ddbc437c73/625_0_6253_5005/500.jpg",
    "summary": "Economic and financial news is being continuously updated, highlighting key developments in markets, policies, and global economic trends. Analysts are closely monitoring indicators such as inflation rates and employment figures. Investors are reacting to these updates, impacting stock and commodity prices.",
    "published": "2025-10-15T08:26:05Z"
  },
  {
    "title": "Vets could be made to cap prescription prices after UK watchdog investigation",
    "url": "https://www.theguardian.com/business/2025/oct/15/vets-could-be-made-to-publish-prices-after-uk-watchdog-investigation",
    "image": "https://media.guim.co.uk/0dfed7ae0d3879a2f94fdc84753fb59890ca04ae/413_466_3530_2826/500.jpg",
    "summary": "The Competition and Markets Authority (CMA) has declared that the current market is \"not fit\" for purpose, prompting calls for significant reforms. Their proposals include the requirement for healthcare providers to publish treatment costs transparently. This initiative aims to enhance competition and improve consumer choice in the healthcare sector.",
    "published": "2025-10-15T08:22:36Z"
  },
  {
    "title": "Putin’s embarrassing cancellation of Arab summit signals waning influence in Middle East",
    "url": "https://www.theguardian.com/world/2025/oct/15/putins-cancelled-russia-arab-summit-signals-waning-influence-in-middle-east",
    "image": "https://media.guim.co.uk/0163f7a90ac7525e48f66d82836c2f26ceed3d0d/1126_0_4843_3874/500.jpg",
    "summary": "Trump's upcoming Gaza summit could highlight the negative impact of the Ukraine war on Russia's global reputation. The event may serve as a stark reminder of Russia's diminishing influence in international affairs. Analysts suggest this could shift perceptions of Russia's role in the ongoing geopolitical landscape.",
    "published": "2025-10-15T08:16:31Z"
  },
  {
    "title": "Gaza ceasefire live: families say bodies of three further hostages identified amid reports vital aid crossing to reopen",
    "url": "https://www.theguardian.com/world/live/2025/oct/15/gaza-ceasefire-israel-hamas-palestine-aid-hostages-detainees-prisoners-live-news-updates",
    "image": "https://media.guim.co.uk/adcc1fcd83a21b80fece9fa06acb966fb043d334/421_0_4205_3364/500.jpg",
    "summary": "Israel announced a reduction in aid flow by half and the postponement of the Rafah crossing opening, citing delays in returning the bodies of hostages. This decision impacts the humanitarian situation in the region. The situation remains tense as hostilities continue.",
    "published": "2025-10-15T08:16:10Z"
  }
]