[
  {
    "title": "St Pölten v Chelsea: Women’s Champions League – live",
    "url": "https://www.theguardian.com/football/live/2025/nov/11/st-polten-v-chelsea-womens-champions-league-live",
    "image": "https://media.guim.co.uk/2a500fdbdf674331b5a02408fd32aca759b0f107/0_374_4044_3235/500.jpg",
    "summary": "Sonia Bompastor's team is set to compete against the Austrian champions, with Yara El-Shaboury providing minute-by-minute updates on the match. Fans can stay informed on the game's progress and key moments during the event. Tune in for ongoing coverage and insights.",
    "published": "2025-11-11T19:07:32Z"
  },
  {
    "title": "World must ‘honour 1.5C’, small island states insist at Cop30 summit – live",
    "url": "https://www.theguardian.com/environment/live/2025/nov/11/cop30-live-negotiations-begin-after-agenda-agreed",
    "image": "https://media.guim.co.uk/328fd1e7d744e129521cadf62a3ba1e5ee9c1017/828_0_4560_3648/500.jpg",
    "summary": "Small island states emphasize that the 1.5°C temperature limit is crucial for their survival, not just a political slogan. Their call comes amid ongoing climate discussions in Belém. They stress the need for urgent action to combat climate change and protect vulnerable communities.",
    "published": "2025-11-11T19:07:28Z"
  },
  {
    "title": "Trump calls Senate bill to end shutdown a ‘very big victory’ as deal splits Democrats – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/nov/11/donald-trump-us-government-shutdown-senate-democrats-republicans-politics-live-news-updates",
    "image": "https://media.guim.co.uk/ab98aee8adba144dd81396e5dce1efdfe2be7b80/535_0_5000_4000/500.jpg",
    "summary": "The US president praised Republicans for reaching a deal that is advancing to the House. Meanwhile, Democrats are experiencing internal conflict due to some senators' backing of the bill. This division highlights the challenges within the party as they navigate legislative priorities.",
    "published": "2025-11-11T19:04:49Z"
  },
  {
    "title": "A-League Women reaches ‘tipping point’ as scathing report highlights stagnation",
    "url": "https://www.theguardian.com/football/2025/nov/11/a-league-women-pfa-players-union-scathing-report-stagnation",
    "image": "https://media.guim.co.uk/e445b0ce14baa2c76b36365d38abbdc229bf7998/289_0_4831_3865/500.jpg",
    "summary": "A new report reveals that the allure of the World Cup has diminished, leading Australian players to consider the domestic league as their 'least preferred' competition. This shift indicates a growing preference for international opportunities over local play. As a result, the domestic league may face challenges in attracting top talent.",
    "published": "2025-11-11T19:00:03Z"
  },
  {
    "title": "The Running Man review – Glen Powell sprints through fun update of Stephen King future-shock sci-fi satire",
    "url": "https://www.theguardian.com/film/2025/nov/11/the-running-man-review-glen-powell-edgar-wright-stephen-king-future-shock-sci-fi-satire",
    "image": "https://media.guim.co.uk/1ff3126b6fa0f7fbd560c66a5326721412c78a94/0_0_2516_2014/500.jpg",
    "summary": "Edgar Wright brings excitement to the adaptation of Stephen King's 1982 novel with dynamic chase scenes, a punk-inspired style, and a lively soundtrack. The film captures a sense of thrill and enjoyment while paying homage to the source material. Audiences can expect a vibrant and engaging cinematic experience.",
    "published": "2025-11-11T19:00:02Z"
  }
]