[
  {
    "title": "October heat records broken across Australia as Sydney braces for temperatures ‘way above the norm’",
    "url": "https://www.theguardian.com/environment/2025/oct/21/australia-weather-october-heat-records-sydney-birdsville-temperature-forecast",
    "image": "https://media.guim.co.uk/6a238cec0d7dd6134c33186df9b99ff5cd16b53a/656_0_6540_5235/500.jpg",
    "summary": "Birdsville has recorded a new temperature high as the Bureau of Meteorology warns of ongoing record hot weather. Heatwave warnings have been issued for several states due to extreme temperatures. Residents are urged to take precautions amid the intense heat conditions.",
    "published": "2025-10-21T05:14:38Z"
  },
  {
    "title": "Australia news live: China claims RAAF aircraft ‘illegally’ entered its airspace during flares incident",
    "url": "https://www.theguardian.com/australia-news/live/2025/oct/21/australia-news-live-michaelia-cash-china-jet-raaf-prime-minister-anthony-albanese-donald-trump-white-house-critical-minerals-deal-ntwnfb",
    "image": "https://media.guim.co.uk/8a681e49c16eb401398108fe57b065e2317c408a/216_0_3510_2808/500.jpg",
    "summary": "I'm sorry, but I need more context or details about the news you want summarized. Please provide the article or the main points!",
    "published": "2025-10-21T05:12:02Z"
  },
  {
    "title": "Dare you enter the splash zone? Wet and wild selkie steals the show at Glasgow’s startling arts festival",
    "url": "https://www.theguardian.com/stage/2025/oct/21/take-me-somewhere-glasgow-radical-immersive-theatre-festival",
    "image": "https://media.guim.co.uk/c3a47f45aa9c6e41d1c0cb6cd6a58c58f2afcaa8/777_335_1080_864/500.jpg",
    "summary": "\"Take Me Somewhere\" immerses audiences in a unique theatrical experience, combining intimate moments like tucking them in bed with the poignant atmosphere of a last supper. The performance cleverly balances humor and sadness, embodied through a paddling-pool setting. Overall, it offers a fresh perspective on storytelling and emotional connection.",
    "published": "2025-10-21T05:00:34Z"
  },
  {
    "title": "Ed Miliband’s new green jobs will bring Britain hope. I dare Reform to denounce them  | Polly Toynbee",
    "url": "https://www.theguardian.com/commentisfree/2025/oct/21/ed-miliband-new-green-jobs-britain-hope-reform",
    "image": "https://media.guim.co.uk/eea5469bcdb4d52ac1439dc1d8a3f2a41896f84f/612_0_4415_3532/500.jpg",
    "summary": "Polly Toynbee critiques Nigel Farage's advocacy for reopening coal mines, questioning the impact on thousands of clean energy workers. She argues that Farage's plans would essentially ask these individuals to abandon their stable, well-paying jobs. The commentary highlights the tension between nostalgic coal mining policies and the growing clean energy sector.",
    "published": "2025-10-21T05:00:33Z"
  },
  {
    "title": "EU criticised for pausing sanctions on Israel in response to Trump Gaza efforts",
    "url": "https://www.theguardian.com/world/2025/oct/21/eu-pause-trade-sanctions-israel-donald-trump-gaza-ceasefire",
    "image": "https://media.guim.co.uk/3bb207bf445fe28be4c630720151723d1c7ec4a5/332_0_4560_3648/500.jpg",
    "summary": "The decision to halt the freeze on a preferential trade pact is linked to efforts aimed at stabilizing a precarious ceasefire. This pause reflects the urgency to maintain diplomatic relations amidst ongoing tensions. The situation highlights the precarious balance between trade agreements and conflict resolution.",
    "published": "2025-10-21T05:00:33Z"
  }
]