[
  {
    "title": "WSL: Arsenal v Brighton, Liverpool v Manchester City and more – matchday live",
    "url": "https://www.theguardian.com/football/live/2025/oct/12/world-cup-qualifiers-wsl-updates-and-football-news-matchday-live",
    "image": "https://media.guim.co.uk/52c82d14af1264071ece362612fdc2810c3df673/35_0_4310_3447/500.jpg",
    "summary": "Tune in for live updates on today's Women's Super League matches and breaking football news from our team of writers. Get real-time insights and commentary as the action unfolds. Stay connected to experience all the excitement of the games!",
    "published": "2025-10-12T13:21:12Z"
  },
  {
    "title": "Women’s Cricket World Cup: Australia v India – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/12/womens-cricket-world-cup-australia-v-india-live-updates-scores-results-teams-squads-start-time-visakhapatnam",
    "image": "https://media.guim.co.uk/b68ad297e519de5d9ac70dfceaf4835461f0fcb1/634_0_4583_3666/500.jpg",
    "summary": "In an ODI match in Visakhapatnam, two heavyweight teams aim to establish dominance during the group stage. The event promises high stakes as both sides look to make a statement. Megan Maurice will be covering the match with an over-by-over report.",
    "published": "2025-10-12T13:17:24Z"
  },
  {
    "title": "Manchester United roar back at Everton as Jess Park punishes former WSL club",
    "url": "https://www.theguardian.com/football/2025/oct/12/everton-manchester-united-womens-super-league-match-report",
    "image": "https://media.guim.co.uk/1d1d2857a204e062232b23d50c22f8f698459f55/433_0_2586_2069/500.jpg",
    "summary": "Manchester United overcame an early setback to beat Everton 4-1 in the inaugural Women’s Super League match at Hill Dickinson Stadium. The team rallied from a goal down with a strong performance. This victory highlights United's competitive edge in the league.",
    "published": "2025-10-12T13:15:01Z"
  },
  {
    "title": "Ceasefire live: aid trucks enter Gaza as JD Vance says hostages likely to be released ‘any moment’",
    "url": "https://www.theguardian.com/world/live/2025/oct/12/gaza-ceasefire-live-aid-relief-hamas-release-israel-hostages",
    "image": "https://media.guim.co.uk/3705a4625beb65e66edf0eda511b0d3be9181544/0_0_4800_3840/500.jpg",
    "summary": "Israel's military announces the completion of the first phase of its withdrawal, coinciding with a peace summit scheduled for Monday in Egypt. This development marks a significant step in ongoing efforts to address tensions in the region. The summit aims to foster dialogue and seek solutions for lasting peace.",
    "published": "2025-10-12T13:12:43Z"
  },
  {
    "title": "Britain's youth clubs have been quietly decimated. What's most revealing is that few seem to care | John Harris",
    "url": "https://www.theguardian.com/commentisfree/2025/oct/12/britain-youth-clubs-social-division-polarisation-loneliness",
    "image": "https://media.guim.co.uk/f7f7b09a587b2a946df66ee102c2d834d6519435/0_0_5000_4000/500.jpg",
    "summary": "In a recent Guardian article, columnist John Harris criticizes the prioritization of older interests over youth, highlighting how vital communal spaces for young people are often first to face budget cuts. He argues that these spaces serve as crucial solutions for issues like social division, polarization, and loneliness. The ongoing neglect of youth-oriented facilities reflects a troubling trend in societal values.",
    "published": "2025-10-12T13:12:26Z"
  }
]