[
  {
    "title": "Charlie Kirk memorial: Trump addresses event after Erika Kirk says she forgives shooting suspect – latest updates",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/21/charlie-kirk-funeral-memorial-time-updates-arizona",
    "image": "https://media.guim.co.uk/c225a64aaebfb41b91f210c3013bb402dd38ec63/402_0_4778_3824/500.jpg",
    "summary": "During a recent event, the US president concluded his speeches, while the widow of rightwing activist Tyler Robinson expressed forgiveness towards him in front of a large audience of tens of thousands. Her remarks highlighted themes of compassion and understanding amidst political tensions. The event underscored the emotional impact of personal loss and the call for healing.",
    "published": "2025-09-21T22:30:18Z"
  },
  {
    "title": "News live: Netanyahu warns Albanese to ‘stand by’ after Australia recognises Palestine; Sydney trains to ban some ebikes",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/22/australia-news-live-anthony-albanese-new-york-israel-palestine-donald-trump-optus-triple-zero-ntwnfb",
    "image": "https://media.guim.co.uk/296fb619ca2170589fd6edc705b9d1e95fceb75a/347_0_4538_3631/500.jpg",
    "summary": "Please provide the specific news article or content you'd like summarized, and I'll be glad to help!",
    "published": "2025-09-21T22:21:20Z"
  },
  {
    "title": "US must ‘universally condemn political violence’, Democratic governor Shapiro says",
    "url": "https://www.theguardian.com/us-news/2025/sep/21/josh-shapiro-pennsylvania-political-violence",
    "image": "https://media.guim.co.uk/a52ac79a1a41a14694f68d4272b32acb4b4c04de/303_0_2083_1667/500.jpg",
    "summary": "Pennsylvania Governor Josh Shapiro stated that the U.S. is facing a critical turning point following the killing of political commentator Charlie Kirk. He emphasized the need for unity and cooperation instead of division in the wake of this incident. Shapiro's remarks highlight the urgency for collective action in addressing growing political tensions.",
    "published": "2025-09-21T21:25:20Z"
  },
  {
    "title": "Trump joins thousands at memorial for rightwing activist Charlie Kirk",
    "url": "https://www.theguardian.com/us-news/2025/sep/21/thousands-gather-at-charlie-kirk-memorial-in-arizona-where-trump-to-pay-tribute-to-slain-organizer",
    "image": "https://media.guim.co.uk/b18b935cc54e1684029e95f444940b02fb0373e3/443_0_4433_3546/500.jpg",
    "summary": "White House adviser Stephen Miller referred to a recently killed activist in Utah as \"immortal,\" stating that his influence will continue to inspire. He emphasized that \"millions will carry on his legacy,\" highlighting the significant impact of the activist's work. Miller's comments reflect a strong commitment to the activist's cause among supporters.",
    "published": "2025-09-21T21:03:44Z"
  },
  {
    "title": "Morning Mail: Australia recognises Palestinian state; why Sydney has the most fare evaders; Olyslagers wins high jump gold",
    "url": "https://www.theguardian.com/australia-news/2025/sep/22/morning-mail-monday-ntwnfb",
    "image": "https://media.guim.co.uk/6efc89c7e787d3322772a9d197690ab3e417a434/534_90_4288_3432/500.jpg",
    "summary": "Australia's foreign policy sees a significant shift as it recognizes the state of Palestine. Sydney faces notable issues with fare evasion, recording the highest rates in the country. Additionally, an Australian high jumper secured a gold medal at the Tokyo Olympics.",
    "published": "2025-09-21T20:43:18Z"
  }
]