[
  {
    "title": "French parliament set for no-confidence votes – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/oct/16/france-no-confidence-debate-lecornu-macron-europe-live-news-updates",
    "image": "https://media.guim.co.uk/6ebcfb54773dcca0410de3f0f506e2b1450f689e/86_0_4079_3263/500.jpg",
    "summary": "French Minister Lecornu is expected to retain his position after postponing proposed pension reforms. However, the political landscape remains precarious, with tight margins in support. Ongoing negotiations and public reaction could still influence his stability.",
    "published": "2025-10-16T08:24:18Z"
  },
  {
    "title": "UK economy posts ‘meagre’ 0.1% growth in August as ‘pre-budget funk’ hits services sector – business live",
    "url": "https://www.theguardian.com/business/live/2025/oct/16/uk-gdp-economy-growth-august-reeves-budget-imf-business-live-news",
    "image": "https://media.guim.co.uk/3df5fa4052482e1c83201e3032cc527c81737fbd/436_0_5081_4066/500.jpg",
    "summary": "The UK economy saw an improvement in August, driven by a rebound in manufacturing activity, according to the latest GDP report. This growth has contributed positively to the overall economic outlook. The increase indicates a strengthening in the manufacturing sector, which is vital for recovery.",
    "published": "2025-10-16T08:23:10Z"
  },
  {
    "title": "Starmer and CPS face further questions after China spy case documents fail to quell controversy – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/oct/16/china-spy-case-cps-keir-starmer-uk-politics-latest-news-updates",
    "image": "https://media.guim.co.uk/bc36c48f8d3f897800edc802cdf890079dd80aff/958_432_1897_1519/500.jpg",
    "summary": "Former Attorney General Dominic Grieve expressed confusion over the decision not to proceed with the prosecution after reviewing witness statements. He found the reasoning behind the decision to be unclear. Grieve's comments highlight concerns regarding the handling of the case.",
    "published": "2025-10-16T08:18:11Z"
  },
  {
    "title": "Gaza ceasefire live: Hamas says it has returned all hostage bodies it can reach for now",
    "url": "https://www.theguardian.com/world/live/2025/oct/16/gaza-ceasefire-israel-hamas-palestine-rafah-hostages-live-news-updates",
    "image": "https://media.guim.co.uk/858fe899e1bcea685c54f64b3eef04136435f2e7/164_0_5558_4449/500.jpg",
    "summary": "A militant group has announced that they are unable to recover additional remains from the ruins in Gaza due to a lack of specialized equipment. They highlighted the challenges faced in the recovery efforts. This statement raises concerns about the ongoing situation in the region.",
    "published": "2025-10-16T08:15:06Z"
  },
  {
    "title": "Students grumble over essay prompt and how paper was stapled as English exam kicks off HSC",
    "url": "https://www.theguardian.com/australia-news/2025/oct/16/nsw-students-begin-hsc-exams",
    "image": "https://media.guim.co.uk/f3ad05049d61625e3c38d085e51ade7e44b18495/576_231_1581_1265/500.jpg",
    "summary": "Students expressed relief as they completed the first exam of this year's HSC, closing their booklets at 11:30 AM. The completion marked a significant milestone in their academic journey. The atmosphere was one of accomplishment as they moved past this initial hurdle.",
    "published": "2025-10-16T08:11:22Z"
  }
]