[
  {
    "title": "Putin says US peace plan could form basis for end to Ukraine war – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/nov/27/russia-ukraine-war-peace-deal-eu-europe-latest-news-updates",
    "image": "https://media.guim.co.uk/562448be5b4cb6c2f4eaba964dfdd1302eee3c80/916_0_4584_3666/500.jpg",
    "summary": "Putin reiterated his call for the international community to acknowledge Russia's territorial gains in Ukraine. This demand is a significant point of contention and a non-negotiable issue for Kyiv. The ongoing conflict continues to highlight the stark divide between Russian and Ukrainian positions.",
    "published": "2025-11-27T15:18:17Z"
  },
  {
    "title": "Hong Kong fire latest: rescue crews search for survivors as death toll rises to 75 with hundreds reported missing",
    "url": "https://www.theguardian.com/world/live/2025/nov/27/hong-kong-fire-arrests-dead-killed-hundreds-missing-housing-complex-blaze",
    "image": "https://media.guim.co.uk/cfe6885eb8e18815f333c6e53cc6426c77efff4b/620_0_5000_4000/500.jpg",
    "summary": "Three men were arrested following a rescue operation at the Wang Fuk Court residential apartment complex in Tai Po district. A total of 26 rescue teams were dispatched to the site to assist. Authorities are investigating the circumstances surrounding the incident.",
    "published": "2025-11-27T15:15:44Z"
  },
  {
    "title": "Economists warn budget built on ‘shaky foundations’; December UK interest rate cut looks more likely – business live",
    "url": "https://www.theguardian.com/business/live/2025/nov/27/uk-fiscal-repair-budget-bond-markets-fiscal-headroom-gambling-companies-rachel-reeves-business-live-updates",
    "image": "https://media.guim.co.uk/a9b684ebd5ab312eea74d213d18cc5cfc9e7b0f1/1_0_2500_2000/500.jpg",
    "summary": "Experts are skeptical about the feasibility of back-loaded tax rises announced in Wednesday's budget. Concerns center on whether these measures will be implemented as planned. The uncertainty raises questions about the government's fiscal strategy moving forward.",
    "published": "2025-11-27T15:14:36Z"
  },
  {
    "title": "‘It was just … meh’: the voters who feel ‘tinkering’ budget let them down",
    "url": "https://www.theguardian.com/uk-news/2025/nov/27/it-was-just-meh-the-voters-who-feel-tinkering-budget-let-them-down",
    "image": "https://media.guim.co.uk/48e6fe9e8b1aabfc45f7097cd1f9bbee2f24e8e3/141_0_4219_3375/500.jpg",
    "summary": "A research group called More in Common conducted interviews with former constituents from traditionally Democratic areas, known as the 'blue wall.' They expressed dissatisfaction with recent political U-turns, describing them as \"chaotic.\" The findings indicate a growing discontent among these voters regarding shifting party positions.",
    "published": "2025-11-27T15:13:57Z"
  },
  {
    "title": "Celebrity Traitors star Ruth Codd recovering after second leg amputation ",
    "url": "https://www.theguardian.com/tv-and-radio/2025/nov/27/celebrity-traitors-star-ruth-codd-second-leg-amputation",
    "image": "https://media.guim.co.uk/0f937a9fb7e2643ec0713a79765fdf9d46ce953f/1380_16_4407_3527/500.jpg",
    "summary": "Irish actor, who lost his leg due to a football injury, shared a TikTok video unveiling his new wheelchair. The post highlights his positive outlook and adaptability after his first amputation. Fans expressed support and admiration for his resilience and spirit.",
    "published": "2025-11-27T15:09:47Z"
  }
]