[
  {
    "title": "World Cup 2026 draw: updates as the teams await fate in Washington DC – live",
    "url": "https://www.theguardian.com/football/live/2025/dec/05/world-cup-2026-draw-updates-usa-mexico-canada",
    "image": "https://media.guim.co.uk/f896ddc5d4bd8807e00d504f6daea698677ec270/148_0_3201_2561/500.jpg",
    "summary": "Writers will provide updates from the draw in Washington, D.C. for the upcoming 48-team tournament scheduled for next summer. The event will outline the tournament's structure and matchups. Stay tuned for live coverage and insights.",
    "published": "2025-12-05T15:22:43Z"
  },
  {
    "title": "Pentagon announces another boat strike amid heightened scrutiny – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/dec/05/trump-pete-hegseth-signal-politics-updates",
    "image": "https://media.guim.co.uk/377241a411be44af4789e9c893ee2bebcb7a11f1/434_0_1792_1434/500.jpg",
    "summary": "A recent attack on a boat in the eastern Pacific has left four people dead. This incident has sparked ongoing inquiries into a preceding double strike that occurred in the area. The circumstances surrounding both attacks remain under investigation.",
    "published": "2025-12-05T15:22:36Z"
  },
  {
    "title": "Merino may keep place as Arsenal striker, Rodri still unavailable for Manchester City – football live",
    "url": "https://www.theguardian.com/football/live/2025/dec/05/world-cup-draw-buildup-premier-league-news-and-more-football-live",
    "image": "https://media.guim.co.uk/ef330cd03f92dbad56a77d137eb40d497638a120/271_131_3857_3085/500.jpg",
    "summary": "England and Scotland are set to discover their World Cup fates as the weekend approaches. Writers will provide the latest updates and news regarding the teams. Fans can expect a busy and exciting weekend in the world of sports.",
    "published": "2025-12-05T15:22:11Z"
  },
  {
    "title": "Labour announces plans to lift 550,000 children out of poverty – UK politics live ",
    "url": "https://www.theguardian.com/politics/live/2025/dec/05/labour-child-poverty-keir-starmer-nigel-farage-reform",
    "image": "https://media.guim.co.uk/4c98ab731c2fe8f13d41d15c70d6016406710eb5/804_71_4425_3540/500.jpg",
    "summary": "Labour leader Keir Starmer describes his party's new strategy to combat child poverty as a \"moral mission.\" The plan includes initiatives to improve childcare access and assist families in moving out of temporary housing. Starmer emphasizes the importance of addressing child poverty for the future of the country.",
    "published": "2025-12-05T15:21:22Z"
  },
  {
    "title": "A guide to the Guardian’s 2025 charity appeal partners",
    "url": "https://www.theguardian.com/society/2025/dec/05/guardian-2025-charity-appeal-partners",
    "image": "https://media.guim.co.uk/6ed81019d8c93ebb2d57087762a4b3f568ff09be/963_17_7172_5738/500.jpg",
    "summary": "This year's appeal focuses on the theme of hope, emphasizing the importance of community support. We are collaborating with five charities that engage in grassroots efforts to combat division, hate, and despair. The initiative aims to foster unity and positive change within communities.",
    "published": "2025-12-05T15:20:24Z"
  }
]