[
  {
    "title": "Premier League top scorers 2025-26: who is leading race for golden boot?",
    "url": "https://www.theguardian.com/football/2025/sep/15/premier-league-top-scorers-2025-26-who-is-leading-race-for-golden-boot",
    "image": "https://media.guim.co.uk/77be6da0a20792a89f51335849cb3f8169dfbba1/671_0_2264_1811/500.jpg",
    "summary": "The news highlights the top goal scorers in the English Premier League for the current season. It provides an overview of the leading players who are excelling in goal scoring. Fans can see how these \"hot shots\" are contributing to their teams' performances.",
    "published": "2025-09-20T22:17:35Z"
  },
  {
    "title": "More than 1,000 people arrive in UK in small boats in one day",
    "url": "https://www.theguardian.com/uk-news/2025/sep/20/more-than-1000-people-arrive-in-uk-in-small-boats-in-one-day",
    "image": "https://media.guim.co.uk/2cb664e0b03bdc5aa0b7b2c5fad94c96dd65a467/196_0_2121_1696/500.jpg",
    "summary": "Home Office figures released on Friday indicate that new arrivals in Dover have resumed after more than a week of no arrivals caused by adverse weather conditions. This break in arrivals was attributed to safety concerns surrounding the poor weather. The resumption marks a return to normalcy for border crossings at Dover.",
    "published": "2025-09-20T21:54:10Z"
  },
  {
    "title": "Alex Iwobi inspires Fulham’s rousing comeback win against Brentford",
    "url": "https://www.theguardian.com/football/2025/sep/20/fulham-brentford-premier-league-match-report",
    "image": "https://media.guim.co.uk/3cfd50466cf6488a1118ee1a9fd044c910d3f00a/0_0_4431_3546/500.jpg",
    "summary": "Fulham staged a comeback to defeat Brentford 3-1 in their latest match. Alex Iwobi and Harry Wilson scored for Fulham, while an own goal from Ethan Pinnock contributed to the win. The result showcased Fulham's resilience after trailing briefly.",
    "published": "2025-09-20T21:11:43Z"
  },
  {
    "title": "Lucy Powell: Labour should raise gambling taxes to axe two-child benefit cap",
    "url": "https://www.theguardian.com/politics/2025/sep/20/lucy-powell-urges-labour-to-consider-raising-gambling-taxes-so-it-can-axe-two-child-benefit-cap",
    "image": "https://media.guim.co.uk/8eb13decf4af5bc6c7231b319863f1b3ae8ea9dc/478_40_2606_2084/500.jpg",
    "summary": "A deputy leadership candidate emphasizes the necessity for the party to focus on its goal of alleviating child poverty. They advocate for clarity in messaging regarding this objective. The statement highlights an urgent commitment to improve the welfare of disadvantaged children.",
    "published": "2025-09-20T21:07:58Z"
  },
  {
    "title": "Matt Beard, former manager of Liverpool Women, dies aged 47",
    "url": "https://www.theguardian.com/football/2025/sep/20/matt-beard-former-manager-of-liverpool-women-dies-aged-47",
    "image": "https://media.guim.co.uk/7cbfafd63c4ca9ba4ff0ca45fb38b97f82ae266e/331_164_2732_2186/500.jpg",
    "summary": "Former Liverpool manager Matt Beard has passed away at the age of 47, as announced by the Women’s Super League club. Beard was known for his contributions to women's football during his time with Liverpool. His death has prompted an outpouring of tributes from the football community.",
    "published": "2025-09-20T20:53:30Z"
  }
]