[
  {
    "title": "Utah campus open carry permit under fresh scrutiny after Kirk shooting",
    "url": "https://www.theguardian.com/us-news/2025/sep/14/utah-campus-concealed-carry-permit",
    "image": "https://media.guim.co.uk/d081af8d839cd60cf098ee8e68ebfc5dd55ced80/229_0_2500_2000/500.jpg",
    "summary": "HB 128, which was passed in August, permits individuals with the appropriate permit to openly carry firearms on college campuses. This legislation aims to enhance personal safety and security in educational environments. Supporters argue it provides a means of self-defense, while opponents raise concerns about potential risks to student safety.",
    "published": "2025-09-14T19:09:37Z"
  },
  {
    "title": "Guy Pearce and Annie Lennox join call to end ‘normalised horror’ for children in Gaza",
    "url": "https://www.theguardian.com/world/2025/sep/14/guy-pearce-and-annie-lennox-join-call-to-end-normalised-horror-for-children-in-gaza",
    "image": "https://media.guim.co.uk/398850b24d0cde7d76afca63bad33d64e01c95ab/89_0_3749_3000/500.jpg",
    "summary": "Stars have come together to read Michael Rosen's 2014 poem \"Don't Mention the Children\" in a film released by Save the Children. The initiative aims to raise awareness about the impact of war and conflict on children. This collaboration highlights the importance of protecting and supporting young lives affected by such crises.",
    "published": "2025-09-14T19:00:41Z"
  },
  {
    "title": "England still favourites to lift Rugby World Cup, but betting on them is another matter | Robert Kitson",
    "url": "https://www.theguardian.com/sport/2025/sep/14/england-scotland-womens-rugby-world-cup",
    "image": "https://media.guim.co.uk/15d689ff68578a32911294aecab33ee1d7623def/345_0_2926_2340/500.jpg",
    "summary": "Despite a convincing victory over Scotland, fans are advised to refrain from spending money on future events. Caution is suggested as circumstances may change. It's a reminder to be prudent even after a successful outcome.",
    "published": "2025-09-14T18:59:55Z"
  },
  {
    "title": "Police assaulted as far-right rally led by Tommy Robinson sparks clashes",
    "url": "https://www.theguardian.com/uk-news/2025/sep/13/unite-the-kingdom-far-right-rally-london-tommy-robinson-police-assaulted",
    "image": "https://media.guim.co.uk/da19315ad3260f40773e4e24c7c0bbb2fe1f4c8e/109_0_5623_4501/500.jpg",
    "summary": "Over 110,000 individuals participated in a protest organized by Tommy Robinson, which prominently featured racist conspiracy theories and hate speech. The event drew significant attention and criticism for its promotion of divisive rhetoric. Authorities and advocacy groups expressed concern over the implications of such gatherings on societal cohesion.",
    "published": "2025-09-14T18:56:23Z"
  },
  {
    "title": "Manchester United seem to have accepted their mediocrity, but how long can it go on? | Jonathan Wilson",
    "url": "https://www.theguardian.com/football/2025/sep/14/ruben-amorim-manchester-united-city-derby",
    "image": "https://media.guim.co.uk/876ebacf4181238a2d593021afc995ccb98728e3/153_0_3173_2539/500.jpg",
    "summary": "Ruben Amorim's role at Old Trafford is increasingly scrutinized as his impact on the team's performance raises concerns. While he may not be the primary problem facing the club, his presence is contributing to ongoing challenges. Critics argue that addressing his involvement is necessary for improvement.",
    "published": "2025-09-14T18:52:23Z"
  }
]