[
  {
    "title": "Australia news live: Victorians to be able to access voluntary assisted dying earlier; Parramatta council sacks CEO",
    "url": "https://www.theguardian.com/australia-news/live/2025/oct/14/australia-news-live-jim-chalmers-superannuation-concession-tax-cybercrime-anthony-albanese-sussan-ley-coalition-penny-wong-israel-gaza-ntwnfb",
    "image": "https://media.guim.co.uk/9dc9f015761e0d574c750ba29efeff85dea024b7/2085_675_5361_4289/500.jpg",
    "summary": "I’m sorry, but I need more context or details about the news you want summarized. Could you provide more information?",
    "published": "2025-10-14T01:24:35Z"
  },
  {
    "title": "Watching from Australia while Donald Trump targets my home of Chicago with armed troops prompts deep questions | Miles Herbert",
    "url": "https://www.theguardian.com/commentisfree/2025/oct/14/watching-from-australia-while-donald-trump-threatens-my-home-of-chicago-with-armed-troops-prompts-deep-questions",
    "image": "https://media.guim.co.uk/16ef2ce5e57ef1c162b1416a80b73e341dd04e07/508_0_5033_4024/500.jpg",
    "summary": "The speaker expresses a strong desire to take action and avoid future regrets about missed opportunities. They emphasize the importance of making the most of the present rather than looking back with doubt. This sentiment reflects a commitment to proactive engagement in their endeavors.",
    "published": "2025-10-13T23:34:36Z"
  },
  {
    "title": "Linda Reynolds pursues bankruptcy proceedings against Brittany Higgins after defamation win",
    "url": "https://www.theguardian.com/law/2025/oct/14/linda-reynolds-brittany-higgins-bankruptcy-proceedings-ntwnfb",
    "image": "https://media.guim.co.uk/973e7d1cb97219ce3e482f6dea5152a04ec82df0/0_0_5000_4000/500.jpg",
    "summary": "A former Liberal senator has initiated a legal claim seeking over $1 million in damages and legal costs. The specifics of the claim have not been disclosed, but it reflects ongoing legal disputes. The outcome could have significant implications for the senator's financial future.",
    "published": "2025-10-13T23:33:18Z"
  },
  {
    "title": "Trump news at a glance: President declares ‘peace in the Middle East’ despite many barriers remaining",
    "url": "https://www.theguardian.com/us-news/2025/oct/14/trump-administration-news-updates-today-latest",
    "image": "https://media.guim.co.uk/182f74da7c0b8460fab2917c80ec0cc4b166c725/0_0_5022_4018/500.jpg",
    "summary": "Donald Trump has pledged that, if elected president again, he will leverage his authority to convince Israel of the limits of military force. He emphasizes the need for a new approach to the Israel-Palestine conflict. This statement reflects his ongoing commitment to Middle East policies as of October 13, 2025.",
    "published": "2025-10-13T23:25:27Z"
  },
  {
    "title": "‘I lost a friend of almost 40 years’: Nancy Meyers pays tribute to Diane Keaton",
    "url": "https://www.theguardian.com/film/2025/oct/14/nancy-meyers-director-tribute-diane-keaton",
    "image": "https://media.guim.co.uk/ee4fc75a4353ca1625316e676868ffcd21133124/166_0_2301_1841/500.jpg",
    "summary": "A prominent film-maker, known for directing Keaton in \"Something's Gotta Give\" and writing classics like \"Baby Boom\" and \"Father of the Bride,\" has expressed deep sorrow over the passing of a significant figure in the industry. He stated, \"we have lost a giant,\" highlighting the profound impact of this individual. The film community mourns the loss of someone who contributed greatly to cinema.",
    "published": "2025-10-13T23:12:02Z"
  }
]