[
  {
    "title": "CBS News staffers to lose jobs as part of sweeping round of cuts from Paramount",
    "url": "https://www.theguardian.com/media/2025/oct/29/cbs-news-layoffs-paramount",
    "image": "https://media.guim.co.uk/97fa3e8309f3bf8182a9747d8333ca4d3d503cca/480_0_3334_2667/500.jpg",
    "summary": "Paramount is set to lay off approximately 1,000 employees on Wednesday as part of its ongoing cost-reduction strategy. This move is aimed at improving the company's financial performance. The layoffs reflect broader challenges facing the media and entertainment industry.",
    "published": "2025-10-29T17:14:25Z"
  },
  {
    "title": "Voting under way in Netherlands parliamentary election – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/oct/29/netherlands-parliamentary-election-geert-wilders-europe-latest-news-updates",
    "image": "https://media.guim.co.uk/9964bdaa150516fc5de5b166ea337859a6a3eef1/0_606_6442_5154/500.jpg",
    "summary": "Polls indicate that Geert Wilders' far-right Freedom Party (PVV) may secure the top position in upcoming elections, following his withdrawal from a right-wing coalition in June. The political landscape is shifting in response to his party's growing popularity. This development underscores the rising influence of far-right parties in Dutch politics.",
    "published": "2025-10-29T17:13:02Z"
  },
  {
    "title": "Senate Democrats demand list of donors to $300m Trump ballroom",
    "url": "https://www.theguardian.com/us-news/2025/oct/29/trump-ballroom-donors-democrats",
    "image": "https://media.guim.co.uk/073df893a6cfd5c75d6d3d0eee16dedadf7f4f53/408_0_4078_3262/500.jpg",
    "summary": "A letter has alerted the White House to potential \"blatant corruption\" risks posed by companies that make political contributions while seeking government contracts or favors. The warning emphasizes concerns about the integrity of decision-making processes influenced by financial contributions. The correspondence calls for greater scrutiny and transparency regarding these relationships.",
    "published": "2025-10-29T17:08:40Z"
  },
  {
    "title": "MPs vote down Farage’s proposal for UK to leave ECHR – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/oct/29/shabana-mahmood-home-office-immigration-pmqs-labour-keir-starmer-kemi-badenoch-conservatives-uk-politics-live-news",
    "image": "https://media.guim.co.uk/09245e6279f27cb50c4ff8a126094c43766d4d7b/563_0_1685_1348/500.jpg",
    "summary": "The Liberal Democrats emphasized the importance of the European Court of Human Rights (ECHR) in safeguarding the rights of the elderly and vulnerable populations. They argue that the ECHR plays a crucial role in providing necessary protections for those who are most in need. The party calls for continued support for the ECHR to ensure these individuals are defended.",
    "published": "2025-10-29T17:07:58Z"
  },
  {
    "title": "Hurricane Melissa live updates: dozens reported dead in Haiti after river flooded by hurricane bursts banks",
    "url": "https://www.theguardian.com/world/live/2025/oct/29/hurricane-melissa-live-updates-strengthens-cuba-extensive-damage-parts-of-jamaica",
    "image": "https://media.guim.co.uk/6bb36ec44ad6c1eff8ae59986c3fe447c5c4071a/252_0_2245_1796/500.jpg",
    "summary": "The mayor of a southern coastal town in Haiti has expressed feeling \"overwhelmed by the situation\" in his community. He is urgently seeking assistance from the government to address pressing issues. The plea highlights the challenges faced by local leaders amid ongoing crises.",
    "published": "2025-10-29T17:06:39Z"
  }
]