[
  {
    "title": "Gaza ceasefire plan live: Israel’s government approves hostage and ceasefire deal",
    "url": "https://www.theguardian.com/world/live/2025/oct/09/gaza-ceasefire-live-trump-says-hostages-probably-released-monday-idf-says-gaza-city-still-extremely-dangerous",
    "image": "https://media.guim.co.uk/2072190864951de196b7397a409549fc0aaa136b/53_0_4800_3840/500.jpg",
    "summary": "A recent decision paves the way for a suspension of hostilities in Gaza within 24 hours, facilitating the process of freeing Israeli hostages. This development aims to promote peace and alleviate the ongoing conflict in the region. Both sides are expected to engage in negotiations following the truce.",
    "published": "2025-10-09T23:16:47Z"
  },
  {
    "title": "New York attorney general calls bank fraud indictment ‘desperate weaponization of our justice system’ – live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/09/national-guard-ice-federal-property-chicago-illinois-us-politics-live",
    "image": "https://media.guim.co.uk/091b85fed22c626f1017da14894b25a206b4fdd7/737_0_5335_4267/500.jpg",
    "summary": "Trump claims that federal budget cuts during a government shutdown will primarily affect the priorities of his political opponents. A House-passed funding bill and a Democratic stopgap measure have been rejected. The standoff highlights ongoing partisan disagreements over government funding.",
    "published": "2025-10-09T23:14:06Z"
  },
  {
    "title": "Australia politics live: Zali Steggall warns against ‘totalitarian crackdown’ on protesters; Gaza flotilla members arrive back in Australia",
    "url": "https://www.theguardian.com/australia-news/live/2025/oct/10/australia-politics-live-senate-estimates-anthony-albanese-sussan-ley-andrew-hastie-migration-aukus-trump-gaza-ntwnfb",
    "image": "https://media.guim.co.uk/e36e3d3ba8d1ea4a0b6cdfbc87e68ece34fd65be/161_0_3000_2400/500.jpg",
    "summary": "Please provide the news article or details you would like summarized, and I'll be happy to help!",
    "published": "2025-10-09T23:08:33Z"
  },
  {
    "title": "The Woman in Cabin 10 review – silliness of Keira Knightley megayacht thriller tips it overboard",
    "url": "https://www.theguardian.com/film/2025/oct/10/the-woman-in-cabin-10-review-keira-knightley-megayacht-thriller",
    "image": "https://media.guim.co.uk/85af5c21fb6ec461b64a47c3a0fd2cd6aac5dbcd/125_0_4227_3381/500.jpg",
    "summary": "Keira Knightley stars in a mystery reminiscent of Agatha Christie as she investigates a situation on Guy Pearce's boat. Her character faces challenges that lead to her being dunked in the water twice. The film combines suspense with a nautical setting to create an engaging narrative.",
    "published": "2025-10-09T23:00:36Z"
  },
  {
    "title": "Judge temporarily blocks Trump’s effort to deploy national guard troops in Chicago",
    "url": "https://www.theguardian.com/us-news/2025/oct/09/trump-national-guard-troops-chicago-ruling",
    "image": "https://media.guim.co.uk/609eebe0ff79090094ef55de4938f58e1be27cfc/250_0_2500_2000/500.jpg",
    "summary": "A crucial ruling is expected regarding the Trump administration's use of military troops to support immigration enforcement measures. The case examines the legality and implications of deploying armed forces in domestic immigration operations. This decision could have significant ramifications for future immigration policies and military involvement.",
    "published": "2025-10-09T22:43:18Z"
  }
]