[
  {
    "title": "Starmer only read China spy witness statements this morning, No 10 says, as Cleverly accuses PM of misquoting him – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/oct/15/keir-starmer-kemi-badenoch-pmqs-china-epping-rachel-reeves-imf-uk-politics-live-news-updates",
    "image": "https://media.guim.co.uk/a608a7b4df8b74e5e5689af8fcf6ce3ca013b47a/370_350_2283_1826/500.jpg",
    "summary": "The Prime Minister plans to release full statements regarding a case and attributes its failure to the actions of the previous government. This announcement highlights a commitment to transparency amidst ongoing political discussions. The PM's remarks suggest a critique of past governance and its impact on current issues.",
    "published": "2025-10-15T15:17:40Z"
  },
  {
    "title": "Gaza ceasefire live: Israel says body handed over by Hamas is not one of the hostages",
    "url": "https://www.theguardian.com/world/live/2025/oct/15/gaza-ceasefire-israel-hamas-palestine-aid-hostages-detainees-prisoners-live-news-updates",
    "image": "https://media.guim.co.uk/1fa1942e1069e28a7952e7ca5c08d14a65eef438/593_0_1993_1595/500.jpg",
    "summary": "Israel has announced that the flow of aid will be reduced by 50% and the Rafah crossing will remain closed as initially scheduled. This decision is linked to delays in the process of returning the bodies of hostages. The situation underscores ongoing tensions and humanitarian concerns in the region.",
    "published": "2025-10-15T15:17:15Z"
  },
  {
    "title": "England v Pakistan: Women’s Cricket World Cup game resumes after rain – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/15/england-v-pakistan-womens-cricket-world-cup-live",
    "image": "https://media.guim.co.uk/33d1c946666fd59ced1aa629e6e8aacb01c1de52/908_0_6827_5464/500.jpg",
    "summary": "England faces Pakistan in Colombo as they aim to preserve their perfect record in the tournament. The match promises exciting action as both teams compete for victory. Stay tuned for live updates from our reporters.",
    "published": "2025-10-15T15:16:40Z"
  },
  {
    "title": "Supreme court hears Voting Rights Act challenge that could affect control of Congress – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/15/donald-trump-federal-government-shutdown-redistricting-voting-rights-act-kash-patel-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/7e8775e32cb6047f194b2f5815622a3aa4c8c769/1248_0_6269_5015/500.jpg",
    "summary": "The GOP is pushing to declare Section 2 of the Voting Rights Act unconstitutional, aiming to reshape legal frameworks as redistricting disputes arise nationwide. This move is part of broader efforts to address voting rights and discrimination claims. The outcome could significantly impact electoral processes and representation across the country.",
    "published": "2025-10-15T15:14:30Z"
  },
  {
    "title": "India to host 2030 Commonwealth Games – next stop the 2036 Olympics?",
    "url": "https://www.theguardian.com/sport/2025/oct/15/india-to-host-2030-commonwealth-games-next-stop-the-2036-olympics",
    "image": "https://media.guim.co.uk/d54811388de5ae6b3bc61b9f74bfd11c8dec03cb/145_0_3537_2830/500.jpg",
    "summary": "India will officially be approved as the host for the 2030 Commonwealth Games next month. This decision reflects India's growing ambitions in global sports. The country is also aiming to stage the 2036 Olympics, further showcasing its commitment to hosting major international events.",
    "published": "2025-10-15T15:13:35Z"
  }
]