[
  {
    "title": "Liverpool 1-0 Real Madrid: Champions League – live reaction",
    "url": "https://www.theguardian.com/football/live/2025/nov/04/liverpool-v-real-madrid-champions-league-live",
    "image": "https://media.guim.co.uk/12920ebbcdb379acca20e59cad2c3390e4fe5ad0/219_0_4237_3390/500.jpg",
    "summary": "Scott Murray will provide live updates as two major teams face off at Anfield. Fans can expect a detailed minute-by-minute report of the match. Stay tuned for the latest developments in this anticipated showdown.",
    "published": "2025-11-04T22:17:52Z"
  },
  {
    "title": "Tottenham 4-0 Copenhagen, PSG 1-2 Bayern Munich, and more: Champions League – live",
    "url": "https://www.theguardian.com/football/live/2025/nov/04/tottenham-v-copenhagen-psg-v-bayern-munich-and-more-champions-league-live",
    "image": "https://media.guim.co.uk/bd1a8b657eb0fccaf99c04b3fe6a125e9f8d8f05/222_0_3832_3066/500.jpg",
    "summary": "Micky van den Ven showcased his talent with a stunning solo goal for Spurs. Meanwhile, Luis Diaz scored twice during the match before being sent off while playing for Bayern in Paris. The game highlighted both players' skills and dramatic moments on the field.",
    "published": "2025-11-04T22:16:35Z"
  },
  {
    "title": "Helen Garner’s diaries win 2025 Baillie Gifford prize for nonfiction ",
    "url": "https://www.theguardian.com/books/2025/nov/05/helen-garner-diaries-how-to-end-a-story-baillie-gifford-prize-for-nonfiction",
    "image": "https://media.guim.co.uk/cf3509884cc27923725ee2c60a7a0b5f3e4b2d80/1963_506_6031_4826/500.jpg",
    "summary": "\"How to End a Story\" explores the author's journey from her bohemian life in Melbourne during the 1970s to the collapse of her marriage in the 1990s. Judges commended the work for elevating the diary format to new artistic levels. The narrative captures personal transformation and emotional depth through a unique storytelling style.",
    "published": "2025-11-04T22:15:07Z"
  },
  {
    "title": "US elections 2025 live: Mamdani refuses to be ‘intimidated’ by Trump jibes as New York City, New Jersey, Virginia and California vote",
    "url": "https://www.theguardian.com/us-news/live/2025/nov/04/us-elections-2025-live-new-york-city-new-jersey-virginia-california-latest-news-updates-live",
    "image": "https://media.guim.co.uk/88a9be04ff4e347897e06aabd63cfa5e1dbf3434/293_0_2500_2000/500.jpg",
    "summary": "A New York mayoral candidate responded strongly after President Biden labeled any Jewish voters supporting him as \"stupid.\" The candidate condemned the remark as offensive and harmful to the Jewish community. This incident has sparked discussions about political discourse and respect for voters' choices.",
    "published": "2025-11-04T22:14:24Z"
  },
  {
    "title": "Radiohead play career-spanning set in first concert since 2018",
    "url": "https://www.theguardian.com/music/2025/nov/04/radiohead-madrid-tour-first-live-show-seven-years",
    "image": "https://media.guim.co.uk/e21e6da789dd888907436628834c1ee38e2b6925/0_0_3331_2666/500.jpg",
    "summary": "The British band showcased tracks from nearly all their studio albums during their performance in Madrid, marking the beginning of their 20-date European tour. Fans enjoyed a diverse setlist as the quintet energized the crowd. The tour promises to highlight the band's extensive musical evolution and catalog.",
    "published": "2025-11-04T22:04:53Z"
  }
]