[
  {
    "title": "Three prisoners charged with murder of child killer Kyle Bevan",
    "url": "https://www.theguardian.com/uk-news/2025/nov/07/three-prisoners-charged-with-murder-of-child-killer-kyle-bevan-hmp-wakefield",
    "image": "https://media.guim.co.uk/2a42d0c715c0b08bec80e4a9a295ab9916097ac0/0_1307_4000_3201/500.jpg",
    "summary": "Mark Fellows, Lee Newell, and David Taylor have been charged with the murder of Kyle Bevan at a high-security prison in West Yorkshire. The incident has raised concerns about safety and violence in prison settings. The case is significant as it involves multiple individuals implicated in a serious crime behind bars.",
    "published": "2025-11-07T09:19:01Z"
  },
  {
    "title": "Tuchel to name England squad, weekend team news and more: football – live",
    "url": "https://www.theguardian.com/football/live/2025/nov/07/thomas-tuchel-england-squad-jude-bellingham-weekend-team-news-and-more-football-live",
    "image": "https://media.guim.co.uk/b6bac615ec02cb98b912d6e76a3105f3e1fa57f0/552_117_1644_1315/500.jpg",
    "summary": "England manager Thomas Tuchel is set to announce his latest squad ahead of a busy weekend filled with Premier League matches and other events. Fans and players eagerly await the announcement, which could influence selections and strategies. The unveiling comes at a crucial time in the football calendar.",
    "published": "2025-11-07T09:18:10Z"
  },
  {
    "title": "Minister defends David Lammy and says ‘broken system’ to blame for prisoner releases – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/nov/07/uk-politics-latest-news-david-lammy-prisoners-labour-keir-starmer",
    "image": "https://media.guim.co.uk/b6359f3b609c171c0e308a5ba15b1cf0d7009ba7/323_0_4152_3323/500.jpg",
    "summary": "Steve Reed emphasizes that addressing the issue at hand requires focused discussion and not gossip regarding David Lammy in the media. He suggests that productive dialogue is the key to finding solutions. Reed's statement highlights the importance of substantive conversation over sensationalism.",
    "published": "2025-11-07T09:17:07Z"
  },
  {
    "title": "Airports in Belgium disrupted again by suspected drone sightings – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/nov/07/europe-latest-news-updates-belgium-airports-brussels-liege-drones-russia-orban-trump-ukraine",
    "image": "https://media.guim.co.uk/cca9f6fc83ed30c250dab98735385955bc6715fc/788_0_5968_4775/500.jpg",
    "summary": "Drone sightings occurred near Brussels and Liège airports shortly after a national security council meeting focused on emerging threats. Authorities are investigating the incidents in light of recent security concerns. The sightings raise alarms about potential risks to air traffic safety.",
    "published": "2025-11-07T09:08:08Z"
  },
  {
    "title": "Orbán to visit US to try to broker another Putin summit but questions raised over motives",
    "url": "https://www.theguardian.com/world/2025/nov/07/orban-hungary-white-house-visit-trump",
    "image": "https://media.guim.co.uk/6992095c8e47c4ebe4f5db1e33619c41567dd5aa/829_0_4099_3280/500.jpg",
    "summary": "Hungarian Prime Minister Viktor Orbán is seeking an exemption from U.S. sanctions on Russian oil amid increasing domestic pressures leading up to upcoming elections. His government is grappling with challenges at home, making access to Russian oil crucial for economic stability. The request highlights ongoing tensions between Hungary's energy needs and international sanctions against Russia.",
    "published": "2025-11-07T09:03:04Z"
  }
]