[
  {
    "title": "Hong Kong sees near-record low election turnout amid discontent over apartment fire",
    "url": "https://www.theguardian.com/world/2025/dec/08/hong-kong-election-low-turnout-discontent-apartment-fire",
    "image": "https://media.guim.co.uk/0ab612c706755b29966736ba0a514dac5df9ca5b/375_0_3750_3000/500.jpg",
    "summary": "The 'patriots only' Legislative Council elections were held on Sunday, overshadowed by a tragic fire in Tai Po that claimed at least 159 lives. The elections aimed to solidify the government's stance on patriotism in governance. Concerns over public sentiment and safety were heightened following the devastating incident.",
    "published": "2025-12-08T06:33:36Z"
  },
  {
    "title": "News live: Hanson excited for ‘new breed’ of One Nation politicians; Australians’ credit card debt at four-year high",
    "url": "https://www.theguardian.com/australia-news/live/2025/dec/08/australia-news-live-politics-coalition-housing-policy-liberal-labor-vic-nsw-qld-tasmania-weather-bushfires-economy-education-health-social-media-cost-of-living",
    "image": "https://media.guim.co.uk/f7b7a8c639df03076c754cbd930f72bf80b66da3/541_0_5000_4000/500.jpg",
    "summary": "Sorry, I need more context or specific content from the news article you'd like summarized. Please provide the details or key points!",
    "published": "2025-12-08T06:31:39Z"
  },
  {
    "title": "Four members of same family killed in Goa nightclub fire that left 25 dead",
    "url": "https://www.theguardian.com/world/2025/dec/08/india-goa-nightclub-fire-birch-romeo-lane",
    "image": "https://media.guim.co.uk/47fd2112803d4e6bb93d04a934a0297ded8f97c5/408_0_2813_2252/500.jpg",
    "summary": "Officials have reported that a venue violated several safety regulations, specifically citing the absence of a fire safety exit in the basement. This oversight raises significant concerns for public safety. Authorities are likely to take action to address these violations.",
    "published": "2025-12-08T06:25:16Z"
  },
  {
    "title": "TV tonight: the ketamine dealer connected to Matthew Perry’s death",
    "url": "https://www.theguardian.com/tv-and-radio/2025/dec/08/tv-tonight-the-ketamine-dealer-connected-to-matthew-perrys-death",
    "image": "https://media.guim.co.uk/2f8d0da92fa785f9bdb767e8c1c1b90b933b79a0/0_0_2501_2000/500.jpg",
    "summary": "Jasveen Sangha admitted guilt in connection with selling drugs that resulted in Perry's death. Additionally, Jamie Oliver will feature festive cooking segments. Viewers can tune in this evening for the cooking show.",
    "published": "2025-12-08T06:15:42Z"
  },
  {
    "title": "‘When you’re desperate, you fall for things easily’: the scam job ads on TikTok taking people’s money",
    "url": "https://www.theguardian.com/global-development/2025/dec/08/scam-job-ads-tiktok-kenya-taking-peoples-money",
    "image": "https://media.guim.co.uk/0f0afeef3acf76cb8f81db6eb25eb7c16d6bc54b/763_66_3888_3111/500.jpg",
    "summary": "An investigation by The Guardian reveals that fake agencies are exploiting a social media platform to scam Kenyans by offering non-existent job opportunities in Europe. These fraudulent operations entice victims to pay fees for these illusory positions. The report highlights the growing concern of job scams targeting vulnerable populations.",
    "published": "2025-12-08T06:00:45Z"
  }
]