[
  {
    "title": "Lammy to be new deputy PM, say No 10 sources, with Cooper as foreign secretary and Mahmood at Home Office – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/05/angela-rayner-stamp-duty-labour-starmer-reform-nigel-farage-uk-politics-live-news-updates",
    "image": "https://media.guim.co.uk/913b9d574a8deaf211dcd44ce2b6bec9036a29d1/0_0_5000_4000/500.jpg",
    "summary": "Keir Starmer is revamping his senior team following Angela Rayner's resignation due to a stamp duty error. Rayner's departure has prompted a review of leadership roles within the party. The reshuffle aims to strengthen the team's effectiveness and address any vulnerabilities.",
    "published": "2025-09-05T16:37:04Z"
  },
  {
    "title": "Who will replace Angela Rayner? The role changes in Labour’s reshuffle",
    "url": "https://www.theguardian.com/politics/2025/sep/05/who-will-replace-angela-rayner-the-role-changes-in-labours-reshuffle",
    "image": "https://media.guim.co.uk/913b9d574a8deaf211dcd44ce2b6bec9036a29d1/0_0_5000_4000/500.jpg",
    "summary": "The Home Office is undergoing changes as Prime Minister's office aims for more effective communication in response to pressure from the Reform party. This shift reflects a strategic move to improve messaging and public engagement. The adjustments indicate a growing focus on addressing concerns raised by political opponents.",
    "published": "2025-09-05T16:34:21Z"
  },
  {
    "title": "Nige takes to the stage offering empty promises and anger – and the crowd love it | John Crace",
    "url": "https://www.theguardian.com/politics/2025/sep/05/nigel-farage-reform-party-conference-sketch",
    "image": "https://media.guim.co.uk/395e326c2a00fe6aad6d526e29bf35ab59313eb3/650_0_6469_5178/500.jpg",
    "summary": "In a vibrant spectacle filled with music, dry ice, and fireworks, a performer displayed a charismatic, over-the-top style reminiscent of a TV evangelist. The event's atmosphere was charged with energy as the performer captivated the audience. Critics may view the act as a blend of entertainment and deception.",
    "published": "2025-09-05T16:23:12Z"
  },
  {
    "title": "Pentagon expected to become ‘Department of War’ as US cities brace for Trump’s next national guard deployment – live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/05/donald-trump-pentagon-department-of-war-immigration-tariffs-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/19d6d7e1c78a05cbf47a9397f76d18e5be650679/315_0_3826_3061/500.jpg",
    "summary": "Renaming the Pentagon could incur costs in the tens of millions due to necessary changes to letterheads and signage. Additionally, cities like Chicago and Boston are preparing for the deployment of troops in response to threats made by Trump this week. The potential financial impact and military readiness dominate the current news landscape.",
    "published": "2025-09-05T16:18:38Z"
  },
  {
    "title": "Your Guardian sport weekend: WSL kick-off, an England double-header and more",
    "url": "https://www.theguardian.com/sport/2025/sep/05/your-guardian-sport-weekend-wsl-kick-off-an-england-double-header-and-more",
    "image": "https://media.guim.co.uk/c96e477b104b3507b597b12e649c564f273e828f/0_0_5000_4000/500.jpg",
    "summary": "Stay updated with our comprehensive coverage featuring top-notch writing and real-time reports. Follow along to get the latest news and insights. Don't miss any important updates!",
    "published": "2025-09-05T16:15:08Z"
  }
]