[
  {
    "title": "Steelers v Browns, Ravens 3-17 Rams and more: NFL week six – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/12/steelers-v-browns-ravens-v-rams-and-more-nfl-week-six-live",
    "image": "https://media.guim.co.uk/61b7cb11bac825818ff6a21e6efcf6039bb7498d/243_0_2758_2206/500.jpg",
    "summary": "Graham Searles will be providing live updates during week six of the NFL. Fans can expect timely coverage and insights on the games. Tune in for the latest scores and highlights!",
    "published": "2025-10-12T20:14:49Z"
  },
  {
    "title": "Gaza ceasefire live: Netanyahu warns ‘campaign is not over’ as Israel awaits release of hostages",
    "url": "https://www.theguardian.com/world/live/2025/oct/12/gaza-ceasefire-live-aid-relief-hamas-release-israel-hostages",
    "image": "https://media.guim.co.uk/b826099457fa74a398182d2a2a34105b1b0e6877/500_0_5000_4000/500.jpg",
    "summary": "Israeli Prime Minister addresses significant security challenges facing the nation. He expresses optimism that hostages will be released tomorrow. The statement reflects ongoing tensions and concerns for national safety.",
    "published": "2025-10-12T20:02:52Z"
  },
  {
    "title": "Corrections and clarifications",
    "url": "https://www.theguardian.com/news/2025/oct/12/corrections-and-clarifications",
    "summary": "Researchers have developed a new smallpox vaccine that enhances immune response and provides broader protection against related viruses. This advancement aims to safeguard public health and prepare for potential bioterrorism threats. The vaccine shows promise in offering a more effective solution compared to older formulations.",
    "published": "2025-10-12T20:00:00Z"
  },
  {
    "title": "Morning Mail: Calls for rule change on abusers’ honours; release of Gaza hostages nears; Healy heroic in Women’s World Cup",
    "url": "https://www.theguardian.com/australia-news/2025/oct/13/morning-mail-monday-ntwnfb",
    "image": "https://media.guim.co.uk/47300cd6a038bfea9a5b0ba6a673c671e32ff27c/591_0_4505_3604/500.jpg",
    "summary": "Campaigners are advocating for changes to honours rules. Israel and Hamas are negotiating a potential prisoner swap. In sports, Alyssa Healy captained Australia to a victory over India.",
    "published": "2025-10-12T19:40:51Z"
  },
  {
    "title": "Strictly Come Dancing: week three results – as it happened",
    "url": "https://www.theguardian.com/tv-and-radio/live/2025/oct/11/strictly-come-dancing-week-three-live",
    "image": "https://media.guim.co.uk/1e097c6c30085f46aef65a45db1b5beb49a437d9/840_258_3065_2454/500.jpg",
    "summary": "During Movie Week, Thunderbird puppet Ross King found himself at the bottom of the standings. The competition raised speculation about potential box office flops facing the dance-off. Fans are left wondering which Hollywood participants might be eliminated next.",
    "published": "2025-10-12T19:35:44Z"
  }
]