[
  {
    "title": "Australia news live: nation’s first Indigenous treaty passes Victorian parliament; five-year-old girl dies after being hit by ute",
    "url": "https://www.theguardian.com/australia-news/live/2025/oct/31/australia-news-live-politics-parliament-coalition-labor-net-zero-anthony-albanese-sussan-ley-epbc-nature-laws-ntwnfb",
    "image": "https://media.guim.co.uk/95c32ae2b6cb2cfc853523883457aa6ce1b5d27f/667_0_6641_5316/500.jpg",
    "summary": "I'm sorry, but I cannot summarize news without specific information or content to refer to. Please provide details or a link to the news you would like summarized.",
    "published": "2025-10-30T23:13:01Z"
  },
  {
    "title": "My lord, the flies: what’s driving the sudden explosion in numbers across Sydney? ",
    "url": "https://www.theguardian.com/australia-news/2025/oct/31/sydney-more-flies-than-normal",
    "image": "https://media.guim.co.uk/451324974e634e136cb87a6fdf62081cdd6c39b4/835_69_4474_3579/500.jpg",
    "summary": "Unseasonably warm and wet spring weather has driven insects that thrive on saliva to urban areas. This rise in insect activity has caught the attention of residents and experts alike. The phenomenon has sparked curiosity about the impact on local ecosystems and public health.",
    "published": "2025-10-30T23:00:09Z"
  },
  {
    "title": "I’d have been shattered in year 12 if I’d studied the wrong Caesar for my exam. Wouldn’t you? | Paul Daley",
    "url": "https://www.theguardian.com/commentisfree/2025/oct/31/australia-year-12-studied-wrong-caesar-for-exam",
    "image": "https://media.guim.co.uk/bfd102a9c6b79390c3b768d8a34df63bf45da316/443_0_2558_2047/500.jpg",
    "summary": "Queensland students faced anxiety when they discovered they had studied the wrong Roman emperor for an exam. This has led to concerns over their preparation and potential impact on their grades. Many reminisce about similar pressures from their own high school experiences.",
    "published": "2025-10-30T22:56:09Z"
  },
  {
    "title": "Trump ally Stephen Miller at heart of FBI agent purge, new book reveals",
    "url": "https://www.theguardian.com/us-news/2025/oct/30/stephen-miller-trump-fbi-agents-injustice",
    "image": "https://media.guim.co.uk/14d4ac619a1fc52ab3f81e2325b3037a398f26c9/569_0_5000_4000/500.jpg",
    "summary": "In their book \"Injustice,\" authors reveal that Miller advocated for the dismissal of officials who had investigated President Trump to fulfill his wish for revenge. This move highlights the influence of loyalty and political motives within the administration. The narrative raises concerns about the integrity of investigations into presidential conduct.",
    "published": "2025-10-30T22:52:44Z"
  },
  {
    "title": "Prince Andrew to be stripped of titles and forced to leave Windsor home",
    "url": "https://www.theguardian.com/uk-news/2025/oct/30/prince-andrew-leave-royal-lodge-windsor",
    "image": "https://media.guim.co.uk/e0e1d937c4db5e45ee39873e5b4ac2dad38374eb/408_0_4080_3264/500.jpg",
    "summary": "Buckingham Palace announced that Prince Andrew will now be known as Andrew Mountbatten Windsor, a change linked to the ongoing fallout from the Jeffrey Epstein scandal. This rebranding comes as part of the royal family's efforts to distance themselves from past controversies. The decision reflects a significant shift in the public perception and representation of the prince.",
    "published": "2025-10-30T22:20:42Z"
  }
]