[
  {
    "title": "US Open tennis 2025: Jannik Sinner v Carlos Alcaraz, men’s singles final – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/07/us-open-tennis-2025-jannik-sinner-v-carlos-alcaraz-mens-singles-final-live",
    "image": "https://media.guim.co.uk/e85998eaaab35f11c31ada45c43f173aab8265b5/79_0_3667_2935/500.jpg",
    "summary": "Daniel Harris provides live updates from the men's singles final at Flushing Meadows. The report covers key moments and performances throughout the match. Stay tuned for ongoing developments as the match unfolds.",
    "published": "2025-09-07T20:29:19Z"
  },
  {
    "title": "Day of the Tuchel: forget any English culture stuff, this is a one-off mission",
    "url": "https://www.theguardian.com/football/2025/sep/07/thomas-tuchel-england-world-cup-2026-qualifiers",
    "image": "https://media.guim.co.uk/fe22e6dece00ac8b3e4ebd95f811737d49f4439a/891_44_4096_3277/500.jpg",
    "summary": "German football leaders are urging a shift away from previous management's benevolent nativism and a renewed focus on achieving World Cup success. The emphasis is on maintaining discipline and commitment towards this goal. Ultimately, they emphasize that nothing can replace the prestige of winning the World Cup.",
    "published": "2025-09-07T20:28:48Z"
  },
  {
    "title": "Freddie Flintoff’s Field of Dreams: Ultimate Test review – this TV show is a beacon of hope",
    "url": "https://www.theguardian.com/tv-and-radio/2025/sep/07/freddie-flintoff-field-of-dreams-ultimate-test-review-bbc-one-iplayer",
    "image": "https://media.guim.co.uk/9af748c746dc6818c0be836f18a7da52c0f93b27/357_0_3571_2857/500.jpg",
    "summary": "The cricket star is dedicated to helping disadvantaged children by forming a girls' XI team. His enthusiasm and commitment to addressing their challenges are commendable. Supporting his mission can make a positive difference in their lives.",
    "published": "2025-09-07T20:10:29Z"
  },
  {
    "title": "Corrections and clarifications",
    "url": "https://www.theguardian.com/news/2025/sep/07/corrections-and-clarifications1",
    "summary": "The International League Against Racism and Antisemitism (ILRA) has raised concerns over the content of recent GCSE maths exams, suggesting that certain questions may be racially insensitive or potentially offensive. The organization advocates for review and revision of exam materials to ensure inclusivity and sensitivity. This situation highlights the ongoing dialogue about diversity and representation in education.",
    "published": "2025-09-07T20:00:29Z"
  },
  {
    "title": "‘He’s our last resort’: Bolsonaro supporters beg Trump to intervene in ex-president’s coup trial",
    "url": "https://www.theguardian.com/world/2025/sep/07/hes-our-last-resort-bolsonaro-supporters-beg-trump-to-intervene-in-ex-presidents-coup-trial",
    "image": "https://media.guim.co.uk/c28e5b5da6bb6639e21d49276fb5c266f7cd0185/226_0_4448_3559/500.jpg",
    "summary": "Rightwing protesters in Brazil have gathered in the streets ahead of a crucial ruling from the Supreme Court regarding an alleged plot linked to the 2022 elections. Tensions are heightened as the court prepares to deliver its decision. The protests reflect significant political divides in the country.",
    "published": "2025-09-07T19:55:14Z"
  }
]