[
  {
    "title": "FTSE 100 slides as US regional bank worries rock markets – business live",
    "url": "https://www.theguardian.com/business/live/2025/oct/17/us-dollar-worst-week-since-august-trade-tensions-stock-markets-bonds-business-live-news",
    "image": "https://media.guim.co.uk/e377b16e9d60276db23a73b8447d47e7d5b2dcec/500_0_5000_4000/500.jpg",
    "summary": "The fear index has surged, prompting European markets to decline following a downturn in Asia. Concerns over rising bad loans are negatively impacting market valuations. Investor anxiety is driving heightened volatility across global exchanges.",
    "published": "2025-10-17T12:39:36Z"
  },
  {
    "title": "Jessica Fostekew: Iconic Breath review – furious, frustrated yet cheerfully funny",
    "url": "https://www.theguardian.com/stage/2025/oct/17/jessica-fostekew-iconic-breath-review-soho-theatre",
    "image": "https://media.guim.co.uk/81fee443f70eb6fb83add3c52355a5e4a3e1c21f/204_267_2860_2289/500.jpg",
    "summary": "The comedy show delves into relatable aspects of family life and the annoyance of podcasters, delivering humor that often brings raised eyebrows. Its personal anecdotes and observations create a consistently engaging experience for the audience. Overall, it successfully blends humor with everyday challenges, making it enjoyable to watch.",
    "published": "2025-10-17T12:39:33Z"
  },
  {
    "title": "Arteta backs Gyökeres, Palmer injury blow, Liverpool v Manchester United news – football live",
    "url": "https://www.theguardian.com/football/live/2025/oct/17/premier-league-returns-with-liverpool-v-manchester-united-buildup-football-live",
    "image": "https://media.guim.co.uk/3e35e61cb244910a819ef4b65d81e470cbe90007/0_0_6021_4818/500.jpg",
    "summary": "A rolling report highlights updates from writers as they prepare for an action-packed weekend of football. Fans can expect continuous coverage leading up to the matches. Stay tuned for the latest news and insights in the buildup to the games.",
    "published": "2025-10-17T12:38:24Z"
  },
  {
    "title": "Ex-Trump adviser John Bolton surrenders after indictment",
    "url": "https://www.theguardian.com/us-news/2025/oct/17/john-bolton-indicted-trump",
    "image": "https://media.guim.co.uk/874df842cde311ae5588dd1e485748f72a060680/577_0_4560_3648/500.jpg",
    "summary": "A Trump critic is scheduled to appear in court for charges related to the mishandling of classified information. The case highlights ongoing tensions surrounding the former president's actions and legal troubles. The outcome may have implications for both political and legal landscapes.",
    "published": "2025-10-17T12:36:13Z"
  },
  {
    "title": "John Bolton expected to surrender to authorities on Friday after being indicted – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/17/donald-trump-john-bolton-volodymyr-zelenskyy-us-politics-latest-news-updates",
    "image": "https://media.guim.co.uk/fbd516d4ba8601adb49432beadce4a4fe5ff11c6/503_0_4369_3496/500.jpg",
    "summary": "A federal grand jury in Maryland has issued an eighteen-count indictment against a former adviser to President Trump. In response, Trump referred to the ex-ally as a \"bad guy.\" The charges against the adviser outline serious allegations, though specific details have not been disclosed in the summary.",
    "published": "2025-10-17T12:35:11Z"
  }
]