[
  {
    "title": "US Open tennis 2025: Jannik Sinner v Carlos Alcaraz, men’s singles final – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/07/us-open-tennis-2025-jannik-sinner-v-carlos-alcaraz-mens-singles-final-live",
    "image": "https://media.guim.co.uk/e85998eaaab35f11c31ada45c43f173aab8265b5/79_0_3667_2935/500.jpg",
    "summary": "The men's singles final at Flushing Meadows is currently underway, with live updates provided by Daniel Harris. Fans are eagerly following the match as it develops, anticipating thrilling moments and key plays. Stay tuned for more detailed coverage and insights as the final progresses.",
    "published": "2025-09-07T19:20:05Z"
  },
  {
    "title": "Sabalenka’s US Open triumph shows lessons have been learned",
    "url": "https://www.theguardian.com/sport/2025/sep/07/aryna-sabalenka-us-open-title-amanda-anisimova-tennis",
    "image": "https://media.guim.co.uk/ab8da7e13cf97f18796278f33169f7755fa6da8f/651_0_3725_2980/500.jpg",
    "summary": "The world's top-ranked player has demonstrated remarkable emotional control, enhancing her performance in major tournaments. This consistency has solidified her status among elite competitors. Her ability to manage pressure is a key factor in her success.",
    "published": "2025-09-07T19:16:02Z"
  },
  {
    "title": "Senior Labour figures tell Keir Starmer to stop making mistakes",
    "url": "https://www.theguardian.com/politics/2025/sep/07/senior-labour-figures-keir-starmer-stop-making-mistakes",
    "image": "https://media.guim.co.uk/4d7bcb326abd1e3e18764b5fb297a1b6d91877ac/0_931_5464_4371/500.jpg",
    "summary": "Prime Minister faces backlash from Emily Thornberry, who warns that his actions could lead to giving control of the country to Nigel Farage. Thornberry emphasizes the potential dangers of the current political situation. The criticism underlines increasing tensions in the country's leadership dynamics.",
    "published": "2025-09-07T18:45:21Z"
  },
  {
    "title": "New business secretary Peter Kyle going to China for trade talks this week",
    "url": "https://www.theguardian.com/politics/2025/sep/07/uk-business-secretary-peter-kyle-visit-beijing",
    "image": "https://media.guim.co.uk/81140f5364b5a23ff475ca76f779963d0ec11ac0/183_0_4455_3565/500.jpg",
    "summary": "In a recent government reshuffle, a former science secretary has been promoted to strengthen the UK’s trade relationship with Beijing. This move aims to enhance economic ties and cooperation between the two nations. The promotion underscores the UK’s commitment to revitalizing trade with China.",
    "published": "2025-09-07T18:38:07Z"
  },
  {
    "title": "France 57-10 South Africa: Women’s Rugby World Cup – as it happened",
    "url": "https://www.theguardian.com/sport/live/2025/sep/07/france-v-south-africa-womens-rugby-world-cup-live",
    "image": "https://media.guim.co.uk/e1dee9b686a17221f6f3cec97ad7ed19c78d564c/455_0_4542_3634/500.jpg",
    "summary": "France dominated South Africa with a resounding victory, scoring nine tries in the match. Despite the loss, both teams secured their places in the quarter-finals. The game highlighted France's strong performance and South Africa's rotated squad.",
    "published": "2025-09-07T18:18:00Z"
  }
]