[
  {
    "title": "Atlético Madrid v Manchester United: Women’s Champions League – live",
    "url": "https://www.theguardian.com/football/live/2025/oct/16/atletico-madrid-v-manchester-united-womens-champions-league-live",
    "image": "https://media.guim.co.uk/95fa564497da670689ab4bbcdc20014e13500afa/184_103_2482_1985/500.jpg",
    "summary": "Marc Skinner's team is set to face a challenging match in the Spanish capital, with Yara El-Shaboury providing live updates. Fans can expect minute-by-minute coverage of the game. Stay tuned for developments as the match unfolds.",
    "published": "2025-10-16T17:15:44Z"
  },
  {
    "title": "Johnson condemns leaked Young Republicans group chat messages as Senate fails to pass funding bill for tenth time – live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/16/trump-latest-shutdown-vote-jd-vance-republicans-democrats",
    "image": "https://media.guim.co.uk/aba7d93795bedf7f9478ad278007b223febd0511/546_0_2753_2202/500.jpg",
    "summary": "The House Speaker claimed he was unfamiliar with members of the Young Republicans chat group amid ongoing budget negotiations. The Senate has rejected a funding bill passed by the House, with a vote of 51-45. This marks the 16th day of the government shutdown as lawmakers struggle to reach an agreement.",
    "published": "2025-10-16T17:14:35Z"
  },
  {
    "title": "Ministers plan high-level visits to China despite espionage trial outcry",
    "url": "https://www.theguardian.com/politics/2025/oct/16/ministers-plan-high-level-visits-to-china-despite-espionage-trial-outcry",
    "image": "https://media.guim.co.uk/b1f3c5cd082b1b0bf8af9e84880aa7d9f9670596/271_0_2560_2048/500.jpg",
    "summary": "The national security adviser, education secretary, and science minister are scheduled to visit before the year's end. This visit aims to reset and improve bilateral relations. The initiative reflects a strategic approach to foster collaboration and dialogue.",
    "published": "2025-10-16T17:10:22Z"
  },
  {
    "title": "Maccabi Tel Aviv fans banned from game at Aston Villa in Europa League",
    "url": "https://www.theguardian.com/football/2025/oct/16/maccabi-tel-aviv-fans-banned-from-game-at-aston-villa-in-europa-league",
    "image": "https://media.guim.co.uk/b663a9a095ad7088e68f03c6bee5d134ac3b47b2/791_67_3663_2930/500.jpg",
    "summary": "Maccabi Tel Aviv fans have been banned from attending the Europa League match against Aston Villa on November 6. The decision was made due to safety concerns. This restriction aims to ensure the security of all involved during the match.",
    "published": "2025-10-16T17:03:24Z"
  },
  {
    "title": "US ‘on a trajectory’ toward authoritarian rule, ex-officials warn",
    "url": "https://www.theguardian.com/us-news/2025/oct/16/trump-authoritarianism-warning",
    "image": "https://media.guim.co.uk/72fee4f7a0e64df0d8620012c6bef4e69072ab45/512_0_3544_2835/500.jpg",
    "summary": "A network of former intelligence and security officials has reported that democratic decline in the United States is intensifying during Donald Trump's presidency. They claim that various actions and policies under his leadership are eroding democratic institutions and norms. The group emphasizes the urgency of addressing these trends to protect democracy.",
    "published": "2025-10-16T17:00:47Z"
  }
]