[
  {
    "title": "Chelsea v Manchester City: WSL – football live",
    "url": "https://www.theguardian.com/football/live/2025/sep/05/chelsea-v-manchester-city-wsl-football-live",
    "image": "https://media.guim.co.uk/3803434d02bf388bb39800b36e501412c337b382/467_182_3747_2998/500.jpg",
    "summary": "Chelsea hosts Manchester City at Stamford Bridge to begin the new Women's Super League (WSL) season. Rob Smyth provides minute-by-minute coverage of the match. This clash marks an exciting start for both teams in the league.",
    "published": "2025-09-05T20:33:12Z"
  },
  {
    "title": "Most of 475 people arrested by US immigration agents at Georgia Hyundai facility are Korean nationals – live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/05/donald-trump-pentagon-department-of-war-immigration-tariffs-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/044eb5ce3fb7049437c4044c77272848f314af01/996_0_5000_4000/500.jpg",
    "summary": "ICE's investigative division carried out a warrant related to an ongoing criminal investigation, according to a spokesperson from Homeland Security. The operation is part of broader law enforcement efforts. Details about the specific investigation have not been disclosed.",
    "published": "2025-09-05T20:32:35Z"
  },
  {
    "title": "Denmark v Scotland, Isak in action for Sweden and more: 2026 World Cup qualifiers - clockwatch",
    "url": "https://www.theguardian.com/football/live/2025/sep/05/denmark-v-scotland-isak-in-action-for-sweden-and-more-2026-world-cup-qualifiers-clockwatch",
    "image": "https://media.guim.co.uk/3ad995a00aa0a2b41b7d81cadfdebf898880d1ef/306_100_1805_1444/500.jpg",
    "summary": "Barry Glendenning provides live updates as Scotland faces Denmark in Copenhagen, along with coverage of nine other World Cup qualifying matches. Fans can follow the action and results as teams compete for a spot in the prestigious tournament. Stay tuned for thrilling moments and key developments throughout the qualifiers.",
    "published": "2025-09-05T20:32:04Z"
  },
  {
    "title": "US Open tennis 2025: Novak Djokovic v Carlos Alcaraz, men’s semi-final – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/05/us-open-tennis-2025-novak-djokovic-carlos-alcaraz-mens-semi-final-live",
    "image": "https://media.guim.co.uk/42af62af94652f4480d4f4ae044c66f65d0d4263/1269_310_2317_1854/500.jpg",
    "summary": "Katy Murrells provides live updates from the men's semi-finals at Flushing Meadows. The report offers game-by-game insights as the match unfolds. Fans can follow along for the latest highlights and key moments.",
    "published": "2025-09-05T20:26:33Z"
  },
  {
    "title": "Trump signs executive order rebranding Pentagon as ‘Department of War’",
    "url": "https://www.theguardian.com/us-news/2025/sep/05/department-war-defense-trump-executive-order-pentagon",
    "image": "https://media.guim.co.uk/2a842627f6cfe68e4405b8d1ce0dab3b8180b766/0_0_6910_5526/500.jpg",
    "summary": "A new order requires Pete Hegseth to obtain congressional approval for a permanent rebranding of the \"Department of Defense.\" This initiative aims to change the department's name to better reflect its mission and values. The order emphasizes the importance of legislative support for such significant modifications.",
    "published": "2025-09-05T20:25:13Z"
  }
]