[
  {
    "title": "Ireland v South Africa: Autumn Nations Series rugby union – live",
    "url": "https://www.theguardian.com/sport/live/2025/nov/22/ireland-v-south-africa-autumn-nations-series-rugby-union-live",
    "image": "https://media.guim.co.uk/9e6f240b604c7edad9fae5c8830f544f03c3d879/391_124_4249_3401/500.jpg",
    "summary": "Andy Farrell's team is set to face off against South Africa in a highly anticipated match in Dublin. The report provides a minute-by-minute update on the game's progress. Fans are eager to see how the Irish side will perform against the formidable opposition.",
    "published": "2025-11-22T19:14:19Z"
  },
  {
    "title": "Cop30 live: Deal agreed at Cop after long negotiations",
    "url": "https://www.theguardian.com/environment/live/2025/nov/22/cop30-climate-talks-deal-overtime-live-news",
    "image": "https://media.guim.co.uk/410e6c1216e81f2d331e156e15d1703df652b560/346_0_3449_2761/500.jpg",
    "summary": "After intense all-night negotiations, a crucial agreement was reached at COP30, alleviating concerns of the summit's possible collapse. Delegates managed to finalize key climate commitments, highlighting the urgency of global action. The deal's passage marks a significant step forward in international climate diplomacy.",
    "published": "2025-11-22T19:14:01Z"
  },
  {
    "title": "Newcastle United v Manchester City: Premier League – live",
    "url": "https://www.theguardian.com/football/live/2025/nov/22/newcastle-united-v-manchester-city-premier-league-live",
    "image": "https://media.guim.co.uk/47c821b38fdb12737b7a3e83ecef7b05395aa607/169_205_2262_1810/500.jpg",
    "summary": "Pep Guardiola's team aims to narrow the points gap at the top of the table during their match at St James' Park. Scott Murray provides a minute-by-minute report on the game's progress. Fans are eager to see if Guardiola’s tactics will lead to victory.",
    "published": "2025-11-22T19:13:55Z"
  },
  {
    "title": "Strictly Come Dancing: Blackpool special – live",
    "url": "https://www.theguardian.com/tv-and-radio/live/2025/nov/22/strictly-come-dancing-blackpool-special-live",
    "image": "https://media.guim.co.uk/d55b9629dc9adc20a5759aac6483440a3e40f6bb/395_0_3953_3162/500.jpg",
    "summary": "The annual Tower Ballroom event features performances of songs by Arctic Monkeys and S Club 7. Attention is focused on which participants will excel on the dancefloor and who might struggle to impress the audience. The anticipation builds for this exciting musical showcase.",
    "published": "2025-11-22T19:11:40Z"
  },
  {
    "title": "Arne Slot offers no excuses and vows to plot route out of Liverpool malaise",
    "url": "https://www.theguardian.com/football/2025/nov/22/arne-slot-offers-no-excuses-and-vows-to-plot-route-out-of-liverpool-malaise",
    "image": "https://media.guim.co.uk/0ce17aea332fd57e359c32c569e899ce6f55ed0e/76_0_1575_1260/500.jpg",
    "summary": "Arne Slot reflected on his own performance following Liverpool's disappointing sixth defeat in seven league matches against Nottingham Forest at Anfield. He acknowledged the team's struggles and emphasized the need for self-evaluation. The loss marks a challenging period for Liverpool as they seek to improve their form.",
    "published": "2025-11-22T19:08:49Z"
  }
]