[
  {
    "title": "Newcastle United 2-1 Manchester City: Premier League – as it happened",
    "url": "https://www.theguardian.com/football/live/2025/nov/22/newcastle-united-v-manchester-city-premier-league-live",
    "image": "https://media.guim.co.uk/47c821b38fdb12737b7a3e83ecef7b05395aa607/169_205_2262_1810/500.jpg",
    "summary": "Harvey Barnes scored twice to lead Newcastle to victory over Manchester City, marking Eddie Howe's first Premier League win against the defending champions. The match showcased Barnes' standout performance, contributing significantly to the team's success. Scott Murray provided a minute-by-minute report of the action.",
    "published": "2025-11-22T20:20:53Z"
  },
  {
    "title": "Strictly Come Dancing: Blackpool special – live",
    "url": "https://www.theguardian.com/tv-and-radio/live/2025/nov/22/strictly-come-dancing-blackpool-special-live",
    "image": "https://media.guim.co.uk/d55b9629dc9adc20a5759aac6483440a3e40f6bb/395_0_3953_3162/500.jpg",
    "summary": "The annual Tower Ballroom event features performances of popular songs by Arctic Monkeys and S Club 7. Attention is on which participants will impress on the dancefloor and who may struggle to capture the audience's interest. Viewers are eager to see the dance moves and style exhibited at the extravaganza.",
    "published": "2025-11-22T20:20:28Z"
  },
  {
    "title": "Ireland 13-24 South Africa: Autumn Nations Series rugby union – as it happened",
    "url": "https://www.theguardian.com/sport/live/2025/nov/22/ireland-v-south-africa-autumn-nations-series-rugby-union-live",
    "image": "https://media.guim.co.uk/3a09f487e93f50ba18ce0798742b9e618263f9cc/1047_0_6260_5008/500.jpg",
    "summary": "Ireland faced significant disciplinary issues, resulting in five players sent to the sin-bin, one receiving a red card. South Africa capitalized on this advantage, showcasing their physical style of play. This victory marked Rassie Erasmus' first win as coach in Dublin.",
    "published": "2025-11-22T20:16:56Z"
  },
  {
    "title": "South Africa make heavy weather of victory over indisciplined Ireland",
    "url": "https://www.theguardian.com/sport/2025/nov/22/ireland-south-africa-autumn-nations-series-rugby-union-match-report",
    "image": "https://media.guim.co.uk/0f946ab7ab3576dce9670c0c6755a576923574ed/440_0_3561_2850/500.jpg",
    "summary": "Ireland faced a 24-13 defeat against world champions South Africa in their autumn finale. The match saw five Irish players receiving yellow cards, impacting their performance. Despite the loss, Ireland demonstrated resilience against a top-tier opponent.",
    "published": "2025-11-22T20:13:20Z"
  },
  {
    "title": "Cop30 live: Deal agreed at Cop after long negotiations",
    "url": "https://www.theguardian.com/environment/live/2025/nov/22/cop30-climate-talks-deal-overtime-live-news",
    "image": "https://media.guim.co.uk/410e6c1216e81f2d331e156e15d1703df652b560/346_0_3449_2761/500.jpg",
    "summary": "After intense all-night negotiations at Cop30, fears of a summit collapse were alleviated as a final agreement was reached. The decision marks a significant achievement for the participating nations. Key points of the agreement focus on climate action and international cooperation.",
    "published": "2025-11-22T20:05:54Z"
  }
]