[
  {
    "title": "Manchester United v Chelsea: Women’s Super League – live",
    "url": "https://www.theguardian.com/football/live/2025/oct/03/manchester-united-v-chelsea-womens-super-league-live",
    "image": "https://media.guim.co.uk/a9d516eac49d6351d3cf6805015f62e6238bef8a/115_0_3220_2576/500.jpg",
    "summary": "The champions face Manchester United in what is considered their toughest challenge of the season. Scott Murray will provide a minute-by-minute report of the match. Fans can expect a thrilling encounter between the two teams.",
    "published": "2025-10-03T20:19:20Z"
  },
  {
    "title": "Sean ‘Diddy’ Combs to address court after prosecution and defense spar over sentencing – live updates",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/03/sean-diddy-combs-sentencing-trial-conviction-latest-updates",
    "image": "https://media.guim.co.uk/275587ab041d168427a6e4ce98fef167deb4dc24/105_0_2812_2250/500.jpg",
    "summary": "Combs, portrayed by his children as a transformed individual, is set to speak during his sentencing hearing in New York. The hearing follows recent developments in his case. Details on the nature of the charges have not been disclosed in this summary.",
    "published": "2025-10-03T20:16:24Z"
  },
  {
    "title": "Three more arrests in synagogue attack investigation; Lammy heckled at vigil for Manchester synagogue attack – latest",
    "url": "https://www.theguardian.com/uk-news/live/2025/oct/03/manchester-synagogue-attack-victims-adrian-daulby-melvin-cravitz-attacker-jihad-al-shamie-latest-news-updates",
    "image": "https://media.guim.co.uk/5347b15f89fa47dd6352daad2ae5a946f25a0b07/231_0_5423_4340/500.jpg",
    "summary": "Police have arrested three additional suspects linked to a recent terror attack, increasing the total number of arrests to six. A significant crowd gathered to honor the victims, leading to emotional reactions, including shouts of \"shame on you\" directed at the justice secretary. The situation highlights growing public frustration and calls for accountability in the aftermath of the incident.",
    "published": "2025-10-03T20:14:39Z"
  },
  {
    "title": "Hamas accepts some elements of Trump’s Gaza plans but says others require further negotiations – live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/03/shutdown-congress-trump-senate-latest-updates",
    "image": "https://media.guim.co.uk/9b4205aea3f4fabc735b6ffe16d553a37b6532ec/580_0_5802_4644/500.jpg",
    "summary": "A group has agreed to release all remaining Israeli hostages, regardless of their condition, but emphasized that additional negotiations are needed to finalize the arrangement. The announcement highlights ongoing discussions surrounding the fate of the hostages. Further details on the negotiation process are yet to be determined.",
    "published": "2025-10-03T20:05:49Z"
  },
  {
    "title": "Sean ‘Diddy’ Combs set to speak in court as prosecution witness backs out",
    "url": "https://www.theguardian.com/music/2025/oct/03/sean-diddy-combs-criminal-sentencing",
    "image": "https://media.guim.co.uk/1b026313c8593a38898ca4ad663773081df0e86a/94_0_2813_2250/500.jpg",
    "summary": "A judge has indicated that the possibility of a lenient sentence for disgraced hip-hop mogul Sean Combs is diminishing. The judge expressed concerns that Combs has not fully shown remorse for his actions. This development may impact the final outcome of his sentencing proceedings.",
    "published": "2025-10-03T19:45:23Z"
  }
]