[
  {
    "title": "Lecornu asks French parliament not to use budget to vote down his government – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/oct/14/france-lecornu-macron-ukraine-russia-zelenskyy-europe-latest-news-updates",
    "image": "https://media.guim.co.uk/7d7286af721d3a9933a23ea0e7fe1a8e37548a45/766_0_1799_1440/500.jpg",
    "summary": "The Prime Minister is aiming to gain support from Socialists to avoid a no-confidence vote that could exacerbate France's political crisis. This move is crucial as the government seeks to maintain stability amidst rising tensions. The outcome will significantly impact the country's political landscape.",
    "published": "2025-10-14T13:29:34Z"
  },
  {
    "title": "Academic axed from Labour conference panel for criticising energy policy",
    "url": "https://www.theguardian.com/politics/2025/oct/14/sustainability-professors-talk-at-uk-party-conferences-cancelled",
    "image": "https://media.guim.co.uk/b520eb2c11030105b039552e94363acf766fc5a6/0_31_833_666/500.jpg",
    "summary": "A sustainability expert revealed that during a panel discussion on North Sea oil and gas, participants were instructed to reach complete agreement. This directive raises concerns about the authenticity of the dialogue on energy sustainability. The situation highlights potential biases in discussions surrounding environmental issues.",
    "published": "2025-10-14T13:26:38Z"
  },
  {
    "title": "The gospel according to Peter Thiel: why the tech svengali is obsessed with the antichrist",
    "url": "https://www.theguardian.com/technology/2025/oct/13/peter-thiel-the-antichrist-and-why-the-world-should-listen",
    "image": "https://media.guim.co.uk/164d54cb02ce42315ea1400d7b3cb28fde95e9a6/0_0_3750_3000/500.jpg",
    "summary": "A prominent billionaire investor has been secretly delivering lectures focused on urgent warnings about impending global crises or \"Armageddon.\" His messages highlight significant economic and societal risks, drawing attention to potential impacts on investments and markets. The lectures have raised concerns about the investor's outlook and the broader implications for the economy and society.",
    "published": "2025-10-14T13:24:05Z"
  },
  {
    "title": "Starmer says he expects debate about ‘full horror’ of what happened in Gaza when media allowed in – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/oct/14/keir-starmer-china-national-security-spying-gaza-nigel-farage-uk-politics-live-news-updates",
    "image": "https://media.guim.co.uk/a62e2bee5a65addf5e2afa8e22f90a0f32212ab2/388_2_1151_921/500.jpg",
    "summary": "Prime Minister praised Donald Trump’s role in facilitating a Middle East peace deal, highlighting its significance. However, he emphasized that the focus now should be on the effective implementation of the agreement. The statement reflects a commitment to ensuring stability and cooperation in the region.",
    "published": "2025-10-14T13:23:01Z"
  },
  {
    "title": "UK economy increasingly likely to suffer ‘bumpy landing’, says Bank of England’s Taylor – business live",
    "url": "https://www.theguardian.com/business/live/2025/oct/14/us-treasury-secretary-beijing-rare-earths-us-china-port-fees-imf-tariffs-business-live-news",
    "image": "https://media.guim.co.uk/1b2a96f686428c9005a81e801fc781ce35e56b97/419_0_6830_5464/500.jpg",
    "summary": "The latest economic and financial news includes a focus on market fluctuations, updates on inflation rates, and central bank policy changes. Analysts are closely monitoring employment data and consumer spending trends. Investors are adjusting strategies in response to ongoing economic uncertainties.",
    "published": "2025-10-14T13:22:59Z"
  }
]