[
  {
    "title": "Australia news live: NSW Central Coast ‘not out of the woods yet’ as bushfire conditions ease; more platforms could be added after under-16 social media ban begins, Wells says",
    "url": "https://www.theguardian.com/australia-news/live/2025/dec/07/australia-news-live-nsw-bushfire-central-coast-upper-hunter-chris-minns-anthony-albanese-anika-wells-social-media-ban-syria-refugees-tasmania-dolphin-sands-labor-coalition-ntwnfb",
    "image": "https://media.guim.co.uk/e5625f8590adc6d9e3787407c31dcb31213c80f5/166_0_1088_870/500.jpg",
    "summary": "I'm happy to help with summarization! However, I need the specific news content you'd like summarized in order to assist you. Please provide the details of the news article or event.",
    "published": "2025-12-07T04:30:04Z"
  },
  {
    "title": "Australia v England: Ashes second Test, day four – live",
    "url": "https://www.theguardian.com/sport/live/2025/dec/07/australia-vs-england-live-ashes-second-2nd-test-day-four-aus-v-eng-cricket-scores-updates-gabba-brisbane",
    "image": "https://media.guim.co.uk/5c58c3d59b3d7777f5da6656a1a381573be9ff26/359_0_3099_2481/500.jpg",
    "summary": "England faces a challenging situation in Brisbane as they require a significant turnaround. Updates will be provided by our writers from the Gabba. The match is proving to be a tough battle for the English team.",
    "published": "2025-12-07T04:27:49Z"
  },
  {
    "title": "Trump news at a glance: Hegseth faces most serious crisis of tenure ",
    "url": "https://www.theguardian.com/us-news/2025/dec/07/trump-administration-news-update-today",
    "image": "https://media.guim.co.uk/e1939d30f844cd348ad7346759ca10e7d3a1e1c8/0_0_4912_3930/500.jpg",
    "summary": "US Defense Secretary Pete Hegseth faces criticism for the mishandling of classified military intelligence related to recent Caribbean boat attacks. The controversy raises questions about national security and accountability within the administration. Key political developments continue to unfold as the situation attracts significant media attention.",
    "published": "2025-12-07T03:02:49Z"
  },
  {
    "title": "Double-post salvation gives Busquets and Alba a fitting farewell in MLS Cup final",
    "url": "https://www.theguardian.com/football/2025/dec/06/inter-miami-mls-cup-messi-busquets-alba-vancouver",
    "image": "https://media.guim.co.uk/4c6c00f1250d6db98e5d2a1b8de694be415693f0/62_0_3073_2459/500.jpg",
    "summary": "Inter Miami clinched their first MLS Cup after a thrilling match that featured a close double-post escape. Lionel Messi and his teammates secured the victory, providing a perfect farewell for Sergio Busquets and Jordi Alba. The win marks a historic achievement for the club.",
    "published": "2025-12-07T01:56:43Z"
  },
  {
    "title": "Ukraine war briefing: With no Miami breakthrough, Zelenskyy turns to European allies",
    "url": "https://www.theguardian.com/world/2025/dec/07/ukraine-war-briefing-with-no-miami-breakthrough-zelenskyy-turns-to-european-allies",
    "image": "https://media.guim.co.uk/a8d70560ee965477562aeae086d36314fedb43a5/305_0_4705_3764/500.jpg",
    "summary": "Following discussions in Florida, there is a positive outlook as the Ukrainian president heads to London to meet with UK leader Keir Starmer, French President Emmanuel Macron, and German Chancellor Olaf Scholz. The talks signify ongoing international support for Ukraine amid its ongoing conflict. This marks day 1,383 of the crisis.",
    "published": "2025-12-07T01:53:37Z"
  }
]