[
  {
    "title": "Reeves says Gatwick second runway will boost UK; Trump’s $100,000 H-1B fee ‘will hurt US growth’ – business live",
    "url": "https://www.theguardian.com/business/live/2025/sep/22/rachel-reeves-gatwick-second-runway-growth-jobs-environmental-disaster-business-live-news",
    "image": "https://media.guim.co.uk/98d32f79f771396c5070d1197b355c9d7ee69fd2/421_0_4448_3558/500.jpg",
    "summary": "Green Party's Zack Polanski has criticized the decision to approve a second runway at Gatwick Airport, calling it a \"disaster.\" The move has sparked ongoing discussions about its economic and environmental implications. The news highlights growing concerns over expanding aviation infrastructure amid climate change considerations.",
    "published": "2025-09-22T09:39:42Z"
  },
  {
    "title": "European officials warn Israel not to annex parts of West Bank in response to recognition of Palestinian state – Middle East crisis live",
    "url": "https://www.theguardian.com/world/live/2025/sep/22/palestinian-state-gaza-israel-middle-east-hamas-benjamin-netanyahu-latest-live-updates",
    "image": "https://media.guim.co.uk/1c0672a7b0933d95884d80f89d0fadb88553a74f/293_0_4583_3667/500.jpg",
    "summary": "On Sunday, the UK, Australia, Canada, and Portugal officially recognized Palestinian statehood. France is also expected to follow suit in this acknowledgment. This development marks a significant shift in international relations regarding Palestine.",
    "published": "2025-09-22T09:38:32Z"
  },
  {
    "title": "Reform branded ‘threat to democracy’ over Farage plan to remove thousands of migrants with leave to be in UK – politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/22/reform-labour-keir-starmer-nigel-farage-immigration-latest-uk-politics-updates",
    "image": "https://media.guim.co.uk/cb6480b92e020a06bd2a4baec6b416ebe942839b/884_0_4549_3640/500.jpg",
    "summary": "Nigel Farage announced that Reform UK plans to eliminate the primary pathway for migrants to obtain British citizenship. This initiative aims to tighten immigration controls and reshape the country's citizenship process. Farage's proposal is part of a broader agenda focusing on stricter immigration policies.",
    "published": "2025-09-22T09:32:52Z"
  },
  {
    "title": "Met police investigate possible vetting errors over 300 recruits",
    "url": "https://www.theguardian.com/uk-news/2025/sep/22/met-police-investigate-possible-vetting-errors-over-300-recruits",
    "image": "https://media.guim.co.uk/72f95bbe8b8d6ed1dc79190725e88cfca5441e2b/449_0_4333_3466/500.jpg",
    "summary": "An investigation is underway to determine if hundreds of recruits were allowed to join a force with inadequate background checks. Authorities are examining the potential implications of these substandard vetting processes. The inquiry aims to ensure the integrity and security of recruitment practices.",
    "published": "2025-09-22T09:09:34Z"
  },
  {
    "title": "Poem of the week: Red Carpet by Steve Malmude",
    "url": "https://www.theguardian.com/books/2025/sep/22/poem-of-the-week-red-carpet-by-steve-malmude",
    "image": "https://media.guim.co.uk/0e53fd46fc6cd345e301bbe5d986c86e7076466e/2447_51_2681_2145/500.jpg",
    "summary": "A mysterious love poem, both playful and earnest, explores the complex emotions surrounding the poet's mother and her potential first love. The poem delves into themes of love and longing, highlighting the nuanced connections between family and affection. Its elusive nature invites varied interpretations and reflections on personal relationships.",
    "published": "2025-09-22T09:02:37Z"
  }
]