[
  {
    "title": "Australia v New Zealand: women’s international football friendly – live",
    "url": "https://www.theguardian.com/football/live/2025/nov/28/matildas-game-australia-new-zealand-womens-international-football-friendly-live",
    "image": "https://media.guim.co.uk/207e37a1df2ed4dc5d6c50f738cbccf23f3eb369/108_0_4583_3667/500.jpg",
    "summary": "The Matildas are facing off against the Football Ferns in Gosford as they prepare for the upcoming Asian Cup. Jo Khan will provide minute-by-minute updates on the match. Fans can follow along for the latest developments.",
    "published": "2025-11-28T10:22:45Z"
  },
  {
    "title": "Business secretary claims workers’ rights bill U-turn doesn’t breach Labour’s manifesto – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/nov/28/workers-rights-bill-unfair-dismissal-uk-politics-latest-news-updates-labour-budget-keir-starmer",
    "image": "https://media.guim.co.uk/84dc16e1cd92db7936e394b3e07f4c6931d262fa/1033_0_7209_5768/500.jpg",
    "summary": "Peter Kyle has rejected claims that the government's change in unfair dismissal policy constitutes a breach of his manifesto pledge. However, this decision has faced criticism from unions and Labour MPs, who argue it undermines workers' rights. The controversy highlights tensions between government policy and labor interests.",
    "published": "2025-11-28T10:22:32Z"
  },
  {
    "title": "‘How am I still going?’: the everlasting appeal of Cliff Richard",
    "url": "https://www.theguardian.com/music/2025/nov/28/cliff-richard-everlasting-appeal",
    "image": "https://media.guim.co.uk/5d0602000c4d535cf3f0b45de33c4c7922aad226/0_175_3744_2995/500.jpg",
    "summary": "Despite being sidelined from mainstream pop, the artist continues to thrive, consistently selling out large venues. His enduring success remains a topic of intrigue. The secret behind his longevity lies in a unique connection with his audience and a commitment to his craft.",
    "published": "2025-11-28T10:21:51Z"
  },
  {
    "title": "Ukraine’s anti-corruption authorities search properties linked to Zelenskyy’s chief of staff – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/nov/28/europe-latest-news-andriy-yermak-anti-corruption-zelenskyy-ukraine-russia-war-peace-talks-putin",
    "image": "https://media.guim.co.uk/597879bd9c804269eb6fdfb97ccc50ef89b4fafe/126_0_1621_1297/500.jpg",
    "summary": "Andriy Yermak announced that authorities have been granted complete access to his apartment. He is cooperating with the officers involved in the investigation and is accompanied by his lawyers. The specifics of the investigation remain undisclosed.",
    "published": "2025-11-28T10:21:18Z"
  },
  {
    "title": "Palmer set to return against Arsenal, Slot defiant, Europa League reaction – football live",
    "url": "https://www.theguardian.com/football/live/2025/nov/28/premier-league-news-europa-league-reaction-previews-and-more-football-live",
    "image": "https://media.guim.co.uk/72d1a19d4bbf773e93cf44bca8c4699c5991beeb/641_107_2668_2134/500.jpg",
    "summary": "A rolling report provides the latest updates and reactions in the world of football as the weekend approaches. Writers are on hand to cover key developments and stories. Stay tuned for real-time insights and analysis.",
    "published": "2025-11-28T10:19:53Z"
  }
]