[
  {
    "title": "European officials warn Israel not to annex parts of West Bank in response to recognition of Palestinian state – Middle East crisis live",
    "url": "https://www.theguardian.com/world/live/2025/sep/22/palestinian-state-gaza-israel-middle-east-hamas-benjamin-netanyahu-latest-live-updates",
    "image": "https://media.guim.co.uk/1c0672a7b0933d95884d80f89d0fadb88553a74f/293_0_4583_3667/500.jpg",
    "summary": "On Sunday, the UK, Australia, Canada, and Portugal officially recognized Palestinian statehood, marking a significant diplomatic shift. France is also expected to follow suit in acknowledging Palestine as a state. This recognition underscores increasing international support for Palestinian sovereignty.",
    "published": "2025-09-22T11:23:36Z"
  },
  {
    "title": "UN and rights groups condemn reported jailing of Wuhan Covid citizen journalist",
    "url": "https://www.theguardian.com/world/2025/sep/22/un-rights-groups-condemn-reported-jailing-wuhan-covid-citizen-journalist-zhang-zhan",
    "image": "https://media.guim.co.uk/e0c9cc522b9bcdc3857c14bc6e44991f0dedda90/33_0_2500_2000/500.jpg",
    "summary": "Zhang Zhan has been sentenced to four years in prison for the second time, with charges commonly employed by China to silence government critics. Her conviction highlights the ongoing crackdown on dissent in the country. Zhang, a journalist, had previously reported on the COVID-19 pandemic in Wuhan.",
    "published": "2025-09-22T11:23:21Z"
  },
  {
    "title": "Reeves claims Gatwick second runway ‘will mean cheaper holidays’; Trump’s $100,000 H-1B visa fee expected to hurt US growth – business live",
    "url": "https://www.theguardian.com/business/live/2025/sep/22/rachel-reeves-gatwick-second-runway-growth-jobs-environmental-disaster-business-live-news",
    "image": "https://media.guim.co.uk/9443c9de49eb8796461c61ca177c9399cee4024e/692_0_6235_4988/500.jpg",
    "summary": "Green Party's Zack Polanski criticized the approval of a second runway at Gatwick Airport, labeling it a \"disaster.\" His statement highlights concerns over environmental impacts and sustainability. The news reflects ongoing debates surrounding airport expansions and their implications for climate change.",
    "published": "2025-09-22T11:22:30Z"
  },
  {
    "title": "Reform branded ‘threat to democracy’ over Farage plan to remove thousands of migrants with leave to be in UK – politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/22/reform-labour-keir-starmer-nigel-farage-immigration-latest-uk-politics-updates",
    "image": "https://media.guim.co.uk/15fdb7612fe89695b8830e6e34af1700e3c6b1d2/856_289_4137_3309/500.jpg",
    "summary": "Nigel Farage has announced that Reform UK plans to eliminate the primary pathway for migrants to acquire British citizenship. He argues that this measure is essential for controlling immigration. The proposal is part of the party's broader strategy to reform the UK's immigration policies.",
    "published": "2025-09-22T11:22:10Z"
  },
  {
    "title": "Flight delays continue across Europe after weekend cyber-attack",
    "url": "https://www.theguardian.com/world/2025/sep/22/flight-delays-europe-cyber-attack-heathrow-brussels-berlin",
    "image": "https://media.guim.co.uk/667eb3aa5935cdc4ed0a81043c231cb8b530d0ac/325_0_3361_2688/500.jpg",
    "summary": "Collins Aerospace is finishing updates to its software systems following operational disruptions at Heathrow, Brussels, and Berlin airports. The issues affected flight operations and passenger experience. The company is working to resolve any lingering problems to ensure smoother airport functionalities.",
    "published": "2025-09-22T11:19:09Z"
  }
]