[
  {
    "title": "Manchester synagogue attack that killed two was a ‘terrorist incident’, say police – latest updates",
    "url": "https://www.theguardian.com/uk-news/live/2025/oct/02/police-reports-stabbing-synagogue-greater-manchester-live",
    "image": "https://media.guim.co.uk/09f20100fbf2630c0e0352f448c48247471f5999/386_0_3289_2632/500.jpg",
    "summary": "Police have confirmed that the victims of a Yom Kippur attack were Jewish. The unidentified suspect was shot dead by authorities within minutes of the incident. The attack has raised concerns about safety and violence against the Jewish community.",
    "published": "2025-10-02T16:21:03Z"
  },
  {
    "title": "Jenrick’s ideas mostly ‘my thoughts repackaged’, says Badenoch – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/oct/02/reform-uk-zia-yusuf-keir-starmer-nigel-farage-immigration-asylum-labour-climate-change-uk-politics-live",
    "image": "https://media.guim.co.uk/8d5580732613185c2cf1a410494dc70d67c8f37f/70_0_4840_3872/500.jpg",
    "summary": "The Tory leader revealed that the party was nearing bankruptcy when she assumed leadership last year. She emphasized the financial challenges faced by the party during her tenure. Her remarks highlight the struggles and efforts to stabilize the party's finances.",
    "published": "2025-10-02T16:19:44Z"
  },
  {
    "title": "Trump to cut ‘Democrat agencies’ as White House says government shutdown layoffs could be in the thousands – live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/02/government-shutdown-trump-democrats-latest-updates",
    "image": "https://media.guim.co.uk/67f0cf364ead08501750764e4c7d8c49cf1252d5/200_0_6588_5271/500.jpg",
    "summary": "Trump highlighted his meeting with Russ Vought, known for Project 2025, to discuss potential budget cuts. Meanwhile, Karoline Leavitt attributed the anticipated job losses to Democratic policies. The focus remains on fiscal reforms amid concerns over employment impacts.",
    "published": "2025-10-02T16:17:41Z"
  },
  {
    "title": "Up to 600 flights a day to be cancelled during French strike, Ryanair says",
    "url": "https://www.theguardian.com/business/2025/oct/02/up-to-600-flights-a-day-to-be-cancelled-during-french-strike-ryanair-says",
    "image": "https://media.guim.co.uk/a310c870d0093d949ccce55b7b641838691b7cef/121_0_4126_3300/500.jpg",
    "summary": "Next week's air traffic control strikes in France could impact up to 100,000 airline passengers, according to a recent announcement by the airline. The strikes are set to disrupt various flight routes over French airspace. Travelers are advised to check for potential cancellations and delays.",
    "published": "2025-10-02T16:13:21Z"
  },
  {
    "title": "Judge denies Kilmar Ábrego García’s bid for asylum in the US",
    "url": "https://www.theguardian.com/us-news/2025/oct/02/trump-immigration-kilmar-abrego-garcia-asylum",
    "image": "https://media.guim.co.uk/c84ef7d7803cf92529d913a972a47671cfdc1924/1658_852_2779_2223/500.jpg",
    "summary": "Ábrego, recently deported to El Salvador in March but returned to the US, has been given a 30-day period to appeal a ruling regarding his legal status. His case highlights ongoing immigration challenges. The situation underscores the complexities of deportation and appeals within the U.S. immigration system.",
    "published": "2025-10-02T16:12:57Z"
  }
]