[
  {
    "title": "Trump says he will cancel all Biden executive orders signed by autopen – live ",
    "url": "https://www.theguardian.com/us-news/live/2025/nov/28/trump-washington-dc-shooting-politics-updates",
    "image": "https://media.guim.co.uk/fcd85e45c85cbde48cae498f511144a64392e654/581_0_5000_4000/500.jpg",
    "summary": "In a recent social media post, Trump baselessly asserted that President Biden did not personally approve certain orders, intensifying his ongoing criticism of his predecessor. This claim is part of Trump's broader campaign against Biden, aiming to undermine his leadership. Trump's remarks reflect his continued focus on past administration actions as he seeks to sway public opinion.",
    "published": "2025-11-28T21:08:26Z"
  },
  {
    "title": "Five Great Reads: the evolving history of the Beatles, Buddhist extremism, and anatomy of a WhatsApp group scandal",
    "url": "https://www.theguardian.com/australia-news/2025/nov/29/five-great-reads-the-evolving-history-of-the-beatles-buddhist-extremism-and-anatomy-of-a-whatsapp-group-scandal",
    "image": "https://media.guim.co.uk/518fead6bdcf3e20cbda792dc492954d52d934a3/551_0_2700_2160/500.jpg",
    "summary": "Guardian Australia has compiled a weekend wrap featuring essential readings from the past week, curated by Kris Swales. This summary highlights significant news stories and insights. Readers can catch up on important events and discussions that shaped the week.",
    "published": "2025-11-28T21:00:18Z"
  },
  {
    "title": "Corrections and clarifications",
    "url": "https://www.theguardian.com/news/2025/nov/28/corrections-and-clarifications",
    "summary": "\"Ronni Ancona | Prisoner 951 | This is Christmas\" appears to be a release related to a special project or performance by comedian Ronni Ancona, likely featuring themes of humor and holiday spirit. The title suggests a unique or humorous take on the season, possibly involving storytelling or skits. Further details on the specific content or format would clarify its significance.",
    "published": "2025-11-28T21:00:17Z"
  },
  {
    "title": "DC to put national guard on joint patrols with local police after shootings",
    "url": "https://www.theguardian.com/us-news/2025/nov/28/washington-dc-national-guard-trump",
    "image": "https://media.guim.co.uk/6ee69c8c812d80a5d3795d5119cdf0f50969179e/500_0_5000_4000/500.jpg",
    "summary": "The National Guard's role in the U.S. capital is changing following a recent incident where two members were shot. This shift signals a new approach to security and operational dynamics in the area. The decision reflects ongoing concerns for the safety of guards in the nation's capital.",
    "published": "2025-11-28T20:52:48Z"
  },
  {
    "title": "Trump says he plans to cancel most of Biden’s executive orders",
    "url": "https://www.theguardian.com/us-news/2025/nov/28/trump-canceling-biden-executive-orders-autopen",
    "image": "https://media.guim.co.uk/d93171cd986e4255b11116fe61cce7176e812d33/281_0_3724_2981/500.jpg",
    "summary": "Donald Trump has made unfounded allegations that his predecessor, President Obama, did not personally sign off on important directives, suggesting they were instead signed using an autopen machine. This claim aims to cast doubt on the authenticity of Obama's signature. Trump's assertions lack evidence and have been met with skepticism.",
    "published": "2025-11-28T20:27:17Z"
  }
]