[
  {
    "title": "Almost a fifth of young UK adults use AI to design holiday, study finds",
    "url": "https://www.theguardian.com/travel/2025/oct/07/uk-adults-ai-design-holiday-package-holiday-travel-abta",
    "image": "https://media.guim.co.uk/7cee4fa29cde8845da41833f47d92bf17bfbb631/127_0_4411_3531/500.jpg",
    "summary": "According to Abta, traditional package holidays remain the most popular choice among travelers. The report indicates that despite evolving travel trends, packaged vacations continue to dominate the market. This preference highlights the enduring appeal of all-inclusive travel experiences.",
    "published": "2025-10-07T12:38:18Z"
  },
  {
    "title": "Jenrick accused of racism over ‘no white faces’ comments as he also claims ‘collapse of old order is in sight’ – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/oct/07/conservative-tory-conference-kemi-badenoch-jenrick-starmer-labour-protests-reform-uk-politics-live-news-updates",
    "image": "https://media.guim.co.uk/7cb13779263875c4abc672bedd3dc03dec5b2a61/587_0_4820_3856/500.jpg",
    "summary": "The Labour mayor of the West Midlands accused Housing Secretary Robert Jenrick of making racist comments regarding Handsworth. This statement has sparked controversy and discussions about race and community representation. The mayor's remarks highlight ongoing tensions surrounding political discourse and racial sensitivity in the region.",
    "published": "2025-10-07T12:38:17Z"
  },
  {
    "title": "England v Bangladesh: Women’s Cricket World Cup – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/07/england-v-bangladesh-womens-cricket-world-cup-live",
    "image": "https://media.guim.co.uk/b5c129a254c123d5f83107912ab8d541dd3ed83c/662_0_4053_3243/500.jpg",
    "summary": "Nat Sciver-Brunt's team aims to maintain momentum following their significant victory against South Africa. Taha Hashim will provide live updates on the match. Fans can follow the action as it unfolds.",
    "published": "2025-10-07T12:37:58Z"
  },
  {
    "title": "Nobel prize in physics awarded to three scientists for work on quantum mechanics",
    "url": "https://www.theguardian.com/books/2025/oct/07/nobel-prize-in-physics-awarded-to-scientists-quantum-mechanics",
    "image": "https://media.guim.co.uk/8e78bbf5022bd23d079af4a46d6fb3ef45bafc0a/688_0_6880_5504/500.jpg",
    "summary": "A research trio has conducted experiments revealing that unusual properties of the quantum realm can manifest in measurable ways in everyday life. Their findings could bridge the gap between quantum mechanics and macroscopic phenomena. This breakthrough enhances our understanding of how quantum behavior impacts the larger world.",
    "published": "2025-10-07T12:34:00Z"
  },
  {
    "title": "Far-right National Rally snubs French PM’s bid to salvage cabinet amid political turmoil – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/oct/07/france-macron-lecornu-cabinet-europe-live",
    "image": "https://media.guim.co.uk/20597275c468c0c35a7fbc040b8b91d33b0a75a0/329_0_4299_3440/500.jpg",
    "summary": "Jordan Bardella and Marine Le Pen have refused an invitation from Minister Sébastien Lecornu to engage in talks aimed at addressing the ongoing crisis. The leaders of the National Rally expressed their decision, highlighting their reluctance to participate in discussions initiated by the government. This refusal underscores the ongoing tensions between the opposition party and the government.",
    "published": "2025-10-07T12:32:33Z"
  }
]