[
  {
    "title": "Adelaide v Hawthorn: AFL 2025 first semi-final – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/12/adelaide-crows-vs-hawthorn-hawks-live-updates-2025-afl-semi-final-latest",
    "image": "https://media.guim.co.uk/b7cb49fb1a5c57dc332ecffc3f6515e5d0ebcca0/0_0_5871_4699/500.jpg",
    "summary": "The Crows are facing the Hawks at Adelaide Oval for a chance to secure a spot in the preliminary final against Geelong. Martin Pegan will provide updates throughout the match. Stay tuned for goal-by-goal commentary.",
    "published": "2025-09-12T10:37:14Z"
  },
  {
    "title": "Wissa, Ramsey and Delap face injury layoffs, plus Slot on Isak and Guéhi – live",
    "url": "https://www.theguardian.com/football/live/2025/sep/12/premier-league-buildup-press-conferences-team-news-live",
    "image": "https://media.guim.co.uk/2c4f1fdff4815cf807e9216ea0955f8552fbde08/1112_298_3825_3059/500.jpg",
    "summary": "Niall McVeigh will be providing updates on the Premier League as it resumes after the international break. Catch all the latest news and developments in the football league. Stay tuned for in-depth analysis and coverage.",
    "published": "2025-09-12T10:35:43Z"
  },
  {
    "title": "Tosca review – punchy new Puccini rises above the ‘Shame on you’ Russian soprano protests",
    "url": "https://www.theguardian.com/music/2025/sep/12/tosca-puccini-royal-opera-house--anna-netrebko-russian-soprano-controversy",
    "image": "https://media.guim.co.uk/77f6a4cc9f487da6ceab47c948ba7c72b076deee/340_0_3443_2756/500.jpg",
    "summary": "Despite public outrage over Anna Netrebko's casting, the audience inside the auditorium responded with enthusiastic applause. The performance, described as a \"high-stakes game of blood-spattered conflict,\" captivated those present. The contrast highlights a divide between public sentiment and the experience of live attendees.",
    "published": "2025-09-12T10:35:17Z"
  },
  {
    "title": "Labour MPs despondent after Rayner and Mandelson departures, says cabinet minister – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/12/uk-politics-latest-news-peter-mandelson-labour-keir-starmer-angela-rayner",
    "image": "https://media.guim.co.uk/95e8e572ca2e33ef0b5a5d45051acab3d36b78c1/0_0_4447_3558/500.jpg",
    "summary": "Scotland Secretary Douglas Alexander expressed that MPs are experiencing a strong sense of loss following Rayner's departure. He emphasized the emotional impact this change has had on the team. The sentiment reflects the significance of Rayner's role among colleagues.",
    "published": "2025-09-12T10:27:22Z"
  },
  {
    "title": "Sir Robert Worcester obituary",
    "url": "https://www.theguardian.com/politics/2025/sep/12/sir-robert-worcester-obituary",
    "image": "https://media.guim.co.uk/5d9ea2ee186352e378b0bac5e6512f6eca0adcac/126_0_1564_1251/500.jpg",
    "summary": "The founder of the market research firm Mori, known for his sharp analyses, has become a prominent pollster for British media. His insights have made him a trusted source for understanding public opinion. Mori's contributions have significantly influenced media narratives in Britain.",
    "published": "2025-09-12T10:15:41Z"
  }
]