[
  {
    "title": "Trump demands Hamas accept US plan to ‘end Gaza conflict’ as Netanyahu says Israel will ‘finish the job’ if they don’t – live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/29/donald-trump-benjamin-netanyahu-gaza-white-house-us-politics-live",
    "image": "https://media.guim.co.uk/f6855d1ff0f1594a3d9aba5cbb5ee09ac76df1ca/473_0_3985_3188/500.jpg",
    "summary": "Israeli Prime Minister Benjamin Netanyahu expressed his backing for former President Trump's Gaza peace plan. However, he emphasized that the plan's success hinges on Hamas agreeing to the proposal. Netanyahu's comments highlight the ongoing complexities of achieving peace in the region.",
    "published": "2025-09-29T19:14:37Z"
  },
  {
    "title": "Everton v West Ham United: Premier League – live",
    "url": "https://www.theguardian.com/football/live/2025/sep/29/everton-v-west-ham-premier-league-live",
    "image": "https://media.guim.co.uk/f472c6d22b24266cf16e439f2020ba296f8e9ddc/247_49_4103_3284/500.jpg",
    "summary": "Nuno Espírito Santo's tenure as West Ham manager kicks off with a match against David Moyes' team at Hill Dickinson Stadium. The game is being reported on minute-by-minute by Daniel Harris. Fans are eager to see how the new manager will fare in his first game.",
    "published": "2025-09-29T19:14:25Z"
  },
  {
    "title": "Tom Watson says he was ‘ashamed’ of US fans at Ryder Cup",
    "url": "https://www.theguardian.com/sport/2025/sep/29/tom-watson-ashamed-us-fans-ryder-cup",
    "image": "https://media.guim.co.uk/27c6e0b0276623e41e40839ad4b3058039ae6138/1226_199_4522_3618/500.jpg",
    "summary": "Tom Watson has issued an apology for the inappropriate behavior exhibited by US fans during the Ryder Cup. The event was overshadowed by instances of abuse directed at European players and their families. Watson described the fans' actions as \"rude and mean-spirited.\"",
    "published": "2025-09-29T19:00:38Z"
  },
  {
    "title": "GPs in England threaten action over online appointment booking plan",
    "url": "https://www.theguardian.com/society/2025/sep/29/gps-doctors-england-online-appointment-booking-plan-strike-action-threat",
    "image": "https://media.guim.co.uk/21d529d3b3e11e22878da62069e78d8c6e7e8a55/422_0_2687_2150/500.jpg",
    "summary": "A doctors' union warns that general practitioners (GPs) will face an overwhelming influx of patients, referred to as a \"triage tsunami.\" They demand that government officials take immediate action to address the crisis within 48 hours. The situation highlights growing concerns regarding the capacity and resources of healthcare providers.",
    "published": "2025-09-29T19:00:36Z"
  },
  {
    "title": "Andy Burnham hits back at Labour critics over challenge to Starmer",
    "url": "https://www.theguardian.com/politics/2025/sep/29/andy-burnham-fights-back-against-labour-critics-over-challenge-to-starmer",
    "image": "https://media.guim.co.uk/247c11738a52e8774ae914d7de814620ac065f63/422_0_2838_2270/500.jpg",
    "summary": "The mayor of Greater Manchester expresses a desire for an upcoming conference, which will be largely focused on leadership speculation, to achieve successful outcomes. He aims to foster meaningful discussions and insights during the event. The emphasis will be on navigating leadership challenges and opportunities in the region.",
    "published": "2025-09-29T18:50:53Z"
  }
]