[
  {
    "title": "World Cup qualifying news, Potter’s big Sweden bow and more – matchday live",
    "url": "https://www.theguardian.com/football/live/2025/nov/15/world-cup-qualifying-news-potters-big-sweden-bow-and-more-matchday-live",
    "image": "https://media.guim.co.uk/4eae2dc154df3e009aa112f962f942c647895403/0_0_5000_4000/500.jpg",
    "summary": "Will Magee will host a pre-game show featuring news and discussions leading up to the day’s football matches. The segment aims to provide insights and analysis for fans. Tune in to stay updated and engaged with the latest in football.",
    "published": "2025-11-15T11:10:57Z"
  },
  {
    "title": "Epstein survivor pushes for release of files in wake of new emails: ‘It will bring us closure’",
    "url": "https://www.theguardian.com/us-news/2025/nov/15/jeffrey-epstein-survivor-marina-lacerda",
    "image": "https://media.guim.co.uk/9c51c53e373c79dd10ed5422e034eff253f443ec/473_0_5000_4000/500.jpg",
    "summary": "Marina Lacerda, 37, shares her experiences of abuse, highlighting the impact it's had on her life. She was motivated to speak out publicly due to recent revelations about similar incidents. Her story aims to raise awareness and support for others facing similar struggles.",
    "published": "2025-11-15T11:00:09Z"
  },
  {
    "title": "Steve Bannon advised Jeffrey Epstein for years on how to rehab his reputation, texts show",
    "url": "https://www.theguardian.com/us-news/2025/nov/15/steve-bannon-jeffrey-epstein-text-messages-publicity",
    "image": "https://media.guim.co.uk/6f02af6a6d6847e8fce854486b44e48f9b1a3afa/1283_0_6414_5134/500.jpg",
    "summary": "A duo has developed strategies to address public anger regarding Jeffrey Epstein's criminal history, his treatment by the judicial system, and his connections to influential individuals. Their approach aims to tackle the concerns surrounding systemic failures and accountability in his case. This initiative highlights ongoing discussions about justice and the implications of privilege.",
    "published": "2025-11-15T11:00:09Z"
  },
  {
    "title": "What pension changes is Rachel Reeves considering in the budget?",
    "url": "https://www.theguardian.com/uk-news/2025/nov/15/what-pension-changes-rachel-reeves-considering-budget",
    "image": "https://media.guim.co.uk/1d22bea375813725893646fc2a658f05fae53dd1/446_0_4169_3335/500.jpg",
    "summary": "The chancellor is considering adjustments to financial regulations, potentially focusing on salary sacrifice schemes instead of tax-free cash drawdowns. This shift could impact how individuals manage their compensation. The decision aims to enhance fiscal efficiency and compliance.",
    "published": "2025-11-15T11:00:08Z"
  },
  {
    "title": "Wes Streeting accused of ‘chaotic and incoherent approach’ to NHS reform",
    "url": "https://www.theguardian.com/politics/2025/nov/15/wes-streeting-accused-of-chaotic-and-incoherent-approach-to-nhs-reform",
    "image": "https://media.guim.co.uk/6a6a29813937c987a0dceffc84e359ab0822cb31/652_184_3575_2859/500.jpg",
    "summary": "A think tank report reveals that the Health Secretary has not succeeded in enhancing productivity within the health service. As a result, the service is projected to fall short of its performance targets. The findings raise concerns about the overall efficiency of the healthcare system.",
    "published": "2025-11-15T11:00:07Z"
  }
]