[
  {
    "title": "Transfer deadline day: Isak, Guéhi and Wissa deals agreed; Kolo Muani, Jackson and more – live",
    "url": "https://www.theguardian.com/football/live/2025/sep/01/transfer-deadline-day-guehi-wissa-martinez-ederson-latest-and-more-live",
    "image": "https://media.guim.co.uk/9132e30aed156f2798142751fdb02989f6435a1c/1393_54_3870_3096/500.jpg",
    "summary": "Will Magee is providing a rolling report on the latest transactions and updates as deadline day unfolds. Expect an exciting and busy atmosphere with significant moves anticipated. Stay tuned for real-time news and developments.",
    "published": "2025-09-01T14:38:21Z"
  },
  {
    "title": "Tell us about a travel experience that benefited the local community",
    "url": "https://www.theguardian.com/travel/2025/sep/01/tell-us-about-a-travel-experience-that-benefited-the-local-community",
    "image": "https://media.guim.co.uk/fe172dbc27ac7886609218f818132f38c6f7c2b3/308_192_2680_2144/500.jpg",
    "summary": "A competition has been announced inviting participants to share tips on grassroots activities or tours that aid local communities. The best submission will win a £200 prize to be used for a Coolstays holiday. This initiative encourages sustainable tourism and supports community engagement.",
    "published": "2025-09-01T14:37:09Z"
  },
  {
    "title": "Keir Starmer says Reform UK doesn’t want to solve small boats problem because they need ‘politics of grievance’ – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/01/women-children-home-office-refugee-family-reunions-uk-politics-live-latest-updates-news",
    "image": "https://media.guim.co.uk/ac88477495935002afc3f7c223c68f856e03a611/1283_0_6880_5504/500.jpg",
    "summary": "The Prime Minister stated that the Reform party has \"no reason to exist\" if existing issues are resolved. He emphasized his goal to clear out asylum hotels by addressing individual cases. This approach aims to streamline the asylum process and alleviate current challenges.",
    "published": "2025-09-01T14:34:02Z"
  },
  {
    "title": "UK manufacturing downturn continues as new orders slide; Trump’s attack on Fed is ‘a serious danger’ – as it happened",
    "url": "https://www.theguardian.com/business/live/2025/sep/01/factory-activity-us-tariffs-uk-house-price-drop-mortgage-interest-rates-business-live-news-updates",
    "image": "https://media.guim.co.uk/931d11a23666de0b8a2b0e280544fbe3feee3900/215_0_3366_2692/500.jpg",
    "summary": "Factory orders have declined due to weak market conditions, the impact of US tariffs, and decreased confidence among clients. These factors have contributed to a challenging environment for manufacturers. The downturn reflects broader economic uncertainties affecting the sector.",
    "published": "2025-09-01T14:30:53Z"
  },
  {
    "title": "Afghanistan earthquake live: ‘There is death in every home’, families say, after at least 800 killed in quake in east of country",
    "url": "https://www.theguardian.com/world/live/2025/sep/01/afghanistan-earthquake-live-hundreds-after-shallow-quake-strikes-countrys-east-state-media-reports",
    "image": "https://media.guim.co.uk/455e3cb27f1cc4b81106f240a375f9730bb7c548/542_0_5000_4000/500.jpg",
    "summary": "The ministry for public health reported that several villages in Kunar province have been \"completely destroyed.\" Rescue operations are currently underway to assist those affected by the devastation. Efforts are focused on providing aid and assessing the extent of the damage.",
    "published": "2025-09-01T14:25:01Z"
  }
]