[
  {
    "title": "Macron reportedly warned European leaders ‘there is a chance that the US will betray Ukraine’ – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/dec/04/german-chancellor-ukraine-russia-future-of-europe-live-latest-news",
    "image": "https://media.guim.co.uk/48ad80755894536faec827f14801e387d2f1dff6/1440_0_7200_5760/500.jpg",
    "summary": "German magazine Der Spiegel has reported on a leaked note revealing European leaders' concerns during a recent call. The warning suggests potential significant challenges ahead for the EU. The specifics of the issues discussed were not disclosed in the report.",
    "published": "2025-12-04T14:20:16Z"
  },
  {
    "title": "Nigel Farage urged to sack Reform council leader accused of racism",
    "url": "https://www.theguardian.com/politics/2025/dec/04/nigel-farage-urged-to-sack-ian-cooper-reform-council-leader-accused-of-racism",
    "image": "https://media.guim.co.uk/24654c820c30b610a4e20cb138a632bc521acff2/1632_337_1550_1240/500.jpg",
    "summary": "Labour MPs are urging Ian Cooper to resign as the leader of Staffordshire County Council amid an ongoing investigation into him. The party is looking into the allegations surrounding his leadership. The situation has raised significant political concerns within the local Labour party.",
    "published": "2025-12-04T14:17:09Z"
  },
  {
    "title": "Keir Starmer says deportation policies touted by Reform UK ‘would tear our country apart’ – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/dec/04/reform-uk-nigel-farage-richard-tice-keir-starmer-kemi-badenoch-uk-politics-live-news-updates",
    "image": "https://media.guim.co.uk/1b8953d976c5eb593676de4baa8fb874fa0b6fea/1085_0_5425_4342/500.jpg",
    "summary": "The Prime Minister warned that Britain's status as a tolerant and diverse nation could be at risk if Nigel Farage gains power. Concerns were raised about the potential impact on the country's inclusivity and unity. The statement reflects growing political tensions surrounding Farage's influence.",
    "published": "2025-12-04T14:16:57Z"
  },
  {
    "title": "Budget uncertainty blamed for plunge in UK construction output, and investor exodus from the stock market – business live",
    "url": "https://www.theguardian.com/business/live/2025/dec/04/uk-energy-network-28bn-upgrade-ofgem-construction-car-sales-stock-markets-business-live-news-updates",
    "image": "https://media.guim.co.uk/c03adfc6086159bb03bd211def2bacc340932f60/375_0_3750_3000/500.jpg",
    "summary": "The latest economic and financial news highlights ongoing developments in global markets, interest rates, and inflation trends. Analysts are closely monitoring central bank policies and their impact on economic recovery. Key indicators suggest mixed signals, prompting cautious investor sentiment.",
    "published": "2025-12-04T14:15:01Z"
  },
  {
    "title": "Nathan Lyon in ‘filthy’ mood after Test omission as Crawley hails ‘phenomenal’ Root",
    "url": "https://www.theguardian.com/sport/2025/dec/04/nathan-lyon-in-filthy-mood-after-test-omission-as-crawley-hails-phenomenal-root",
    "image": "https://media.guim.co.uk/6e3005bc0cf03436134d04b26b665f71e53ba567/637_0_4290_3434/500.jpg",
    "summary": "Nathan Lyon expressed his anger at being dropped from the Australian Test squad for the first time in 13 years during a home series. The decision has sparked discussions about the team's selection strategy. Lyon's reaction highlights the emotional impact of such choices on seasoned players.",
    "published": "2025-12-04T14:11:24Z"
  }
]