[
  {
    "title": "Trump loses appeal and must pay E Jean Carroll $83m in defamation case – live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/08/donald-trump-immigration-hyundai-tariffs-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/ca1dfd4f9fcb728e91fc230edca6e8e724e281d8/287_0_2870_2296/500.jpg",
    "summary": "A federal appeals court has upheld a defamation judgment against Donald Trump, dismissing his administration's claim of immunity based on a Supreme Court ruling. The court's decision reinforces the legal consequences of Trump's statements. This ruling could set a precedent for future defamation cases involving public officials.",
    "published": "2025-09-08T15:34:24Z"
  },
  {
    "title": "New home secretary Shabana Mahmood says she will not run for deputy leader after Labour accused of ‘stitch-up’ over contest – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/08/labour-deputy-leadership-election-contest-keir-starmer-angela-rayner-uk-politics-live",
    "image": "https://media.guim.co.uk/ce5c9ae13f9192a7db62c9f1381de999825f24fe/449_0_4124_3299/500.jpg",
    "summary": "Wes Streeting and Jess Phillips have both decided not to run for leadership amid reports that Emily Thornberry is looking for support. Potential candidates must secure 80 backing signatures by 5 PM on Thursday. The race for leadership is heating up as the deadline approaches.",
    "published": "2025-09-08T15:34:19Z"
  },
  {
    "title": "At least 19 killed in ‘gen Z’ protests against Nepal’s social media ban",
    "url": "https://www.theguardian.com/world/2025/sep/08/nepal-bans-26-social-media-sites-including-x-whatsapp-and-youtube",
    "image": "https://media.guim.co.uk/3ec7617b05d41ceb469e6d8673defe4b6bdbaab8/360_0_3600_2880/500.jpg",
    "summary": "Demonstrators are protesting against widespread corruption and nepotism that they claim is pervasive in their country. Their grievances reflect a growing frustration with governance and a demand for accountability. The protests signify a broader call for reform and justice from the authorities.",
    "published": "2025-09-08T15:32:49Z"
  },
  {
    "title": "Europe live: Macron labelled ‘a defeated president’ as his PM faces no-confidence vote",
    "url": "https://www.theguardian.com/world/live/2025/sep/08/europe-live-macron-france-prime-minister-francois-bayrou-confidence-vote-latest-news",
    "image": "https://media.guim.co.uk/27d25520fffb3884efcb6e72485f947141dc0929/132_0_5380_4304/500.jpg",
    "summary": "Socialist leader Boris Vallaud fiercely criticized President Macron, labeling the decision by François Bayrou to initiate a no-confidence vote as a \"cop-out.\" Vallaud's remarks underscore the ongoing political tensions in France. The statement highlights divisions among political figures regarding accountability and governance.",
    "published": "2025-09-08T15:29:54Z"
  },
  {
    "title": "Surrey all out for 246, Durham’s McKinney hits century at Essex: county cricket day one – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/08/county-championship-cricket-surrey-warwickshire-somerset-yorkshire-live",
    "image": "https://media.guim.co.uk/0ffae68889e0686b32aa62f43ae8d10aa43bb5f8/169_0_3500_2800/500.jpg",
    "summary": "Tanya Aldred provides live updates from day one of the County Championship as it resumes after a month-long hiatus. Fans can expect coverage of match highlights and key performances. Keep an eye on the latest developments from the grounds throughout the day.",
    "published": "2025-09-08T15:26:57Z"
  }
]