[
  {
    "title": "Global bond sell-off eases after weak US jobs report and smooth Japanese debt auction – business live",
    "url": "https://www.theguardian.com/business/live/2025/sep/04/global-bond-sell-off-eases-us-jobs-report-japan-debt-auction-car-sales-uk-construction-business-live-news-updates",
    "image": "https://media.guim.co.uk/5ee62c3d9ba104c37b687ade4d187cf8951511af/831_0_4169_3334/500.jpg",
    "summary": "This news report provides ongoing updates on current economic and financial developments. It highlights significant market movements, economic indicators, and key financial events. The coverage aims to keep readers informed about trends that may impact the global economy.",
    "published": "2025-09-04T07:21:11Z"
  },
  {
    "title": "Australia news live: Ben Roberts-Smith’s final appeal bid rejected by high court; some Rip Curl and Kathmandu stores to close",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/04/australia-politics-live-bob-carr-daniel-andrews-beijing-putin-question-time-labor-coalition-anthony-albanese-sussan-ley-ntwnfb",
    "summary": "I'm sorry, but it seems you didn't provide the news article or information. Please share the details or content you'd like summarized, and I'll be happy to help!",
    "published": "2025-09-04T07:20:06Z"
  },
  {
    "title": "From fast risers to fallen giants: World Cup 2026 qualifiers to watch",
    "url": "https://www.theguardian.com/football/2025/sep/04/from-fast-risers-to-fallen-giants-world-cup-2026-qualifiers-to-watch",
    "image": "https://media.guim.co.uk/f8919bb376da455a3c43967d66591ae7f6ffb853/0_0_5000_4000/500.jpg",
    "summary": "Bolivia, Peru, Nigeria, and Italy are experiencing significant challenges in various sectors, suggesting they may face tough times ahead. In contrast, some countries are showing positive trends and reasons for optimism. Overall, the global landscape presents a mix of adversity and hope for different nations.",
    "published": "2025-09-04T07:00:48Z"
  },
  {
    "title": "Alex Matthews to captain England in final World Cup pool game against Australia",
    "url": "https://www.theguardian.com/sport/2025/sep/04/alex-matthews-captain-england-women-rugby-world-cup-pool-game-australia",
    "image": "https://media.guim.co.uk/a9ded422523afdcb1a1ab4400f2d2284ce03242a/904_57_5616_4494/500.jpg",
    "summary": "Alex Matthews will lead England as captain from the No8 position in their final World Cup pool match against Australia. Jess Breach will also mark a milestone by earning her 50th cap during the game. This match is significant for both players as they aim for victory in a crucial matchup.",
    "published": "2025-09-04T07:00:48Z"
  },
  {
    "title": "Is Britain really the new North Korea? Let us consider the evidence | Martin Kettle",
    "url": "https://www.theguardian.com/commentisfree/2025/sep/04/britain-north-korea-labour-headlines-politics",
    "image": "https://media.guim.co.uk/dcf2ff4ad6615d7dc06c8ff7e7a72ecf9b277374/0_0_5000_4000/500.jpg",
    "summary": "Guardian columnist Martin Kettle argues that while the Labour party faced significant issues this week, exaggerated media claims distort political discourse. He emphasizes the importance of a nuanced discussion rather than sensationalism in reporting. Kettle suggests that such overblown narratives ultimately harm the depth of political debate.",
    "published": "2025-09-04T07:00:47Z"
  }
]