[
  {
    "title": "Zelenskyy says ‘we must do everything’ against ‘wicked Russian attacks’ as Ukraine and US meet for emergency talks – live",
    "url": "https://www.theguardian.com/world/live/2025/nov/23/ukrainian-us-emergency-talks-plan-war-russia-live",
    "image": "https://media.guim.co.uk/c82b9742a207341ec5c4ce1982ad3037ee8f2495/511_0_6651_5321/500.jpg",
    "summary": "Officials are set to discuss a 28-point draft plan perceived as advantageous to Moscow, despite the ongoing Russian invasion of Ukraine that began in February 2022. The plan's provisions and implications are under scrutiny amid international tensions. Stakeholders will evaluate its potential impact on the conflict and regional stability.",
    "published": "2025-11-23T11:13:48Z"
  },
  {
    "title": "Gaza hospitals are running out of essential supplies, medical workers say",
    "url": "https://www.theguardian.com/world/2025/nov/23/gaza-hospitals-essential-supplies-aid-israeli-airstrikes",
    "image": "https://media.guim.co.uk/c2a927b7102c0ef015b306bafe8f528c1dcdae74/408_0_3358_2687/500.jpg",
    "summary": "Israeli airstrikes in a contested territory have resulted in over 50 fatalities and more than 100 injuries. The area is experiencing a \"severe lack\" of essential resources amidst the ongoing conflict. Humanitarian concerns are rising as the situation deteriorates further.",
    "published": "2025-11-23T11:11:09Z"
  },
  {
    "title": "Arsenal v Tottenham buildup, Liverpool lose again, and Sheffield derby updates – matchday live",
    "url": "https://www.theguardian.com/football/live/2025/nov/23/arsenal-v-tottenham-hotspur-buildup-and-sheffield-derby-updates-matchday-live",
    "image": "https://media.guim.co.uk/ca360e23438137d526ccf8eaa93de37925a0bef8/0_0_5000_4000/500.jpg",
    "summary": "Join our writers for updates and insights as a bustling weekend of domestic football approaches. Stay informed on match previews and key storylines. Don't miss out on the latest developments in the football world!",
    "published": "2025-11-23T11:09:42Z"
  },
  {
    "title": "Charlotte activists met the immigration crackdown with ‘bless your heart’ resistance",
    "url": "https://www.theguardian.com/us-news/2025/nov/23/activists-immigration-charlotte-north-carolina",
    "image": "https://media.guim.co.uk/62368af9dc3fa2803bd0f41f31265ac75fe70763/0_0_4552_3643/500.jpg",
    "summary": "ICE and CBP's operations in North Carolina were challenged by a network of thousands of volunteers who formed an early-warning system. This grassroots effort aimed to alert communities about potential immigration enforcement activities. The initiative highlights the growing resistance and community organization against federal immigration enforcement in the region.",
    "published": "2025-11-23T11:00:07Z"
  },
  {
    "title": "Verstappen back in F1 title race after Norris and Piastri disqualification follows his Las Vegas win",
    "url": "https://www.theguardian.com/sport/2025/nov/23/max-verstappen-wins-f1-las-vegas-gp-lando-norris-second",
    "image": "https://media.guim.co.uk/711b321710c93dedd5cfc1d1a9533c27b5d00e24/443_160_3896_3116/500.jpg",
    "summary": "Max Verstappen fell 24 points behind Lando Norris in the standings due to significant wear on the skid blocks of his McLaren. As a result, both he and teammate Oscar Piastri ended the race without earning any points. The wear on the skid blocks significantly impacted their performance.",
    "published": "2025-11-23T10:34:31Z"
  }
]