[
  {
    "title": "England given target of 331 to beat South Africa: second men’s one-day international – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/04/england-v-south-africa-second-mens-one-day-international-live",
    "image": "https://media.guim.co.uk/bd6b255d80ac5abdd2ba87c89734c35e02604fb9/168_0_3648_2918/500.jpg",
    "summary": "England looks to recover from a heavy defeat in the first ODI against South Africa as they prepare to face off again at Lord's. The team aims to improve their performance and regain momentum. Join the live commentary to follow the action.",
    "published": "2025-09-04T19:21:50Z"
  },
  {
    "title": "RFK Jr grilled in tense hearing about chaos at federal health agencies and vaccines – live updates",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/04/donald-trump-tariffs-immigration-technology-epstein-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/c9ce9df4e0a13cc2fb1c6525d12a19fd293216bc/763_0_4913_3933/500.jpg",
    "summary": "Trump's health secretary is under pressure as he addresses concerns regarding department layoffs and budget cuts. Scrutiny intensifies around his proposals aimed at improving public health and the overall effectiveness of his initiatives. Critics question whether his strategies align with the administration's slogan to \"make America healthy again.\"",
    "published": "2025-09-04T19:15:45Z"
  },
  {
    "title": "Epping asylum hotel resident found guilty of sexual assault",
    "url": "https://www.theguardian.com/uk-news/2025/sep/04/epping-asylum-hotel-resident-found-guilty-of-sexual-assault",
    "image": "https://media.guim.co.uk/a2236e8615e47bf90c50589b17ef9b05aa329219/327_0_3379_2703/500.jpg",
    "summary": "Hadush Gerberslasie Kebatu was found guilty of two counts of sexual assault involving a 14-year-old girl and an adult woman. The verdict highlights serious concerns regarding the safety of vulnerable individuals in the community. The sentencing will address the severity of these offenses.",
    "published": "2025-09-04T19:11:42Z"
  },
  {
    "title": "Israel’s president to visit London next Thursday for expected talks with ministers",
    "url": "https://www.theguardian.com/politics/2025/sep/04/israel-president-visit-london-talks-ministers-isaac-herzog",
    "image": "https://media.guim.co.uk/58fe53f86dd5d3ed8808284aa7c3a855d5004d1d/510_287_3224_2579/500.jpg",
    "summary": "Israeli President Isaac Herzog is set to visit the UK shortly before a planned recognition of Palestinian statehood by the British government. This visit comes amid growing discussions around Palestine's independence. Herzog's trip may influence diplomatic relations as the UK approaches this significant decision.",
    "published": "2025-09-04T19:10:18Z"
  },
  {
    "title": "Scotland’s national library in U-turn over exhibiting gender-critical book",
    "url": "https://www.theguardian.com/uk-news/2025/sep/04/scotland-national-library-in-u-turn-over-exhibiting-gender-critical-book",
    "image": "https://media.guim.co.uk/e7989529f260c5e28e37a310987fdc2472a2235a/49_0_531_425/500.jpg",
    "summary": "The institution has agreed to readmit \"The Women Who Wouldn’t Wheesht\" to its centenary exhibition following public outcry. This decision comes after the work was initially excluded, sparking significant backlash. The reinstatement reflects the importance of the piece in the exhibition's narrative.",
    "published": "2025-09-04T19:05:24Z"
  }
]