[
  {
    "title": "Hamas praises Trump but says Tony Blair not welcome in post-war Gaza role – live",
    "url": "https://www.theguardian.com/world/live/2025/oct/10/gaza-ceasefire-plan-israel-donald-trump-hamas-palestine-benjamin-netanyahu-middle-east-latest-news",
    "image": "https://media.guim.co.uk/715b6748a97400308c7ea16c85bbeab3a959e509/403_0_2204_1763/500.jpg",
    "summary": "A senior Hamas official credits the US president for facilitating a ceasefire but emphasizes that Palestinians have negative recollections of Tony Blair's involvement in their history. The comments reflect ongoing tensions regarding foreign influence in the Israeli-Palestinian conflict. The official's remarks highlight a complex relationship with Western leaders.",
    "published": "2025-10-10T18:23:27Z"
  },
  {
    "title": "Bellingham must accept Tuchel’s collective structure or risk England exile | Jacob Steinberg",
    "url": "https://www.theguardian.com/football/2025/oct/10/thomas-tuchel-england-world-cup-jude-bellingham-psg-bayern-chelsea",
    "image": "https://media.guim.co.uk/74523396bf2424ea1f8c13f7fb373d959e2d34e7/301_59_1426_1141/500.jpg",
    "summary": "The manager at PSG has shifted focus from star power to fostering team unity in order to create a successful winning strategy. By prioritizing brotherhood among players, he believes the team can achieve better results. This approach marks a departure from relying solely on individual talent.",
    "published": "2025-10-10T18:23:17Z"
  },
  {
    "title": "Federal layoffs to begin as Congress remains deadlocked over funding to end shutdown – live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/10/letitia-james-donald-trump-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/84c7b03bccaa2922d85ef889e5129dcd2e773dba/475_0_5000_4000/500.jpg",
    "summary": "The Department of Homeland Security has confirmed that the Cybersecurity and Infrastructure Security Agency (CISA) will face workforce reductions. This decision comes amid an ongoing impasse within the agency. The layoffs highlight challenges in managing cybersecurity resources effectively during critical times.",
    "published": "2025-10-10T18:20:46Z"
  },
  {
    "title": "Sweden v Switzerland, France v Azerbaijan: World Cup qualifying clockwatch – live",
    "url": "https://www.theguardian.com/football/live/2025/oct/10/tuchel-criticises-silent-england-fans-world-cup-qualifying-news-and-more-football-live",
    "image": "https://media.guim.co.uk/5fd0f0bab80a011573a6d8d6ca51fed7a3c75097/594_440_2783_2227/500.jpg",
    "summary": "A rolling report covers the latest updates from World Cup qualifying matches featuring France, Germany, and Sweden. Writers are providing ongoing insights and highlights from these games. Stay tuned for continuous coverage as the qualifiers progress.",
    "published": "2025-10-10T18:20:33Z"
  },
  {
    "title": "Trump officials cancel major solar project in latest hit to renewable energy",
    "url": "https://www.theguardian.com/us-news/2025/oct/10/trump-officials-drop-major-solar-power-project-in-another-renewable-energy-attack",
    "image": "https://media.guim.co.uk/138c98c72ea54bd695264659bed9acac589a2111/753_0_3537_2833/500.jpg",
    "summary": "The Esmeralda 7 solar project in Nevada was set to generate enough energy to power 2 million homes. This initiative represents a significant step in renewable energy production. However, specific outcomes or current status details were not provided.",
    "published": "2025-10-10T18:15:45Z"
  }
]