[
  {
    "title": "News live: Albanese urges UAE supermarket chain to challenge Australia’s duopoly",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/30/australia-news-live-albanese-supermarket-united-arab-emirates-uae-coalition-sussan-ley-andrew-hastie-reserve-bank-rba-chalmers-interest-rates-decision-ntwnfb",
    "image": "https://media.guim.co.uk/b04cde3f729d013ff87842fe29cdc0616d5bd019/0_0_6326_5064/500.jpg",
    "summary": "I'm sorry, but I need more context or specific information about the news you want summarized. Please provide details or a link to the news article.",
    "published": "2025-09-29T21:15:39Z"
  },
  {
    "title": "Premier League top scorers 2025-26: who is leading race for golden boot?",
    "url": "https://www.theguardian.com/football/2025/sep/15/premier-league-top-scorers-2025-26-who-is-leading-race-for-golden-boot",
    "image": "https://media.guim.co.uk/4fb720907d0985e98936e72b69009529546d07db/566_298_2619_2096/500.jpg",
    "summary": "The English Premier League is showcasing top-performing strikers this season, with leading players dominating the goalscoring charts. Fans can track which football stars are making the most significant impact in terms of goals. Stay updated on the race for the Golden Boot as the season progresses.",
    "published": "2025-09-29T21:14:23Z"
  },
  {
    "title": "Trump demands Hamas accept US plan to ‘end Gaza conflict’ as Netanyahu says Israel will ‘finish the job’ if they don’t",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/29/donald-trump-benjamin-netanyahu-gaza-white-house-us-politics-live",
    "image": "https://media.guim.co.uk/f6855d1ff0f1594a3d9aba5cbb5ee09ac76df1ca/473_0_3985_3188/500.jpg",
    "summary": "Israeli Prime Minister Netanyahu expressed support for Trump's Gaza peace plan, highlighting its potential for resolving the conflict. However, he emphasized that a crucial requirement for the plan's success is the agreement of Hamas. This stance underscores the ongoing complexities in achieving lasting peace in the region.",
    "published": "2025-09-29T21:12:47Z"
  },
  {
    "title": "Future Fund profits from war, Liberal women sound net zero warning, and Trump spruiks new Gaza peace plan",
    "url": "https://www.theguardian.com/australia-news/2025/sep/30/morning-mail-tuesday-ntwnfb",
    "image": "https://media.guim.co.uk/da53dc78b1865f2beb04974b3a9d7ed13f440099/928_0_4708_3766/500.jpg",
    "summary": "A sovereign wealth fund has significantly increased in value, aided by investments in defense companies. Meanwhile, a political party has been warned that abandoning its net-zero commitments could lead to the loss of crucial voting demographics. This highlights the balancing act between investment growth and environmental policy.",
    "published": "2025-09-29T21:10:16Z"
  },
  {
    "title": "Everton v West Ham United: Premier League – as it happened",
    "url": "https://www.theguardian.com/football/live/2025/sep/29/everton-v-west-ham-premier-league-live",
    "image": "https://media.guim.co.uk/b4b2838a860736123bf48d492c4e20b037edfde6/544_0_4601_3682/500.jpg",
    "summary": "Michael Keane scored to give Everton an early lead, but Jarrod Bowen equalized for West Ham, marking the team's first goal under manager Nuno Espírito Santo. This result earned West Ham their first point of the season. The match showcased both teams battling for dominance in a competitive clash.",
    "published": "2025-09-29T21:05:10Z"
  }
]