[
  {
    "title": "Arsenal v Chelsea: Women’s Super League – live",
    "url": "https://www.theguardian.com/football/live/2025/nov/08/arsenal-v-chelsea-womens-super-league-live",
    "image": "https://media.guim.co.uk/26787568ccec301a9a823d58b15f94c26b1ab19a/628_0_4283_3426/500.jpg",
    "summary": "The league leaders are set to face the reigning European champions in a highly anticipated matchup. Rob Smyth will provide minute-by-minute updates on the game. Fans can expect exciting action as the two top teams clash.",
    "published": "2025-11-08T13:21:48Z"
  },
  {
    "title": "Tottenham Hotspur v Manchester United: Premier League – live",
    "url": "https://www.theguardian.com/football/live/2025/nov/08/tottenham-hotspur-v-manchester-united-premier-league-live",
    "image": "https://media.guim.co.uk/91438ec0341de93ac35df72addff831bfdcdcd67/454_0_3835_3068/500.jpg",
    "summary": "Ruben Amorim's team aims to maintain their unbeaten streak against Spurs. Updates are provided by Tim de Lisle during the match. Stay tuned for minute-by-minute coverage.",
    "published": "2025-11-08T13:20:18Z"
  },
  {
    "title": "Zohran Mamdani has upended US politics. Now he should take on Fifa | Jules Boykoff",
    "url": "https://www.theguardian.com/football/2025/nov/08/zohran-mamdani-has-upended-us-politics-now-he-should-take-on-fifa",
    "image": "https://media.guim.co.uk/f1d6be0a1abdffe363988cc64e9593d7adabaad8/300_0_3000_2400/500.jpg",
    "summary": "New York’s mayor-elect is confronting influential entities as he prepares to lead the city. With the World Cup set to occur in New York, he is encouraged to take on FIFA next. This move could signify a commitment to prioritizing the city's interests over external pressures.",
    "published": "2025-11-08T13:14:50Z"
  },
  {
    "title": "Middlesbrough give Rob Edwards permission to hold talks over Wolves job",
    "url": "https://www.theguardian.com/football/2025/nov/08/rob-edwards-middlesbrough-stand-down-manager-wolves-move-football-premier-league",
    "image": "https://media.guim.co.uk/dd2b4bf8d092bd47e997e92d494c669ca8dd075f/780_220_3370_2697/500.jpg",
    "summary": "Middlesbrough has granted Rob Edwards permission to discuss the managerial position at the Premier League club following the departure of Vítor Pereira. Edwards is set to hold talks regarding the vacancy. This move suggests Middlesbrough is looking for a new direction in their coaching staff.",
    "published": "2025-11-08T13:11:31Z"
  },
  {
    "title": "Social media misinformation driving men to NHS clinics in search of testosterone they don’t need",
    "url": "https://www.theguardian.com/society/2025/nov/08/social-media-misinformation-driving-men-to-nhs-clinics-in-search-of-testosterone-they-dont-need",
    "image": "https://media.guim.co.uk/404015c40059b0136c7c064adcb35d5d3e8f1d61/609_0_6142_4912/500.jpg",
    "summary": "Endocrinologists caution that unnecessary testosterone use may inhibit the body's natural hormone production. They emphasize the importance of only using testosterone when medically necessary. The warning highlights potential health risks associated with non-prescribed testosterone supplementation.",
    "published": "2025-11-08T13:01:03Z"
  }
]