[
  {
    "title": "UK borrowing exceeds forecasts in October as retail sales fall; energy price cap to rise in January – business live",
    "url": "https://www.theguardian.com/business/live/2025/nov/21/uk-public-finances-retail-sales-budget-energy-price-cap-stock-markets-ai-bubble-fears-business-live",
    "image": "https://media.guim.co.uk/004bcc62899c90e6dcd7e71211113b7759589bef/427_0_4265_3414/500.jpg",
    "summary": "Latest economic and financial news includes ongoing developments in markets and monetary policy. Analysts are closely monitoring key indicators and trends that could impact the global economy. Investors remain cautious as uncertainty continues to shape financial strategies.",
    "published": "2025-11-21T07:18:59Z"
  },
  {
    "title": "UK government borrows more than expected in setback before budget",
    "url": "https://www.theguardian.com/business/2025/nov/21/uk-government-borrowing-october-rachel-reeves",
    "image": "https://media.guim.co.uk/c2dbb5a83f88f6a165c5ead12f4c703856a4d929/318_0_4907_3924/500.jpg",
    "summary": "October figures provide a comprehensive overview of public finances ahead of Rachel Reeves's upcoming tax and spending statement. These statistics are crucial for understanding the economic landscape and potential fiscal policies. The data will likely influence Reeves's proposed measures to address financial challenges.",
    "published": "2025-11-21T07:13:57Z"
  },
  {
    "title": "Australia v England: Ashes first Test, day one – live",
    "url": "https://www.theguardian.com/sport/live/2025/nov/21/australia-vs-england-live-ashes-first-1st-test-day-one-aus-v-eng-cricket-scores-updates-perth",
    "image": "https://media.guim.co.uk/3b19a1ec8cf901733864c67440e3dc9b82c99549/162_0_3515_2813/500.jpg",
    "summary": "The much-anticipated series has officially started at Perth Stadium. Writers are providing updates in an over-by-over report. Fans can follow the action as it unfolds.",
    "published": "2025-11-21T07:09:26Z"
  },
  {
    "title": "Energy price cap for Great Britain in surprise rise from January",
    "url": "https://www.theguardian.com/money/2025/nov/21/energy-price-cap-great-britain-rise-january-fuel",
    "image": "https://media.guim.co.uk/51935e53859b5be51c83a224a25704e6e3c9489b/909_0_4560_3648/500.jpg",
    "summary": "The quarterly cap for dual fuel energy bills will rise to £1,758, up from the previous cap of £1,755. This adjustment reflects ongoing changes in energy market conditions. Consumers will see this new rate applied in the upcoming quarter.",
    "published": "2025-11-21T07:03:06Z"
  },
  {
    "title": "Stranger Things to The Beatles Anthology: the seven best shows to stream this week",
    "url": "https://www.theguardian.com/tv-and-radio/2025/nov/21/stranger-things-to-the-beatles-anthology-the-seven-best-shows-to-stream-this-week",
    "image": "https://media.guim.co.uk/5c131f31692b5d3294a6630b70daf61beaccd28d/73_6_1549_1239/500.jpg",
    "summary": "Fans are returning to Hawkins for a final, thrilling encounter with Vecna in the upcoming series finale. Additionally, Peter Jackson showcases remarkable footage of The Beatles, bringing new insights into the iconic band. This dual excitement promises a blend of horror and nostalgia for viewers.",
    "published": "2025-11-21T07:00:04Z"
  }
]