[
  {
    "title": "Widow of Charlie Kirk says her ‘cries will echo around the world like a battle cry’",
    "url": "https://www.theguardian.com/us-news/2025/sep/12/erika-kirk-charlie-kirk",
    "image": "https://media.guim.co.uk/2dc02185cc0adf3f6ae7569de6ed9207aeed1b00/270_0_1180_944/500.jpg",
    "summary": "Erika Kirk released a statement on Friday addressing her husband's assassination. She emphasized that the perpetrators of the crime do not understand the impact of their actions. Her remarks highlight the deep pain and consequences stemming from the tragedy.",
    "published": "2025-09-13T02:18:40Z"
  },
  {
    "title": "‘No idea what you’ve unleashed’: Erika Kirk, Charlie Kirk’s widow, gives statement after husband’s shooting – follow live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/12/charlie-kirk-shooter-suspect-latest-news-updates-donald-trump-utah",
    "image": "https://media.guim.co.uk/5ee7d8e9869b8a0948450a4c2b516b301baa8e06/310_0_1190_952/500.jpg",
    "summary": "Tyler Robinson, 22, is expected to face charges on Tuesday following an incident where he allegedly shot a rightwing activist. A family friend alerted authorities after hearing about the shooting. The investigation is ongoing as details continue to emerge.",
    "published": "2025-09-13T02:11:44Z"
  },
  {
    "title": "As a dark chapter closes, NZ reckons with fugitive father Tom Phillips’ four years on the run",
    "url": "https://www.theguardian.com/world/2025/sep/13/as-a-dark-chapter-closes-nz-reckons-with-fugitive-father-tom-phillips-four-years-on-the-run-ntwnfb",
    "image": "https://media.guim.co.uk/3ff1c8c4209c21ffa3bf6a73cad11db774e1af88/155_0_1548_1238/500.jpg",
    "summary": "Phillips' three children were rescued from the wilderness this week, sparking a complex and emotional case. The circumstances surrounding their disappearance and subsequent rescue have raised many questions. Investigations are likely to delve deeper into how the situation evolved.",
    "published": "2025-09-13T01:28:58Z"
  },
  {
    "title": "Suspect in Charlie Kirk shooting lived in quiet Utah town: ‘No different than my family’",
    "url": "https://www.theguardian.com/us-news/2025/sep/12/charlie-kirk-suspect-washington-utah",
    "image": "https://media.guim.co.uk/b3a1ab86d369c194f4cc743ee7d9a8b954ea3087/604_0_5160_4128/500.jpg",
    "summary": "In a small Washington city, neighbors were taken aback by the arrest of a local college student in connection with the death of Kirk. The news has sparked shock and surprise among the community. Details about the investigation remain limited.",
    "published": "2025-09-13T00:15:47Z"
  },
  {
    "title": "From rune megaphones to the number 88: Australia’s neo-Nazis have a new look after swastikas banned",
    "url": "https://www.theguardian.com/australia-news/2025/sep/13/rune-megaphone-number-88-australia-neo-nazi-symbols-after-swastikas-banned-ntwnfb",
    "image": "https://media.guim.co.uk/690d25f13460a922beb28139e64a8bb608c96395/316_0_3954_3165/500.jpg",
    "summary": "The far-right has utilized ancient Norse mythology to adopt a variety of symbols that promote their white supremacist ideologies. This appropriation of cultural elements serves to enhance their identity and messaging. Such actions highlight the ongoing manipulation of historical narratives for extremist agendas.",
    "published": "2025-09-13T00:00:51Z"
  }
]