[
  {
    "title": "Australia news live: five taken to hospital after chemical leak at post offices; widespread storms forecast for NSW",
    "url": "https://www.theguardian.com/australia-news/live/2025/oct/17/australia-news-live-sussan-ley-anthony-albanese-trump-meeting-foi-climate-laws-ntwnfb",
    "image": "https://media.guim.co.uk/7a7e3cb00822d9fd6d0ff201641ab55e33e20458/0_393_2705_2163/500.jpg",
    "summary": "I'm sorry, but I need more information or context to provide a summary. Could you please provide details or a specific article?",
    "published": "2025-10-17T02:59:37Z"
  },
  {
    "title": "Mamdani, Cuomo and Sliwa spar in New York mayoral debate",
    "url": "https://www.theguardian.com/us-news/2025/oct/16/mamdani-cuomo-sliwa-new-york-mayoral-debate",
    "image": "https://media.guim.co.uk/3de49cf0ba154d83238763112491379b61cba2f8/803_323_3594_2876/500.jpg",
    "summary": "The Democratic nominee and former New York Governor faced off during a heated debate, exchanging sharp criticisms. Meanwhile, Sliwa took the opportunity to criticize both candidates. Tensions were high as differing visions for the future were presented.",
    "published": "2025-10-17T02:30:04Z"
  },
  {
    "title": "Without Ace Frehley, Kiss could not have achieved their extraordinary greatness | Michael Hann",
    "url": "https://www.theguardian.com/music/2025/oct/17/ace-frehley-kiss-guitarist-greatness",
    "image": "https://media.guim.co.uk/4137ef4ee638e9639ffdaf6196bc473c19fd1c2e/313_0_3099_2480/500.jpg",
    "summary": "The guitarist, a key member of the original lineup, was recognized for his exceptional musical skills. His distinctive \"monster plod\" guitar style played a crucial role in defining the band's sound. His contributions were integral to their overall success and musical identity.",
    "published": "2025-10-17T02:27:48Z"
  },
  {
    "title": " Dan and Phil’s relationship revelation is a reminder of how toxic fandoms can be | Eilish Gilligan ",
    "url": "https://www.theguardian.com/technology/2025/oct/17/dan-phil-relationship-youtubers-toxic-fan-reactions",
    "image": "https://media.guim.co.uk/7547142a578c9dc1588deccb24b803aab537dbd1/362_0_3269_2616/500.jpg",
    "summary": "British YouTubers have officially confirmed their romantic relationship in their latest video. This announcement comes after 16 years of intense speculation about their status. Fans are reacting to the long-awaited revelation.",
    "published": "2025-10-17T02:26:54Z"
  },
  {
    "title": "Trump news at a glance: John Bolton vows to defend his conduct after indictment ",
    "url": "https://www.theguardian.com/us-news/2025/oct/17/trump-briefing-news-at-a-glance-latest",
    "image": "https://media.guim.co.uk/0e6fd6b0810d64406b40c4a89d7ee59a5f4b577a/0_0_4527_3622/500.jpg",
    "summary": "John Bolton, former National Security Advisor under Trump, is facing charges related to the mishandling and transmission of classified information. The allegations have emerged as part of broader scrutiny of national security protocols. This development is one of the significant US politics stories from October 16.",
    "published": "2025-10-17T02:14:05Z"
  }
]