[
  {
    "title": "NFL week seven: Jacksonville Jaguars host Los Angeles Rams at Wembley – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/19/nfl-week-seven-chiefs-raiders-vikings-eagles-titans-patriots-and-more-live",
    "image": "https://media.guim.co.uk/1d0c09cc2af48018e94c5d90489829d8befc5054/451_0_3410_2728/500.jpg",
    "summary": "Graham Searles will provide live updates as the Jacksonville Jaguars face the LA Rams at Wembley Stadium. This matchup marks the start of a busy Sunday in the sports schedule. Fans can expect exciting coverage of the game.",
    "published": "2025-10-19T16:21:32Z"
  },
  {
    "title": "India v England: Women’s Cricket World Cup – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/19/india-v-england-womens-cricket-world-cup-live",
    "image": "https://media.guim.co.uk/863766e89861a00e2fca1f7c32a2d56e6ab0ed6b/646_238_3084_2469/500.jpg",
    "summary": "James Wallace will cover the match where England faces the co-hosts at Holkar Stadium. Both teams are competing for a spot in the semi-finals. The game promises to be a thrilling encounter as they vie for advancement.",
    "published": "2025-10-19T16:21:08Z"
  },
  {
    "title": "Liverpool v Manchester United: Premier League – live",
    "url": "https://www.theguardian.com/football/live/2025/oct/19/liverpool-v-manchester-united-premier-league-live",
    "image": "https://media.guim.co.uk/36fcc1987654da4679eb0892f2436826214e090d/368_73_3144_2516/500.jpg",
    "summary": "In a crucial match, the champions face Ruben Amorim's team as they aim to break a streak of three consecutive losses. Follow Rob Smyth for live updates on the game. The outcome is essential for the champions to regain their momentum.",
    "published": "2025-10-19T16:20:33Z"
  },
  {
    "title": "Gaza agency says 11 killed in Israeli strikes as IDF confirms it has begun ‘wave of attacks’ – Middle East crisis live",
    "url": "https://www.theguardian.com/world/live/2025/oct/19/gaza-ceasefire-israel-hamas-rafah-hostages-middle-east-crisis-live-news-updates",
    "image": "https://media.guim.co.uk/ba9f257828b01b381c76b9ec3b5f8eb4094a5e9c/330_0_4560_3648/500.jpg",
    "summary": "The ceasefire is nearing total collapse as the Israeli military has initiated strikes, citing a \"blatant violation\" of the agreement by Hamas. This escalation raises concerns about renewed violence in the region. The situation remains tense, with heightened fears for civilian safety.",
    "published": "2025-10-19T16:12:31Z"
  },
  {
    "title": "This gift to housebuilders from Labour is shameful | Letters",
    "url": "https://www.theguardian.com/society/2025/oct/19/this-gift-to-housebuilders-from-labour-is-shameful",
    "image": "https://media.guim.co.uk/3f57fc3383b6cf974ded88095385f787f402ed50/374_0_3750_3000/500.jpg",
    "summary": "Readers react to Aditya Chakrabortty's article regarding a leaked memo that reveals government-funded advantages provided to developers. These perks include a reduction in the number of affordable housing units. The responses highlight concern over the implications for public funding and housing accessibility.",
    "published": "2025-10-19T16:12:24Z"
  }
]