[
  {
    "title": "India v South Africa: Women’s Cricket World Cup final – live",
    "url": "https://www.theguardian.com/sport/live/2025/nov/02/india-v-south-africa-womens-cricket-world-cup-final-live",
    "image": "https://media.guim.co.uk/f5bca26904d1ce24923ff89c48bd34a27dd6ba4e/234_0_3536_2828/500.jpg",
    "summary": "In Navi Mumbai, an exciting match is underway as teams compete fiercely for the trophy. Writers provide an over-by-over report to keep fans updated on the action. Stay tuned for live commentary and key highlights of the game.",
    "published": "2025-11-02T11:14:00Z"
  },
  {
    "title": "Australia v India: third men’s Twenty20 international – live",
    "url": "https://www.theguardian.com/sport/live/2025/nov/02/australia-v-india-t20-live-third-twenty20-international-cricket-aus-vs-ind-latest",
    "image": "https://media.guim.co.uk/f89b0a6955fb1d98f16e4bbb104a971b671668b9/432_0_3750_2999/500.jpg",
    "summary": "India requires 187 runs to win the T20I match at Bellerive Oval and equal the series against Australia. Martin Pegan will provide updates throughout the game. Fans can follow the over-by-over report for live commentary.",
    "published": "2025-11-02T11:13:58Z"
  },
  {
    "title": "Celtic and Rangers meet again, Premier League news and buildup – matchday live",
    "url": "https://www.theguardian.com/football/live/2025/nov/02/old-firm-clash-scottish-league-cup-semi-final-premier-league-buildup-matchday-live",
    "image": "https://media.guim.co.uk/c085638892a50f62981c279c5e9b536343331d9e/1008_301_3821_3059/500.jpg",
    "summary": "Tom Bassam brings updates and previews as anticipation builds for a significant day of events in both Scotland and England. Stay tuned for the latest news and insights. Don't miss out on the action!",
    "published": "2025-11-02T11:13:56Z"
  },
  {
    "title": "Cambridgeshire train stabbing: suspects both British and ‘nothing to suggest’ attack was terrorism, say police – latest updates",
    "url": "https://www.theguardian.com/uk-news/live/2025/nov/02/cambridgeshire-train-stabbing-life-threatening-injuries-arrests-latest-updates",
    "image": "https://media.guim.co.uk/61804b126144d2495eebbeb982c41af12f9c87c0/325_0_3432_2745/500.jpg",
    "summary": "Two men have been arrested on suspicion of attempted murder following an incident that left two individuals in life-threatening condition. Authorities are investigating the circumstances surrounding the event. The victims are currently receiving medical care.",
    "published": "2025-11-02T11:13:07Z"
  },
  {
    "title": "America’s redistricting fight: how could the US congressional map shift?",
    "url": "https://www.theguardian.com/us-news/ng-interactive/2025/nov/02/us-redistrcting-congressional-map",
    "image": "https://media.guim.co.uk/4082d9e4720e989f204725d7a3c99fccec1954b4/0_0_2000_1600/500.jpg",
    "summary": "Republicans currently have a slim majority in the House with 219 seats to 213. They have the potential to secure additional seats through upcoming reapportionment processes. This could strengthen their position in future legislative sessions.",
    "published": "2025-11-02T11:00:01Z"
  }
]