[
  {
    "title": "Australia news live: Hecs debt relief to come into effect from mid-November; Waters urges Australia to do more for detained flotilla activists",
    "url": "https://www.theguardian.com/australia-news/live/2025/oct/05/australia-news-live-hecs-student-debt-mark-butler-albanese-labor-melbourne-metro-nsw-qld-sussan-ley-andrew-hastie-coalition-ntwnfb",
    "image": "https://media.guim.co.uk/677bd6bc3f202404374826e287de834f6177658e/756_415_3490_2793/500.jpg",
    "summary": "I'm sorry, but I need the actual content or key points from the news to provide a summary. Please provide details or specific information you'd like summarized.",
    "published": "2025-10-04T23:14:37Z"
  },
  {
    "title": "Quiptic crossword No 1,350",
    "url": "https://www.theguardian.com/crosswords/quiptic/1350",
    "summary": "Quiptic crossword No. 1,350 has been released, offering puzzlers a new challenge with its carefully crafted clues. Known for its approachable difficulty, this edition is designed to engage both seasoned solvers and newcomers alike. Fans can expect a mix of clever wordplay and themed entries that make for an enjoyable solving experience.",
    "published": "2025-10-04T23:00:18Z"
  },
  {
    "title": "Ex-NFL player and Fox Sports star Mark Sanchez arrested after being stabbed",
    "url": "https://www.theguardian.com/sport/2025/oct/04/nfl-mark-sanchez-stabbing-fox",
    "image": "https://media.guim.co.uk/d249bf28cbd54e3bdf9eb2c24d4505eef89e4207/395_0_6198_4960/500.jpg",
    "summary": "The situation regarding the incident involving Sanchez is still unclear, as he is currently hospitalized. He has not yet been placed in detention. Further details are awaited as authorities continue to investigate.",
    "published": "2025-10-04T22:33:59Z"
  },
  {
    "title": "Judge halts Trump administration from detaining immigrant children after they turn 18",
    "url": "https://www.theguardian.com/us-news/2025/oct/04/immigrant-children-ice-detention-ruling",
    "image": "https://media.guim.co.uk/25608df8e219c47c57b261f7a1bd21ce16b01db6/236_0_2529_2023/500.jpg",
    "summary": "A ruling has temporarily halted the transfer of individuals to adult detention centers that advocates claimed was scheduled for this weekend. This decision comes amid concerns from advocates regarding the potential impact on those affected. The situation remains under scrutiny as legal proceedings continue.",
    "published": "2025-10-04T22:12:50Z"
  },
  {
    "title": "Maresca’s wild sprint a red-hot release after Chelsea stifle misfiring Liverpool | Barney Ronay",
    "url": "https://www.theguardian.com/football/2025/oct/04/enzo-maresca-wild-sprint-red-hot-release-chelsea-stifle-misfiring-liverpool",
    "image": "https://media.guim.co.uk/48132ea6465a20776fe09c44f8de536fee347035/117_65_2357_1886/500.jpg",
    "summary": "The Blues’ head coach was dismissed during the match following Estêvão Willian’s dramatic injury-time winning goal. Despite this setback, it is Arne Slot who must strategize moving forward. The situation presents challenges for the team as they navigate their next steps.",
    "published": "2025-10-04T21:30:52Z"
  }
]