[
  {
    "title": "AFL grand final 2025 live updates: Geelong Cats v Brisbane Lions",
    "url": "https://www.theguardian.com/sport/live/2025/sep/27/afl-grand-final-2025-live-updates-geelong-vs-lions-blog-scores-results-start-time-cats-v-lions-mcg",
    "image": "https://media.guim.co.uk/b9adfee7928848e17f9686acd5c052482c22f698/325_0_3234_2589/500.jpg",
    "summary": "In a highly anticipated match, the Cats aim for their third premiership under coach Chris Scott's leadership, while the Lions seek to defend their title. Live updates will be provided by our writers as the game unfolds. Stay tuned for a goal-by-goal report on this thrilling showdown.",
    "published": "2025-09-27T06:23:35Z"
  },
  {
    "title": "Bledisloe Cup live updates: New Zealand All Blacks v Australia Wallabies – Rugby Championship",
    "url": "https://www.theguardian.com/sport/live/2025/sep/27/bledisloe-cup-live-updates-new-zealand-all-blacks-vs-wallabies-australia-rugby-championship-scores-results-kick-off-time-eden-park-auckland",
    "image": "https://media.guim.co.uk/345e137d1023fdca0ddead19d10f9d3f6ba107bf/0_0_4130_3305/500.jpg",
    "summary": "The Wallabies aim to break their longstanding losing streak at Eden Park in a crucial match that could significantly impact their Rugby Championship campaign. The match report is provided by Jonathan Howcroft. Fans are eagerly anticipating whether the Wallabies can achieve this milestone.",
    "published": "2025-09-27T06:22:16Z"
  },
  {
    "title": "Mother and baby whale trapped in shark net off Queensland’s Rainbow Beach",
    "url": "https://www.theguardian.com/australia-news/2025/sep/27/mother-and-baby-whale-trapped-in-shark-net-off-queenslands-rainbow-beach",
    "image": "https://media.guim.co.uk/1f697ff5170f78acb9a0fb1e78f0daed3e41c1af/521_0_2069_1656/500.jpg",
    "summary": "Nine humpback whales have encountered entanglement issues in the past nine days, with one incident occurring 245 km north of Brisbane. This highlights increasing concerns about whale safety and the impact of fishing gear in their habitats. Efforts are likely needed to address these entanglements and protect marine wildlife.",
    "published": "2025-09-27T06:03:18Z"
  },
  {
    "title": "The word sauna comes from which language? The Saturday quiz",
    "url": "https://www.theguardian.com/lifeandstyle/2025/sep/27/the-word-sauna-comes-from-which-language-the-saturday-quiz",
    "image": "https://media.guim.co.uk/2a7ddd300f1cc61daa49724d33d629b4d4c107ab/461_0_5438_4350/500.jpg",
    "summary": "The Saturday quiz features a range of topics, including Japanese spiders and Spanish pirates, challenging participants to test their knowledge. It also references the political slogan \"Get Brexit Done.\" Engage in a fun and diverse trivia experience!",
    "published": "2025-09-27T06:00:36Z"
  },
  {
    "title": "My cultural awakening: The Parent Trap made me reconnect with my estranged father",
    "url": "https://www.theguardian.com/culture/2025/sep/27/my-cultural-awakening-the-parent-trap-made-me-reconnect-with-my-estranged-father",
    "image": "https://media.guim.co.uk/1a21d117c36319eb6c88b0aaf0360985627877fa/9_0_2246_1796/500.jpg",
    "summary": "The author reflects on their childhood experiences with a stepfather, leading to questions about their biological father's identity. A Lindsay Lohan film serves as a catalyst for the author to embark on a journey to find their real dad. This quest for understanding and connection highlights the complexities of family relationships.",
    "published": "2025-09-27T06:00:36Z"
  }
]