[
  {
    "title": "Women’s Cricket World Cup: Australia v Bangladesh – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/16/womens-cricket-world-cup-australia-v-bangladesh-live",
    "image": "https://media.guim.co.uk/722564bb2069558c8a009261fd1f3ca47a345bbd/706_0_4389_3512/500.jpg",
    "summary": "Australia has secured their place in the finals after a strong performance in the 50-over match in Visakhapatnam. The over-by-over report provides detailed updates on the match's progress. Join Megan Maurice for live commentary and analysis.",
    "published": "2025-10-16T11:15:18Z"
  },
  {
    "title": "First Thing: JD Vance brushes off racist texts in Republican group chat as ‘what kids do’",
    "url": "https://www.theguardian.com/us-news/2025/oct/16/first-thing-jd-vance-brushes-off-racist-texts-in-republican-group-chat-as-what-kids-do",
    "image": "https://media.guim.co.uk/ba14ce789d11563b177b42cf8e674da9b25edecd/790_435_1518_1215/500.jpg",
    "summary": "The vice-president dismissed messages like \"I love Hitler\" shared by young adults as mere \"stupid jokes.\" Meanwhile, Virginia Giuffre spoke out about her abuse by Jeffrey Epstein and Ghislaine Maxwell. The statements highlight ongoing discussions about the normalization of harmful rhetoric and the impact of trauma.",
    "published": "2025-10-16T11:15:14Z"
  },
  {
    "title": "Joint committee on national security strategy to hold inquiry into collapse of China spy trial, MPs told – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/oct/16/china-spy-case-cps-keir-starmer-uk-politics-latest-news-updates",
    "image": "https://media.guim.co.uk/d531e71f36df851b9482ec86e79bd6053562df55/350_0_4118_3294/500.jpg",
    "summary": "Chairs of the home affairs, foreign affairs, and justice committees will participate in an ongoing inquiry. Their involvement aims to address key issues related to their respective areas. The inquiry seeks to gather insights and recommendations for policy improvements.",
    "published": "2025-10-16T11:11:22Z"
  },
  {
    "title": "Gaza ceasefire live: Hamas accuses Israel of breaching ceasefire by ‘killing at least 24 people’ since Friday",
    "url": "https://www.theguardian.com/world/live/2025/oct/16/gaza-ceasefire-israel-hamas-palestine-rafah-hostages-live-news-updates",
    "image": "https://media.guim.co.uk/858fe899e1bcea685c54f64b3eef04136435f2e7/164_0_5558_4449/500.jpg",
    "summary": "The Israeli military has accused certain Palestinians of disregarding warnings to stay away from ceasefire positions and troops. This tension has escalated concerns over safety and adherence to ceasefire agreements. The situation remains complex amid ongoing conflict in the region.",
    "published": "2025-10-16T11:10:29Z"
  },
  {
    "title": "French PM survives no-confidence vote – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/oct/16/france-no-confidence-debate-lecornu-macron-europe-live-news-updates",
    "image": "https://media.guim.co.uk/a9b4c627977b39d4c3b184113dcd73cad1fd2ead/781_0_5000_4000/500.jpg",
    "summary": "French Minister Sébastien Lecornu and his government received narrow support from lawmakers following concessions made regarding pension reforms. The backing comes amid ongoing debates on the controversial changes. This approval is crucial for advancing the government's agenda amidst political tensions.",
    "published": "2025-10-16T11:06:05Z"
  }
]