[
  {
    "title": "Australia news live: Barnaby Joyce says he remains with Nationals but will not attend party room meetings this sitting fortnight",
    "url": "https://www.theguardian.com/australia-news/live/2025/oct/26/australia-news-live-anthony-albanese-asean-apac-coalition-matt-canavan-renewable-energy-solar-power",
    "image": "https://media.guim.co.uk/d0987a207d2babcc9fc811872868cc64e9c70f20/284_0_4291_3433/500.jpg",
    "summary": "Could you please provide the specific news you would like me to summarize?",
    "published": "2025-10-26T01:39:46Z"
  },
  {
    "title": "‘He trained us like Cool Runnings’: how Australian brothers took on niche Finnish sport to become the Finskaroos",
    "url": "https://www.theguardian.com/australia-news/2025/oct/26/he-trained-us-like-cool-runnings-how-australian-brothers-took-on-niche-finnish-sport-to-become-the-finskaroos",
    "image": "https://media.guim.co.uk/13ae572de08de1d9443e59188871bc19f779ffe9/0_0_2461_1969/500.jpg",
    "summary": "Traditional Finnish skittles has gained popularity in Australia, resulting in the formation of a self-selected national team. The sport has captured the interest and enthusiasm of players and fans alike. This unexpected trend highlights the growing appreciation for traditional games beyond their home countries.",
    "published": "2025-10-26T00:58:34Z"
  },
  {
    "title": "Trump news at a glance: President raises tariffs on Canada as he attends Asean summit with Carney",
    "url": "https://www.theguardian.com/us-news/2025/oct/26/trump-administration-news-updates-today-latest",
    "image": "https://media.guim.co.uk/47d1344ad043ca49c696490a8a5dde76db550753/830_0_6388_5111/500.jpg",
    "summary": "Donald Trump announced a response to an anti-tariff advertisement launched by the Ontario government. This announcement highlights ongoing tensions regarding trade policies between the US and Canada. Meanwhile, key political developments in the US were noted on Saturday, October 25.",
    "published": "2025-10-26T00:46:34Z"
  },
  {
    "title": "New Zealand v England: first men’s ODI – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/26/new-zealand-v-england-first-mens-odi-live",
    "image": "https://media.guim.co.uk/0cb18a38c2260e3466d58917f85ca51f81710170/659_60_6016_4815/500.jpg",
    "summary": "England's 50-over series against New Zealand has begun at Mount Maunganui. Live updates are provided through an over-by-over report from the writers. Fans can follow along as the match unfolds.",
    "published": "2025-10-25T23:36:13Z"
  },
  {
    "title": "Quiptic crossword No 1,353",
    "url": "https://www.theguardian.com/crosswords/quiptic/1353",
    "summary": "Quiptic crossword No. 1,353 is a recent installment in a popular crossword series known for its engaging clues and approachable difficulty. The puzzle combines clever wordplay and diverse themes, appealing to both novice and experienced solvers. Players are encouraged to challenge their vocabulary and problem-solving skills while enjoying the experience.",
    "published": "2025-10-25T23:00:46Z"
  }
]