[
  {
    "title": "Budget leak was the only leak Reeves wasn’t responsible for in this shambles",
    "url": "https://www.theguardian.com/politics/2025/nov/26/budget-leak-was-the-only-leak-reeves-wasnt-responsible-for-in-this-shambles",
    "image": "https://media.guim.co.uk/2ec1453467ead37174954d368ffe4428e894fdad/490_0_4912_3929/500.jpg",
    "summary": "The chancellor adopted a new strategy for the budget, unveiling her plans ahead of the official presentation. This early disclosure led to significant confusion and disruption. The unconventional tactic aimed to reshape how the budget is received, but resulted in unexpected turmoil.",
    "published": "2025-11-26T18:23:45Z"
  },
  {
    "title": "Budget 2025 live: Reeves claims freezing tax thresholds in budget does not breach manifesto pledge",
    "url": "https://www.theguardian.com/uk-news/live/2025/nov/26/budget-2025-rachel-reeves-tax-cash-isa-minimum-wage-latest-news-updates",
    "image": "https://media.guim.co.uk/969f334cc72f6242c187e863da1fea83f6af0cfc/286_0_6730_5384/500.jpg",
    "summary": "The Chancellor refused to elaborate on a specific issue, stating she would not engage in semantic debates. This comment came during a questioning session where her recent statement was critically analyzed. Her stance indicates a focus on substantive matters over detailed linguistic clarifications.",
    "published": "2025-11-26T18:21:37Z"
  },
  {
    "title": "‘A bit of a relief’: a City trading floor reacts to Reeves’s budget",
    "url": "https://www.theguardian.com/uk-news/2025/nov/26/london-city-trading-floor-reaction-rachel-reeves-budget",
    "image": "https://media.guim.co.uk/322e3c853f1a28500e9ce55e7b86eea527747c43/62_242_6898_5518/500.jpg",
    "summary": "Following the disruption caused by a leak from the Office for Budget Responsibility (OBR), London financial traders report that the markets have stabilized. The initial turmoil did not lead to significant long-term impacts on market performance. Traders are now assessing the situation with a sense of calm.",
    "published": "2025-11-26T18:21:20Z"
  },
  {
    "title": "Trump calls Times reporter ‘ugly’ days after branding another journalist ‘piggy’",
    "url": "https://www.theguardian.com/us-news/2025/nov/26/trump-insults-new-york-times-reporter-katie-rogers",
    "image": "https://media.guim.co.uk/d6969cff381f308cc6a13735aa80952ffd8ac734/410_124_3179_2543/500.jpg",
    "summary": "In a Truth Social post, the president criticized journalist Katie Rogers following a New York Times article that suggested he might be slowing down. His comments reflect frustration with media interpretations of his performance. The post highlights ongoing tensions between the president and the press.",
    "published": "2025-11-26T18:19:23Z"
  },
  {
    "title": "Toxic culture of distrust at BBC led to recent resignations, former deputy director says",
    "url": "https://www.theguardian.com/media/2025/nov/26/toxic-culture-of-distrust-at-bbc-led-to-recent-resignations-former-deputy-director-says",
    "image": "https://media.guim.co.uk/aef7e267490d147e831894408d6299dff5c9aeca/87_259_1923_1538/500.jpg",
    "summary": "Mark Damazer attributed the resignations of Tim Davie and Deborah Turness to a \"toxic mix\" of factors. He suggested that these circumstances created an untenable working environment. The implications of their departures are likely to impact the organization significantly.",
    "published": "2025-11-26T18:16:53Z"
  }
]