[
  {
    "title": "Nottinghamshire stun Surrey, Glamorgan promoted and more: county cricket, day four – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/18/surrey-v-nottinghamshire-somerset-v-hampshire-and-more-county-cricket-day-four-live",
    "image": "https://media.guim.co.uk/6e00c513cd479e01fb23433c5043c61e772fff4f/335_0_2978_2382/500.jpg",
    "summary": "Tanya Aldred provides live updates on the last day of the current County Championship matches. Fans can expect key highlights and performances as the games conclude. Stay tuned for the latest developments in the tournament.",
    "published": "2025-09-18T16:40:38Z"
  },
  {
    "title": "Trump suggests Starmer use military to cu– UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/18/donald-trump-state-visit-uk-keir-starmer-labour-politics-latest-news",
    "image": "https://media.guim.co.uk/3b481b3e5184381ee343d9f990e06eea26f9b1b9/463_0_5000_4000/500.jpg",
    "summary": "US and UK leaders faced questions regarding the situation in Gaza and the topic of free speech. Meanwhile, former President Trump stated he was unaware of Peter Mandelson, a former US ambassador. The discussions highlighted ongoing political and diplomatic issues related to both conflicts and public discourse.",
    "published": "2025-09-18T16:37:51Z"
  },
  {
    "title": "Trump claims Jimmy Kimmel suspension not a free speech issue as Democrats call for FCC chair to quit over ‘abuse of power’ – live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/18/jimmy-kimmel-charlie-kirk-comments-show-cancelled-suspended-monologue-trump-us-politics-live",
    "image": "https://media.guim.co.uk/c5e96b967de7e5aa001310c0fc9ab1ba6d6aedce/0_284_6474_5180/500.jpg",
    "summary": "US President Biden criticized a comedian, stating they were \"fired for lack of talent.\" Meanwhile, Democratic House leaders are calling for Brendan Carr, a media official associated with Trump, to resign. The comments highlight ongoing political tensions related to media and entertainment.",
    "published": "2025-09-18T16:37:37Z"
  },
  {
    "title": "Two teenagers charged over cyber-attack on Transport for London",
    "url": "https://www.theguardian.com/uk-news/2025/sep/18/two-teenagers-charged-transport-for-london-cyber-attack",
    "image": "https://media.guim.co.uk/586578b822c7e121003c9be2973df8788cefe000/707_0_6830_5464/500.jpg",
    "summary": "Thalha Jubair, 19, and Owen Flowers, 18, have appeared in court facing charges related to a hacking incident that reportedly cost Transport for London (TfL) £39 million. The court proceedings address the serious implications of their alleged actions. The case highlights ongoing concerns regarding cybersecurity and the impact of digital crimes on public services.",
    "published": "2025-09-18T16:36:02Z"
  },
  {
    "title": "Labour must win voters’ hearts – or Reform UK will | Letters ",
    "url": "https://www.theguardian.com/politics/2025/sep/18/labour-must-win-voters-hearts-or-reform-uk-will",
    "image": "https://media.guim.co.uk/e605703be9685cd3ea66ec4dbaa8ba7fccbdbd2f/60_0_1668_1334/500.jpg",
    "summary": "Cyril Haessig, Adrian Dumphy, and Dr. Margaret Martlew provide their insights in response to Kirsty Major's article addressing the party's struggle to engage with constituents, even in secure electoral districts. Their letters highlight the effectiveness of communication and the need for greater connection with the public. The discussion underscores concerns about the party's relevance in contemporary politics.",
    "published": "2025-09-18T16:30:30Z"
  }
]