[
  {
    "title": "Australia politics live: PM says neo-Nazi giving speech from Victoria’s parliament steps ‘isn’t the Australian way’",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/01/australia-politics-live-labor-coalition-housing-net-zero-anthony-albanese-sussan-ley-question-time-ntwnfb",
    "image": "https://media.guim.co.uk/94300487d4f4ced2913c26c2f9e98e956e544e35/85_177_3930_3145/500.jpg",
    "summary": "I'm sorry, but there is no specific news article provided for me to summarize. If you share the content or details of the news, I'd be happy to help summarize it in three lines!",
    "published": "2025-09-01T06:55:14Z"
  },
  {
    "title": "Factory activity shrinks as US tariffs bite; UK house prices drop – business live",
    "url": "https://www.theguardian.com/business/live/2025/sep/01/factory-activity-us-tariffs-uk-house-price-drop-mortgage-interest-rates-business-live-news-updates",
    "image": "https://media.guim.co.uk/670a80c570308d660f81c3c4e4ed9b841949b811/292_0_2917_2333/500.jpg",
    "summary": "Stay informed with real-time updates on the latest trends in the economy and financial markets. Coverage includes significant economic indicators, stock market movements, and expert analyses. Key focus areas highlight global economic changes and their potential impacts on various sectors.",
    "published": "2025-09-01T06:51:37Z"
  },
  {
    "title": "Afternoon Update: police say people helping Dezi Freeman; the deadly toll on journalists in Gaza; and Michael Rosen’s tips for a happier day",
    "url": "https://www.theguardian.com/australia-news/2025/sep/01/afternoon-update-monday-ntwnfb",
    "image": "https://media.guim.co.uk/4f3b8f78109074fae0ec4c238cebd159306200b8/781_0_4560_3648/500.jpg",
    "summary": "Authorities report that the public is aware of Freeman's location but has chosen not to provide information to the police. They are urging anyone with knowledge to come forward. The police express frustration over the community's silence regarding the matter.",
    "published": "2025-09-01T06:42:07Z"
  },
  {
    "title": "Afghanistan earthquake live: more than 600 dead after shallow quake strikes country’s east, state media reports",
    "url": "https://www.theguardian.com/world/live/2025/sep/01/afghanistan-earthquake-live-hundreds-after-shallow-quake-strikes-countrys-east-state-media-reports",
    "image": "https://media.guim.co.uk/4a505703b0a4050ac22ad1014630c49509de5ce0/0_0_2333_1867/500.jpg",
    "summary": "Several villages in Kunar province have been \"completely destroyed,\" according to the Ministry of Public Health. Rescue operations are currently underway to assist those affected. The extent of the damage and the impact on the community are still being assessed.",
    "published": "2025-09-01T06:38:02Z"
  },
  {
    "title": "GPS pay-as-you-go rail tickets to be trialled in England for first time",
    "url": "https://www.theguardian.com/business/2025/sep/01/tap-in-tap-out-rail-ticket-trial-to-streamline-fares-using-gps-tracking",
    "image": "https://media.guim.co.uk/caf6b707b245d7d97f5043833c585ea73e417826/500_0_6030_4824/500.jpg",
    "summary": "East Midlands passengers can now check in for their travel using their phones. They will be automatically charged the best fares available at the end of the day. This initiative aims to enhance convenience and offer cost-effective pricing for travelers.",
    "published": "2025-09-01T06:28:35Z"
  }
]