[
  {
    "title": "Tottenham v Manchester United buildup, Premier League and WSL news – matchday live ",
    "url": "https://www.theguardian.com/football/live/2025/nov/08/tottenham-v-manchester-united-buildup-premier-league-and-wsl-news-matchday-live",
    "image": "https://media.guim.co.uk/9ad2977bd5c40ff9858f4c5002b2ec56253ea145/0_0_5000_4000/500.jpg",
    "summary": "Tune in for updates, discussions, and previews ahead of today's events. Stay informed and engaged as the action unfolds. Don't miss out on essential insights!",
    "published": "2025-11-08T08:21:20Z"
  },
  {
    "title": "Australia v India: fifth men’s Twenty20 international – live",
    "url": "https://www.theguardian.com/sport/live/2025/nov/08/australia-v-india-fifth-mens-twenty20-international-cricket-live-updates",
    "image": "https://media.guim.co.uk/41295527c4f54bdf248af4e3fe44122c5a775d96/477_0_3193_2555/500.jpg",
    "summary": "Australia aims to equalize the T20 series against their rivals in the final match at the Gabba. The game has sparked excitement as both teams vie for victory. Join James Wallace for live updates on the match.",
    "published": "2025-11-08T08:15:59Z"
  },
  {
    "title": "Jailed UK climate protesters facing conditions reserved for extremists on release",
    "url": "https://www.theguardian.com/law/2025/nov/08/jailed-uk-climate-protesters-facing-conditions-reserved-for-extremists-on-release",
    "image": "https://media.guim.co.uk/e9068fad4d52f668313d18c38a58f70892cfb8a0/845_0_7200_5760/500.jpg",
    "summary": "A Just Stop Oil activist has been prohibited from attending any gatherings, including social meet-ups like cafes, unless they receive prior permission. This ban reflects ongoing tensions between climate activism and legal restrictions. The measures taken against the activist raise concerns about freedom of assembly and expression.",
    "published": "2025-11-08T08:00:06Z"
  },
  {
    "title": "Fall and redemption of Becker and Wiggins shows sporting glory does not deliver purpose or meaning | Cath Bishop",
    "url": "https://www.theguardian.com/sport/2025/nov/08/boris-becker-bradley-wiggins-autobiographies-redemption-abuse",
    "image": "https://media.guim.co.uk/5f55c218243aa1896d0b2a4e255d0e6a0d700c2d/0_0_5000_4000/500.jpg",
    "summary": "Books authored by former champions highlight the need to reject the idea that abuse and suffering are inevitable for success in sports. They emphasize the importance of addressing these issues rather than accepting them as \"the price of winning.\" The message calls for a stronger commitment from sports organizations to create a safer and healthier environment for athletes.",
    "published": "2025-11-08T08:00:06Z"
  },
  {
    "title": "Can anyone challenge the Sinner-Alcaraz supremacy? ATP Finals will reveal all",
    "url": "https://www.theguardian.com/sport/2025/nov/08/can-anyone-challenge-the-sinner-alcaraz-supremacy-atp-finals-will-reveal-all",
    "image": "https://media.guim.co.uk/267c3cb28b19da6b7c0330956b2891be54b1945c/180_0_4758_3807/500.jpg",
    "summary": "The top two players in the competition are dominating the field, consistently finishing first whenever they both participate in an event this year. Their performances have placed them significantly ahead of their rivals. This trend highlights their exceptional skill and competitiveness.",
    "published": "2025-11-08T08:00:04Z"
  }
]