[
  {
    "title": "Chelsea v Wolves: Premier League – live",
    "url": "https://www.theguardian.com/football/live/2025/nov/08/chelsea-v-wolves-premier-league-live",
    "image": "https://media.guim.co.uk/f8d5916cff4dd07f112769906fc468664518995c/234_188_6419_5135/500.jpg",
    "summary": "Enzo Maresca's team is set to play against the league's bottom team. Barry Glendenning will provide minute-by-minute updates on the match. Fans can follow along for real-time coverage of the game.",
    "published": "2025-11-08T21:14:02Z"
  },
  {
    "title": "Strictly Come Dancing: week seven – as it happened",
    "url": "https://www.theguardian.com/tv-and-radio/live/2025/nov/08/strictly-come-dancing-week-seven-live",
    "image": "https://media.guim.co.uk/cd2c1becfa3120fb43fce3c7638d2201ecf05b37/382_0_3818_3055/500.jpg",
    "summary": "Vicky Pattison delivered a standout tango, securing the highest scores, while Balvinder Sopal infused the competition with Bollywood flair. La Voix fell to the bottom of the leaderboard following a disappointing foxtrot. The contest's midway point raises questions about who will be eliminated next.",
    "published": "2025-11-08T21:00:41Z"
  },
  {
    "title": "Premier League top scorers 2025-26: who is leading race for golden boot?",
    "url": "https://www.theguardian.com/football/2025/sep/15/premier-league-top-scorers-2025-26-who-is-leading-race-for-golden-boot",
    "image": "https://media.guim.co.uk/7467a90a5a415f45959903d6d1b0c6942de5a2ce/1263_152_3876_3100/500.jpg",
    "summary": "The English Premier League is showcasing top scorers vying for the title this season. As goal tallies rise, key players are making headlines with their impressive performances. Fans are eagerly tracking the competition among these prolific strikers.",
    "published": "2025-11-08T20:27:46Z"
  },
  {
    "title": "‘Environmental catastrophe’ fears as millions of plastic beads wash up on Camber Sands",
    "url": "https://www.theguardian.com/uk-news/2025/nov/08/environmental-catastrophe-fears-as-millions-of-plastic-beads-wash-up-on-camber-sands",
    "image": "https://media.guim.co.uk/82f74d4fcda3e53e818d464c60533586e3f50d69/0_0_1788_1430/500.jpg",
    "summary": "Southern Water is under investigation due to worries that a recent spill may severely affect rare marine life. Environmental concerns have been raised regarding the potential consequences of the incident. Authorities are looking into the situation to assess the extent of the impact.",
    "published": "2025-11-08T20:22:56Z"
  },
  {
    "title": "The best Advent calendars in the US: 19 unique picks for a delightful Christmas countdown",
    "url": "https://www.theguardian.com/thefilter-us/2025/nov/08/best-advent-calendars-us-christmas-gifts",
    "image": "https://media.guim.co.uk/f470929d740437fc71e6c4433e026ba3000e427b/148_0_3781_3024/500.jpg",
    "summary": "Discover a selection of delightful Advent calendars featuring a variety of treats, from wine and whisky to beauty products and candy. These curated options are sure to enhance your holiday experience. Celebrate the season with these festive surprise-filled calendars!",
    "published": "2025-11-08T20:15:12Z"
  }
]