[
  {
    "title": "Europe scrambles to join Ukraine talks as EU nations attempt to bolster militaries – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/nov/27/russia-ukraine-war-peace-deal-eu-europe-latest-news-updates",
    "image": "https://media.guim.co.uk/562448be5b4cb6c2f4eaba964dfdd1302eee3c80/916_0_4584_3666/500.jpg",
    "summary": "French President Emmanuel Macron is set to announce plans for a new voluntary military service aimed at strengthening the nation's defense capabilities. This initiative is intended as an alternative to reinstating mandatory conscription. The proposal reflects France's commitment to enhancing its security while appealing to citizen participation.",
    "published": "2025-11-27T13:28:43Z"
  },
  {
    "title": "‘There should have been an alarm’: in air thick with acrid smoke, people in Hong Kong are reeling and angry ",
    "url": "https://www.theguardian.com/news/2025/nov/27/hong-kong-apartment-complex-fire-reaction",
    "image": "https://media.guim.co.uk/75107868bad6d47f4731a23734563f6454942d6c/619_0_5000_4000/500.jpg",
    "summary": "A fire at an apartment complex continues to burn more than 24 hours after it started. Police are investigating the cause, suspecting it may be due to \"grossly negligent\" actions. Residents are urged to stay clear of the area as firefighters work to contain the blaze.",
    "published": "2025-11-27T13:28:08Z"
  },
  {
    "title": "How the Hong Kong fire unfolded – visual guide",
    "url": "https://www.theguardian.com/news/2025/nov/27/how-hong-kong-fire-unfolded-apartment-block-blaze-wang-court",
    "image": "https://media.guim.co.uk/baf523e164ff98cc9ce4a3600f60049901ba29fb/175_0_5000_4000/500.jpg",
    "summary": "A fire swiftly escalated in a densely populated area of 31-storey tower blocks, threatening thousands of residents. The flames spread rapidly due to bamboo scaffolding used in the construction. Emergency services are working to control the blaze and ensure the safety of those affected.",
    "published": "2025-11-27T13:27:14Z"
  },
  {
    "title": "You’re gonna need a bigger boat: the 20 best films set on water – ranked! ",
    "url": "https://www.theguardian.com/film/2025/nov/27/youre-gonna-need-a-bigger-boat-the-20-best-films-set-on-water-ranked",
    "image": "https://media.guim.co.uk/1eaa26299f74f04a594d20dccc2771ab5765c06d/120_0_1379_1103/500.jpg",
    "summary": "With the re-release of L’Atalante, a countdown of the best films predominantly set on various watercrafts has been compiled. The list includes vessels such as ships, boats, barges, yachts, steamers, and trimarans. Notably, submarines are excluded as they operate underwater.",
    "published": "2025-11-27T13:26:56Z"
  },
  {
    "title": "Belfast youth football coach expelled after posting cocaine prices on league group chat",
    "url": "https://www.theguardian.com/uk-news/2025/nov/27/belfast-youth-football-coach-expelled-after-posting-cocaine-prices-on-league-group-chat",
    "image": "https://media.guim.co.uk/1730f94f1425ba4ddf3e683a60616af98c6e8fc9/951_705_4626_3701/500.jpg",
    "summary": "Details about \"proper pure bags\" include specific meeting times, costs, and locations for purchase, as well as a requirement for cash payment. This information is aimed at ensuring clarity for potential buyers. It emphasizes the importance of organized transactions for these items.",
    "published": "2025-11-27T13:26:06Z"
  }
]