[
  {
    "title": "India v England: Women’s Cricket World Cup – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/19/india-v-england-womens-cricket-world-cup-live",
    "image": "https://media.guim.co.uk/eb011cb724977ec56e2f8b09908480fd36a0cfba/512_0_6485_5191/500.jpg",
    "summary": "England will face the co-hosts at Holkar Stadium in a crucial match, as both teams vie for a spot in the semi-finals. The stakes are high as the competition intensifies. Fans are eagerly anticipating an exciting clash between the two sides.",
    "published": "2025-10-19T12:36:12Z"
  },
  {
    "title": "Israeli army confirms it has carried out airstrikes in Rafah – Middle East crisis live",
    "url": "https://www.theguardian.com/world/live/2025/oct/19/gaza-ceasefire-israel-hamas-rafah-hostages-middle-east-crisis-live-news-updates",
    "image": "https://media.guim.co.uk/fefaa83f7a97615a79f697d17201edd7b8239990/965_0_5600_4480/500.jpg",
    "summary": "A ceasefire is jeopardized as the army claims it acted in response to attacks on its troops involving anti-tank missiles and gunfire. The situation escalated amid ongoing tensions, challenging efforts to maintain peace. Officials are now seeking to address the incident and prevent further conflict.",
    "published": "2025-10-19T12:27:04Z"
  },
  {
    "title": "Tottenham v Aston Villa: Premier League – live",
    "url": "https://www.theguardian.com/football/live/2025/oct/19/tottenham-hotspur-v-aston-villa-premier-league-live",
    "image": "https://media.guim.co.uk/580be8d8ed09f21de99b964ae4bd147b11f01c00/7_0_4914_3933/500.jpg",
    "summary": "Michael Butler provides a live update on the Spurs as they aim to uphold their impressive start in the Premier League season. Fans can follow minute-by-minute commentary to keep track of the team's performance. The focus remains on Spurs continuing their momentum in the league.",
    "published": "2025-10-19T12:16:39Z"
  },
  {
    "title": "How the west can stop the global south being strangled by debt | Heather Stewart",
    "url": "https://www.theguardian.com/world/2025/oct/19/west-act-stop-global-south-strangled-by-debt",
    "image": "https://media.guim.co.uk/c4f8b398973dde6d14f1b6d37cf8d004b324a81a/2_0_3750_3000/500.jpg",
    "summary": "Labour is urged to honor its manifesto commitment to restore the UK's global leadership in development. Emphasizing this promise could enhance the party's credibility and appeal. Reviving international development efforts is seen as crucial for Britain's influence on the world stage.",
    "published": "2025-10-19T12:16:34Z"
  },
  {
    "title": "Forest target Fulham’s Marco Silva, Liverpool v Manchester United build-up – as it happened",
    "url": "https://www.theguardian.com/football/live/2025/oct/19/nottingham-forest-latest-and-buildup-to-liverpool-v-manchester-united-matchday-live",
    "image": "https://media.guim.co.uk/6b2afb41f98d3556e8ef27c0b4b9b7ffde4d3e9f/0_0_5000_4000/500.jpg",
    "summary": "Nottingham Forest is actively seeking a new manager ahead of Sunday's match. The club is in discussions and gathering updates regarding potential candidates. The buildup to the game includes news and opinions surrounding this managerial search.",
    "published": "2025-10-19T12:04:27Z"
  }
]