[
  {
    "title": "Benfica v Arsenal: Women’s Champions League – live",
    "url": "https://www.theguardian.com/football/live/2025/oct/16/benfica-v-arsenal-womens-champions-league-live",
    "image": "https://media.guim.co.uk/dc536eef92b32e38ab53f469927e2b51f2c8398d/475_47_3142_2514/500.jpg",
    "summary": "Rob Smyth is providing live updates as the defending champions face off against the Portuguese champions. Fans can join the minute-by-minute report for all the action. Stay tuned for the latest developments in this exciting matchup.",
    "published": "2025-10-16T20:21:11Z"
  },
  {
    "title": "Trump says he will meet Putin in Hungary after ‘productive’ call – live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/16/trump-latest-shutdown-vote-jd-vance-republicans-democrats",
    "image": "https://media.guim.co.uk/036ce5b1a800ea4a9f2021e40c27155274b6e017/265_0_1795_1436/500.jpg",
    "summary": "U.S. President and Russian leader have agreed to meet next week in an undisclosed location in Budapest. This meeting aims to address ongoing issues between the two countries. Details regarding the agenda and participants are not yet available.",
    "published": "2025-10-16T20:21:00Z"
  },
  {
    "title": "Australia news live: Ley challenges Albanese over Trump meeting; storm warning for Sydney",
    "url": "https://www.theguardian.com/australia-news/live/2025/oct/17/australia-news-live-sussan-ley-anthony-albanese-trump-meeting-foi-climate-laws-ntwnfb",
    "image": "https://media.guim.co.uk/99064e784e22d4b81763d913748a54062a6e2c0a/0_0_4913_3931/500.jpg",
    "summary": "Certainly! However, I'll need more context or content related to the news you want summarized. Please provide the details or key points you'd like me to condense into three lines.",
    "published": "2025-10-16T20:19:12Z"
  },
  {
    "title": "Corrections and clarifications",
    "url": "https://www.theguardian.com/news/2025/oct/16/corrections-and-clarifications",
    "summary": "The article discusses recent figures related to Palestinian arrests, highlighting a significant increase in detentions. The context may involve political tensions and security operations in the region. The information is set against a backdrop that includes various international responses to the situation.",
    "published": "2025-10-16T20:00:51Z"
  },
  {
    "title": "US Senate vote to end government shutdown fails for 10th time",
    "url": "https://www.theguardian.com/us-news/2025/oct/16/government-shutdown-aoc-bernie-sanders-republicans",
    "image": "https://media.guim.co.uk/15a5affc9d387a8e92b23be694fb5dc70295d967/997_0_5662_4531/500.jpg",
    "summary": "A second vote on Pentagon funding has failed, halting the process necessary to initiate military operations. This setback complicates the approval of defense spending. Lawmakers must now confront the challenges posed by the stalled funding efforts.",
    "published": "2025-10-16T19:57:07Z"
  }
]