[
  {
    "title": "Who are the final 20 living hostages to have been freed from Gaza?",
    "url": "https://www.theguardian.com/world/2025/oct/11/hostages-gaza-israel-profiles",
    "image": "https://media.guim.co.uk/ca410a92dbf87716b9b74065398cb0a80f65be55/0_76_3932_3146/500.jpg",
    "summary": "A ceasefire agreement has been reached, resulting in the release of individuals held captive for over 700 days following the attacks on October 7, 2023. This deal marks a significant step towards resolution and the end of prolonged suffering for the captives. The negotiations reflect ongoing efforts to promote peace and stability in the region.",
    "published": "2025-10-13T15:18:59Z"
  },
  {
    "title": "‘Locked up for 24 years’: joy and sorrow as Palestinian prisoners return home",
    "url": "https://www.theguardian.com/world/2025/oct/13/palestinian-prisoners-return-home",
    "image": "https://media.guim.co.uk/cdf626d48d4af33670bd143137a87ee2b48fce39/588_0_5009_4009/500.jpg",
    "summary": "Nearly 2,000 individuals have been released from Israeli prisons, but some families fear their loved ones may have been deported instead of being set free. Concerns persist over the fate of these individuals, as uncertainty surrounds their current locations. The situation highlights ongoing tensions and complexities in the region.",
    "published": "2025-10-13T15:18:21Z"
  },
  {
    "title": "Gaza ceasefire: all living Israeli hostages freed as Trump arrives in Egypt for summit – latest updates",
    "url": "https://www.theguardian.com/world/live/2025/oct/13/gaza-ceasefire-live-updates-israel-hostages-release-hamas-trump-middle-east",
    "image": "https://media.guim.co.uk/ee681345a9cc6bf12d760b5434dceb30e13f5831/345_0_3196_2557/500.jpg",
    "summary": "US President Joe Biden received a standing ovation in Israel's Knesset amid a momentous occasion where 20 hostages were returned. The event coincided with the release of hundreds of Palestinian prisoners. This development highlights ongoing tensions and efforts towards resolution in the region.",
    "published": "2025-10-13T15:14:03Z"
  },
  {
    "title": "Vodafone outage: thousands of broadband and mobile users report problems",
    "url": "https://www.theguardian.com/business/2025/oct/13/vodafone-outage-broadband-mobile-down-internet-calls",
    "image": "https://media.guim.co.uk/3b1a08a894d52beb69e451301a9356ce53ed518d/285_0_5039_4033/500.jpg",
    "summary": "Many customers are experiencing disruptions in accessing services, including internet connectivity and mobile phone calls. These outages have led to significant frustration among users. The issues are prompting inquiries into the reliability of the service provider.",
    "published": "2025-10-13T15:09:44Z"
  },
  {
    "title": "Macron accuses rivals of fuelling instability as he dismisses calls to resign",
    "url": "https://www.theguardian.com/world/2025/oct/13/macron-accuses-rivals-fuelling-france-instability-dismisses-calls-resign",
    "image": "https://media.guim.co.uk/da930b86eeaf0ce8fdb3183389b8a0f35e76378e/176_68_2864_2292/500.jpg",
    "summary": "French President Emmanuel Macron criticized the opposition for failing to meet the challenges facing the nation following the reappointment of Sébastien Lecornu as Prime Minister. He expressed disappointment in their response to current issues. Macron's remarks highlight a call for greater accountability and collaboration from political rivals.",
    "published": "2025-10-13T15:08:58Z"
  }
]