[
  {
    "title": "Australia news live: Ley says nuclear a technology ‘we should consider for the future’ after Coalition’s net zero meeting",
    "url": "https://www.theguardian.com/australia-news/live/2025/oct/31/australia-news-live-politics-parliament-coalition-labor-net-zero-anthony-albanese-sussan-ley-epbc-nature-laws-ntwnfb",
    "image": "https://media.guim.co.uk/09719c98cf89cab2321405f962f5ab96b47b95cb/349_0_5685_4548/500.jpg",
    "summary": "Please provide the news article or content you'd like summarized, and I'll be happy to help!",
    "published": "2025-10-31T02:55:27Z"
  },
  {
    "title": "Australia’s first formal treaty with Indigenous traditional owners passed in Victoria",
    "url": "https://www.theguardian.com/australia-news/2025/oct/31/australia-first-formal-treaty-indigenous-traditional-owners-passed-victoria",
    "image": "https://media.guim.co.uk/713b977cb99c0ff12e4349b43b8170675f4a56a5/558_0_5580_4464/500.jpg",
    "summary": "Premier Jacinta Allan described a recent development as a historic moment for reconciliation, empowering Aboriginal Australians to influence policies impacting their communities. This step is celebrated as a significant advancement in recognizing the rights and voices of Indigenous peoples. The initiative aims to enhance self-determination and strengthen the relationship between Aboriginal Australians and the government.",
    "published": "2025-10-31T02:52:44Z"
  },
  {
    "title": "More than half of Americans disapprove of Trump demolishing East Wing – poll",
    "url": "https://www.theguardian.com/us-news/2025/oct/30/americans-disapprove-trump-east-wing-poll",
    "image": "https://media.guim.co.uk/f7ef9c9cdf0f0891743c53e071da9e4e554c48f9/313_61_1000_801/500.jpg",
    "summary": "A recent survey revealed that one-third of respondents support the president, while 56% oppose a specific policy move. This indicates a significant level of discontent among the population regarding the president's decisions. The findings suggest a divide in public opinion.",
    "published": "2025-10-31T01:50:45Z"
  },
  {
    "title": "Hurricane Melissa heads to Bermuda as relief efforts intensify in Jamaica",
    "url": "https://www.theguardian.com/world/2025/oct/30/hurricane-melissa-bermuda-leaving-devastation-jamaica",
    "image": "https://media.guim.co.uk/54e96ff0deedfce38d5b975b2657bf6c5ef333f5/60_0_2500_2000/500.jpg",
    "summary": "Kingston airport has resumed operations for aid flights as Jamaican towns face severe flooding and downed power lines following a recent storm. The storm's overall death toll has risen to 44. Authorities are working to restore normalcy and provide assistance to affected areas.",
    "published": "2025-10-31T01:50:16Z"
  },
  {
    "title": "‘Yes, we’ve been to the moon before’: Nasa rebuffs Kim Kardashian conspiracy theory",
    "url": "https://www.theguardian.com/science/2025/oct/30/nasa-kim-kardashian-moon-landings",
    "image": "https://media.guim.co.uk/d169fa810e9dc81d087407451d08e5c338e73084/326_0_5319_4255/500.jpg",
    "summary": "NASA chief Sean Duffy affirmed the authenticity of the 1969 moon landing following a claim by a US celebrity on a television show suggesting it was staged. Duffy emphasized the significant evidence and scientific achievements behind the historic event. The reaffirmation comes amid ongoing discussions about conspiracy theories surrounding the Apollo missions.",
    "published": "2025-10-31T01:25:08Z"
  }
]