[
  {
    "title": "More railway operators to be returned to public ownership next year, says Labour – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/27/railway-operators-trains-public-ownership-labour-party-conference-uk-politics-live-latest-news",
    "image": "https://media.guim.co.uk/565527e809a9f8364f67b2e409bc660d4b1006f4/246_0_2953_2362/500.jpg",
    "summary": "Transport Secretary announces that Govia Thameslink, Chiltern, and Great Western rail services will transition into public ownership in 2026, following West Midlands Trains. This move is set to be revealed at the Labour Party conference. The change aims to enhance rail services and accountability.",
    "published": "2025-09-27T09:12:48Z"
  },
  {
    "title": "Brentford v Manchester United buildup, Madrid derby and WSL action – matchday live",
    "url": "https://www.theguardian.com/football/live/2025/sep/27/brentford-v-manchester-united-buildup-madrid-derby-and-wsl-action-matchday-live",
    "image": "https://media.guim.co.uk/d53934446e07ffe23418a5768b721a58d05dd52d/0_0_5000_4000/500.jpg",
    "summary": "Ruben Amorim is seeking a much-needed victory as his team faces a challenging day in football. Meanwhile, the highly anticipated Madrid derby is approaching, adding to the excitement. Join us for a discussion on these critical matchups.",
    "published": "2025-09-27T09:08:48Z"
  },
  {
    "title": "‘Nobody is painted any worse than they actually were’: new book tells the true story of the Cars",
    "url": "https://www.theguardian.com/music/2025/sep/27/the-cars-band-book-let-the-stories-be-told",
    "image": "https://media.guim.co.uk/be0ddd945964c6a3e1b8b853ed5002b280505c0b/380_0_4419_3534/500.jpg",
    "summary": "In \"Let the Stories Be Told,\" surviving members of the 80s band reveal intriguing behind-the-scenes tales from their iconic songs. They discuss personal conflicts and creative challenges that shaped their music. The documentary offers fans an intimate look at the band's journey during a transformative era in music.",
    "published": "2025-09-27T09:07:37Z"
  },
  {
    "title": "Most of gen Z watch TV with the subtitles on – and I understand why | Isabel Brooks",
    "url": "https://www.theguardian.com/commentisfree/2025/sep/27/gen-z-watch-tv-subtitles-i-understand-why",
    "image": "https://media.guim.co.uk/9ebc4ca4441786e4b68ac846c6894ef0294f8ecd/0_0_5000_4000/500.jpg",
    "summary": "Freelance writer Isabel Brooks highlights how social media has transformed our environment by introducing widespread subtitling. This trend, while promoting accessibility, often leads to divided attention and inaccuracies in captions. Brooks reflects on the implications of this shift in communication and engagement.",
    "published": "2025-09-27T09:00:39Z"
  },
  {
    "title": "Sexless, snug and still here: the secrets of Birkenstock’s enduring success",
    "url": "https://www.theguardian.com/fashion/2025/sep/27/sexless-snug-and-still-here-the-secrets-of-birkenstocks-enduring-success",
    "image": "https://media.guim.co.uk/5e90c747fdafa889f9e4f5a328b2899bb5d9031a/333_0_2360_1888/500.jpg",
    "summary": "A recent tour of Birkenstock factories in Germany highlights the brand's unique position in the fashion industry, showcasing shoes that prioritize functionality while still making a stylish statement. This paradox of form and function illustrates how Birkenstock has successfully merged practicality with trendiness. The exploration reveals insights into the craftsmanship and design philosophy behind these popular footwear styles.",
    "published": "2025-09-27T09:00:39Z"
  }
]