[
  {
    "title": "Charlie Kirk shooting: suspect set to face aggravated murder charge - live updates",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/12/charlie-kirk-shooter-suspect-latest-news-updates-donald-trump-utah",
    "image": "https://media.guim.co.uk/b3900dee754cc4e9b61442cbd4826f211c47f0af/0_969_1693_1353/500.jpg",
    "summary": "Tyler Robinson, 22, is expected to face charges after allegedly shooting a rightwing activist. A family friend informed authorities about the incident. The charges are anticipated to be announced on Tuesday.",
    "published": "2025-09-12T23:19:35Z"
  },
  {
    "title": "Weekend crossword No 766",
    "url": "https://www.theguardian.com/crosswords/weekend/766",
    "summary": "I'm sorry, but I don't have access to specific content like \"Weekend crossword No 766.\" If you can provide details or context about the crossword, I'd be happy to help summarize or discuss it!",
    "published": "2025-09-12T23:00:48Z"
  },
  {
    "title": "Suspect in Charlie Kirk shooting lived in quiet Utah town: ‘no different than my family’",
    "url": "https://www.theguardian.com/us-news/2025/sep/12/charlie-kirk-suspect-washington-utah",
    "image": "https://media.guim.co.uk/b3a1ab86d369c194f4cc743ee7d9a8b954ea3087/604_0_5160_4128/500.jpg",
    "summary": "Tyler Robinson's family resides in Washington, a city with a population of 35,000. They are located 260 miles from the site where Kirk was tragically killed during an event. The incident has deeply affected their community.",
    "published": "2025-09-12T23:00:40Z"
  },
  {
    "title": "US immigration officers kill man trying to flee vehicle stop near Chicago",
    "url": "https://www.theguardian.com/us-news/2025/sep/12/ice-agent-shooting-chicago",
    "image": "https://media.guim.co.uk/614880ebdc98251c09db7173da72829dc3822ce4/275_0_2735_2189/500.jpg",
    "summary": "Silverio Villegas-Gonzalez was involved in an incident in Franklin Park, Illinois, where he shot and killed a police officer. Another officer was injured during the confrontation. The event has raised concerns about public safety and the need for further investigation.",
    "published": "2025-09-12T22:23:34Z"
  },
  {
    "title": "Five Great Reads: Defending Dominique Pelicot, AI relationships, and the neighbourhood cat elections",
    "url": "https://www.theguardian.com/australia-news/2025/sep/13/five-great-reads-defending-dominique-pelicot-ai-relationships-and-the-neighbourhood-cat-elections",
    "image": "https://media.guim.co.uk/a9dc46cde41419d460d764c11ac4ff4883452d12/497_180_2546_2037/500.jpg",
    "summary": "Guardian Australia's weekend wrap highlights key articles from the past week, curated by Claire Keenan. It offers insights into significant news stories and trends affecting Australia. The selection aims to keep readers informed on relevant current events.",
    "published": "2025-09-12T22:00:46Z"
  }
]