[
  {
    "title": "Australia news live: Melbourne Metro Tunnel to begin taking passengers early; Albanese labels Coalition a ‘rabble and clown show’",
    "url": "https://www.theguardian.com/australia-news/live/2025/nov/16/australia-news-live-liberal-coalition-net-zero-sussan-ley-penny-wong-labor-cop30-chris-bowen-albanese-storms-queensland-nsw-ntwnfb",
    "image": "https://media.guim.co.uk/50445d822de8db2a85ef0227bb906313081e997f/0_0_6448_5158/500.jpg",
    "summary": "I'm sorry, but it seems like you've provided an incomplete request. Could you please provide the news article or information that you'd like summarized?",
    "published": "2025-11-16T03:14:11Z"
  },
  {
    "title": "Ukraine war briefing: Drones hit Russia’s Ryazan oil refinery",
    "url": "https://www.theguardian.com/world/2025/nov/16/ukraine-war-briefing-drones-hit-russias-ryazan-oil-refinery",
    "image": "https://media.guim.co.uk/1a0f4bcf02fa23eccdd82abc497dca715be5a27f/253_0_1350_1080/500.jpg",
    "summary": "Russian attacks resulted in the deaths of four people on Saturday. Meanwhile, the Serbian government is under pressure to remove Russian ownership from its state oil company. This marks the 1,362nd day of the ongoing conflict.",
    "published": "2025-11-16T02:31:15Z"
  },
  {
    "title": "Trump news at a glance: Marjorie Taylor Greene raises fears for her safety as row with Donald Trump escalates",
    "url": "https://www.theguardian.com/us-news/2025/nov/16/trump-administration-news-updates-today",
    "image": "https://media.guim.co.uk/3b3c76b44c90c5914506e43150a86b1ddf4c26b4/214_0_3220_2576/500.jpg",
    "summary": "A former ally of the president reports being approached by private security firms following her public criticism of him. This development comes amid ongoing tensions in U.S. politics. Key stories from November 15 highlight significant political dynamics and reactions.",
    "published": "2025-11-16T02:16:43Z"
  },
  {
    "title": "The Wallabies were meant to prove they’re back. But instead they have gone backwards",
    "url": "https://www.theguardian.com/sport/2025/nov/16/the-wallabies-were-meant-to-prove-theyre-back-but-instead-they-have-gone-backwards",
    "image": "https://media.guim.co.uk/82af2827a849cd00d8972b60a9fdef5921c2b4d9/564_887_2982_2388/500.jpg",
    "summary": "Australia's recent 46-19 loss to Ireland highlights the significant gap between the Australian rugby team and the top-ranked teams in the sport. The defeat serves as a sobering wake-up call regarding their performance and competitiveness on the international stage. This result emphasizes the need for improvement as they aim to close the disparity with elite teams.",
    "published": "2025-11-16T01:01:35Z"
  },
  {
    "title": "Alice Wong, ‘luminary’ writer and disability rights activist, dies aged 51",
    "url": "https://www.theguardian.com/us-news/2025/nov/15/alice-wong-disability-rights-activist-dies-aged-51",
    "image": "https://media.guim.co.uk/7a564213213fcfcdd19804582519723aeb376e3c/0_270_683_546/500.jpg",
    "summary": "The daughter of immigrants is championing the rights of individuals with disabilities, pushing for their full autonomy and self-determination. Her advocacy highlights the importance of empowering this community to live independently. Through her efforts, she aims to create a more inclusive society that values the voices of all individuals.",
    "published": "2025-11-16T00:35:05Z"
  }
]