[
  {
    "title": "Australia news live: Optus CEO to speak to media about network outage; baby dies in horror crash on side of Queensland freeway",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/21/australia-news-live-anthony-albanese-donald-trump-new-york-sunday-ntwnfb",
    "image": "https://media.guim.co.uk/2a5c2347f73c4b19e0c95baad5148b8497b27ab7/768_0_5003_4003/500.jpg",
    "summary": "I'm unable to access live news updates. Please provide the specific news content you'd like summarized, and I'd be happy to help!",
    "published": "2025-09-21T03:14:55Z"
  },
  {
    "title": "Trump news at a glance: fears president will seize on Kirk’s murder for campaign of vengeance",
    "url": "https://www.theguardian.com/us-news/2025/sep/21/trump-administration-news-updates-today-latest",
    "image": "https://media.guim.co.uk/a282ada00eed6fdeebc20a385c17dc3c7dce6efc/9_0_4568_3654/500.jpg",
    "summary": "Critics are concerned that Donald Trump may exploit the memorial service for Charlie Kirk to promote a revenge campaign against the \"radical left.\" This has raised fears of politicizing collective grief during a sensitive time. The situation highlights ongoing tensions in US politics leading up to the 2026 elections.",
    "published": "2025-09-21T01:58:33Z"
  },
  {
    "title": "NT attorney general criticised after confirming family link to hit-and-run driver",
    "url": "https://www.theguardian.com/australia-news/2025/sep/21/northern-territory-attorney-general-confirms-hit-run-driver-family-link",
    "image": "https://media.guim.co.uk/a803460f65dd90e489a9f2ad86207db2f9ea77ac/1631_30_4251_3401/500.jpg",
    "summary": "Marie-Clare Boothby is under scrutiny following the disclosure of her familial connection to a man who received a non-custodial sentence for a crash that resulted in the death of an Aboriginal pedestrian. The revelation has sparked public outrage and prompted discussions about accountability and justice in such cases. Critics are calling for a review of the circumstances surrounding the sentencing.",
    "published": "2025-09-21T01:37:31Z"
  },
  {
    "title": "Ukraine war briefing: Shoot down trespassing Russian jets if necessary – Czech president",
    "url": "https://www.theguardian.com/world/2025/sep/21/ukraine-war-briefing-shoot-down-trespassing-russian-jets-if-necessary-czech-president",
    "image": "https://media.guim.co.uk/56e7f2e85f3897c9de23a07b56e7f3a46e9c4c84/836_0_4164_3333/500.jpg",
    "summary": "Britain's Typhoon warplanes are now participating in patrols over Poland as part of NATO's response to ongoing tensions in the region. Meanwhile, significant Russian oil facilities in the Samara region have been targeted amid the ongoing conflict. This marks day 1,306 of the hostilities.",
    "published": "2025-09-21T01:32:44Z"
  },
  {
    "title": "Knights in shining armour gallop into battle at Australia’s national jousting championship",
    "url": "https://www.theguardian.com/australia-news/2025/sep/21/australia-national-jousting-championship-knights-in-shining-armour-gallop-into-battle",
    "image": "https://media.guim.co.uk/2dfc125e455ae78a42e760e9acbd83c3cc99c842/805_187_3824_3061/500.jpg",
    "summary": "Competitors clash on horseback at Kryal Castle in regional Victoria, where mental challenges match the physical intensity of the event. The tournaments showcase the skills and tactics of both men and women in a unique setting. This blend of strategy and athleticism draws attention and participation from enthusiasts.",
    "published": "2025-09-21T00:00:27Z"
  }
]