[
  {
    "title": "Barcelona v PSG, Monaco v Manchester City and more: Champions League and Championship – live",
    "url": "https://www.theguardian.com/football/live/2025/oct/01/barcelona-v-psg-monaco-v-manchester-city-and-more-champions-league-and-championship-live",
    "image": "https://media.guim.co.uk/d9ccb4d24d466069ff4d8f978d1725156f3d5c7f/871_0_6280_5025/500.jpg",
    "summary": "Michael Butler provides live updates on Wednesday's Champions League and Championship football matches. Stay tuned for scores and key moments as the games unfold. Follow along for real-time action and insights.",
    "published": "2025-10-01T18:27:33Z"
  },
  {
    "title": "Union Saint-Gilloise v Newcastle: Champions League – live",
    "url": "https://www.theguardian.com/football/live/2025/oct/01/union-saint-gilloise-v-newcastle-champions-league-live",
    "image": "https://media.guim.co.uk/b8a63a6671e17f1487480fea7145df93d0d8d8e1/604_324_3064_2451/500.jpg",
    "summary": "Newcastle United, managed by Eddie Howe, is seeking their first points of the league season. A live report by Scott Murray will provide minute-by-minute updates on the match. Fans are eager to see if the team can turn their fortunes around.",
    "published": "2025-10-01T18:27:04Z"
  },
  {
    "title": "Jaguar Land Rover parts makers asked by banks to put up homes as loan security after hack",
    "url": "https://www.theguardian.com/business/2025/oct/01/jaguar-land-rover-suppliers-asked-to-put-up-homes-as-loan-security-after-hack",
    "image": "https://media.guim.co.uk/3a5b0333e3cdae13d1c7b449e722660775a06eea/460_0_4818_3856/500.jpg",
    "summary": "A lobby group is urging the government to take immediate action to support small suppliers facing potential collapse due to an ongoing shutdown. The organization highlights the critical situation that threatens the viability of these businesses. Without intervention, many small suppliers could cease operations.",
    "published": "2025-10-01T18:27:03Z"
  },
  {
    "title": "Arsenal v Olympiakos: Champions League – live",
    "url": "https://www.theguardian.com/football/live/2025/oct/01/arsenal-v-olympiakos-champions-league-live",
    "image": "https://media.guim.co.uk/e33f02e9ace5a3d6998edbe48ca28528a794239f/0_2383_4023_3219/500.jpg",
    "summary": "Mikel Arteta's team seeks to secure their second consecutive league win. John Brewin provides a minute-by-minute report on the match. Stay tuned for live updates and insights.",
    "published": "2025-10-01T18:26:55Z"
  },
  {
    "title": "US government shutdown live: White House says ‘layoffs are imminent’ as JD Vance uses false claims to blame Democrats for shutdown",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/01/us-government-shutdown-update-2025-shutting-funding-trump-democrats-republicans-live-updates-latest-news",
    "image": "https://media.guim.co.uk/c3c341192462c427995c443709fedd57ab223dd0/450_0_4655_3724/500.jpg",
    "summary": "The vice-president inaccurately asserts that Democrats aim to fund healthcare for undocumented immigrants. Meanwhile, the press secretary highlights that a potential government shutdown would impact federal workers. The statements reflect ongoing political tensions over funding and health care policies.",
    "published": "2025-10-01T18:25:37Z"
  }
]