[
  {
    "title": "Doha strikes on Hamas leaders were in response to Jerusalem shooting, says Netanyahu – Middle East crisis live",
    "url": "https://www.theguardian.com/world/live/2025/sep/09/israel-gaza-city-evacuation-order-idf-military-offensive-live-updates-middle-east-crisis-latest-news",
    "image": "https://media.guim.co.uk/194b78f6b7777ba65dde174e77716e009ae0bbba/117_0_1849_1479/500.jpg",
    "summary": "Israeli Prime Minister stated that targeting ceasefire negotiators from a militant group is “entirely justified.” This assertion suggests a strong stance against negotiations with the group. The remarks reflect the ongoing tensions and conflict dynamics in the region.",
    "published": "2025-09-09T15:36:05Z"
  },
  {
    "title": "Maga loyalists claim Trump note to Epstein is ‘fake’ after House committee releases images of ‘birthday book’ – live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/09/donald-trump-jeffrey-epstein-birthday-note-letter-latest-live-us-politics-news",
    "image": "https://media.guim.co.uk/b0e5d7e8b7aa33fd498746bbd3662c425557d965/603_29_1913_1531/500.jpg",
    "summary": "Some allies of Donald Trump are defending him against claims that he wrote a note to Jeffrey Epstein for his 50th birthday. They argue that the allegations are misleading and misrepresent the nature of their interactions. The controversy raises questions about Trump's past associations and relationships.",
    "published": "2025-09-09T15:32:25Z"
  },
  {
    "title": "Somerset v Yorkshire, Leicestershire v Gloucestershire and more: county cricket, day two – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/09/somerset-v-yorkshire-leicestershire-v-gloucestershire-and-more-county-cricket-day-two-live",
    "image": "https://media.guim.co.uk/acb6a829fb2bdc9c6cb8e49db1038ba82c946d16/508_0_4005_3207/500.jpg",
    "summary": "Tanya Aldred provides live updates from county grounds on the second day of the latest fixtures. Stay tuned for key moments and developments in the matches. Follow along for comprehensive coverage of the action.",
    "published": "2025-09-09T15:29:19Z"
  },
  {
    "title": "Building good relationships is paramount in social work | Letters",
    "url": "https://www.theguardian.com/education/2025/sep/09/building-good-relationships-is-paramount-in-social-work",
    "image": "https://media.guim.co.uk/f95a1fdb207138fe7286ecd5573278f4208f87b7/22_0_5600_4480/500.jpg",
    "summary": "Sarah Owen and Marie Buss emphasize the importance of establishing consistent relationships with practitioners who possess the necessary time, skills, and tools. They advocate for a supportive environment where practitioners can listen, encourage, and challenge individuals effectively. This approach aims to improve overall well-being and engagement in various contexts.",
    "published": "2025-09-09T15:28:06Z"
  },
  {
    "title": "Spanish PM Pedro Sánchez is right about immigration | Letters",
    "url": "https://www.theguardian.com/world/2025/sep/09/spanish-pm-pedro-sanchez-is-right-about-immigration",
    "image": "https://media.guim.co.uk/dc04dda7c4434c545e6bdb5972b72f68b7954ea2/162_0_1668_1334/500.jpg",
    "summary": "In a letter, Simon Bird highlights the Spanish leader's positive stance on the benefits of migrants, which sharply contrasts with the perspectives of other European leaders, including Keir Starmer. This divergence in views underscores differing approaches to immigration within Europe. Bird emphasizes the need for a more inclusive perspective on migration.",
    "published": "2025-09-09T15:27:25Z"
  }
]