[
  {
    "title": "Australia politics live: home affairs secretary reveals citizenship processed for two detainees returned from Syria",
    "url": "https://www.theguardian.com/australia-news/live/2025/oct/08/australia-politics-live-gaza-rally-parliament-anthony-albanese-sussan-ley-question-time-andrew-hastie-ntwnfb",
    "image": "https://media.guim.co.uk/b84fb495fa4386b95581364a636517f1ef4f09db/0_0_5000_4000/500.jpg",
    "summary": "Please provide the news article or the main points you'd like summarized, and I'll be happy to assist!",
    "published": "2025-10-08T04:22:04Z"
  },
  {
    "title": "Unity is desperately needed, but the EU prefers turf wars to facing down Russia | Paul Taylor",
    "url": "https://www.theguardian.com/commentisfree/2025/oct/08/eu-copenhagen-summit-defence-policy-ukraine-russia",
    "image": "https://media.guim.co.uk/b898411d0bbd86a165bc9329667ea6e0a456efa9/1013_344_5889_4711/500.jpg",
    "summary": "Paul Taylor of the European Policy Centre warns that disagreements over a common defense strategy could empower Vladimir Putin. He emphasizes the urgent need for unity among European nations. Failure to cooperate may undermine security in the region.",
    "published": "2025-10-08T04:00:16Z"
  },
  {
    "title": "Scientists develop first ‘accurate blood test’ to detect chronic fatigue syndrome",
    "url": "https://www.theguardian.com/society/2025/oct/08/scientists-say-they-have-first-blood-test-to-diagnose-chronic-fatigue-syndrome-me",
    "image": "https://media.guim.co.uk/aeace8771132ed7d06c2508e59021fe37722f5fb/0_0_5156_4125/500.jpg",
    "summary": "Recent research suggests potential new treatments for myalgic encephalomyelitis (ME) patients, raising hopes for improved care. However, some experts caution that further studies are necessary to validate these findings and ensure their effectiveness. As the scientific understanding evolves, caution is advised before drawing definitive conclusions.",
    "published": "2025-10-08T04:00:16Z"
  },
  {
    "title": "‘Stay true to yourself – and fly closer to the sun’: what I’ve learned from 50 years of rejection",
    "url": "https://www.theguardian.com/lifeandstyle/2025/oct/08/stay-true-to-yourself-fly-closer-sun-what-ive-learned-from-50-years-of-rejection",
    "image": "https://media.guim.co.uk/02e891ba039056bb4c524f4eccbad10a1f88f2f0/0_0_6903_5521/500.jpg",
    "summary": "The author reflects on their extensive experience with rejection as a writer, initially feeling shock and anger before coming to accept it. They suggest that acceptance of rejection can lead to personal growth and resilience. The piece encourages others to embrace rejection as a valuable learning experience.",
    "published": "2025-10-08T04:00:16Z"
  },
  {
    "title": "‘I have searched and searched for help’: the Sudanese women left alone to live hand to mouth in Chad’s desert camps",
    "url": "https://www.theguardian.com/global-development/2025/oct/08/aid-cuts-sudanese-refugees-chad-malnutrition-healthcare",
    "image": "https://media.guim.co.uk/b2f48d012f2ec729b99a7218e54be65e4c7d0092/911_0_5000_4000/500.jpg",
    "summary": "The ongoing war in Sudan is causing an influx of refugees into Chad, particularly affecting remote settlements. As a result, malnutrition rates are increasing, with 86% of the refugees being women and children. Humanitarian efforts are urgently needed to address these growing challenges.",
    "published": "2025-10-08T04:00:15Z"
  }
]