[
  {
    "title": "Australia news live: Optus fined $100m for ‘predatory’ sales practices; SA algal bloom could contain species unknown to scientists",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/24/australia-news-live-anthony-albanese-new-york-united-nations-donald-trump-climate-crisis-palestine-israel-gaza-ntwnfb",
    "image": "https://media.guim.co.uk/97d790cef9d6a611122274759e84825d3c5203ad/559_0_5600_4480/500.jpg",
    "summary": "I'm sorry, but I need more context or details about the specific news article you're referring to in order to provide an accurate summary. Please provide more information or the main points of the news article.",
    "published": "2025-09-24T05:22:19Z"
  },
  {
    "title": "TV tonight: the phone-hacking scandal gets the Mr Bates treatment",
    "url": "https://www.theguardian.com/tv-and-radio/2025/sep/24/tv-tonight-the-phone-hacking-scandal-gets-the-mr-bates-treatment",
    "image": "https://media.guim.co.uk/c2820030b6b21c785bb13be3da39fb1c61d470ea/578_0_4614_3690/500.jpg",
    "summary": "Jack Thorne adapts the Guardian's 2011 investigation exposing illegal practices at the News of the World. The evening also features a spotlight on the intriguing figure known as the Ibiza Final Boss. Tune in for these compelling stories.",
    "published": "2025-09-24T05:20:15Z"
  },
  {
    "title": "‘It changed my view’: the letter campaign urging pupils in deprived areas to try university",
    "url": "https://www.theguardian.com/education/2025/sep/24/it-changed-my-view-the-letter-campaign-urging-pupils-in-deprived-areas-to-try-university",
    "image": "https://media.guim.co.uk/8994a7785cdabf36cb5900c630dd0684a69b8457/805_0_7200_5760/500.jpg",
    "summary": "Personalized notes from students with similar backgrounds aim to enhance the sense of accessibility in higher education. These messages are intended to resonate with prospective students, fostering a supportive community. The initiative seeks to encourage more individuals from diverse backgrounds to pursue higher education.",
    "published": "2025-09-24T05:00:18Z"
  },
  {
    "title": "Change prostate cancer treatment for black men to avoid ‘epidemic’, NHS urged",
    "url": "https://www.theguardian.com/society/2025/sep/24/change-prostate-cancer-treatment-black-men-avoid-epidemic-nhs-urged",
    "image": "https://media.guim.co.uk/2a7c40c2eb92936a956ae604f66adaf105d19020/390_0_7240_5792/500.jpg",
    "summary": "Campaigners are highlighting the alarming statistic that black men are diagnosed with a specific disease at twice the rate of white men. They aim to raise awareness about this disparity and its implications on health equity. The initiative seeks to educate the public and encourage proactive health measures within affected communities.",
    "published": "2025-09-24T05:00:18Z"
  },
  {
    "title": "Resisting Faragism offers the Lib Dems a rare clarity of purpose | Rafael Behr",
    "url": "https://www.theguardian.com/commentisfree/2025/sep/24/resisting-farage-lib-dems-ed-davey",
    "image": "https://media.guim.co.uk/1f5592f32e275f53eff28facf024352cc30918cd/173_0_3429_2742/500.jpg",
    "summary": "Ed Davey's call to defend moderate, liberal values in Britain aims to unify a party often viewed as opportunistic. According to Guardian columnist Rafael Behr, this rallying cry may provide much-needed coherence to the party's identity. By emphasizing these principles, Davey seeks to strengthen the party's position in the political landscape.",
    "published": "2025-09-24T05:00:17Z"
  }
]