[
  {
    "title": "Crystal Palace v Brighton, Brentford v Newcastle and more: Premier League clockwatch – live",
    "url": "https://www.theguardian.com/football/live/2025/nov/09/crystal-palace-v-brighton-brentford-v-newcastle-and-more-premier-league-clockwatch-live",
    "image": "https://media.guim.co.uk/557c970d38c9e20918486d2124d89aba034de3b4/96_0_1694_1355/500.jpg",
    "summary": "Upcoming matches feature key clashes at Selhurst Park, where rivals face off, while Leeds take on Nottingham Forest and Aston Villa hosts Bournemouth. Fans can follow the latest updates from these thrilling encounters. Stay tuned for all the action!",
    "published": "2025-11-09T14:14:58Z"
  },
  {
    "title": "ATP Finals tennis: Carlos Alcaraz v Alex de Minaur – live",
    "url": "https://www.theguardian.com/sport/live/2025/nov/09/atp-finals-tennis-carlos-alcaraz-alex-de-minaur-live",
    "image": "https://media.guim.co.uk/b4b7b12d9f6bb27d7b7390c84750099a6427d027/573_0_3424_2739/500.jpg",
    "summary": "The season-ending tournament kicks off in Turin with world No. 2 facing Australia's Alex de Minaur. Daniel Harris will provide updates on the match.",
    "published": "2025-11-09T14:13:02Z"
  },
  {
    "title": "WSL drama, Guéhi an England injury doubt, plus Premier League buildup – as it happened",
    "url": "https://www.theguardian.com/football/live/2025/nov/09/liverpool-travel-to-manchester-city-premier-league-buildup-and-more-matchday-live",
    "image": "https://media.guim.co.uk/bb6279c22a0c80af13985b401566ab9053ec80ac/1215_0_6075_4860/500.jpg",
    "summary": "In the WSL, Liverpool and West Ham faced unfortunate stoppage-time losses during Matchday live. Additionally, there are updates regarding Marc Guéhi's injury status. The matches highlighted the intense competition and hard-fought battles in the league.",
    "published": "2025-11-09T14:08:10Z"
  },
  {
    "title": "Why is the BBC expected to apologise over a Donald Trump speech edit?",
    "url": "https://www.theguardian.com/media/2025/nov/09/why-is-the-bbc-expected-to-apologise-over-a-donald-trump-speech-edit",
    "image": "https://media.guim.co.uk/966c33ed7d00eac938541b54bb2f30f7c025fd8e/902_0_4560_3648/500.jpg",
    "summary": "Boris Johnson and the White House have criticized the BBC, claiming bias in its reporting. Some journalists argue that this criticism is part of a broader effort to undermine the corporation's credibility. The situation highlights ongoing tensions between the government, media, and public trust.",
    "published": "2025-11-09T14:07:02Z"
  },
  {
    "title": "Why do we feel nostalgia?",
    "url": "https://www.theguardian.com/lifeandstyle/2025/nov/09/why-do-we-feel-nostalgia",
    "image": "https://media.guim.co.uk/debd7b5046bac70ef34449a58fc6c725cf1f2ffd/1708_750_3930_3144/500.jpg",
    "summary": "The article discusses a popular series where readers respond to questions posed by other readers, covering a wide range of topics from lighthearted curiosities to deep scientific and philosophical inquiries. This ongoing dialogue fosters community engagement and knowledge sharing. The series highlights the diverse interests and insights of its participants.",
    "published": "2025-11-09T14:01:33Z"
  }
]