[
  {
    "title": "Rangers v Celtic: Scottish Premiership updates – live",
    "url": "https://www.theguardian.com/football/live/2025/aug/31/rangers-v-celtic-scottish-premiership-updates-live",
    "image": "https://media.guim.co.uk/60bb6c941babb62e5885c082a7ff09662f39efb7/273_0_5000_4000/500.jpg",
    "summary": "Daniel Harris will provide live minute-by-minute updates for the highly anticipated Old Firm match between Rangers and Celtic at Ibrox. Fans can expect detailed coverage of the key moments and events throughout the game. Don't miss this exciting rivalry as the teams clash for the first time this season.",
    "published": "2025-08-31T11:22:25Z"
  },
  {
    "title": "Nicolas Jackson defies Chelsea’s orders to return in attempt to revive Bayern move",
    "url": "https://www.theguardian.com/football/2025/aug/31/nicolas-jackson-chelsea-orders-bayern-munich-transfer-window",
    "image": "https://media.guim.co.uk/2c040e827e9fbe19c78fe26b7998a0abce165ba9/246_517_6550_5240/500.jpg",
    "summary": "Nicolas Jackson is staying in Germany to pursue a potential transfer to Bayern Munich. Chelsea has requested that he return to London instead. Jackson is focused on reviving his move to the Bundesliga club.",
    "published": "2025-08-31T11:18:46Z"
  },
  {
    "title": "Israeli airstrikes and gunfire kill 18 in and around Gaza City, Gaza officials say",
    "url": "https://www.theguardian.com/world/2025/aug/31/israeli-airstrikes-gunfire-gaza-city",
    "image": "https://media.guim.co.uk/f0d059e7d5306df2fde10a2bf5f1c039498df5ab/720_0_7200_5760/500.jpg",
    "summary": "Thirteen individuals were killed while attempting to secure food near a distribution point amid ongoing conflict. The Israeli cabinet is set to convene to deliberate on the next phases of the military offensive. The situation continues to escalate, leaving many in desperate need of aid.",
    "published": "2025-08-31T11:14:05Z"
  },
  {
    "title": "Broken English review – Marianne Faithfull’s last glow, as she recounts past lives",
    "url": "https://www.theguardian.com/film/2025/aug/31/broken-english-review-marianne-faithfull",
    "image": "https://media.guim.co.uk/e7edcb18143497970bb76e269fae1315dbf72ce6/527_0_5248_4201/500.jpg",
    "summary": "In an intriguing interview, Tilda Swinton leads a fictional ministry that questions the multifaceted career of the captivating Marianne Faithfull. The discussion spans Faithfull's transformation from a 1960s It girl to a prominent figure in the art scene. This unique dialogue highlights her enduring influence and artistic evolution.",
    "published": "2025-08-31T11:10:43Z"
  },
  {
    "title": "British baby dies from whooping cough as vaccination rates fall",
    "url": "https://www.theguardian.com/society/2025/aug/31/british-baby-dies-from-whooping-cough-as-vaccination-rates-fall",
    "image": "https://media.guim.co.uk/ec126c1ea0e0e77d16f37276000f3ee97eae5125/186_0_1729_1383/500.jpg",
    "summary": "An infant developed a serious illness caused by a highly infectious respiratory disease. The baby's mother was unvaccinated, increasing the risk of transmission. Health officials highlight the importance of vaccination to protect both mothers and infants from such diseases.",
    "published": "2025-08-31T11:01:27Z"
  }
]