[
  {
    "title": "Australia news live: PM lands in US for Trump meeting; NSW police warn of counterfeit cash and tell businesses to ‘feel the note’",
    "url": "https://www.theguardian.com/australia-news/live/2025/oct/20/australia-news-live-space-debris-wa-albanese-trump-meeting-labor-supermarkets-price-gouging-barnaby-joyce-nationals-coalition-sussan-ley-net-zero-ntwnfb",
    "image": "https://media.guim.co.uk/d24115b2055d79e12a4924905656c2c2938c7696/878_387_6209_4970/500.jpg",
    "summary": "Please provide the specific news content you'd like summarized, and I'll be happy to help!",
    "published": "2025-10-20T03:07:36Z"
  },
  {
    "title": "Trump news at a glance: ‘Illegal drug leader’ – threat of new tariffs against Colombia",
    "url": "https://www.theguardian.com/us-news/2025/oct/20/trump-briefing-news-at-a-glance-latest",
    "image": "https://media.guim.co.uk/87a1b8524c28f098096da2c0e81b87aa4e7e4d07/96_67_4499_3600/500.jpg",
    "summary": "Trump announced plans for Washington to cut aid to Colombia amid ongoing U.S. military operations against suspected drug smuggling. This decision comes as tensions escalate regarding drug trafficking in the region. The announcement highlights ongoing U.S. involvement in combating drug-related issues while reshaping foreign aid policies.",
    "published": "2025-10-20T02:26:20Z"
  },
  {
    "title": "East coast to sizzle after record October temperatures in Australia’s west",
    "url": "https://www.theguardian.com/environment/2025/oct/20/east-coast-weather-high-temperatures-after-record-breaking-heat-west",
    "image": "https://media.guim.co.uk/102452ef4454c12c274affcbccc13af5393606b4/899_0_4497_3598/500.jpg",
    "summary": "Australia's eastern states are expected to experience temperatures soaring up to 18°C above average this coming week, according to the Bureau of Meteorology (BoM). This significant heatwave will impact multiple locations across the region. Residents are advised to take precautions to stay safe in the extreme weather conditions.",
    "published": "2025-10-20T02:19:01Z"
  },
  {
    "title": "Ukraine war briefing: Energy war continues with strikes on Russian oil and gas plants",
    "url": "https://www.theguardian.com/world/2025/oct/20/ukraine-war-briefing-energy-war-continues-with-strikes-on-russian-oil-and-gas-plants",
    "image": "https://media.guim.co.uk/a88d4f464c1eda9dcbe767e3a8dc8b771764f344/0_0_3960_3168/500.jpg",
    "summary": "Russian attacks targeted a coal mine in the Dnipropetrovsk region and disrupted the power grid in Chernihiv. Meanwhile, former President Trump has returned to a stance of accommodating Vladimir Putin. This marks day 1,335 of the ongoing conflict.",
    "published": "2025-10-20T01:32:13Z"
  },
  {
    "title": "Rodrigo Paz Pereira wins Bolivia’s presidential runoff marking a new shift to the right",
    "url": "https://www.theguardian.com/world/2025/oct/20/rodrigo-paz-pereira-bolivia-wins-presidential-runoff-electiion-right-wing",
    "image": "https://media.guim.co.uk/2458e222dcae0cf77e615430212c8da27502ef6f/187_0_5465_4372/500.jpg",
    "summary": "Sunday's election was historic as it featured no candidates from Evo Morales' Mas party since 2005. This shift indicates a significant change in Bolivia's political landscape. The absence of Mas candidates reflects evolving dynamics within the country's electoral scene.",
    "published": "2025-10-20T01:06:50Z"
  }
]