[
  {
    "title": "Little Problems – a cute detective game with no violence or victims",
    "url": "https://www.theguardian.com/games/2025/sep/02/little-problems-a-cute-detective-game-with-no-violence-or-victims",
    "image": "https://media.guim.co.uk/a49f520053a68cac53d5eb247f070df78108461f/719_189_2384_1907/500.jpg",
    "summary": "Shanghai's Posh Cat Studio has launched a new cozy crime game that emphasizes the enjoyable experience of unraveling life's little mysteries. The game combines charming gameplay with intriguing puzzles. Players can immerse themselves in a satisfying and light-hearted detective adventure.",
    "published": "2025-09-02T08:45:45Z"
  },
  {
    "title": "Cooper rejects claims Reeves has been sidelined on economic policy by No 10 mini-reshuffle – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/02/cooper-reeves-starmer-green-party-leader-badenoch-devolution-latest-updates",
    "image": "https://media.guim.co.uk/5ee7256b881b9e516f6ac328c32ed62776c9d4ed/1068_382_5441_4353/500.jpg",
    "summary": "Home Secretary has responded to reports suggesting that Keir Starmer's reorganization is intended to exclude the Chancellor from the budget planning. She emphasized that the situation is \"quite the reverse.\" This exchange highlights tensions within the political landscape as the autumn budget approaches.",
    "published": "2025-09-02T08:44:32Z"
  },
  {
    "title": "UK long-term borrowing costs reach 27-year high in pre-budget blow for Labour – business live",
    "url": "https://www.theguardian.com/business/live/2025/sep/02/uk-long-term-borrowing-costs-27-year-high-gold-silver-inflation-business-live-news-updates",
    "image": "https://media.guim.co.uk/e33d07dd27d69afd62d493dfc3b45e781ee7d390/582_0_5839_4672/500.jpg",
    "summary": "The latest economic and financial news highlights ongoing developments in global markets, with analysts closely monitoring trends and indicators. Key topics include inflation rates, interest rate changes, and stock market fluctuations. Investors are adjusting strategies in response to economic forecasts and geopolitical events.",
    "published": "2025-09-02T08:40:11Z"
  },
  {
    "title": "Belgium to recognise Palestinian state at UN and sanction Israel – Middle East crisis live",
    "url": "https://www.theguardian.com/world/live/2025/sep/02/middle-east-crisis-israel-gaza-palestine-un-belgium-live-news-updates",
    "image": "https://media.guim.co.uk/6e91d70261e19e5f28df210b67e6d327ed450be9/192_0_1666_1333/500.jpg",
    "summary": "A foreign minister stated that their recent actions are not directed against the Israeli people. Instead, the objective is to ensure that the Israeli government adheres to international and humanitarian law. The statement emphasizes a focus on governmental accountability rather than targeting civilians.",
    "published": "2025-09-02T08:37:04Z"
  },
  {
    "title": "Football transfer rumours: What now for Gomez, Guéhi, Martínez and Sterling?",
    "url": "https://www.theguardian.com/football/2025/sep/02/transfer-rumours-martinez-gomez-guehi-sterling-deadline-day",
    "image": "https://media.guim.co.uk/4466c96e36f4a0bb58edf425258f45294b8a2739/391_346_2502_2002/500.jpg",
    "summary": "Axel Disasi remains with Chelsea, while Manchester United is pursuing Conor Gallagher. Tyrell Malacia will not be moving, and Osula is set to stay at Newcastle.",
    "published": "2025-09-02T08:29:16Z"
  }
]