[
  {
    "title": "Pro-Palestine marches have become ‘carnivals of hatred’, Badenoch tells Tory conference – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/oct/05/conservative-tory-conference-kemi-badenoch-echr-immigration-uk-politics-live-news-updates",
    "image": "https://media.guim.co.uk/e3cd560e9fc1b080fc7b5ccf1008ca80a3d75b49/549_0_5000_4000/500.jpg",
    "summary": "A political party leader has criticized the UK government for failing to address rising extremism, claiming that it has been allowed to proliferate without sufficient intervention. The leader emphasizes the need for urgent action to combat this issue and ensure public safety. Their comments come amid growing concerns about the impact of extremism on society.",
    "published": "2025-10-05T16:20:07Z"
  },
  {
    "title": "Brentford v Manchester City: Premier League – live",
    "url": "https://www.theguardian.com/football/live/2025/oct/05/brentford-v-manchester-city-premier-league-live",
    "image": "https://media.guim.co.uk/0df7ab93be51f0d047c621adee01a539b903d233/522_422_4472_3578/500.jpg",
    "summary": "In a live report, Xaymaca Awoyungbo covers the match where Brentford takes on Manchester City, seeking to exploit a challenging week for Pep Guardiola's team following their recent defeat in Monaco. The focus is on whether the Bees can capitalize on City’s struggles. Fans eagerly await the outcome of this encounter.",
    "published": "2025-10-05T16:16:17Z"
  },
  {
    "title": "Gaza ceasefire talks live: Trump warns Hamas faces ‘complete obliteration’ if it refuses to cede power",
    "url": "https://www.theguardian.com/world/live/2025/oct/05/gaza-ceasefire-israel-palestine-hamas-trump-cairo-negotiations-middle-east-crisis-live-news-updates",
    "image": "https://media.guim.co.uk/547b7a5cc18105a953b48919cda03551a19b5e0f/886_0_4554_3642/500.jpg",
    "summary": "Negotiators are set to travel to Egypt following Hamas's agreement to aspects of Trump's plan for Gaza. This development marks a significant shift in dialogue regarding the region's future. The implications of this agreement could reshape the political landscape and humanitarian efforts in Gaza.",
    "published": "2025-10-05T16:15:23Z"
  },
  {
    "title": "Patrick Murray obituary",
    "url": "https://www.theguardian.com/tv-and-radio/2025/oct/05/patrick-murray-obituary",
    "image": "https://media.guim.co.uk/6766ca95800c7373abc49e4db98d0744aa9fd87e/619_0_4221_3377/500.jpg",
    "summary": "Actor who portrayed Mickey Pearce, the stylish spiv from the classic sitcom \"Only Fools and Horses,\" has passed away. His character brought humor and memorable moments to the beloved series. Fans and colleagues remember him fondly for his iconic role in British television.",
    "published": "2025-10-05T16:15:13Z"
  },
  {
    "title": "The next archbishop of Canterbury has no time to waste in making change – this is what she will be up against | Martine Oborne",
    "url": "https://www.theguardian.com/commentisfree/2025/oct/05/archbishop-of-canterbury-sarah-mullally-change",
    "image": "https://media.guim.co.uk/c6c5776b99f1adf59579e82a376194b99c34fe42/465_0_3425_2739/500.jpg",
    "summary": "Vicar Martine Oborne praises Sarah Mullally for her wisdom, intelligence, courage, and compassion. These qualities will be valuable as she faces future challenges. Her character is highlighted as a strong asset in upcoming battles.",
    "published": "2025-10-05T16:15:11Z"
  }
]