[
  {
    "title": "Police and protesters both claim they were ‘set upon’ as pepper spray deployed outside Sydney weapons expo",
    "url": "https://www.theguardian.com/world/2025/nov/04/ten-arrested-as-police-pepper-spray-protesters-who-tried-to-blockade-sydney-weapons-expo",
    "image": "https://media.guim.co.uk/8ffb4365285bd0dc5437c56167a351b0640ffe5e/751_0_5000_4000/500.jpg",
    "summary": "Thirteen people were arrested during a demonstration where both police and protesters sustained injuries. The clash occurred amid heightened tensions surrounding the event. Authorities are investigating the situation to determine the circumstances leading to the violence.",
    "published": "2025-11-04T07:07:12Z"
  },
  {
    "title": "Third of British farmers made no profit in past year, report finds",
    "url": "https://www.theguardian.com/environment/2025/nov/04/third-of-british-farmers-made-no-profit-in-past-year-report-finds",
    "image": "https://media.guim.co.uk/00bd2d573b6095b1bad6acb0b7ed2bb87632663a/1178_0_6139_4912/500.jpg",
    "summary": "A recent Farmdex report reveals that only 14% of surveyed farmers are achieving profit margins of 10% or more. This decline in profitability is attributed to reduced subsidies following Brexit. Farmers are facing significant financial challenges as a result.",
    "published": "2025-11-04T07:00:23Z"
  },
  {
    "title": "Apple Watch SE 3 review: the bargain smartwatch for iPhone",
    "url": "https://www.theguardian.com/technology/2025/nov/04/apple-watch-se-3-review-bargain-smartwatch-iphone-screen-watchos-26",
    "image": "https://media.guim.co.uk/c2763543529d454bf6d9bac6352789e1d20b7fe3/1153_477_4760_3808/500.jpg",
    "summary": "The new budget watch features many highlights of the Series 11, such as an always-on display and updated watchOS 26. It also includes the convenient wrist-flick gesture for easy access. This makes it an appealing option for those seeking affordability without compromising key functions.",
    "published": "2025-11-04T07:00:22Z"
  },
  {
    "title": "‘Beating, torturing, killing’: freed Palestinian author on life in Israeli jails",
    "url": "https://www.theguardian.com/world/2025/nov/04/freed-palestinian-author-nasser-abu-srour-israel-prisons-gaza-war",
    "image": "https://media.guim.co.uk/2af728c10d4e4f22c9180ef120adfe12fcc2cf3d/552_0_2666_2133/500.jpg",
    "summary": "Nasser Abu Srour reports that the outbreak of war in Gaza following October 7, 2023, has transformed prisons into another battleground. The situation highlights the escalating tensions and conflicts spilling over into correctional facilities. This development raises concerns about the safety and conditions within the prison system amid ongoing violence.",
    "published": "2025-11-04T07:00:22Z"
  },
  {
    "title": "Fantaisie review – study of a modern Ophelia swamped by audiovisual overwhelm",
    "url": "https://www.theguardian.com/film/2025/nov/04/fantaisie-review-study-of-a-modern-ophelia-swamped-by-audiovisual-overwhelm",
    "image": "https://media.guim.co.uk/c5cc4aeef614a8d24fec8cd8cb57e9938d928aed/681_0_2587_2070/500.jpg",
    "summary": "Isabel Pagliai’s film presents its main character, Louise, using a dynamic mix of handheld footage and a striking array of still images. This innovative approach creates an engaging visual narrative. The blend enhances the storytelling experience, drawing viewers into Louise's world.",
    "published": "2025-11-04T07:00:22Z"
  }
]