[
  {
    "title": "UK factories return to growth with JLR restarting operations after cyber-attack – business live",
    "url": "https://www.theguardian.com/business/live/2025/nov/03/oil-price-rises-opec-pauses-oil-output-hikes-uk-manufacturing-stock-market-business-live-news",
    "image": "https://media.guim.co.uk/f71e596f1a990d1231e092505da87b21d17be572/326_0_6572_5258/500.jpg",
    "summary": "OPEC+ has decided to pause any increases in oil production beyond December due to concerns over a potential surplus in crude oil. This decision reflects the organization's efforts to stabilize the market amidst fluctuating demand. The situation continues to be monitored closely as economic indicators evolve.",
    "published": "2025-11-03T13:23:41Z"
  },
  {
    "title": "US government shutdown nearing record for longest in history as Trump delays food benefits to millions – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/nov/03/us-government-shutdown-donald-trump-latest-politics-news",
    "image": "https://media.guim.co.uk/b4b84f22380a10ccc00539f03de99303b099a38c/17_0_5000_4000/500.jpg",
    "summary": "Republicans assert that President Biden is eager to resolve the ongoing government shutdown, which has now reached its 33rd day. The impasse continues to impact federal operations and services. Tensions remain high as negotiations between parties persist.",
    "published": "2025-11-03T13:22:18Z"
  },
  {
    "title": "Farage accused of betraying pensioners but praised for ‘fiscal discipline’ after triple lock hint – politics live",
    "url": "https://www.theguardian.com/politics/live/2025/nov/03/nigel-farage-reform-speech-labour-conservatives-politics-live-latest-updates",
    "image": "https://media.guim.co.uk/87242bb4df31cdef46cbce71b10ac05b15972b5a/1337_1301_3038_2430/500.jpg",
    "summary": "The leader of the reform movement has declined to ensure the continuation of a mechanism that guarantees pension increases. This uncertainty raises concerns among pensioners about future benefits. The stance highlights potential tensions between reform goals and maintaining financial security for retirees.",
    "published": "2025-11-03T13:11:15Z"
  },
  {
    "title": "Man appears in court after mass stabbing on train in Cambridgeshire",
    "url": "https://www.theguardian.com/uk-news/2025/nov/03/man-charged-after-mass-stabbing-on-cambridgeshire-train",
    "image": "https://media.guim.co.uk/69b55ab446dd61d4fa0341b2c98fc2c4567eb77f/898_0_5000_4000/500.jpg",
    "summary": "A suspect has been charged with attempted murder following two separate attacks: one on a train traveling from Doncaster to London and another at a Docklands Light Railway (DLR) station. The incidents raised safety concerns among commuters. Authorities are continuing their investigation into the attacks.",
    "published": "2025-11-03T13:10:41Z"
  },
  {
    "title": "First Thing: Top 10 US billionaires’ wealth grew by $698bn in past year",
    "url": "https://www.theguardian.com/us-news/2025/nov/03/first-thing-top-10-us-billionaires-wealth-grew-by-698bn-in-past-year",
    "image": "https://media.guim.co.uk/a99ef2fc663b75aec51490bafc87d1ea69e65fa1/593_0_5925_4740/500.jpg",
    "summary": "Oxfam warns that Trump's policies could further increase inequality, while also highlighting that Democrats have contributed to the widening wealth gap. In related news, Salman Rushdie's therapist praised him as a \"badass\" for his resilience. The commentary underscores ongoing debates about wealth distribution and personal strength.",
    "published": "2025-11-03T13:08:15Z"
  }
]