[
  {
    "title": "Mushroom murderer Erin Patterson sentenced; fugitive father shot dead by NZ police; and pictures of the blood moon",
    "url": "https://www.theguardian.com/australia-news/2025/sep/08/afternoon-update-monday-ntwnfb",
    "image": "https://media.guim.co.uk/da758e11a47cc517892b2333057b402304dc9d05/390_0_2500_2000/500.jpg",
    "summary": "Patterson has been sentenced to life imprisonment with a non-parole period of 33 years for the murder of three individuals and the attempted murder of a fourth. The court found him guilty of these serious offenses. The sentencing reflects the severity of his crimes.",
    "published": "2025-09-08T06:50:01Z"
  },
  {
    "title": "US tariff tensions hit Chinese export growth, slowest in six months; oil prices climb – business live",
    "url": "https://www.theguardian.com/business/live/2025/sep/08/chinese-export-growth-slowest-six-months-shipments-us-fall-amid-tariff-tensions-oil-prices-climb-business-live",
    "image": "https://media.guim.co.uk/469a3d2eb0eef550c49aee411d39cca03c22e67e/281_0_2813_2250/500.jpg",
    "summary": "In August, China's exports to the U.S. declined by 33%, reflecting ongoing trade tensions and economic challenges. Meanwhile, Germany experienced an unexpected drop in exports in July, highlighting concerns over its economic performance. Both situations underscore the fragility of global trade dynamics.",
    "published": "2025-09-08T06:48:27Z"
  },
  {
    "title": "‘Only you know why’: how mushroom murderer Erin Patterson faced her sentencing",
    "url": "https://www.theguardian.com/australia-news/2025/sep/08/how-mushroom-murderer-erin-patterson-faced-her-sentencing",
    "image": "https://media.guim.co.uk/da758e11a47cc517892b2333057b402304dc9d05/390_0_2500_2000/500.jpg",
    "summary": "Patterson received a life sentence with a 33-year non-parole period for his crime. The focus now turns to understanding his motive. The case continues to attract attention as the motivations behind his actions are still unclear.",
    "published": "2025-09-08T06:47:38Z"
  },
  {
    "title": "Australia news live: Alex Hawke says speculation about his call to Jacinta Nampijinpa Price’s office ‘sounds like total gossip’",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/08/australia-news-live-erin-patterson-mushroom-murders-trial-sentencing-blood-moon-pictures-shark-net-beach-ntwnfb",
    "image": "https://media.guim.co.uk/9cb0382b5638df51cd92aa8b02aa45f254e95c4c/121_0_3352_2683/500.jpg",
    "summary": "I'm sorry, but it seems you haven't provided specific news content to summarize. If you could share the details or main points, I'd be happy to help create a summary!",
    "published": "2025-09-08T06:43:19Z"
  },
  {
    "title": "Call for ban on sexual relations between barristers and junior staff",
    "url": "https://www.theguardian.com/world/2025/sep/08/call-for-ban-on-sexual-relations-between-barristers-and-junior-staff",
    "image": "https://media.guim.co.uk/df77d5b025fd01d1509ac2740379adaef5173d28/683_0_6827_5464/500.jpg",
    "summary": "A report by Labour peer Harriet Harman highlights widespread systemic bullying within parliamentary chambers. The findings reveal an alarming culture of harassment and mistreatment among members. The report calls for urgent reforms to address these troubling issues and improve the working environment.",
    "published": "2025-09-08T06:21:50Z"
  }
]