[
  {
    "title": "Australia politics live: Labor targeted over CFMEU and surging house prices in question time as Joyce sits on Coalition benches",
    "url": "https://www.theguardian.com/australia-news/live/2025/oct/27/epbc-environment-laws-ai-copyright-lobbying-transparency-federal-parliament-anthony-albanese-asean-sussan-ley-murray-watt-ntwnfb",
    "image": "https://media.guim.co.uk/9b7eb0ec1cef1a0b013a27245c51a1b6f5c6a247/1132_0_5708_4569/500.jpg",
    "summary": "I'm sorry, but I am unable to access or follow live updates. However, if you provide specific content or details from the news article, I can help summarize it in three lines.",
    "published": "2025-10-27T04:27:28Z"
  },
  {
    "title": "Crunch time nears for Australia as selectors try to fit Ashes batting puzzle pieces together | Martin Pegan",
    "url": "https://www.theguardian.com/sport/2025/oct/27/cricket-australia-ashes-selector",
    "image": "https://media.guim.co.uk/197485f601678b8a751d95fe23f27ee1f694fd78/70_260_4745_3796/500.jpg",
    "summary": "Recent developments have created uncertainty regarding the selection of six batters for the host team's squad, just a month before the first Test. Various plot twists have emerged, complicating the decision-making process. The situation remains fluid as the team prepares for the upcoming match.",
    "published": "2025-10-27T04:14:39Z"
  },
  {
    "title": "Thousands without power in Queensland as Victoria experiences ‘terrifying’ winds after year’s wettest day",
    "url": "https://www.theguardian.com/australia-news/2025/oct/27/queensland-victoria-qld-brisbane-hail-storms-power-outages-wild-weather",
    "image": "https://media.guim.co.uk/3118ff55672725353bcb1ea7bf894de5ca7ada0d/180_0_1699_1360/500.jpg",
    "summary": "Severe winds caused downed power lines across greater Brisbane, with residents reporting significant disruptions. A Werribee resident described a terrifying experience where their partner was \"lifted and dropped\" by the strong gusts. Authorities are addressing the aftermath of the extreme weather conditions.",
    "published": "2025-10-27T03:50:16Z"
  },
  {
    "title": "Trump news at a glance: administration accused of attack on free speech after British journalist detained ",
    "url": "https://www.theguardian.com/us-news/2025/oct/27/trump-administration-news-updates-today-latest",
    "image": "https://media.guim.co.uk/ccb06ea6790f0d3653276ad452c15b6dd98715c4/617_0_4098_3280/500.jpg",
    "summary": "Homeland Security revoked Hamdi's visa, which has been perceived as retaliation for his criticism of Israel. The situation has drawn attention in the context of key U.S. political stories. This move raises concerns about free speech and political repercussions.",
    "published": "2025-10-27T03:00:22Z"
  },
  {
    "title": "Javier Milei hails ‘tipping point’ as his far-right party wins Argentina’s midterm elections",
    "url": "https://www.theguardian.com/world/2025/oct/27/javier-milei-president-far-right-party-wins-argentina-midterm-elections",
    "image": "https://media.guim.co.uk/e720fbcf4ff396097337ab573590ff0ccc79868f/0_0_3921_3137/500.jpg",
    "summary": "Javier Milei's party did not achieve a congressional majority in Argentina, falling short of expectations. However, the election outcome has been characterized as surprising by many analysts in the country. This result highlights a significant political shift in the Argentine landscape.",
    "published": "2025-10-27T02:21:17Z"
  }
]