[
  {
    "title": "Australia news live: Liberal party to head to trial over Pesutto loan; Nine lobbies Labor for compensation if gambling ads banned",
    "url": "https://www.theguardian.com/australia-news/live/2025/nov/07/australia-news-live-sussan-ley-coalition-liberals-nationals-leadership-senate-anthony-albanese-labor-net-zero-ntwnfb",
    "image": "https://media.guim.co.uk/11f7344884e99f0b8169e08bdbbce0fa0e74aa0a/1493_867_3487_2790/500.jpg",
    "summary": "Please provide the news article or details you'd like summarized, and I'll be happy to help!",
    "published": "2025-11-07T01:38:08Z"
  },
  {
    "title": "Trump administration ‘failed to consider the harms’ in not supporting Snap, judge says in ruling that demands funds by Friday – live",
    "url": "https://www.theguardian.com/us-news/live/2025/nov/06/donald-trump-government-shutdown-venezuela-senate-vote-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/4ec6b889773d1d5bcb5c8deadafe905a500e4189/217_0_3333_2667/500.jpg",
    "summary": "A federal judge in Rhode Island has mandated that the Trump administration disburse the complete November Snap food aid benefits to states within 24 hours. This ruling comes as part of ongoing legal actions regarding food assistance. The decision emphasizes the urgency of providing support to those in need.",
    "published": "2025-11-07T01:24:07Z"
  },
  {
    "title": "US airlines cancel flights after aviation agency directive to cut air traffic",
    "url": "https://www.theguardian.com/world/2025/nov/06/us-40-airports-traffic-reduced",
    "image": "https://media.guim.co.uk/bbbd9683d23624d486d4a2143b34bd2d864d4c6a/725_0_5960_4768/500.jpg",
    "summary": "United, Southwest, and Delta airlines are cutting flight schedules due to the ongoing government shutdown. The reductions reflect challenges in operations and decreased demand. This decision comes as federal workers and agencies face disruptions.",
    "published": "2025-11-07T01:09:48Z"
  },
  {
    "title": "How Tesla shareholders put Elon Musk on path to be world’s first trillionaire",
    "url": "https://www.theguardian.com/technology/2025/nov/06/how-tesla-shareholders-elon-musk-trillionaire",
    "image": "https://media.guim.co.uk/146ea600371c47e796f9b3708122efd144613cab/458_0_4583_3667/500.jpg",
    "summary": "Tesla's board has approved a significant compensation package for Elon Musk, contingent on key performance milestones. To receive the full benefits, Musk must achieve ambitious company growth and operational targets. This structure aims to align his incentives with Tesla's long-term success.",
    "published": "2025-11-07T00:46:26Z"
  },
  {
    "title": "Death toll from UPS plane crash at Louisville airport rises to 13",
    "url": "https://www.theguardian.com/us-news/2025/nov/06/ups-plane-crash-louisville-death-toll",
    "image": "https://media.guim.co.uk/f0bb926ea9ecfd37b1be23824b61711006193818/78_0_2503_2003/500.jpg",
    "summary": "The firm has identified the three victims of the plane crash. Investigators reported that the aircraft's left wing experienced a fire. Further details surrounding the incident are still under investigation.",
    "published": "2025-11-07T00:42:09Z"
  }
]