[
  {
    "title": "Celtic and Rangers meet again, Premier League news and buildup – matchday live",
    "url": "https://www.theguardian.com/football/live/2025/nov/02/old-firm-clash-scottish-league-cup-semi-final-premier-league-buildup-matchday-live",
    "image": "https://media.guim.co.uk/a1679e866bf9a42221bbfb6e034117c266ef7b9c/726_0_4917_3935/500.jpg",
    "summary": "Tom Bassam provides updates and previews for an exciting day of events in Scotland and England. Expect news highlights and insights as the action unfolds. Stay tuned for the latest developments in sports.",
    "published": "2025-11-02T08:21:32Z"
  },
  {
    "title": "Australia v India: third men’s Twenty20 international – live",
    "url": "https://www.theguardian.com/sport/live/2025/nov/02/australia-v-india-t20-live-third-twenty20-international-cricket-aus-vs-ind-latest",
    "image": "https://media.guim.co.uk/30bdac385ef25dc1ffda467dbd78a89e45f6a7c5/192_0_1800_1440/500.jpg",
    "summary": "The arch-rivals face off in a T20I match at Bellerive Oval, where the hosts currently maintain a slight lead in the series. Martin Pegan will provide live updates throughout the game. Fans can expect an exciting showdown between the two teams.",
    "published": "2025-11-02T08:20:39Z"
  },
  {
    "title": "Cambridgeshire train stabbing: 10 people injured in attack; police arrest two suspects – latest updates",
    "url": "https://www.theguardian.com/uk-news/live/2025/nov/02/cambridgeshire-train-stabbing-life-threatening-injuries-arrests-latest-updates",
    "image": "https://media.guim.co.uk/c8fb9faf5e3abb41a9f3bd7f074385fa02a6c37c/0_0_4076_3261/500.jpg",
    "summary": "Nine individuals have been hospitalized with life-threatening injuries, prompting an investigation involving counter-terrorism police. The circumstances surrounding the incident remain under scrutiny. Ongoing updates will provide further details on the situation.",
    "published": "2025-11-02T08:17:50Z"
  },
  {
    "title": "UK small business owner to face L’Oréal at tribunal over trademark dispute",
    "url": "https://www.theguardian.com/uk-news/2025/nov/02/uk-small-business-owner-to-face-loreal-at-tribunal-over-trademark-dispute",
    "image": "https://media.guim.co.uk/c219ac2bad09f0846758b0e10e3ad057add9a2cf/499_296_3677_2941/500.jpg",
    "summary": "Rebecca Dowdeswell has been engaged in a three-year legal dispute with a £170 billion cosmetics company concerning her nkd brand. The conflict centers around trademark issues and brand identity. The case highlights the challenges faced by smaller brands against major corporations in the beauty industry.",
    "published": "2025-11-02T08:00:03Z"
  },
  {
    "title": "Rosalía’s Berghain is a thundrous goth-pop hit – but is it opera?",
    "url": "https://www.theguardian.com/music/2025/nov/02/rosalia-berghain-is-a-thundrous-goth-pop-hit-but-is-it-opera",
    "image": "https://media.guim.co.uk/f9d5863c24e1bf121e90afe1e525be8e6f62aab7/473_0_4792_3834/500.jpg",
    "summary": "A new single from a prominent Catalan artist is generating excitement among classical music fans while also sparking debate. The track's innovative approach is both delighting some listeners and dividing opinions within the classical community. The release showcases the artist's talent and creativity, contributing to ongoing discussions in the genre.",
    "published": "2025-11-02T08:00:01Z"
  }
]