[
  {
    "title": "Australia politics live: Wells says Optus sent ‘inaccurate and misleading’ advice to her office as Ley again targets triple-zero failures",
    "url": "https://www.theguardian.com/australia-news/live/2025/oct/08/australia-politics-live-gaza-rally-parliament-anthony-albanese-sussan-ley-question-time-andrew-hastie-ntwnfb",
    "image": "https://media.guim.co.uk/7bbe0fb24285d1ffbaaa34df1416afbb42be7f53/652_0_5973_4781/500.jpg",
    "summary": "I'm sorry, but I can't provide a summary without the actual news content. Please provide the details or text you'd like summarized!",
    "published": "2025-10-08T03:33:00Z"
  },
  {
    "title": "Pat Cummins expected to miss first Ashes Test as doubts grow over fitness for entire series ",
    "url": "https://www.theguardian.com/sport/2025/oct/08/pat-cummins-back-injury-australia-ashes-first-test-cricket",
    "image": "https://media.guim.co.uk/449fc9c34bc0d5102deb3098c488842a901223c8/125_0_4640_3712/500.jpg",
    "summary": "Australia's captain is likely to miss the opening match against England in Perth due to a back injury. The star fast bowler has not yet returned to bowling as he continues his recovery. His absence raises concerns for the team's performance in the crucial game.",
    "published": "2025-10-08T03:05:52Z"
  },
  {
    "title": "Oregon’s governor says she told Kristi Noem ‘there is no insurrection in Oregon’ – as it happened",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/07/donald-trump-national-guard-pam-bondi-mark-carney-government-shutdown-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/ce2d02a899104554aaec733305cd5c424543c446/380_0_5417_4335/500.jpg",
    "summary": "Oregon Governor Tina Kotek requested a meeting with the Homeland Security Secretary prior to their visit to the ICE field office in Portland. Her statement reflects a proactive approach to addressing immigration issues in the state. The meeting underscores the importance of communication between state leadership and federal officials on such matters.",
    "published": "2025-10-08T02:06:57Z"
  },
  {
    "title": "Dolly Parton ‘going to be just fine’, singer’s sister says as she calls for prayers amid health problems",
    "url": "https://www.theguardian.com/music/2025/oct/08/dolly-parton-health-problems-sister-prayers-going-to-be-just-fine",
    "image": "https://media.guim.co.uk/9301399dbef0dce5b8480184107f9cf70eaa7771/181_0_3474_2778/500.jpg",
    "summary": "Freida Parton has expressed deep concern for her sister, who is facing ongoing health challenges. She revealed that she has been praying all night for her sibling's well-being. The specific nature of the singer's health issues has not been disclosed.",
    "published": "2025-10-08T01:21:12Z"
  },
  {
    "title": "Alleged ‘kill team’ charged after arrest en route to hit near Sydney daycare",
    "url": "https://www.theguardian.com/australia-news/2025/oct/08/alleged-kill-team-charged-after-arrest-en-route-to-hit-near-sydney-daycare",
    "image": "https://media.guim.co.uk/4039ec071c4857f9eee666ed9ffab320483e02b1/230_0_1114_892/500.jpg",
    "summary": "Police have apprehended three individuals suspected of planning to murder a man near a childcare center in the southwest of the city. The trio was allegedly seen preparing for the attack. Authorities are taking the threat seriously due to the proximity to a children's facility.",
    "published": "2025-10-08T01:07:16Z"
  }
]