[
  {
    "title": "Melbourne Metro Tunnel train services will soon begin – but what is the ‘summer start’ and when is the ‘big switch’?",
    "url": "https://www.theguardian.com/australia-news/2025/oct/07/melbourne-metro-tunnel-train-services-will-soon-begin-but-what-is-the-summer-start-and-when-is-the-big-switch",
    "image": "https://media.guim.co.uk/8252b21e961417c2c196d4af456eabc6683a722b/0_0_5000_4000/500.jpg",
    "summary": "Starting in December, trains will operate every 20 minutes. However, commuters will need to wait until February 1 for the introduction of 'turn up and go' services. This change aims to enhance convenience for travelers.",
    "published": "2025-10-07T04:14:36Z"
  },
  {
    "title": "Australia politics live: Anika Wells says ‘no silver bullet’ for Optus failures; Nationals deputy leader kicked out of question time",
    "url": "https://www.theguardian.com/australia-news/live/2025/oct/07/australia-politics-live-october-7-anniversary-hamas-israel-anthony-albanese-sussan-ley-question-time-andrew-hastie-labor-coalition-ntwnfb",
    "image": "https://media.guim.co.uk/93c6adcbeaef71cb0d4eef9754d83eda7f104c6a/374_32_2960_2368/500.jpg",
    "summary": "I'm sorry, but I need more context or specific information about the news you want summarized. Could you please provide details or a link?",
    "published": "2025-10-07T04:12:58Z"
  },
  {
    "title": "Proof-of-age ID leaked in Discord data breach",
    "url": "https://www.theguardian.com/games/2025/oct/07/discord-data-breach-proof-of-age-id-leaked",
    "image": "https://media.guim.co.uk/95a635fddc8840c9dbe5e480ba25db55b22d1044/683_0_6827_5464/500.jpg",
    "summary": "A video game chat platform has notified users that sensitive data, including driver's licenses and passports, was compromised through a third-party customer service provider. The breach raises concerns about data security and privacy. The platform is likely taking steps to address the incident and inform affected users.",
    "published": "2025-10-07T04:08:06Z"
  },
  {
    "title": "‘It’s Sellafield or nothing’: what life is like growing up in the shadow of Europe’s oldest nuclear site",
    "url": "https://www.theguardian.com/environment/2025/oct/07/whitehaven-sellafield-europe-oldest-nuclear-site",
    "image": "https://media.guim.co.uk/77a4aad08e71962f275496946e9f8c80d8e9a13b/625_0_9294_7439/500.jpg",
    "summary": "In Whitehaven, England, the local power plant is a vital source of employment and community funding for young residents. However, many youth seeking opportunities beyond the town face a lack of options. The reliance on the plant underscores a broader issue of limited prospects in the region.",
    "published": "2025-10-07T04:00:35Z"
  },
  {
    "title": "‘People screamed. Cried. Threw up’: 10 extraordinary life lessons from Ozzy Osbourne’s new memoir",
    "url": "https://www.theguardian.com/music/2025/oct/07/people-screamed-cried-threw-up-10-extraordinary-life-lessons-ozzy-osbourne-new-memoir",
    "image": "https://media.guim.co.uk/20a3243c099c7523f374dc4edc7a081c0dad4f3b/347_0_3246_2596/500.jpg",
    "summary": "The late rock legend's book reveals his struggle with addiction, humorously detailing how he transitioned from cigarettes to smoking 30 cigars daily. He presents himself as self-aware and insightful, offering lessons on fame and the importance of choosing the right support in life's challenges. His experience serves as a candid exploration of coping with addiction and its consequences.",
    "published": "2025-10-07T04:00:34Z"
  }
]