[
  {
    "title": "Donald Trump says rare earths dispute ‘settled’ after Xi Jinping meeting in South Korea – live updates",
    "url": "https://www.theguardian.com/world/live/2025/oct/30/donald-trump-xi-jinping-meeting-live-updates",
    "image": "https://media.guim.co.uk/bd1c513361c5ea2ab97bd963b56b8b81e60cde38/0_1161_5159_4127/500.jpg",
    "summary": "The APEC summit marked the first meeting between US and Chinese leaders since 2019, amid ongoing tensions exacerbated by Trump's trade war. This encounter highlights the importance of diplomatic dialogue in addressing bilateral issues. Both nations are seeking to navigate their complex relationship moving forward.",
    "published": "2025-10-30T06:28:58Z"
  },
  {
    "title": "TV tonight: Brassic calls it a day with Tarantino-inspired finale",
    "url": "https://www.theguardian.com/tv-and-radio/2025/oct/30/tv-tonight-brassic-calls-it-a-day-with-tarantino-inspired-finale",
    "image": "https://media.guim.co.uk/9a879cd420970ad891cfa4a1897e933b1229e2f6/833_0_6221_4975/500.jpg",
    "summary": "Rogueish comedy wraps up with its climactic 50th episode, providing fans with a thrilling conclusion. Additionally, \"Peter Pansy – The Rusical\" is featured in this evening's episode of Drag Race. Viewers can expect a fun-filled night of entertainment.",
    "published": "2025-10-30T06:20:54Z"
  },
  {
    "title": "Prisons across NSW in lockdown after thousands of guards walk off job over violent bashing",
    "url": "https://www.theguardian.com/australia-news/2025/oct/30/strike-nsw-prisons-lockdown",
    "image": "https://media.guim.co.uk/328db45c30db89405cf25f9b59f0312af63f5fd2/0_0_3416_2733/500.jpg",
    "summary": "A strike was initiated following a court ruling that declined to extend the sentence of an inmate convicted of violently assaulting four prison officers. The decision has sparked outrage among prison staff, who demand increased safety measures. This incident highlights ongoing concerns over inmate behavior and staff protection in correctional facilities.",
    "published": "2025-10-30T06:19:04Z"
  },
  {
    "title": "Australia politics live: Larissa Waters says nature laws revamp has new loopholes ‘you could drive a mining truck through’",
    "url": "https://www.theguardian.com/australia-news/live/2025/oct/30/anthony-albanese-donald-trump-meeting-murray-watt-epbc-nature-laws-press-club-parliament-labor-coalition-sussan-ley-ntwnfb",
    "image": "https://media.guim.co.uk/a4f00584847ec06028c060b931f831ad3d3d8f31/1050_0_6752_5402/500.jpg",
    "summary": "Please provide the news article or key points you'd like summarized, and I will help you condense it into three lines.",
    "published": "2025-10-30T06:13:33Z"
  },
  {
    "title": "Weatherwatch: autumn colours linger as growing seasons get longer",
    "url": "https://www.theguardian.com/news/2025/oct/30/weatherwatch-autumn-colours-linger-as-growing-seasons-get-longer",
    "image": "https://media.guim.co.uk/7b3aa5883bdd2fbf493403464c1fd77f192e922a/562_0_3751_3000/500.jpg",
    "summary": "Over the past 40 years, autumn has been delayed by about two weeks due to less frequent but more intense rainfall events. This shift highlights the changing weather patterns affecting seasonal cycles. The trend raises concerns about potential impacts on agriculture and ecosystems.",
    "published": "2025-10-30T06:00:55Z"
  }
]