[
  {
    "title": "Hegseth orders US Navy secretary to investigate Arizona senator Mark Kelly for ‘potentially unlawful comments’ - live",
    "url": "https://www.theguardian.com/us-news/live/2025/nov/25/us-politics-pam-bondi-appeal-james-comey-letitia-james-cases-donald-trump-venezuela-latest-updates",
    "image": "https://media.guim.co.uk/88cf58ae42ba1f14911ec3de02ee68753e6b721b/258_0_3107_2486/500.jpg",
    "summary": "Donald Trump's former Defense Secretary sent a memo to John Phelan requesting a review of comments made by Kelly. Concurrently, House Democrats have acknowledged that the FBI is pursuing an investigation related to these remarks. This development highlights ongoing tensions and inquiries surrounding Trump's administration actions.",
    "published": "2025-11-25T23:17:46Z"
  },
  {
    "title": "Australia politics live: Pocock pushes back on CSIRO cuts as Labor insists it has not reduced funding; Thorpe criticises ‘outrageous’ search powers expansion in Victoria",
    "url": "https://www.theguardian.com/australia-news/live/2025/nov/26/politics-live-labor-epbc-nature-laws-murray-watt-greens-coalition-anthony-albanese-sussan-ley-ted-obrien-national-press-club-ndis-fines-cpi-question-time-ntwnfb",
    "image": "https://media.guim.co.uk/49fccfdc5242bb680dc0d2f1605b5673a660e32d/804_0_5058_4046/500.jpg",
    "summary": "Please provide the news article or content you would like me to summarize.",
    "published": "2025-11-25T23:17:24Z"
  },
  {
    "title": "Estêvão outshines Lamine Yamal to show why he is Chelsea’s rare diamond | Jonathan Wilson",
    "url": "https://www.theguardian.com/football/2025/nov/25/estevao-lamine-yamal-chelsea-barcelona-champions-league",
    "image": "https://media.guim.co.uk/7028971bdfb3cef63e31412135add97c3c8b117b/99_73_2825_2261/500.jpg",
    "summary": "A Brazilian teenager scored a remarkable goal in a victory against Barcelona, showcasing his exceptional talent. His performance has sparked discussions about his potential to become one of the best in football. Fans and analysts alike are excited to see his future developments on the field.",
    "published": "2025-11-25T23:16:25Z"
  },
  {
    "title": "Pete Hegseth orders US navy to investigate Mark Kelly’s comments ",
    "url": "https://www.theguardian.com/us-news/2025/nov/25/democrats-trump-fbi-intimidation-campaign",
    "image": "https://media.guim.co.uk/caa216c48b7a7baa5fe8c83724c46773d0e971f9/206_0_6882_5504/500.jpg",
    "summary": "Lawmakers who advocated for military personnel to disobey illegal orders are reportedly facing inquiries from federal agents. They assert that this investigation is an attempt to intimidate them for their stance. The situation highlights tensions between legislative members and federal authorities regarding military conduct.",
    "published": "2025-11-25T23:14:52Z"
  },
  {
    "title": "Study claims to provide first direct evidence of dark matter",
    "url": "https://www.theguardian.com/science/2025/nov/25/study-claims-to-provide-first-direct-evidence-of-dark-matter",
    "image": "https://media.guim.co.uk/e9870caa6f1ceb4d80a026a997593bab901e1ec6/430_0_2036_1629/500.jpg",
    "summary": "Astrophysicist Prof. Tomonori Totani has announced research that may lead to a significant breakthrough in the quest for a mysterious substance in the universe. His findings could enhance our understanding of fundamental cosmic phenomena. This innovative study could reshape our approach to astrophysics and related fields.",
    "published": "2025-11-25T23:00:33Z"
  }
]