[
  {
    "title": "Senate passes bill to nullify Trump’s sweeping global tariffs on more than 100 nations – US politics live",
    "url": "https://www.theguardian.com/world/live/2025/oct/30/donald-trump-xi-jinping-meeting-live-updates",
    "image": "https://media.guim.co.uk/97046f776aac162b3e42421270440d729ca4c94c/918_0_6827_5464/500.jpg",
    "summary": "A recent vote has successfully passed 51-47 in favor of ending tariffs, marking a significant bipartisan effort. This decision follows earlier resolutions to repeal tariffs on Canada and Brazil. The moves reflect ongoing discussions about trade policies and international relations.",
    "published": "2025-10-30T19:02:58Z"
  },
  {
    "title": "Enhanced Games are dangerous and must be stopped, says Wada head",
    "url": "https://www.theguardian.com/sport/2025/oct/30/enhanced-games-are-dangerous-and-must-be-stopped-says-wada-head",
    "image": "https://media.guim.co.uk/89bc810be7ff21b802dd078e05cf1439b97d57c3/660_0_6615_5292/500.jpg",
    "summary": "The head of the World Anti-Doping Agency has urged U.S. anti-doping authorities to intervene against the Enhanced Games. He labeled the event as \"dangerous\" and \"irresponsible.\" Concerns are raised about the implications for athlete health and integrity in sports.",
    "published": "2025-10-30T18:53:50Z"
  },
  {
    "title": "Thieves steal more than 1,000 items from Oakland museum in ‘brazen’ heist",
    "url": "https://www.theguardian.com/us-news/2025/oct/30/heist-oakland-museum-native-american-artifacts",
    "image": "https://media.guim.co.uk/92dba77013cb5ff98d19f7c05650319c96412f08/675_10_370_296/master/370.png",
    "summary": "A burglary occurred early in the morning, resulting in the theft of valuable artifacts, including Native American baskets, ivory carvings, and historical daguerreotypes. The incident has raised concerns about the preservation of cultural heritage. Authorities are investigating and seeking leads on the stolen items.",
    "published": "2025-10-30T18:53:18Z"
  },
  {
    "title": "Reeves says she should have checked rental licence had been obtained as letting agent apologises – as it happened",
    "url": "https://www.theguardian.com/politics/live/2025/oct/30/rachel-reeves-labour-keir-starmer-uk-politics-latest-news-updates",
    "image": "https://media.guim.co.uk/042e4d5b2b45b212202ef947cf7e2b8fe3ba3099/295_103_1834_1467/500.jpg",
    "summary": "No 10 has made public redacted emails involving the husband of a government figure and a letting agent. The decision to release these communications follows scrutiny regarding transparency. The emails are part of ongoing discussions about accountability and governance.",
    "published": "2025-10-30T18:50:05Z"
  },
  {
    "title": "Man jailed after burgling Damien Hirst’s London studio while wearing GPS ankle tag",
    "url": "https://www.theguardian.com/artanddesign/2025/oct/30/man-jailed-theft-damien-hirst-london-studio",
    "image": "https://media.guim.co.uk/f253a3cbd1e2ea65004403635f8074d207bdc718/519_0_4682_3746/500.jpg",
    "summary": "Liam Middleton-Gomm, 36, has been sentenced to 32 months in prison for stealing goods worth £5,000. His movements were tracked by police, leading to his arrest. The sentence reflects the seriousness of his theft.",
    "published": "2025-10-30T18:46:30Z"
  }
]