[
  {
    "title": "‘Time to take the big leap’: Reese Witherspoon’s first novel hits the shelves",
    "url": "https://www.theguardian.com/film/2025/oct/17/reese-witherspoon-first-novel-gone-before-goodbye",
    "image": "https://media.guim.co.uk/da81800cc8e666dead77f0aef380a830ae8f5fe9/283_0_2830_2264/500.jpg",
    "summary": "Oscar-winning actor and producer has collaborated with bestselling author Harlan Coben to co-write a new book titled \"Gone Before Goodbye.\" This marks a significant entry into the literary world for the actor, showcasing their storytelling talents alongside Coben's renowned expertise. The project has generated excitement among fans and readers alike.",
    "published": "2025-10-17T13:26:11Z"
  },
  {
    "title": "Postecoglou defends ‘trophy’ record; Arteta backs Gyökeres, Palmer injury blow – football live",
    "url": "https://www.theguardian.com/football/live/2025/oct/17/premier-league-returns-with-liverpool-v-manchester-united-buildup-football-live",
    "image": "https://media.guim.co.uk/8dd0a07ae4a9d92cfbe69e0d8f6a283871ae11f6/0_0_3276_2621/500.jpg",
    "summary": "Writers provide a rolling report as they prepare for an action-packed weekend of football. Fans can stay updated with the latest developments and match previews. Excitement builds as key matches approach.",
    "published": "2025-10-17T13:24:22Z"
  },
  {
    "title": "John Bolton at court to surrender to authorities after being indicted – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/17/donald-trump-john-bolton-volodymyr-zelenskyy-us-politics-latest-news-updates",
    "image": "https://media.guim.co.uk/60aea35c77a06ef512e365a2874d2a11f31fc6b7/870_129_1696_1358/500.jpg",
    "summary": "A federal grand jury in Maryland has issued an eighteen-count indictment against former Trump adviser. In response, President Trump referred to his ex-ally as a \"bad guy.\" The case marks another significant legal challenge for Trump allies.",
    "published": "2025-10-17T13:24:00Z"
  },
  {
    "title": "No 10 says talks happening ‘at pace’ across government to lift ban on Maccabi Tel Aviv fans attending Aston Villa match – live",
    "url": "https://www.theguardian.com/politics/live/2025/oct/17/keir-starmer-uk-politics-latest-news-updates-maccabi-tel-aviv-fans-banned",
    "image": "https://media.guim.co.uk/c06220d3dee987abdc59177faa424469a2e88602/361_0_3747_2997/500.jpg",
    "summary": "Fans of Maccabi Tel Aviv have been banned from attending the upcoming match against Aston Villa due to security concerns. The decision comes amidst ongoing tensions and safety issues surrounding international events. Authorities are prioritizing the safety of all attendees at the match.",
    "published": "2025-10-17T13:22:33Z"
  },
  {
    "title": "Trump is battling the ravages of Time – in more ways than one | Dave Schilling",
    "url": "https://www.theguardian.com/commentisfree/2025/oct/17/trump-time-magazine-photo",
    "image": "https://media.guim.co.uk/d54a1e5757102a827a41619e34722f35e5233845/418_0_4164_3333/500.jpg",
    "summary": "The president expresses dissatisfaction with his photo featured on a magazine cover. Additionally, the speaker shares a humorous personal complaint about their own scalp. Both comments highlight concerns about self-image and public perception.",
    "published": "2025-10-17T13:18:33Z"
  }
]