[
  {
    "title": "Controversial domestic violence laws pass Queensland parliament as experts warn they could be weaponised against victims",
    "url": "https://www.theguardian.com/australia-news/2025/aug/28/queensland-mps-vote-on-controversial-plan-to-give-police-power-to-issue-on-the-spot-domestic-violence-orders",
    "image": "https://media.guim.co.uk/421060603d7944951699652a37dbddfc4111544b/671_0_6713_5374/500.jpg",
    "summary": "Police will now have the authority to issue immediate domestic violence orders to address urgent situations. However, experts and advocacy groups have expressed concerns that this could lead to victims being wrongly identified as perpetrators. Critics fear this could undermine the safety and rights of actual victims.",
    "published": "2025-08-28T08:43:26Z"
  },
  {
    "title": "Minister refuses to deny reports Rachel Reeves considering tax increase for landlords in budget – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/aug/28/latest-uk-politics-news-keir-starmer-rachel-reeves-labour-live-updates",
    "image": "https://media.guim.co.uk/04fcc70fae2cfebfc05b3f3ed628e4b6ea8a10f2/153_0_3085_2469/500.jpg",
    "summary": "Stephen Morgan emphasized that Labour's priority is driving growth, following reports suggesting the implementation of a national insurance tax on rental income. He argued that such a tax could adversely impact rental property owners. The Labour Party aims to address economic challenges while supporting property owners.",
    "published": "2025-08-28T08:38:18Z"
  },
  {
    "title": "Russia hits British Council and EU delegation offices in overnight airstrikes on Kyiv - Europe live",
    "url": "https://www.theguardian.com/world/live/2025/aug/28/ukraine-kyiv-strike-russia-europe-zelenskyy-putin-updates-live-news-latest",
    "image": "https://media.guim.co.uk/73f3dc40757f1c02fa6275f97f063d845d9d9749/184_0_1778_1422/500.jpg",
    "summary": "Ukrainian President Zelenskyy demanded a strong reaction to the brutal killing of civilians amid ongoing conflicts. European Council President António Costa described a recent Russian attack on a European delegation as a \"deliberate\" act. The situation intensifies calls for accountability and a unified response from the international community.",
    "published": "2025-08-28T08:36:45Z"
  },
  {
    "title": "Porepunkah manhunt enters day three: what we know so far about the Victoria police shooting and suspect Dezi Freeman",
    "url": "https://www.theguardian.com/australia-news/2025/aug/28/porepunkah-manhunt-enters-day-three-what-we-know-victoria-police-shooting-suspect-dezi-freeman-ntwnfb",
    "image": "https://media.guim.co.uk/1541aeaabf1d9fe038b5d2b6b47fc7e53dc1a344/6_0_4640_3712/500.jpg",
    "summary": "Police are seeking Dezi Freeman, the suspect in the killings of two officers in Porepunkah, a regional town in Victoria, Australia. The incident has prompted a manhunt for Freeman, who is considered armed and dangerous. Authorities are urging the public to remain vigilant and report any sightings.",
    "published": "2025-08-28T08:35:34Z"
  },
  {
    "title": "Porepunkah shooting: Victoria police ‘throwing everything’ at manhunt in ‘severe weather’ for shooting suspect",
    "url": "https://www.theguardian.com/australia-news/2025/aug/28/porepunkah-shooting-victoria-police-search-alleged-killer-dezi-freeman-amid-severe-weather",
    "image": "https://media.guim.co.uk/7014b6edb274194ae8c32aa6a4c35e89dcb7e3da/658_0_5000_4001/500.jpg",
    "summary": "Authorities are searching bushland near a rural property for a heavily armed suspect linked to the shooting deaths of two police officers. The suspect remains elusive as the investigation continues. Police efforts are focused on locating the individual in the surrounding area.",
    "published": "2025-08-28T08:34:32Z"
  }
]