[
  {
    "title": "Australia news live: Albanese arrives in New York; Optus pledges investigation into triple-zero deaths",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/21/australia-news-live-anthony-albanese-donald-trump-new-york-sunday-ntwnfb",
    "image": "https://media.guim.co.uk/2cdbd26eb3dcc8777d6afd9109c8219c3ce704fb/0_0_2737_2191/500.jpg",
    "summary": "I'm sorry, but I cannot access current news updates or live feeds. However, if you provide me with specific news content or a summary, I would be happy to help you summarize it in three lines!",
    "published": "2025-09-20T23:24:09Z"
  },
  {
    "title": "Quiptic crossword No 1,348",
    "url": "https://www.theguardian.com/crosswords/quiptic/1348",
    "summary": "Quiptic crossword No 1,348 features a blend of clues that challenge solvers with both straightforward and cryptic hints. It maintains the series' tradition of engaging wordplay, catering to crossword enthusiasts. This installment aims to provide a satisfying experience for puzzlers of all levels.",
    "published": "2025-09-20T23:00:26Z"
  },
  {
    "title": "Oklahoma Republicans propose all state colleges must have Charlie Kirk statue",
    "url": "https://www.theguardian.com/us-news/2025/sep/20/oklahoma-republicans-charlie-kirk",
    "image": "https://media.guim.co.uk/708554eef747400ff83228c8ecb0ea31887b2f76/398_0_4072_3258/500.jpg",
    "summary": "Schools will be mandated to construct a memorial plaza honoring a slain activist and label them as a civil rights leader. Failure to comply with this requirement could result in financial penalties. This initiative aims to recognize the contributions of the activist and promote education about civil rights issues.",
    "published": "2025-09-20T22:40:22Z"
  },
  {
    "title": "Tulsi Gabbard did not alert White House before revoking 37 security clearances",
    "url": "https://www.theguardian.com/us-news/2025/sep/20/tulsi-gabbard-white-house-security-clearances",
    "image": "https://media.guim.co.uk/e6927fd8277e5464c47b96d94399946ef07c1ba2/333_0_3333_2668/500.jpg",
    "summary": "The White House was unaware that security clearances at the CIA and Congress had been revoked until after the fact. This oversight prompted concerns about communication and protocol within the administration. The incident highlights potential vulnerabilities in national security processes.",
    "published": "2025-09-20T22:26:55Z"
  },
  {
    "title": "Premier League top scorers 2025-26: who is leading race for golden boot?",
    "url": "https://www.theguardian.com/football/2025/sep/15/premier-league-top-scorers-2025-26-who-is-leading-race-for-golden-boot",
    "image": "https://media.guim.co.uk/77be6da0a20792a89f51335849cb3f8169dfbba1/671_0_2264_1811/500.jpg",
    "summary": "The English Premier League's goalscoring charts are heating up this season, showcasing standout players. Top scorers are making a significant impact on their teams' performances. Keep an eye out for these hot shots as the season progresses.",
    "published": "2025-09-20T22:17:35Z"
  }
]