[
  {
    "title": "Sydney set for ‘blistering’ weather as record heat shifts east and BoM warnings for winds to blast Melbourne and Victoria",
    "url": "https://www.theguardian.com/environment/2025/oct/22/sydney-weather-nsw-heat-bom-forecast-wind-warnings-australia",
    "image": "https://media.guim.co.uk/d30ccb44149d5fa0576f5aa80ca92c0a1b4e8bf4/0_0_2123_1698/500.jpg",
    "summary": "The Bureau of Meteorology forecasts temperatures to hit 39°C in the CBD. Additionally, rain and damaging wind gusts of up to 130 km/h are expected along Victoria's south-west coast. Residents are advised to prepare for extreme weather conditions.",
    "published": "2025-10-22T03:09:59Z"
  },
  {
    "title": "Thailand to let Myanmar refugees work to counter aid cuts and labour shortages",
    "url": "https://www.theguardian.com/global-development/2025/oct/22/thailand-to-let-myanmar-refugees-work-aid-cuts-labour-shortages",
    "image": "https://media.guim.co.uk/389cd4d5de475ea6e3d45329cc864b15edb437d3/707_0_6064_4852/500.jpg",
    "summary": "The UN has praised a new initiative that empowers thousands living in camps to become self-sufficient. This move is expected to enhance their ability to support themselves and their families. Overall, it represents a significant step towards improving the living conditions of those affected.",
    "published": "2025-10-22T03:00:53Z"
  },
  {
    "title": "Kevin Muscat remains on course to follow in Postecoglou’s footsteps despite fiasco | John Duerden",
    "url": "https://www.theguardian.com/sport/blog/2025/oct/22/kevin-muscat-coach-move-rangers-fiasco-ange-postecoglou",
    "image": "https://media.guim.co.uk/609ac4a28c25896fb382feb88818ab4feb4a16bb/269_0_2691_2153/500.jpg",
    "summary": "A deal with Rangers fell through for the Australian coach, but his successful run in Asia is opening up new opportunities in Europe. His transformation from a fiery player to a more composed coach has contributed to his recent achievements. This success is expected to lead to more prospects in the European football landscape.",
    "published": "2025-10-22T03:00:17Z"
  },
  {
    "title": "Australia news live: Sydney temperature edges towards October record; severe weather warnings across three states",
    "url": "https://www.theguardian.com/australia-news/live/2025/oct/22/australia-news-live-weather-nsw-qld-heat-record-melbourne-destructive-wind-rex-airlines-bid-albanese-washington-sussan-ley-labor-coalition-ntwnfb",
    "image": "https://media.guim.co.uk/15b94e083ae24a168719ae008803014d65f4daee/884_0_4418_3535/500.jpg",
    "summary": "I'm sorry, but I need more context or information about the news you would like summarized. Please provide the details or key points you'd like included.",
    "published": "2025-10-22T03:00:10Z"
  },
  {
    "title": "Protests erupt in New York City after Ice raids Chinatown over ‘counterfeit goods’",
    "url": "https://www.theguardian.com/us-news/2025/oct/21/new-york-city-chinatown-ice-raids-protests",
    "image": "https://media.guim.co.uk/ac0e0565464beb2a2d54cc28859d85074bc10348/1221_0_1732_1386/500.jpg",
    "summary": "Demonstrators gathered near a federal building following the detention of an unspecified number of individuals by agents. The protest reflects public concern over the circumstances surrounding the detentions. Details regarding the reasons for the arrests and the identities of those detained remain unclear.",
    "published": "2025-10-22T02:16:33Z"
  }
]