[
  {
    "title": "Lammy heckled at vigil for Manchester synagogue attack; one victim died after apparently being hit by police bullet – latest",
    "url": "https://www.theguardian.com/uk-news/live/2025/oct/03/manchester-synagogue-attack-victims-adrian-daulby-melvin-cravitz-attacker-jihad-al-shamie-latest-news-updates",
    "image": "https://media.guim.co.uk/5347b15f89fa47dd6352daad2ae5a946f25a0b07/231_0_5423_4340/500.jpg",
    "summary": "The justice secretary faced public outrage and shouts of \"shame on you\" during a gathering to honor victims of a recent terror attack. The event drew a large crowd expressing their grief and demanding accountability. Emotions ran high as the community united in remembrance and protest.",
    "published": "2025-10-03T16:21:35Z"
  },
  {
    "title": "Tell us: how did you end a dry spell in your relationship?",
    "url": "https://www.theguardian.com/lifeandstyle/2025/oct/03/tell-us-how-did-you-end-a-dry-spell-in-your-relationship",
    "image": "https://media.guim.co.uk/3fe033653182f6f8abf8d30a8180fa38b6821ee3/648_0_4402_3523/500.jpg",
    "summary": "To combat a dry spell in a romantic relationship, consider engaging in open communication to express feelings and desires. Plan new activities together to rekindle excitement and intimacy. Additionally, prioritize quality time and affection to strengthen your emotional connection.",
    "published": "2025-10-03T16:19:13Z"
  },
  {
    "title": "England fans ‘astonished’ by World Cup ticket prices; Antony hits out at United treatment: football – live",
    "url": "https://www.theguardian.com/football/live/2025/oct/03/weekend-football-countdown-nottingham-forest-postecoglou-england-squad-premier-league-news-live",
    "image": "https://media.guim.co.uk/6e2e583bc281b8b890af548ef98dbd5342bba7d0/106_0_2745_2196/500.jpg",
    "summary": "Our writers are set to provide updates and insights as we approach the weekend's football matches. Stay tuned for the latest news and developments. Don't miss out on any key information before the games begin!",
    "published": "2025-10-03T16:17:31Z"
  },
  {
    "title": "Sean ‘Diddy’ Combs in court as sentencing hearing gets under way – live updates",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/03/sean-diddy-combs-sentencing-trial-conviction-latest-updates",
    "image": "https://media.guim.co.uk/f481d2573a78ffbd126134345e03b8e177261762/429_0_4088_3270/500.jpg",
    "summary": "A music mogul, convicted of prostitution charges in July, is seeking leniency from the judge, requesting a 'second chance' before potentially facing a lengthy prison sentence. His plea reflects a desire to avoid severe repercussions for his actions. The case is drawing significant attention as it unfolds in the legal system.",
    "published": "2025-10-03T16:14:32Z"
  },
  {
    "title": "UK political class ‘poisoned by wealth’, says Zack Polanski as he sets out plan to tax assets of richest 1% – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/oct/03/greens-labour-reform-conservatives-immigration-uk-politics-live-news-updates",
    "image": "https://media.guim.co.uk/230f3f716b1479d4b506a4187fec02c39aa795b2/648_0_4274_3419/500.jpg",
    "summary": "Filmmaker Roman Polanski has urged for a deeper discussion on patriotism, emphasizing that it should extend beyond mere flag waving. He believes that true patriotism involves more meaningful engagement with national identity and values. His comments suggest a desire for a thoughtful discourse on what it means to be patriotic in contemporary society.",
    "published": "2025-10-03T16:13:02Z"
  }
]