[
  {
    "title": "Scotland v Belarus: World Cup 2026 qualifying – live",
    "url": "https://www.theguardian.com/football/live/2025/oct/12/scotland-v-belarus-world-cup-2026-qualifying-live",
    "image": "https://media.guim.co.uk/2c5732cec5b02d58d2c1a28ab4f5a6137854e953/207_0_3624_2901/500.jpg",
    "summary": "Steve Clarke's team is looking to advance towards qualification with a crucial match against Belarus. Rob Smyth will provide a minute-by-minute report on the game's progress. Fans are eager to see if they can secure a vital victory.",
    "published": "2025-10-12T17:14:10Z"
  },
  {
    "title": "Steelers v Browns, Ravens v Rams and more: NFL week six – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/12/steelers-v-browns-ravens-v-rams-and-more-nfl-week-six-live",
    "image": "https://media.guim.co.uk/b18277754f9443f8cdb7af59ccb0163f14d73928/294_0_2500_2000/500.jpg",
    "summary": "Graham Searles is providing live updates for week six of the NFL. Fans can expect real-time information on games, player performances, and key events. Stay tuned for detailed coverage and insights throughout the week.",
    "published": "2025-10-12T17:14:00Z"
  },
  {
    "title": "Women’s Cricket World Cup: Australia v India – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/12/womens-cricket-world-cup-australia-v-india-live-updates-scores-results-teams-squads-start-time-visakhapatnam",
    "image": "https://media.guim.co.uk/01ff01a0477df68bec3efe45d65f1b017d19fbba/408_0_3070_2457/500.jpg",
    "summary": "In an ODI match in Visakhapatnam, two heavyweight teams aim to establish their dominance during the group stage. The game promises to be a competitive showdown. Megan Maurice will provide live updates throughout the match.",
    "published": "2025-10-12T17:12:34Z"
  },
  {
    "title": "Gaza ceasefire live: Trump to meet with Israeli hostages after their release by Hamas on Monday, says Vance",
    "url": "https://www.theguardian.com/world/live/2025/oct/12/gaza-ceasefire-live-aid-relief-hamas-release-israel-hostages",
    "image": "https://media.guim.co.uk/b826099457fa74a398182d2a2a34105b1b0e6877/500_0_5000_4000/500.jpg",
    "summary": "US Vice President JD Vance announced that a potential release related to Middle East peace could occur \"any moment.\" He expressed optimism, stating that the region is on the brink of achieving sustainable peace. Vance's comments reflect a hopeful assessment of ongoing diplomatic efforts.",
    "published": "2025-10-12T17:05:15Z"
  },
  {
    "title": "La Bohème – noirish reframing of Puccini’s classic weepy",
    "url": "https://www.theguardian.com/music/2025/oct/12/la-boheme-puccini-glyndebourne-sussex-review",
    "image": "https://media.guim.co.uk/f8d8cca9f072fac0dfe5a2f7a32dbd1a8d9f3ca1/761_0_3803_3043/500.jpg",
    "summary": "Floris Visser's production evokes the artistic spirit of Brassaï's Paris with its stylish bohemian aesthetic. The performance of Puccini's score is noted for its clarity and flexibility. Overall, the combination creates a captivating experience.",
    "published": "2025-10-12T17:01:05Z"
  }
]