[
  {
    "title": "Pound slides after UK government borrowing jumps in August, as chancellor’s worries deepen – business live",
    "url": "https://www.theguardian.com/business/live/2025/sep/19/uk-government-borrowing-rises-consumer-confidence-slips-reeves-budget-business-live-news",
    "image": "https://media.guim.co.uk/156005abd5022a48f2801c0646db8d04e1e02dfe/264_0_6827_5464/500.jpg",
    "summary": "August borrowing has reached its highest level since 2020, highlighting concerns about rising debt levels. This increase reflects trends in consumer spending and credit utilization amid economic uncertainties. Analysts are closely monitoring these developments for potential implications on the financial landscape.",
    "published": "2025-09-19T09:31:10Z"
  },
  {
    "title": "Probation Service failing to assess thousands who pose risk to women, watchdog says",
    "url": "https://www.theguardian.com/society/2025/sep/18/offenders-england-wales-serious-risk-to-women-girls",
    "image": "https://media.guim.co.uk/00efbfd84671dcbd7d05319360943a6ca54f0317/26_0_5600_4480/500.jpg",
    "summary": "The Chief Inspector of Probation warns that without significant improvements in the criminal justice system, more murders and rapes are likely to occur. This statement highlights concerns over public safety and the effectiveness of current measures. The call for urgent reforms emphasizes the need to address systemic issues within the probation framework.",
    "published": "2025-09-19T09:31:08Z"
  },
  {
    "title": "World Athletics Championships 2025: 200m finals, heptathlon and more – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/19/world-athletics-championships-2025-200m-finals-heptathlon-and-more-live",
    "image": "https://media.guim.co.uk/2e6f2f6107f4ea4085aa5efc69cf9a84b36039c7/76_0_2199_1759/500.jpg",
    "summary": "Yara El-Shaboury provides updates from night seven in Tokyo, featuring the highly anticipated men’s and women’s 200m finals. The event promises exciting performances and thrilling competition. Stay tuned for all the highlights and results.",
    "published": "2025-09-19T09:29:08Z"
  },
  {
    "title": "Sikh groups offer £10k reward for information after rape of woman in West Midlands",
    "url": "https://www.theguardian.com/uk-news/2025/sep/19/sikh-groups-offer-10k-reward-for-information-after-rape-of-woman-in-west-midlands",
    "image": "https://media.guim.co.uk/bf19c9d0cbbab042b338949fb5627cb1bdc8b380/292_114_2774_2219/500.jpg",
    "summary": "Police in Oldbury, near Birmingham, are searching for two men connected to a racially motivated attack on a woman in her 20s. The incident has raised concerns about safety in the area. Authorities are urging anyone with information to come forward.",
    "published": "2025-09-19T09:24:42Z"
  },
  {
    "title": "More thoughtful than a card: 24 of the best letterbox gifts, from pub snacks to pamper kits",
    "url": "https://www.theguardian.com/thefilter/2025/sep/19/best-letterbox-gifts-uk",
    "image": "https://media.guim.co.uk/1fe50f883c9f6db09bab7343e6c41e86fad9a403/377_34_1623_1299/500.jpg",
    "summary": "The article highlights convenient letterbox gifts ideal for various occasions such as birthdays or last-minute surprises. These gifts are designed to bring joy with minimal effort. They promise to deliver positive vibes directly to recipients' doorsteps.",
    "published": "2025-09-19T09:24:20Z"
  }
]