[
  {
    "title": "Trump says Hamas is ready for peace and Israel ‘must immediately stop bombing of Gaza’ – live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/03/shutdown-congress-trump-senate-latest-updates",
    "image": "https://media.guim.co.uk/9b4205aea3f4fabc735b6ffe16d553a37b6532ec/580_0_5802_4644/500.jpg",
    "summary": "Donald Trump expressed satisfaction with Hamas' response to his Gaza plan, indicating a willingness to engage in discussions. However, Hamas stated that further negotiations are necessary to finalize the details. Trump's acknowledgment suggests an openness to dialogue amid complex political dynamics.",
    "published": "2025-10-04T01:07:00Z"
  },
  {
    "title": "Donald Trump orders Israel to ‘immediately’ stop bombing Gaza as Hamas agrees to free hostages",
    "url": "https://www.theguardian.com/world/2025/oct/03/hamas-agrees-to-release-all-israeli-hostages",
    "image": "https://media.guim.co.uk/21a5a6d3ece081378a0436e0594a541e6cb40bf0/720_0_7200_5760/500.jpg",
    "summary": "The Palestinian militant group has agreed to some aspects of the US president's proposed plan but is calling for further negotiations on various terms. They aim to address unresolved issues to reach a more comprehensive agreement. This indicates a willingness to engage in dialogue while still asserting their demands.",
    "published": "2025-10-04T00:39:53Z"
  },
  {
    "title": "Dfat officials en route to Israeli prison after Australians on pro-Palestinian flotilla reportedly detained",
    "url": "https://www.theguardian.com/australia-news/2025/oct/03/australians-gaza-flotilla-detained-government-pushing-israel-for-information",
    "image": "https://media.guim.co.uk/13979036b07825efe92a98cd77b6cf3345cbf424/168_0_1695_1356/500.jpg",
    "summary": "At least five Australians are among the passengers of the Global Sumud Flotilla who are currently detained in a prison located in the Negev desert. The flotilla was attempting to break the blockade on Gaza. The situation has raised concerns regarding the treatment of the detainees and their legal status.",
    "published": "2025-10-04T00:34:54Z"
  },
  {
    "title": "Trump news at a glance: Hamas says it has approved parts of Donald Trump’s ultimatum to end war in Gaza",
    "url": "https://www.theguardian.com/us-news/2025/oct/04/trump-news-at-a-glance-hamas-says-it-has-approved-parts-of-donald-trumps-ultimatum-to-end-war-in-gaza",
    "image": "https://media.guim.co.uk/2471218054af851ea58b7807f028216b848dfa2f/302_0_3202_2563/500.jpg",
    "summary": "On October 3, the President urged Israel to cease its bombing campaign in Gaza. Meanwhile, a Palestinian group expressed its desire for further negotiations regarding a proposed plan. These developments highlight ongoing tensions and diplomatic efforts in the region.",
    "published": "2025-10-04T00:26:15Z"
  },
  {
    "title": "Sean ‘Diddy’ Combs sentenced to more than four years in prison and given $500,000 fine – as it happened",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/03/sean-diddy-combs-sentencing-trial-conviction-latest-updates",
    "image": "https://media.guim.co.uk/275587ab041d168427a6e4ce98fef167deb4dc24/105_0_2812_2250/500.jpg",
    "summary": "Combs has been convicted of transportation to engage in prostitution and has received a sentencing in New York. The case highlights ongoing issues related to human trafficking and exploitation. The blog covering this case is now closed.",
    "published": "2025-10-04T00:25:31Z"
  }
]