[
  {
    "title": "News live: Darwin hospital roof collapses as Tropical Cyclone Fina brings heavy rains; Australia signs G20 statement backing Paris Agreement",
    "url": "https://www.theguardian.com/australia-news/live/2025/nov/23/severe-tropical-cyclone-fina-darwin-nt-bom-cop30-fossil-fuel-transition-g20-climate-declaration-ntwnfb",
    "image": "https://media.guim.co.uk/6a5b7b9e4eeeeef97d47535764556266aac67b79/277_0_2832_2268/500.jpg",
    "summary": "Please provide the news content you'd like summarized, and I'll be happy to help!",
    "published": "2025-11-22T22:15:52Z"
  },
  {
    "title": "Cop30 live: Fury, confusion and gratitude as climate deal reached in Belém",
    "url": "https://www.theguardian.com/environment/live/2025/nov/22/cop30-climate-talks-deal-overtime-live-news",
    "image": "https://media.guim.co.uk/0fea9a90f340035b1785f6dbe8d579214d27756b/388_0_3866_3094/500.jpg",
    "summary": "An agreement has been reached at Cop30 after lengthy all-night negotiations, dispelling fears of a summit collapse. The talks were marked by intense discussions and urgency. This resolution signifies a significant step in the ongoing global climate efforts.",
    "published": "2025-11-22T22:15:46Z"
  },
  {
    "title": "Reeves to announce £1.5bn boost in EV subsidies amid pay-per-mile concerns",
    "url": "https://www.theguardian.com/uk-news/2025/nov/22/reeves-ev-subsidies-chargers-budget-boost-pay-per-mile-tax",
    "image": "https://media.guim.co.uk/57e98033c9aedb149dd31993d75b1ec5922e8536/672_0_4522_3618/500.jpg",
    "summary": "Industry experts are supportive of additional incentives but express concerns that a consultation on a mileage tax may create confusion. They believe that these mixed signals could undermine the intended benefits. Overall, clarity is needed to avoid potential negative impacts on the industry.",
    "published": "2025-11-22T22:00:50Z"
  },
  {
    "title": "Cop30’s watered-down agreements will do little for an ecosystem at tipping point",
    "url": "https://www.theguardian.com/environment/2025/nov/22/small-win-at-cop-on-finance-for-poor-countries-overshadowed-by-failure-on-fossil-fuels",
    "image": "https://media.guim.co.uk/e1a9fff138791d508e0f160ad8a0e2e6eef62de5/532_0_5301_4243/500.jpg",
    "summary": "Delegates at the recent meeting struggled to establish a clear timeline for phasing out oil and gas. There were also limited commitments made regarding the reduction of carbon emissions. Overall, progress on critical climate action initiatives remained minimal.",
    "published": "2025-11-22T21:59:02Z"
  },
  {
    "title": "End of fossil fuel era inches closer as Cop30 deal agreed after bitter standoff",
    "url": "https://www.theguardian.com/environment/2025/nov/22/cop30-deal-inches-closer-to-end-of-fossil-fuel-era-after-bitter-standoff",
    "image": "https://media.guim.co.uk/0bd6f5163c428444ecc401fc39eadd25ec46276b/333_0_3328_2662/500.jpg",
    "summary": "Wealthy nations are urged to triple their financial support for vulnerable countries addressing climate impacts. However, discussions on deforestation and critical minerals were excluded from the final agreement. This highlights ongoing challenges in global climate negotiations.",
    "published": "2025-11-22T21:52:41Z"
  }
]