[
  {
    "title": "Most of 475 people arrested by US immigration agents at Georgia Hyundai facility are Korean nationals – live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/05/donald-trump-pentagon-department-of-war-immigration-tariffs-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/044eb5ce3fb7049437c4044c77272848f314af01/996_0_5000_4000/500.jpg",
    "summary": "ICE's investigative unit carried out a warrant as part of an ongoing criminal investigation. A spokesperson for homeland security provided this information to Reuters. Details about the investigation remain limited at this time.",
    "published": "2025-09-05T17:30:30Z"
  },
  {
    "title": "Lammy made deputy PM and Yvette Cooper foreign secretary after Angela Rayner exit",
    "url": "https://www.theguardian.com/politics/2025/sep/05/yvette-cooper-david-lammy-reshuffle-no-10-sources",
    "image": "https://media.guim.co.uk/961a2dd2d208258ef9a59c5f93ea593afffcbd71/0_0_5000_4000/500.jpg",
    "summary": "Shabana Mahmood is set to assume a key role at the Home Office following the departure of Angela Rayner, prompting a significant reshuffle within the government. This transition marks a strategic shift in leadership as the administration reorients its focus. The changes reflect ongoing political dynamics and the need for fresh perspectives in critical positions.",
    "published": "2025-09-05T17:26:59Z"
  },
  {
    "title": "Lammy to be new deputy PM with Cooper as foreign secretary and Mahmood at Home Office – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/05/angela-rayner-stamp-duty-labour-starmer-reform-nigel-farage-uk-politics-live-news-updates",
    "image": "https://media.guim.co.uk/913b9d574a8deaf211dcd44ce2b6bec9036a29d1/0_0_5000_4000/500.jpg",
    "summary": "Labour leader Keir Starmer is reshuffling his senior team following the resignation of Deputy Leader Angela Rayner, who stepped down due to a mistake related to stamp duty. The change is expected to impact party dynamics as Starmer seeks to strengthen his leadership. The move reflects ongoing challenges within the party as it navigates internal issues.",
    "published": "2025-09-05T17:24:40Z"
  },
  {
    "title": "‘Living the dream’: Hamilton savours first Italian GP in Ferrari colours",
    "url": "https://www.theguardian.com/sport/2025/sep/05/living-the-dream-hamilton-savours-first-italian-gp-in-ferrari-colours",
    "image": "https://media.guim.co.uk/318b6cf28c24e161d619721ee7a7ec1c740d5821/720_0_7200_5760/500.jpg",
    "summary": "The atmosphere for the team's drivers at the Monza race is unparalleled in Formula One. Fans create an electric environment, showcasing their passionate support. This unique home race experience sets Monza apart from other venues in the sport.",
    "published": "2025-09-05T17:23:13Z"
  },
  {
    "title": "The Guardian view on Angela Rayner’s exit: a loss that exposes Labour’s deeper faultlines | Editorial",
    "url": "https://www.theguardian.com/commentisfree/2025/sep/05/the-guardian-view-on-angela-rayners-exit-a-loss-that-exposes-labours-deeper-faultlines",
    "image": "https://media.guim.co.uk/15341121f1cf782b0965c2f4ca8e9932790c6329/0_0_3780_3024/500.jpg",
    "summary": "The resignation of the deputy prime minister marks a dignified end to her tenure. However, the ensuing contest to find her replacement risks rekindling existing divisions within the Labour party. This situation highlights ongoing tensions as the party navigates its future direction.",
    "published": "2025-09-05T17:20:43Z"
  }
]