[
  {
    "title": "Venezuela v Australia: men’s international football friendly – live",
    "url": "https://www.theguardian.com/football/live/2025/nov/15/venezuela-v-australia-live-updates-scores-socceroos-mens-international-football-friendly",
    "image": "https://media.guim.co.uk/90f63e9355e349583092cc809d5c0c32fc47568b/275_0_2500_2000/500.jpg",
    "summary": "The Socceroos return to the U.S. for friendly matches as part of their preparation for the 2026 World Cup. Updates will be provided by Martin Pegan during the events. Fans can expect insights and highlights from the team's performances.",
    "published": "2025-11-15T04:22:47Z"
  },
  {
    "title": "Australia welcomes Trump’s removal of tariffs on beef and other food imports",
    "url": "https://www.theguardian.com/business/2025/nov/15/australia-welcomes-trumps-removal-of-tariffs-on-beef-and-other-food-imports",
    "image": "https://media.guim.co.uk/437069e3ba323942951482827d954553a926816b/332_0_4494_3597/500.jpg",
    "summary": "Australian Trade Minister Don Farrell asserts that tariffs on Australian products are unwarranted. He emphasizes the government's stance against such trade barriers. Farrell's comments highlight ongoing concerns about the impact of tariffs on trade relations.",
    "published": "2025-11-15T04:18:48Z"
  },
  {
    "title": "Trump turns on former ally Marjorie Taylor Greene as Epstein questions mount – as it happened",
    "url": "https://www.theguardian.com/us-news/live/2025/nov/14/us-politics-latest-news-donald-trump-ice-bishops-jeffrey-epstein",
    "image": "https://media.guim.co.uk/af4fcbd43125341d9a55b3dc26295044fc177b1b/745_0_3990_3193/500.jpg",
    "summary": "The live blog has officially ended, marking the conclusion of its updates. No further information will be posted. Thank you for following along.",
    "published": "2025-11-15T03:07:54Z"
  },
  {
    "title": "Trump ends support for Marjorie Taylor Greene amid growing Epstein feud",
    "url": "https://www.theguardian.com/us-news/2025/nov/14/trump-marjorie-taylor-greene-support",
    "image": "https://media.guim.co.uk/871b1d16fc7a06f87bc0eae30438a5c3ead31ac5/492_0_4917_3935/500.jpg",
    "summary": "President Biden criticized Congresswoman Marjorie Taylor Greene for her \"wacky\" comments regarding the administration's effort to prevent the release of crucial documents related to Jeffrey Epstein. Greene had expressed dissatisfaction with the lack of transparency surrounding the case. The exchange highlights the tensions between the president and some members of Congress over sensitive issues.",
    "published": "2025-11-15T03:02:00Z"
  },
  {
    "title": "Epstein was texting US House member during 2019 hearing with Michael Cohen",
    "url": "https://www.theguardian.com/us-news/2025/nov/14/epstein-texting-house-member-cohen-hearing",
    "image": "https://media.guim.co.uk/39cd81035bc6dbcac187a33f74ccaf982a2305fb/298_0_3004_2404/500.jpg",
    "summary": "Recently uncovered documents indicate that a sex offender had been messaging a lawmaker, potentially affecting the lawmaker's line of questioning. This revelation raises concerns about the integrity of the legislative process. The situation highlights the need for scrutiny regarding interactions between officials and individuals with criminal backgrounds.",
    "published": "2025-11-15T02:39:10Z"
  }
]