[
  {
    "title": "Australia is bringing in ‘world first’ minimum pay for food delivery drivers – here’s how it will work",
    "url": "https://www.theguardian.com/business/2025/nov/25/food-delivery-companies-australian-union-drivers-minimum-pay",
    "image": "https://media.guim.co.uk/b08c2f80d5ee7504b93805cda932ee6594e25005/663_355_5156_4125/500.jpg",
    "summary": "A new agreement has been reached between companies and a union, incorporating an hourly wage increase and accident insurance. However, the deal still needs approval from the industrial umpire. Details of the agreement are still emerging.",
    "published": "2025-11-25T07:13:20Z"
  },
  {
    "title": "Sydney restaurant Cairo Takeaway counter-sues pro-Israel activist, claiming he trespassed to ‘ambush’ staff",
    "url": "https://www.theguardian.com/australia-news/2025/nov/25/sydney-restaurant-cairo-takeaway-counter-sues-pro-israel-activist-claiming-he-trespassed-to-ambush-staff-ntwnfb",
    "image": "https://media.guim.co.uk/a836ff28a4364d808ed0201fa385fe5a49b645e6/212_0_3953_3162/500.jpg",
    "summary": "A Newtown restaurant is counter-suing Ofir Birenbaum after he initiated a defamation lawsuit against them. The eatery denies the allegations and seeks to protect its reputation. This legal dispute highlights ongoing tensions between the two parties.",
    "published": "2025-11-25T07:11:40Z"
  },
  {
    "title": "An uncomfortable truth for our leaders: there’s a limit to how ‘human’ we want you to be | Gaby Hinsliff",
    "url": "https://www.theguardian.com/commentisfree/2025/nov/25/political-leaders-jacinda-ardern-crises-pandemic",
    "image": "https://media.guim.co.uk/03828f3ec1ecffc8fd7665c78b66b1ff5db49a67/16_0_2109_1688/500.jpg",
    "summary": "In a new film, Jacinda Ardern appears in pajamas, making emotional appeals for compassion during crises. Guardian columnist Gaby Hinsliff reflects on the disturbing reality of political fallibility in times of crisis. This juxtaposition highlights the complexities and challenges faced by leaders in addressing urgent issues.",
    "published": "2025-11-25T07:00:27Z"
  },
  {
    "title": "Small print on signs at a tram park and ride hid the fact I could get clamped",
    "url": "https://www.theguardian.com/money/2025/nov/25/small-print-on-signs-at-a-tram-park-and-ride-hid-the-fact-i-could-get-clamped",
    "image": "https://media.guim.co.uk/abe551fbfb83b0060f48ba77ef72c54563dcf636/306_0_3144_2514/500.jpg",
    "summary": "The author received a £140 fine after missing a notice on the back of an entrance sign, despite believing they were following the correct signs. An enforcement officer brought the notice to their attention. The incident highlights the importance of carefully checking all posted information.",
    "published": "2025-11-25T07:00:27Z"
  },
  {
    "title": "What is prostate cancer and how is it diagnosed in the UK?",
    "url": "https://www.theguardian.com/society/2025/nov/25/what-is-prostate-cancer-and-how-is-it-diagnosed-in-the-uk",
    "image": "https://media.guim.co.uk/88b6c93b1e0a9e5612b7d7843d3aca66d9da6dc6/427_0_4267_3413/500.jpg",
    "summary": "David Cameron is undergoing treatment and is advocating for an NHS screening program for the disease. The article discusses the disease's characteristics and the available treatment options. It highlights Cameron's support for improved healthcare measures in response to his own health challenges.",
    "published": "2025-11-25T07:00:27Z"
  }
]