[
  {
    "title": "WTA Finals tennis: Coco Gauff v Jasmine Paolini, Aryna Sabalenka v Jessica Pegula – live",
    "url": "https://www.theguardian.com/sport/live/2025/nov/04/wta-finals-tennis-coco-gauff-v-jasmine-paolini-aryna-sabalenka-v-jessica-pegula-live",
    "image": "https://media.guim.co.uk/0e55be67826e11fe645ee4b5666b5524b5413dce/444_0_3333_2667/500.jpg",
    "summary": "Yara El-Shaboury will cover the latest group-stage matches of the season-ending tournament. Tune in for updates on the teams and players. Don't miss the excitement of this competitive event!",
    "published": "2025-11-04T14:20:24Z"
  },
  {
    "title": "US elections 2025 live: Americans go to the polls, with elections in New York City, New Jersey, Virginia and California",
    "url": "https://www.theguardian.com/us-news/live/2025/nov/04/us-elections-2025-live-new-york-city-new-jersey-virginia-california-latest-news-updates-live",
    "image": "https://media.guim.co.uk/0965b087be591a2ae6e1804d1ce1af3e63bad4df/1131_49_3758_3005/500.jpg",
    "summary": "The New York mayoral race is drawing significant attention both domestically and internationally. Democratic candidate Zohran Mamdani is competing against former Governor Andrew Cuomo and Guardian Angels founder Curtis Sliwa. The outcome could have implications beyond the city's borders, given the high profile of the candidates involved.",
    "published": "2025-11-04T14:18:15Z"
  },
  {
    "title": "Smyth’s Der Wald and Respighi’s Lucrezia review – Wagner’s spirit presides over double bill",
    "url": "https://www.theguardian.com/music/2025/nov/04/smyths-der-wald-and-respighis-lucrezia-review-silk-street-theatre-barbican-london",
    "image": "https://media.guim.co.uk/58a6dac979c5a2eff99d49f36f7446f314edbcda/491_0_3650_2920/500.jpg",
    "summary": "The UK premiered Respighi's 1937 work alongside Ethel Smyth’s intense opera Der Wald. Both pieces were creatively staged by director Stephen Barlow. The performance showcased a blend of unique compositions and theatrical artistry.",
    "published": "2025-11-04T14:14:25Z"
  },
  {
    "title": "Reeves refuses to say she will stick to manifesto pledge on tax rises and insists she must face world ‘as it is’ – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/nov/04/rachel-reeves-speech-tax-budget-labour-keir-starmer-latest-politics-news-live",
    "image": "https://media.guim.co.uk/7ebd2ee66722401ff1d8a55b51fe33ca1c924190/363_0_3411_2729/500.jpg",
    "summary": "In her pre-budget speech, the Chancellor emphasized her commitment to addressing key priorities for the British public. She indicated that tax increases are anticipated as part of the upcoming budget strategy. The speech aims to lay the groundwork for addressing economic challenges while supporting citizens.",
    "published": "2025-11-04T14:13:35Z"
  },
  {
    "title": "Listeria outbreak in pasta meals linked to six deaths across 18 US states",
    "url": "https://www.theguardian.com/us-news/2025/nov/04/listeria-outbreak-deaths-pasta-kroger-trader-joes",
    "image": "https://media.guim.co.uk/cb6f4e183d7ec92df2f328f9c729ade19756c3c7/250_0_2500_2000/500.jpg",
    "summary": "Listeria contamination has been detected in pasta products sold by Trader Joe's, Kroger, and other retailers. The CDC is advising consumers to check their fridges for the affected pasta and to seek medical attention if they experience illness. The situation highlights ongoing food safety concerns.",
    "published": "2025-11-04T14:12:46Z"
  }
]