[
  {
    "title": "Trump’s ‘exciting announcement’ related to the Pentagon, White House says – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/02/congress-returns-government-shutdown-funding-trump-announcement-us-politics-live-latest-updates",
    "image": "https://media.guim.co.uk/934755303f5380d328b0d1d9140a6be39d349d04/317_0_2500_2000/500.jpg",
    "summary": "White House press secretary Karoline Leavitt has indicated that an upcoming announcement will be linked to the Department of Defense. The specifics of the announcement remain unclear at this time. Further details are expected to be revealed soon.",
    "published": "2025-09-02T13:35:53Z"
  },
  {
    "title": "England v South Africa: first men’s one-day international – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/02/england-south-africa-first-mens-odi-cricket-live",
    "image": "https://media.guim.co.uk/7046d9e75a4812bf98a82153944fd6fc1f00e1e1/0_0_3717_2973/500.jpg",
    "summary": "England faced South Africa in the first match of a three-match ODI series at Headingley. The over-by-over report provides live updates and insights on the game. Follow along for detailed commentary and analysis.",
    "published": "2025-09-02T13:35:02Z"
  },
  {
    "title": "Marc Guéhi angry with Crystal Palace’s decision to block move to Liverpool",
    "url": "https://www.theguardian.com/football/2025/sep/02/marc-guehi-angy-with-crystal-palaces-decision-to-block-move-to-liverpool",
    "image": "https://media.guim.co.uk/c8ff71c8d28a91c50500525b6a6bb5ad825239ff/256_0_3500_2799/500.jpg",
    "summary": "Marc Guéhi is dissatisfied with Crystal Palace for halting his £35 million transfer to Liverpool. The decision has left him frustrated, impacting his career ambitions. Guéhi was looking forward to the opportunity at Liverpool but has been left in limbo.",
    "published": "2025-09-02T13:33:34Z"
  },
  {
    "title": "‘We’re here to replace you,’ new Green leader Polanski tells Labour as he terms Starmer’s politics ‘despicable’ – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/02/cooper-reeves-starmer-green-party-leader-badenoch-devolution-latest-updates",
    "image": "https://media.guim.co.uk/6ac2f27cad625f0742832693c50cb9774cf45a06/958_264_6415_5132/500.jpg",
    "summary": "The newly elected leader emphasizes that migrants are essential to the UK and rejects the idea of compromising patriotism to align with figures like Nigel Farage. He positions his party as one that values inclusivity and support for immigrants. The leader's strong stance indicates a commitment to upholding the principles of diversity within national identity.",
    "published": "2025-09-02T13:33:08Z"
  },
  {
    "title": "Depardieu to stand trial over alleged rape and sexual assault of fellow actor",
    "url": "https://www.theguardian.com/film/2025/sep/02/gerard-depardieu-to-stand-trial-over-alleged-sexual-assault-fellow-actor-charlotte-arnould",
    "image": "https://media.guim.co.uk/8645152ecf7185cd8b3f83c5e21adaaddb0697bc/366_0_3661_2929/500.jpg",
    "summary": "A judge has ordered that a legal case proceed against a French film star following allegations made by Charlotte Arnould regarding incidents from 2018. The specifics of the allegations have not been detailed in the report. This development marks a significant step in addressing the claims brought forward by Arnould.",
    "published": "2025-09-02T13:32:26Z"
  }
]