[
  {
    "title": "Tottenham v Arsenal: Women’s Super League – live",
    "url": "https://www.theguardian.com/football/live/2025/nov/16/tottenham-v-arsenal-womens-super-league-live",
    "image": "https://media.guim.co.uk/79649b586d36f37797bd9d67ecade6c14760881d/445_0_4017_3215/500.jpg",
    "summary": "John Brewin provides live updates from the north London derby, offering minute-by-minute reports. Stay tuned for ongoing coverage and key moments from the match. Keep an eye on the developments as the game unfolds.",
    "published": "2025-11-16T15:16:40Z"
  },
  {
    "title": "Zelenskyy pledges to ‘clean up’ Ukraine’s energy sector amid corruption scandal",
    "url": "https://www.theguardian.com/world/2025/nov/16/zelenskyy-pledges-to-clean-up-ukraine-energy-sector-amid-corruption-scandal",
    "image": "https://media.guim.co.uk/f2aed15edbaa911f1f3b69371e9c4fd7482f738b/250_0_2500_2000/500.jpg",
    "summary": "The President has announced plans to restructure state energy companies following allegations of a $100 million kickback scheme uncovered by anti-corruption investigators. This move aims to enhance transparency and accountability within the sector. The investigation points to widespread corruption that has prompted urgent reform measures.",
    "published": "2025-11-16T15:13:40Z"
  },
  {
    "title": "Two-thirds of English councils have not prosecuted a single landlord in past three years",
    "url": "https://www.theguardian.com/money/2025/nov/16/two-thirds-of-english-councils-have-not-prosecuted-a-single-landlord-in-past-three-years",
    "image": "https://media.guim.co.uk/7871a884d03003e1eff709c0eebde466827a38fd/4_41_3128_2502/500.jpg",
    "summary": "Despite receiving 300,000 complaints about unsafe living conditions, councils have only prosecuted 64 landlords. This disparity highlights significant gaps in enforcement against landlords who fail to maintain proper housing standards. The situation raises concerns about tenant protections and the effectiveness of housing regulations.",
    "published": "2025-11-16T15:12:05Z"
  },
  {
    "title": "Saturday Night Live: Glen Powell’s debut as host is dominated by Epstein ",
    "url": "https://www.theguardian.com/tv-and-radio/2025/nov/16/saturday-night-live-glen-powell-host",
    "image": "https://media.guim.co.uk/bab770979d4fad1b6558e6bf2827524aeeb37273/276_0_2500_2000/500.jpg",
    "summary": "In a recent episode featuring the star of \"Chad Powers\" and \"The Running Man,\" viewers were treated to a lively emcee. The show included several entertaining skits centered around the week's major scandal. The combination of humor and charm kept audiences engaged throughout.",
    "published": "2025-11-16T15:09:59Z"
  },
  {
    "title": "Five people killed and three injured in car crash in County Louth, Ireland",
    "url": "https://www.theguardian.com/world/2025/nov/16/people-killed-injured-car-crash-county-louth-ireland",
    "image": "https://media.guim.co.uk/042d6d7ae3e7ab61a81b9aac4ced1af77c3cd30d/55_0_4847_3880/500.jpg",
    "summary": "Gardaí are seeking witnesses to a two-vehicle collision that occurred on Saturday. Simon Harris, in response to the incident, paid tribute to the first responders who attended the scene. The appeal aims to gather more information regarding the circumstances of the crash.",
    "published": "2025-11-16T15:03:20Z"
  }
]