[
  {
    "title": "Trump justice department seeks 2020 election records from Georgia county",
    "url": "https://www.theguardian.com/us-news/2025/oct/31/trump-georgia-2020-election-records",
    "image": "https://media.guim.co.uk/a4f3df85990b7ec4081507632a72cd5a8a1bde5c/375_0_3750_3000/500.jpg",
    "summary": "Fulton County officials have received a request aimed at reviving former President Trump's false claims regarding the 2020 election results. This move highlights ongoing efforts to perpetuate misinformation despite the election outcome being verified. The situation reflects the persistence of election-related conspiracy theories in political discourse.",
    "published": "2025-10-31T21:04:03Z"
  },
  {
    "title": "Breeders’ Cup 2025 horse racing: day one – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/31/breeders-cup-2025-horse-racing-day-one-live",
    "image": "https://media.guim.co.uk/4664dd1a030035c51b52469ca4c2d4759b1bef5c/407_0_3676_2942/500.jpg",
    "summary": "Greg Wood provides updates on a major horse racing event in California, highlighting its significance in the racing calendar. The event is known for its prestige and draws attention from fans and participants alike. Stay tuned for insights and developments throughout the competition.",
    "published": "2025-10-31T21:03:00Z"
  },
  {
    "title": "Senate declines to halt plan to kill off half-million barred owls by Fish and Wildlife Service",
    "url": "https://www.theguardian.com/us-news/2025/oct/31/senate-barred-northern-spotted-owls",
    "image": "https://media.guim.co.uk/d47214da33b16f1c8c2f333a31284886f97f94c9/350_0_3500_2800/500.jpg",
    "summary": "Northern spotted owls are facing a decline due to the westward expansion of the larger barred owls. This invasive species competes for resources and habitat, threatening the survival of the native northern spotted owl. Conservation efforts are needed to address this ecological imbalance.",
    "published": "2025-10-31T21:01:47Z"
  },
  {
    "title": "Corrections and clarifications",
    "url": "https://www.theguardian.com/news/2025/oct/31/corrections-and-clarifications",
    "summary": "Mikey Lewis has drawn attention for his connection to the Ruth Ellis case, a notable historical criminal case in the UK. The case led to significant discussions about capital punishment and justice. Additionally, Quick crossword no. 17,309 features clues related to this subject.",
    "published": "2025-10-31T21:00:15Z"
  },
  {
    "title": "Five Great Reads: the ‘good guy’ behind Wikipedia, the lost art of flirting, and a war photographer’s greatest shots",
    "url": "https://www.theguardian.com/australia-news/2025/nov/01/five-great-reads-the-good-guy-behind-wikipedia-the-lost-art-of-flirting-and-a-war-photographers-greatest-shots",
    "image": "https://media.guim.co.uk/465c35da488d6f5fadffeff198b6a0639e5b40a8/0_0_5808_4647/500.jpg",
    "summary": "Guardian Australia highlights key stories from the past week, as curated by Kris Swales. The wrap features essential reads that cover significant events and developments across various topics. Stay informed with a concise overview of the most impactful news.",
    "published": "2025-10-31T21:00:15Z"
  }
]