[
  {
    "title": "WTA Finals tennis: Rybakina beats Swiatek; Anisimova v Keys to come – live",
    "url": "https://www.theguardian.com/sport/live/2025/nov/03/wta-finals-swiatek-v-rybakina-anisimova-v-keys-live",
    "image": "https://media.guim.co.uk/b4a15b5bac1c49327263c786689622dae8edd3e4/0_370_2281_1825/500.jpg",
    "summary": "Daniel Harris will provide updates from the season-ending tournament taking place in Saudi Arabia. Fans can expect insights and highlights as the event unfolds. Stay tuned for live coverage and analysis.",
    "published": "2025-11-03T16:21:29Z"
  },
  {
    "title": "Two girls injured in fall from ferris wheel at Louisiana fairground",
    "url": "https://www.theguardian.com/us-news/2025/nov/03/two-girls-injured-fall-ferris-wheel",
    "image": "https://media.guim.co.uk/a1bd0c62a2a9e14c2be170ad14319c997d8c3d58/480_0_4800_3840/500.jpg",
    "summary": "A pair of individuals were thrown to the ground when the bucket they were seated in unexpectedly overturned. The incident caused them to fall, resulting in potential injuries. Further details about the circumstances surrounding the event are not yet reported.",
    "published": "2025-11-03T16:20:52Z"
  },
  {
    "title": "Israel top military lawyer arrested after she admitted leaking video of soldiers’ abuse",
    "url": "https://www.theguardian.com/world/2025/nov/03/israels-top-military-lawyer-arrested-after-she-admitted-leaking-video-of-soldiers-abuse",
    "image": "https://media.guim.co.uk/87104051ccb681e949d116eaa1c3f4635e03244f/1073_0_5398_4318/500.jpg",
    "summary": "Rightwing politicians and pundits have praised soldiers involved in the attack on a Palestinian detainee, labeling them as \"heroes.\" In contrast, they have criticized military investigators as \"traitors\" for their scrutiny of the incident. This division highlights the contentious debate surrounding the military's actions and accountability.",
    "published": "2025-11-03T16:20:52Z"
  },
  {
    "title": "Farage accused of betraying pensioners after triple lock hint in speech Tories say was rambling and incoherent – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/nov/03/nigel-farage-reform-speech-labour-conservatives-politics-live-latest-updates",
    "image": "https://media.guim.co.uk/87242bb4df31cdef46cbce71b10ac05b15972b5a/1337_1301_3038_2430/500.jpg",
    "summary": "The leader of a reform movement has declined to guarantee the continuation of a mechanism that assures regular pensions increases. This decision raises concerns among pensioners about the stability of their financial support. The stance could significantly impact future pension policies and beneficiaries' well-being.",
    "published": "2025-11-03T16:20:27Z"
  },
  {
    "title": "House speaker says emergency Snap food aid funding not easy to do as millions lose benefit while shutdown drags on – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/nov/03/us-government-shutdown-donald-trump-latest-politics-news",
    "image": "https://media.guim.co.uk/ea942d13c47b91ed6f2485b6f0310cc2c7334b79/484_0_6345_5076/500.jpg",
    "summary": "Mike Johnson defended his inaction regarding a judge's order to use contingency funds for Snap recipients as the U.S. government shutdown approaches a record duration. The lack of funding for these programs has raised concerns among lawmakers and citizens alike. The ongoing stalemate highlights the increasing challenges faced by the government in addressing essential services during the shutdown.",
    "published": "2025-11-03T16:20:23Z"
  }
]