[
  {
    "title": "France v South Africa: Women’s Rugby World Cup – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/07/france-v-south-africa-womens-rugby-world-cup-live",
    "image": "https://media.guim.co.uk/e1dee9b686a17221f6f3cec97ad7ed19c78d564c/455_0_4542_3634/500.jpg",
    "summary": "France and South Africa have both secured their spots in the quarterfinals of the tournament. The competition now intensifies as they vie for the top position in Pool D. Daniel Gallan will provide insights and updates on this gripping matchup.",
    "published": "2025-09-07T16:36:24Z"
  },
  {
    "title": "As home secretary, Shabana Mahmood will face enormous challenges",
    "url": "https://www.theguardian.com/politics/2025/sep/07/as-home-secretary-shabana-mahmood-will-face-enormous-challenges",
    "image": "https://media.guim.co.uk/e4fcbc2c8f8c7f9bcec60826e27b64807d6e5d58/669_0_6707_5366/500.jpg",
    "summary": "Reform is capitalizing on existing societal tensions, particularly around immigration issues. Mahmood is faced with the challenge of addressing public frustration related to these concerns. Effective communication and policy solutions will be crucial for him moving forward.",
    "published": "2025-09-07T16:36:12Z"
  },
  {
    "title": "England beat South Africa by 342 runs for biggest winning margin in men’s ODI history – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/07/england-v-south-africa-third-mens-one-day-international-live",
    "image": "https://media.guim.co.uk/2146f4108eb84b8eb96b1af226440ab873b28295/188_0_2553_2042/500.jpg",
    "summary": "South Africa has secured victory in the three-match ODI series against England. The final match will take place at the Utilita Bowl. Fans are eager to see if England can redeem themselves in this final game.",
    "published": "2025-09-07T16:35:12Z"
  },
  {
    "title": "Shabana Mahmood to host Five Eyes meeting on people-smuggling",
    "url": "https://www.theguardian.com/politics/2025/sep/07/military-sites-house-asylum-seekers-labour",
    "image": "https://media.guim.co.uk/d35e86228f6da2ccef20e9e5bd8b8356367369da/1807_222_1213_970/500.jpg",
    "summary": "The new Home Secretary will meet with counterparts from the US, Australia, Canada, and New Zealand in London. This gathering highlights collaboration and discussions on key issues among these countries. The meeting aims to strengthen international partnerships in areas of shared concern.",
    "published": "2025-09-07T16:23:50Z"
  },
  {
    "title": "John Bibby obituary",
    "url": "https://www.theguardian.com/education/2025/sep/07/john-bibby-obituary",
    "image": "https://media.guim.co.uk/a3cdf2c9d74e60d1489a794641855a904ca930ff/0_15_1045_836/500.jpg",
    "summary": "A university lecturer in statistics, known for publishing educational books, focused on making math learning enjoyable. His innovative approach aimed to engage students and enhance their understanding of the subject. His contributions have left a lasting impact on math education.",
    "published": "2025-09-07T16:23:39Z"
  }
]