[
  {
    "title": "Australia politics live: ‘I have not seen a good fascist yet’, Husic says after PM’s remark that ‘good people’ attended anti-immigration rallies",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/03/australia-politics-live-labor-coalition-greens-anthony-albanese-sussan-ley-question-time-nauru-immigration-asylum-ntwnfb",
    "image": "https://media.guim.co.uk/2f2f58e42bd5e4701df1b697f3a8fabbd10e8bcf/2217_892_3138_2512/500.jpg",
    "summary": "Please provide the news article or details you would like me to summarize.",
    "published": "2025-09-03T07:25:51Z"
  },
  {
    "title": "Gaza is becoming ‘graveyard of international humanitarian law’, says Unrwa boss – Middle East crisis live",
    "url": "https://www.theguardian.com/world/live/2025/sep/03/gaza-graveyard-international-humanitarian-law-unrwa-israel-middle-east-crisis-latest-updates-news",
    "image": "https://media.guim.co.uk/9501ef62e035f4fe4233e091a9265ecc8af5446a/247_0_2891_2312/500.jpg",
    "summary": "Philippe Lazzarini, the head of UNRWA, has warned for months about the escalating famine and violence in Gaza, highlighting a critical humanitarian crisis. He criticized the blatant disregard for international law amidst the ongoing situation. Lazzarini's remarks emphasize the urgent need for attention and action to address the worsening conditions in the region.",
    "published": "2025-09-03T07:17:13Z"
  },
  {
    "title": "Labor caves to pressure to bring forward funding for 20,000 in-home aged care places",
    "url": "https://www.theguardian.com/australia-news/2025/sep/03/labor-caves-to-pressure-to-bring-forward-funding-for-20000-in-home-aged-care-places",
    "image": "https://media.guim.co.uk/676298632719bfebfc6b1012f62b0c07b6c2208e/197_0_3071_2457/500.jpg",
    "summary": "The Albanese government postponed the implementation of a new system earlier this year, which has left over 87,000 approved individuals waiting. The delay has raised concerns about the efficiency and effectiveness of the government's processes. The decision highlights ongoing challenges in managing approved applications and addressing backlog issues.",
    "published": "2025-09-03T07:10:52Z"
  },
  {
    "title": "UK politicians must stop stoking division, says policing chief",
    "url": "https://www.theguardian.com/uk-news/2025/sep/03/uk-politicians-must-stop-stoking-division-says-policing-chief",
    "image": "https://media.guim.co.uk/5a687f4cf00a2538f35c6b1f777b032ae976144a/45_0_2500_2000/500.jpg",
    "summary": "Gavin Stephens has highlighted that disputes regarding asylum seekers have escalated community tensions. He noted that these conflicts are also placing increased pressure on law enforcement officers. The situation reflects broader societal challenges related to immigration and public safety.",
    "published": "2025-09-03T07:10:27Z"
  },
  {
    "title": "Global bond sell-off hits Japan’s government debt; pound falls again – business live",
    "url": "https://www.theguardian.com/business/live/2025/sep/03/global-bond-sell-off-japan-government-debt-uk-us-eurozone-pound-falls-business-live-news-updates",
    "image": "https://media.guim.co.uk/33043e635ce2b16bdd760078e1df4511ce16a2d7/500_0_5000_4002/500.jpg",
    "summary": "The latest economic and financial news highlights significant developments in markets, including fluctuations in stock prices and changes in interest rates. Experts are analyzing data to forecast future trends and potential impacts on global economies. Ongoing coverage will provide updates on key economic indicators and financial performance.",
    "published": "2025-09-03T07:02:19Z"
  }
]