[
  {
    "title": "New Zealand v Australia: international men’s football friendly – live",
    "url": "https://www.theguardian.com/football/live/2025/sep/09/australia-socceroos-vs-new-zealand-all-whites-game-two-live-updates-international-football-friendly-latest",
    "image": "https://media.guim.co.uk/d7f1575ef03e70498d9e8963287312c7cbdcc054/0_26_2702_2162/500.jpg",
    "summary": "The Socceroos and All Whites face off again in the 'Soccer Ashes' series, marking their second match within a week. Martin Pegan provides live updates on the game. Fans can follow the developments minute by minute.",
    "published": "2025-09-09T06:51:13Z"
  },
  {
    "title": "Australia news live: David Pocock urges ANU council to ‘get on with it’ and change leadership",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/09/australia-news-live-anthony-albanese-vanuatu-china-pacific-forum-murray-watt-nature-protection-laws-ntwnfb",
    "image": "https://media.guim.co.uk/7648ea539de2e6dce3db8395ed28d59f773d65d9/503_0_6215_4972/500.jpg",
    "summary": "I apologize, but I cannot follow online news or content in real-time. If you provide the details or content of the news article, I can help summarize it for you!",
    "published": "2025-09-09T06:51:06Z"
  },
  {
    "title": "Anglo American agrees mining mega merger; Londoners face commuting struggles as tube strike enters second day – business live",
    "url": "https://www.theguardian.com/business/live/2025/sep/09/anglo-mining-mega-merger-londoners-commuting-struggles-tube-strike-second-day-business-live",
    "image": "https://media.guim.co.uk/0f9e2319cb4a332a06ce7286b1ad347dd702ad5a/291_0_3487_2790/500.jpg",
    "summary": "Anglo American's $20 billion acquisition of Canada's Teck Resources has sparked concerns about potential job cuts. Analysts worry that the merger may lead to redundancies as the companies consolidate operations. The deal aims to strengthen Anglo's position in the mining sector, but the impact on employment remains uncertain.",
    "published": "2025-09-09T06:50:15Z"
  },
  {
    "title": "Israel issues large-scale evacuation order for Gaza City ahead of expanded offensive – Middle East crisis live",
    "url": "https://www.theguardian.com/world/live/2025/sep/09/israel-gaza-city-evacuation-order-idf-military-offensive-live-updates-middle-east-crisis-latest-news",
    "image": "https://media.guim.co.uk/3d115650717b60c240af2240ce662759f443a7a3/172_0_4816_3851/500.jpg",
    "summary": "Israeli Prime Minister Benjamin Netanyahu urged residents of Gaza City to evacuate as the country prepared to intensify airstrikes. This warning came amidst escalating tensions and military actions in the region. The announcement reflects Israel's ongoing response to the conflict.",
    "published": "2025-09-09T06:39:44Z"
  },
  {
    "title": "Victoria has tabled treaty legislation in an Australian first. Here’s what you need to know about the bill",
    "url": "https://www.theguardian.com/australia-news/2025/sep/09/victoria-treaty-traditional-owners-aboriginal-truth-telling-indigenous-legislation-parliament",
    "image": "https://media.guim.co.uk/e44431daa513b3e266f53300f31db1840a63ec39/0_0_6193_4954/500.jpg",
    "summary": "A statewide treaty bill aims to implement measures enhancing Aboriginal education, including truth-telling initiatives in the school curriculum. The bill will also promote the incorporation of traditional names across various contexts. This initiative seeks to foster reconciliation and recognition of Indigenous culture and history.",
    "published": "2025-09-09T06:12:22Z"
  }
]