[
  {
    "title": "US Open tennis 2025: Sinner in action, Gauff and Osaka advance on day seven – live",
    "url": "https://www.theguardian.com/sport/live/2025/aug/30/us-open-tennis-2025-gauff-sinner-osaka-day-seven-live",
    "image": "https://media.guim.co.uk/27433d207bbb142fbe68facebccd613f5f2d7d11/351_91_4052_3242/500.jpg",
    "summary": "Katy Murrells is providing live updates from the third round of the tennis tournament at Flushing Meadows. Follow her coverage for the latest match highlights and player performances. Stay tuned for real-time information on the event.",
    "published": "2025-08-30T20:29:35Z"
  },
  {
    "title": "USA 31-31 Australia: 2025 Women’s Rugby World Cup – live reaction",
    "url": "https://www.theguardian.com/sport/live/2025/aug/30/usa-v-australia-live-2025-womens-rugby-world-cup-wallaroos-eagles-usa-vs-aus-latest-score-updates",
    "image": "https://media.guim.co.uk/6530e1e1ccef0046ea3776de8c691dcb735f39a7/876_0_4489_3592/500.jpg",
    "summary": "A closely contested match in York concludes with no winner, highlighting the intensity of the game. Daniel Gallan will provide post-match reactions and insights. Fans are left eagerly discussing the highlights and key moments from the event.",
    "published": "2025-08-30T20:24:00Z"
  },
  {
    "title": "Joy for Samoa as Harmony Vatau kicks their first World Cup points for 11 years",
    "url": "https://www.theguardian.com/sport/2025/aug/30/joy-for-samoa-as-harmony-vatau-kicks-their-first-world-cup-points-for-11-years",
    "image": "https://media.guim.co.uk/41893f386ae19c848fbd7bf76dca976d6d5146e3/480_116_1857_1485/500.jpg",
    "summary": "Despite being cash-strapped and facing numerous challenges, the nation managed to reach England. The successful penalty by their fly half, even amidst a heavy defeat to the Red Roses, made their sacrifices feel worthwhile. This moment highlights the resilience and determination of the team.",
    "published": "2025-08-30T20:06:17Z"
  },
  {
    "title": "John Mitchell demands England improve despite record World Cup win over Samoa",
    "url": "https://www.theguardian.com/sport/2025/aug/30/john-mitchell-demands-england-improve-basics-despite-record-world-cup-win-over-samoa",
    "image": "https://media.guim.co.uk/e690f17a1257a497bfb307b9f912175db65c9679/1000_0_5000_4000/500.jpg",
    "summary": "England achieved a record victory over Samoa in the Rugby World Cup, showcasing their strength on the field. However, head coach John Mitchell criticized the team for faltering on basic skills at times. Despite the win, there is room for improvement as they move forward in the tournament.",
    "published": "2025-08-30T20:02:35Z"
  },
  {
    "title": "‘It’s only going to get bigger’: Australia embraces the Japanese game that turns rubbish into sport",
    "url": "https://www.theguardian.com/sport/2025/aug/31/its-only-going-to-get-bigger-australia-embraces-the-japanese-game-that-turns-rubbish-into-sport",
    "image": "https://media.guim.co.uk/33e0a98c9dd0d04a6a40e1832296496671a69d8a/167_0_2268_1814/500.jpg",
    "summary": "Australia hosted its World Cup \"spogomi\" qualifier in Manly, an event aimed at raising environmental awareness through a fun and engaging competition. Participants collected litter from local beaches while competing in a friendly sporting atmosphere. The event emphasizes the importance of environmental stewardship and community involvement.",
    "published": "2025-08-30T20:00:12Z"
  }
]