[
  {
    "title": "Trump press secretary denies president is weaponizing justice department and dodges question on autism announcement – live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/22/donald-trump-charlie-kirk-autism-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/2634bbbbf1bb558047074a6df983813ba889847a/538_0_4501_3601/500.jpg",
    "summary": "Karoline Leavitt accuses the media of 'gaslighting' regarding coverage of a pressure campaign. She avoids answering questions about an anticipated announcement related to acetaminophen. Leavitt's statements highlight concerns over media narratives and their impact on public perception.",
    "published": "2025-09-22T19:23:57Z"
  },
  {
    "title": "Ballon d’Or 2025: who will be voted the best men’s and women’s footballers? – live",
    "url": "https://www.theguardian.com/football/live/2025/sep/22/ballon-dor-2025-who-will-be-voted-the-best-male-and-female-footballers-live",
    "image": "https://media.guim.co.uk/74b7553d51f62743bf77d077cc73e707ead30131/534_0_4833_3866/500.jpg",
    "summary": "A rolling report is underway to determine the best men's and women's footballers in the world. Michael Butler is providing updates as the voting takes place. Stay tuned to find out the winners.",
    "published": "2025-09-22T19:23:49Z"
  },
  {
    "title": "Trump to meet with world leaders at UN general assembly as summit focuses on two-state solution – Middle East crisis live",
    "url": "https://www.theguardian.com/world/live/2025/sep/22/palestinian-state-gaza-israel-middle-east-hamas-benjamin-netanyahu-latest-live-updates",
    "image": "https://media.guim.co.uk/b3e994dcbc1989bd01ae3af5616680d9708aaf72/11_0_4458_3566/500.jpg",
    "summary": "Donald Trump is scheduled to address the UN General Assembly in New York on Tuesday. During the visit, he will engage in crucial meetings with leaders from Ukraine, the European Union, and various Middle Eastern countries. The discussions are expected to focus on key international issues and collaborations.",
    "published": "2025-09-22T19:23:16Z"
  },
  {
    "title": "Exits of Lewis and Levy will mean less ‘banging on the table’ at Premier League meetings",
    "url": "https://www.theguardian.com/football/2025/sep/22/premier-league-meetings-tim-lewis-daniel-levy",
    "image": "https://media.guim.co.uk/8bcb65c539f3c3adc59b3fea46728014f3adddc7/0_0_5000_4000/500.jpg",
    "summary": "North London's recent boardroom reshuffles aim to foster a more collaborative atmosphere during meetings. This change is expected to promote teamwork and improved decision-making among leaders. For the time being, these adjustments are anticipated to enhance the overall dynamics within the organization.",
    "published": "2025-09-22T19:00:26Z"
  },
  {
    "title": "Fresh approaches needed to tackle political ‘age of rage’, US study suggests",
    "url": "https://www.theguardian.com/science/2025/sep/22/fresh-approaches-needed-to-tackle-political-age-of-rage-us-study-suggests",
    "image": "https://media.guim.co.uk/8b24973a95fda206c536830501d0e5b22fd41e68/376_0_4048_3239/500.jpg",
    "summary": "Researchers found that interventions aimed at reducing hostility have only a short-term effect and do not provide a permanent solution. Their study highlights the complexity of addressing deep-seated hostility issues. There is no \"magical fix\" for long-term change in aggressiveness.",
    "published": "2025-09-22T19:00:26Z"
  }
]