[
  {
    "title": "Australia news live: Greens candidate Asta Hill elected Alice Springs mayor; police investigate Melbourne CBD shooting",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/07/australia-news-live-melbourne-stabbing-nsw-koala-national-park-logging-anthony-albanese-sussan-ley-immigration-ntwnfb",
    "image": "https://media.guim.co.uk/7b1f0f867ac0344ee64782d2b6746a18d93d29ec/495_0_4950_3962/500.jpg",
    "summary": "I'm sorry, but I need more context or the specific news article you'd like me to summarize. Please provide the details, and I'll be happy to help!",
    "published": "2025-09-07T04:15:22Z"
  },
  {
    "title": "Is anything more awkward - and potentially insulting - than giving up your seat on public transport? | Polly Hudson",
    "url": "https://www.theguardian.com/commentisfree/2025/sep/07/is-anything-more-awkward-and-potentially-insulting-than-giving-up-your-seat-on-public-transport",
    "image": "https://media.guim.co.uk/b8894c729dda430bee28e38bf29ae45862d85610/24_0_6827_5464/500.jpg",
    "summary": "Actress Celia Imrie expressed surprise at being left standing during a lengthy train trip, highlighting the complexities of seat-offering etiquette. Writer Polly Hudson reflects on the unwritten rules governing this social norm. The situation raises questions about courtesy and social expectations in public transportation.",
    "published": "2025-09-07T04:00:10Z"
  },
  {
    "title": "Roman Abramovich under investigation in Jersey over corruption and money-laundering claims ",
    "url": "https://www.theguardian.com/world/2025/sep/07/roman-abramovich-under-investigation-jersey-corruption-money-laundering-claims",
    "image": "https://media.guim.co.uk/2e02e8c0c44f2777da1bdecefcc2b9f3f00a24d8/432_0_4320_3456/500.jpg",
    "summary": "Swiss bank account data will be shared with the chief legal adviser of an island jurisdiction investigating the origin of former Chelsea FC owner Roman Abramovich's Sibneft billions. This move aims to aid in probing the financial background of Abramovich's wealth. The disclosure comes amid increasing scrutiny over the source of large assets owned by prominent figures.",
    "published": "2025-09-07T04:00:10Z"
  },
  {
    "title": "‘We have the people’: Bernie Sanders campaigns with Zohran Mamdani as New York mayoral race enters final stretch",
    "url": "https://www.theguardian.com/us-news/2025/sep/07/we-have-the-people-bernie-sanders-campaigns-with-zohran-mamdani-as-new-york-mayoral-race-enters-final-stretch",
    "image": "https://media.guim.co.uk/22f478f45dbe503ab71c2227e53d49245bf42501/400_0_3984_3189/500.jpg",
    "summary": "A pair received enthusiastic applause during a town hall event in Brooklyn, part of a senator's \"Fighting Oligarchy\" tour. The senator's tour aims to address issues related to economic inequality and political influence. The event highlighted growing public support for initiatives aimed at combating oligarchic power.",
    "published": "2025-09-07T03:48:53Z"
  },
  {
    "title": "Mexican festivals in Chicago canceled amid Trump plans to deploy troops",
    "url": "https://www.theguardian.com/us-news/2025/sep/06/chicago-mexican-independence-day-trump",
    "image": "https://media.guim.co.uk/482b77e6fc7a9135dbb93d47e522e0ccfbd3acd1/293_0_2915_2333/500.jpg",
    "summary": "Cities and suburbs have canceled local events scheduled for Mexican Independence Day on September 16 due to various concerns. The decision impacts celebrations that honor the cultural significance of the holiday. Organizers are assessing the situation and exploring future opportunities for celebration.",
    "published": "2025-09-07T02:37:01Z"
  }
]