[
  {
    "title": "French parliament set for no-confidence votes – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/oct/16/france-no-confidence-debate-lecornu-macron-europe-live-news-updates",
    "image": "https://media.guim.co.uk/6ebcfb54773dcca0410de3f0f506e2b1450f689e/86_0_4079_3263/500.jpg",
    "summary": "Lecornu is expected to retain his position despite postponing proposed pension reforms. The decision has created a narrow margin for political stability. Tensions remain high as the government navigates its next steps.",
    "published": "2025-10-16T07:17:19Z"
  },
  {
    "title": "Proposed UK cuts to global aid fund could lead to 300,000 preventable deaths, say charities",
    "url": "https://www.theguardian.com/politics/2025/oct/16/proposed-uk-cuts-global-aid-fund-preventable-deaths-charities",
    "image": "https://media.guim.co.uk/0be3310af5d4efaeacf93d8911b0c9530bb566cf/0_0_4589_3670/500.jpg",
    "summary": "An exclusive report indicates that a significant 20% reduction in funding for AIDS, tuberculosis, and malaria is expected to be announced next month. This cut could impact global health initiatives aimed at combating these diseases. The reduction highlights ongoing budgetary challenges faced by international health organizations.",
    "published": "2025-10-16T07:16:04Z"
  },
  {
    "title": "Gaza ceasefire live: Hamas says it has returned all hostage bodies it can reach for now",
    "url": "https://www.theguardian.com/world/live/2025/oct/16/gaza-ceasefire-israel-hamas-palestine-rafah-hostages-live-news-updates",
    "image": "https://media.guim.co.uk/858fe899e1bcea685c54f64b3eef04136435f2e7/164_0_5558_4449/500.jpg",
    "summary": "A militant group has stated that it is unable to recover additional remains from the ruins in Gaza due to a lack of specialized equipment. They emphasized the challenges faced in the recovery efforts. The situation highlights the ongoing difficulties in the region following recent conflicts.",
    "published": "2025-10-16T07:06:48Z"
  },
  {
    "title": "UK economy posts ‘meagre’ 0.1% growth in August as ‘pre-budget funk’ hits services sector – business live",
    "url": "https://www.theguardian.com/business/live/2025/oct/16/uk-gdp-economy-growth-august-reeves-budget-imf-business-live-news",
    "image": "https://media.guim.co.uk/3df5fa4052482e1c83201e3032cc527c81737fbd/436_0_5081_4066/500.jpg",
    "summary": "The latest economic news features rolling coverage of the UK growth report, revealing key insights into the country's financial performance. Analysts are closely monitoring indicators of economic recovery and potential challenges ahead. The updates reflect ongoing concerns about inflation and its impact on growth.",
    "published": "2025-10-16T07:05:29Z"
  },
  {
    "title": "‘Damning’ review of anti-Black racism within Met police ‘buried’ by force",
    "url": "https://www.theguardian.com/uk-news/2025/oct/16/review-anti-black-racism-metropolitan-police-force-london",
    "image": "https://media.guim.co.uk/4fca3e8c9f622c97fc19b4392a2f945a1035bbc7/207_1216_2959_2367/500.jpg",
    "summary": "An external consultancy report revealed systemic discrimination ingrained in the HR systems of London's police force. The findings highlight significant issues regarding diversity and fairness within the organization. The report calls for urgent reforms to address these biases and improve workplace equality.",
    "published": "2025-10-16T07:00:03Z"
  }
]