[
  {
    "title": "Brisbane battered by ‘giant hail’ as severe thunderstorms leave thousands in Queensland with power outages",
    "url": "https://www.theguardian.com/australia-news/2025/nov/24/brisbane-storms-giant-hail-severe-thunderstorms-power-outages",
    "image": "https://media.guim.co.uk/97dbe78d69ec0803943db5befc6e3f9e757d292a/0_352_1080_864/500.jpg",
    "summary": "The Bureau of Meteorology has issued a warning for potential \"damaging to destructive winds\" as storms are expected to move across the state. Residents are advised to prepare for severe weather conditions. The forecast highlights the need for caution during this storm event.",
    "published": "2025-11-24T09:17:20Z"
  },
  {
    "title": "Ukraine working with US on ‘compromises that strengthen us’, says Zelenskyy – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/nov/24/ukraine-russia-war-peace-talks-europe-us-trump-germany-latest-updates",
    "image": "https://media.guim.co.uk/d72d9ae86fb81986c501107d8a50b1ae102b65ca/385_231_2211_1769/500.jpg",
    "summary": "The U.S. and Ukraine announced an \"updated framework\" for a peace plan following discussions in Geneva over the weekend. The new proposals aim to address ongoing conflicts and enhance diplomatic efforts. Both countries emphasized the importance of continued collaboration for achieving stability in the region.",
    "published": "2025-11-24T09:05:47Z"
  },
  {
    "title": "Hardcore band Speed wins inaugural $80,000 New South Wales Music prize",
    "url": "https://www.theguardian.com/music/2025/nov/24/hardcore-band-speed-wins-inaugural-80000-new-south-wales-music-prize",
    "image": "https://media.guim.co.uk/296ef527445180a0096aa387f63726c4dc9f0bd1/106_0_1000_800/500.jpg",
    "summary": "Sydney band, along with Ninajirachi and rapper Barkaa, have received new awards from the state government designed to bolster local musicians in the face of international competition. These initiatives aim to promote and support homegrown talent in the music industry. The recognition highlights the importance of nurturing local artists.",
    "published": "2025-11-24T09:00:34Z"
  },
  {
    "title": "Search is on for the German hairy snail in London",
    "url": "https://www.theguardian.com/environment/2025/nov/24/search-for-german-hairy-snail-in-london",
    "image": "https://media.guim.co.uk/ee819d193f070adfbe5a718b4c4453912bcf32b0/350_518_4114_3291/500.jpg",
    "summary": "Conchologists and citizen scientists have joined forces to search for endangered mollusc species in the River Thames. This collaboration aims to monitor and protect the biodiversity of the river's ecosystem. Their efforts highlight the importance of citizen involvement in conservation initiatives.",
    "published": "2025-11-24T09:00:33Z"
  },
  {
    "title": "Desperate Journey review – Nazi-fleeing Jewish boy heads for the glamour of wartime Paris",
    "url": "https://www.theguardian.com/film/2025/nov/24/desperate-journey-review-annabel-jankel",
    "image": "https://media.guim.co.uk/b83378f2ddf9fcc38712f58e30d945e48c2814c4/1230_0_5807_4650/500.jpg",
    "summary": "In a 1930s-set drama inspired by true events, a young Austrian Jew seeks refuge in the vibrant nightclub scene as he tries to evade persecution. The story draws on the experiences of many Jews in exile across Europe during this tumultuous era. It reflects the struggles and resilience of those living in the shadows during a time of great danger.",
    "published": "2025-11-24T09:00:33Z"
  }
]