[
  {
    "title": "Liz Truss warns there is ‘a reckoning coming’ for central banks, and backs Trump in battle with Fed – business live",
    "url": "https://www.theguardian.com/business/live/2025/aug/28/tesla-sales-fall-across-europe-byd-bond-market-shares-ftse-business-live-news-updates",
    "image": "https://media.guim.co.uk/cfdb5cc7bda6dc4d6aea2245075bdbf20e3d9fad/484_0_4840_3872/500.jpg",
    "summary": "Former Prime Minister critiques the Bank of England, warning that the UK is entering an \"economic doom loop.\" The remarks come amid ongoing rolling coverage of pressing economic and financial news. Concerns over the country's financial stability continue to grow as debates intensify.",
    "published": "2025-08-28T11:26:51Z"
  },
  {
    "title": "Russia claims it is still interested in peace despite hitting British Council and EU offices in deadly strikes on Kyiv - Europe live",
    "url": "https://www.theguardian.com/world/live/2025/aug/28/ukraine-kyiv-strike-russia-europe-zelenskyy-putin-updates-live-news-latest",
    "image": "https://media.guim.co.uk/73f3dc40757f1c02fa6275f97f063d845d9d9749/184_0_1778_1422/500.jpg",
    "summary": "An overnight raid resulted in the deaths of at least 14 people, prompting European leaders to denounce the attack as a \"deliberate\" targeting of civilians and institutions. The incident has raised international concerns over escalating violence and the protection of human rights. Calls for accountability and an investigation into the attack have intensified among global powers.",
    "published": "2025-08-28T11:23:16Z"
  },
  {
    "title": "Minister refuses to deny reports Rachel Reeves considering tax increase for landlords in budget – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/aug/28/latest-uk-politics-news-keir-starmer-rachel-reeves-labour-live-updates",
    "image": "https://media.guim.co.uk/04fcc70fae2cfebfc05b3f3ed628e4b6ea8a10f2/153_0_3085_2469/500.jpg",
    "summary": "Stephen Morgan emphasizes that Labour's priority is on fostering economic growth, in response to reports suggesting the introduction of a national insurance tax on rental income. He implies that the party is committed to creating a favorable environment for economic development. The focus remains on addressing concerns while promoting financial stability for renters and landlords alike.",
    "published": "2025-08-28T11:17:42Z"
  },
  {
    "title": "UK landlords could face tax from rents that may raise £2bn",
    "url": "https://www.theguardian.com/money/2025/aug/28/uk-landlords-could-face-tax-from-rents",
    "image": "https://media.guim.co.uk/22c0e34a2a0b754af4d93f3f661eb97d87421f57/209_0_4079_3264/500.jpg",
    "summary": "The Treasury is reportedly exploring a budget proposal to widen the scope of national insurance to encompass rental income. This move aims to increase revenue by taxing landlords on their earnings from property rentals. If implemented, it could significantly impact the housing market and rental sector.",
    "published": "2025-08-28T11:14:53Z"
  },
  {
    "title": "UK power company Drax’s shares plunge amid investigation over source of ‘renewable’ fuel",
    "url": "https://www.theguardian.com/business/2025/aug/28/drax-investigated-by-uk-watchdog-over-historical-statements-on-biomass-sourcing",
    "image": "https://media.guim.co.uk/0c18832a58c6992b7388b9ed88943133fc6b2d30/202_0_4832_3863/500.jpg",
    "summary": "A UK watchdog is investigating historical statements regarding wood pellets used for power stations, covering the period from January 2022 to March 2024. The inquiry aims to assess the accuracy and implications of these past claims. The investigation could impact the regulatory landscape for renewable energy sources.",
    "published": "2025-08-28T11:05:10Z"
  }
]