[
  {
    "title": "Arteta warns that clubs could pull out of cups amid fixture congestion: football news – live",
    "url": "https://www.theguardian.com/football/live/2025/oct/31/weekend-team-news-and-previews-football-live",
    "image": "https://media.guim.co.uk/37eda24d18a567a671c31eb159ff2f2f449dbbd6/0_0_6313_5051/500.jpg",
    "summary": "Join our writers for updates and insights as we head into the weekend's football matches. Get ready for the latest news and analysis. Stay informed about all the upcoming games!",
    "published": "2025-10-31T12:37:14Z"
  },
  {
    "title": "Trump calls for Senate to scrap filibuster in order to force end to month-long government shutdown – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/31/donald-trump-filibuster-shutdown-snap-food-refugees-drug-boats-latest-news-updates",
    "image": "https://media.guim.co.uk/e4fa98b006ecd4a9554d3cae08825d75d3582b91/915_0_4585_3669/500.jpg",
    "summary": "Snap food benefits will expire this weekend due to an impending government shutdown, which is approaching the length of the shutdown experienced in 2018-2019. This lapse could significantly impact low-income households relying on these benefits for sustenance. The situation underscores ongoing challenges related to government funding and support programs.",
    "published": "2025-10-31T12:36:48Z"
  },
  {
    "title": "Kristi Noem denies request to halt immigration crackdown for Halloween",
    "url": "https://www.theguardian.com/us-news/2025/oct/31/kristi-noem-halloween-immigration-illinois",
    "image": "https://media.guim.co.uk/b0885c6c0f900898bc84bfa303bcacf367afbbc6/1061_0_5829_4666/500.jpg",
    "summary": "Illinois Governor J.B. Pritzker requested a pause in border patrol activities following reports that agents deployed tear gas to disperse a Halloween parade. The incident raised concerns about the use of force in controlling crowds. Pritzker emphasized the need for federal accountability and oversight in such situations.",
    "published": "2025-10-31T12:35:56Z"
  },
  {
    "title": "Danes with scythes, wacky Albion and Squidsoup’s pulsating techno – the week in art",
    "url": "https://www.theguardian.com/artanddesign/2025/oct/31/danes-with-scythes-wacky-albion-and-squidsoups-pulsating-techno-the-week-in-art",
    "image": "https://media.guim.co.uk/d0e181235a471f59c55521e196717d2e9b06cf2c/271_0_7636_6108/500.jpg",
    "summary": "An exhibition showcases the works of Anna Ancher, drawing parallels to Vermeer, while highlighting the realities faced by today's children in Britain. Additionally, artists Liz West and Squidsoup present immersive installations that envision a futuristic landscape. The event combines historical art influences with contemporary themes and innovative technology.",
    "published": "2025-10-31T12:23:46Z"
  },
  {
    "title": "How young people can use their online gaming skills to fight cybercrime – and what parents can do to help them",
    "url": "https://www.theguardian.com/from-play-to-purpose/2025/oct/31/how-young-gamers-can-fight-cybercrime-advice-for-parents",
    "image": "https://media.guim.co.uk/4f71c8d40bd1ced1e5ae2048cbb574f014f29b9d/0_0_5000_4000/500.jpg",
    "summary": "A new initiative aims to guide young gamers toward careers in cybersecurity, leveraging their gaming and coding skills. This program recognizes the online gaming world as a refuge that fosters digital skill development. By providing pathways into cybersecurity, it seeks to channel these talents into a vital field.",
    "published": "2025-10-31T12:22:20Z"
  }
]