[
  {
    "title": "Graham ‘Richo’ Richardson, former Labor party powerbroker, dies aged 76",
    "url": "https://www.theguardian.com/australia-news/2025/nov/08/graham-richardson-dies-richo-former-labor-party-powerbroker-dead-at-76",
    "image": "https://media.guim.co.uk/b599927f6e85f329178d022b125deb2bff94b3e3/531_334_2428_1942/500.jpg",
    "summary": "Former NSW senator and influential factional enforcer has passed away at the age of 76. His death followed a prolonged battle with health issues. He leaves behind a legacy in Australian politics.",
    "published": "2025-11-08T03:00:00Z"
  },
  {
    "title": "Federal judge issues permanent ban on deployment of national guard troops in Portland – live",
    "url": "https://www.theguardian.com/us-news/live/2025/nov/07/donald-trump-government-shutdown-air-traffic-flights-snap-viktor-orban-hungary-ukraine-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/6558cde3d21ccc0d3d79e16264b91d78a8c3ea96/0_0_5417_4334/500.jpg",
    "summary": "US District Court Judge Karin Immergut ruled that President Trump lacked a lawful basis to federalize the National Guard. This decision comes as part of a legal assessment regarding the actions taken during his presidency. The ruling underscores the judicial checks on executive power.",
    "published": "2025-11-08T02:53:28Z"
  },
  {
    "title": "‘Huge victory’ in Portland as judge’s final order bars Trump from sending national guard",
    "url": "https://www.theguardian.com/us-news/2025/nov/07/final-order-trump-national-guard-portland",
    "image": "https://media.guim.co.uk/11040e12783ee2e7e8776a458837e1f4aef25cb2/6_0_4583_3667/500.jpg",
    "summary": "Karin Immergut stated that she found no credible evidence indicating that the protests in an Oregon city had spiraled out of control. Her comments addressed concerns about the nature of the demonstrations. This assessment suggests that the protests remained largely manageable and contained.",
    "published": "2025-11-08T02:35:03Z"
  },
  {
    "title": "Trump news at a glance: administration turns to supreme court after failed bid to block Snap payment order",
    "url": "https://www.theguardian.com/us-news/2025/nov/07/trump-administration-news-updates-today",
    "image": "https://media.guim.co.uk/eab6bed38542ea6387c20bec6b61bfae5dff2c9f/623_0_3860_3088/500.jpg",
    "summary": "Administration officials sought to halt a federal judge's ruling requiring the distribution of full monthly food stamp benefits for November. Their request was denied by the appeals court on the same day. This development highlights ongoing tensions in U.S. politics regarding social welfare programs.",
    "published": "2025-11-08T02:05:21Z"
  },
  {
    "title": "One-year-old girl dies after being struck by freight train in NSW",
    "url": "https://www.theguardian.com/australia-news/2025/nov/08/one-year-old-girl-dies-after-being-struck-by-freight-train-in-nsw-ntwnfb",
    "image": "https://media.guim.co.uk/90ff88387eb21bf004485fd85075201acd613891/357_389_5114_4091/500.jpg",
    "summary": "A toddler received emergency treatment from paramedics in the small village of Baan Baa on Friday night. Despite efforts to save the child, they later succumbed to their injuries in the hospital. The incident has drawn attention and raised concerns in the local community.",
    "published": "2025-11-08T01:31:50Z"
  }
]