[
  {
    "title": "Ukrainian counteroffensive has derailed Russian plans to capture parts of Donetsk, says Zelenskyy – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/oct/09/russia-attacks-ukraine-energy-france-germany-europe-live-news-updates",
    "image": "https://media.guim.co.uk/5415c8af8b57b80fca0233089bf1980fb504252a/74_0_1918_1534/500.jpg",
    "summary": "Ukrainian President accuses Russia of attempting to create chaos through attacks on energy and rail infrastructure. He also claims that Ukraine's long-range strikes have led to gas shortages in Russia. The ongoing conflict continues to escalate, impacting both nations' resources.",
    "published": "2025-10-09T12:30:12Z"
  },
  {
    "title": "Gaza ceasefire plan live: Israel says it is preparing to pull back troops; living hostages could be released within days",
    "url": "https://www.theguardian.com/world/live/2025/oct/09/gaza-ceasefire-live-trump-says-hostages-probably-released-monday-idf-says-gaza-city-still-extremely-dangerous",
    "image": "https://media.guim.co.uk/6238a15ffab0f5711e9c9f617b1025b9c4e042b8/29_0_5307_4245/500.jpg",
    "summary": "US President Donald Trump announced that Israel and Hamas have reached an agreement on the initial phase of a plan aimed at pausing hostilities. This phase includes provisions for the release of certain hostages and prisoners. The development marks a significant step towards de-escalating the conflict.",
    "published": "2025-10-09T12:24:22Z"
  },
  {
    "title": "Simple menu, minimal stress, banging playlist: top chefs’ tips for a dinner party even the host will enjoy",
    "url": "https://www.theguardian.com/lifeandstyle/2025/oct/09/chefs-on-how-to-wow-at-a-dinner-party",
    "image": "https://media.guim.co.uk/5a0c7903c2d112fc7a35d188f98ac786b0f08c8e/0_0_2500_2000/500.jpg",
    "summary": "Experts share tips for entertaining friends without breaking the bank or feeling overwhelmed. By focusing on enhancing flavors and simplifying the process, hosts can create enjoyable gatherings with less stress. Practical strategies help streamline preparation while ensuring delicious meals.",
    "published": "2025-10-09T12:21:44Z"
  },
  {
    "title": "President Petro accuses US of killing Colombians in attacks on ‘narco-boats’",
    "url": "https://www.theguardian.com/world/2025/oct/09/gustavo-petro-colombia-boats-us-military",
    "image": "https://media.guim.co.uk/f0ce649d46dccf26ecc2eed3e67b2b8db83896d8/329_0_3282_2627/500.jpg",
    "summary": "Colombian President Gustavo Petro has urged the U.S. to disclose the names of victims linked to violence in the Caribbean region. He asserts that a new conflict is emerging in this area, emphasizing the urgency for accountability and transparency. Petro's call reflects rising concerns over the impact of drug trafficking and criminal activity in the Caribbean.",
    "published": "2025-10-09T12:18:36Z"
  },
  {
    "title": "HSBC makes £10bn bet on Hong Kong as ‘super-connector’ for China and west",
    "url": "https://www.theguardian.com/business/2025/oct/09/hsbc-makes-10bn-bet-on-hong-kong-as-super-connector-for-china-and-west",
    "image": "https://media.guim.co.uk/def4b520b80c72d46301d2caba4c503ce157d48e/907_497_6482_5186/500.jpg",
    "summary": "HSBC has agreed to acquire Hang Seng Bank, resulting in the latter's shares being delisted from the local stock exchange. This move highlights HSBC's commitment to strengthening its Asian business operations. The deal reflects an increasing focus on the growth potential in the region.",
    "published": "2025-10-09T12:16:15Z"
  }
]