[
  {
    "title": "Labour Together reportedly canvassing party members on leadership candidates – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/dec/08/labour-leadership-keir-starmer-conservatives-live-updates",
    "image": "https://media.guim.co.uk/b9cb0730fdafe4613d3c89394c56679a6726a2f5/1000_0_5000_4000/500.jpg",
    "summary": "Labour leader Keir Starmer is facing scrutiny after reports emerged that local Labour groups have been solicited for input on potential candidates to lead the party into the next general election. This raises questions about internal party dynamics and Starmer's leadership. The situation highlights the ongoing conversations around succession planning within the Labour Party.",
    "published": "2025-12-08T10:24:29Z"
  },
  {
    "title": "Sprawling defense bill will ‘restore warrior ethos’, House speaker says – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/dec/08/donald-trump-pete-hegseth-defense-security-indiana-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/c146a79abb28b95cb40e0832fb51f05174c5fc57/1062_0_5338_4272/500.jpg",
    "summary": "Lawmakers have introduced a policy bill that proposes a historic $901 billion allocation for national security spending in the upcoming fiscal year. This significant funding aims to address various defense and security needs. The bill reflects emerging global threats and priorities in national defense strategies.",
    "published": "2025-12-08T10:18:03Z"
  },
  {
    "title": " Labor minister Don Farrell claimed $9,000 for family travel during sports events and theatre showings",
    "url": "https://www.theguardian.com/australia-news/2025/dec/08/labor-minister-don-farrell-claimed-9000-for-family-travel-during-sports-events-and-theatre-showings",
    "image": "https://media.guim.co.uk/7f97ba6aeca6579ff8fed45a97ce94ad699d0477/1873_465_4527_3621/500.jpg",
    "summary": "A minister has defended family travel expenses, asserting they comply with existing regulations. This includes claims made during the AFL grand final and a sunset dinner at Uluru. The minister emphasized that all expenses are appropriate and within the allowable guidelines.",
    "published": "2025-12-08T10:16:43Z"
  },
  {
    "title": "Thailand launches airstrikes along disputed border with Cambodia as tensions flare",
    "url": "https://www.theguardian.com/world/2025/dec/08/thailand-airstrikes-disputed-border-cambodia",
    "image": "https://media.guim.co.uk/10fb66705a91ff31b33bee1fe88a53d5a67900d1/188_0_1350_1080/500.jpg",
    "summary": "Tensions have escalated following the killing of a Thai soldier and four Cambodian civilians, which occurred weeks after a ceasefire was brokered by former President Trump. The incident has raised concerns about the stability of the region and the effectiveness of the peace negotiations. Both countries may face increased pressure to address the violence and restore calm.",
    "published": "2025-12-08T10:03:45Z"
  },
  {
    "title": "China’s trade surplus hits $1tn for first time despite Trump’s tariffs – business live",
    "url": "https://www.theguardian.com/business/live/2025/dec/08/china-trade-surplus-trump-tariffs-stock-market-ftse-pound-business-live-latest-news",
    "image": "https://media.guim.co.uk/a8a8e884064b63796db597744e3dfe86e6aa72a1/166_0_2880_2304/500.jpg",
    "summary": "China's exports exceeded expectations in November, primarily fueled by increased shipments to non-US markets. This growth reflects a robust demand from regions outside the United States. Overall, the data highlights China's resilient trade performance amid global economic challenges.",
    "published": "2025-12-08T10:03:42Z"
  }
]