[
  {
    "title": "Benjamin Netanyahu set for defiant UN speech as Trump warns on annexation of West Bank - Middle East crisis live",
    "url": "https://www.theguardian.com/world/live/2025/sep/26/gaza-israel-benjamin-netanyahu-un-united-nations-unga-west-bank-donald-trump-middle-east-crisis-live",
    "image": "https://media.guim.co.uk/1fc57891ee0a2f8bc46d0b0ee6d7172966c3ac3c/691_0_4466_3572/500.jpg",
    "summary": "Israeli Prime Minister is set to deliver a strong statement at the UN General Assembly on Friday, opposing the establishment of a Palestinian state. His message is anticipated to emphasize Israel's stance on the matter amidst ongoing regional tensions. This address reflects Israel's ongoing diplomatic challenges surrounding its relationship with Palestinians.",
    "published": "2025-09-26T10:19:27Z"
  },
  {
    "title": "Starmer says global election results refute claim centre-left politics ‘dying out’ amid rise of far right - UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/26/keir-starmer-digital-id-cards-immigration-borders-reform-uk-politics-live",
    "image": "https://media.guim.co.uk/a056eccaa47283032977eb2cb62b950c524e23d5/678_0_3418_2736/500.jpg",
    "summary": "The Prime Minister announced plans to implement digital IDs as part of efforts to enhance border security in Britain. This initiative aims to streamline identification processes and improve monitoring at borders. The move is part of broader government strategies to strengthen national security measures.",
    "published": "2025-09-26T10:18:40Z"
  },
  {
    "title": "Ex-FBI director James Comey indicted on two charges with reports that he will surrender on Friday - US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/26/james-comey-fbi-indictment-donald-trump-executive-orders-tariffs-us-politics-live",
    "image": "https://media.guim.co.uk/e1c975aa75b18ca76a3a2449bcf36cc609d9d489/500_0_5000_4000/500.jpg",
    "summary": "James Comey is anticipated to surrender to authorities and will have his first court appearance in federal district court today. This development marks a significant moment in his legal proceedings. Further details about the charges or context are awaited.",
    "published": "2025-09-26T10:18:08Z"
  },
  {
    "title": "Nottinghamshire v Warwickshire, Hampshire v Surrey and more: county cricket – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/26/nottinghamshire-v-warwickshire-surrey-v-hampshire-and-more-county-cricket-final-round-live",
    "image": "https://media.guim.co.uk/3290781b7a11aaa64f623dedb5a7b993adb6533d/941_0_4380_3503/500.jpg",
    "summary": "On day three of the season's final round at Trent Bridge, updates are streaming in as a title party unfolds. Tanya Aldred reports the latest developments and highlights from the event. Excitement continues to build as teams vie for the championship.",
    "published": "2025-09-26T10:17:38Z"
  },
  {
    "title": "Patricia Crowther, known as UK’s oldest witch, dies aged 97",
    "url": "https://www.theguardian.com/uk-news/2025/sep/26/patricia-crowther-known-uk-oldest-witch-dies",
    "image": "https://media.guim.co.uk/135801b358dfa605fc789e1a3000bb3b34737910/226_0_3272_2618/500.jpg",
    "summary": "A 1970s BBC radio series hosted by a Wiccan high priestess significantly contributed to the popularity of modern witchcraft. The program introduced a wider audience to Wiccan practices and beliefs. Its influence has been recognized in shaping contemporary perceptions of witchcraft.",
    "published": "2025-09-26T10:11:41Z"
  }
]