[
  {
    "title": "IDF warns aid workers only hospitals are protected sites in northern Gaza ",
    "url": "https://www.theguardian.com/world/2025/sep/20/idf-warns-aid-workers-only-hospitals-are-protected-sites-in-northern-gaza",
    "image": "https://media.guim.co.uk/06bee9db248760b3190f0be3312f54c2cfb06462/551_0_5507_4405/500.jpg",
    "summary": "The Israeli military has issued an order for all residents of Gaza to evacuate, stating that it may target aid infrastructure in the area. This announcement raises concerns about the humanitarian situation as residents face increased pressure to leave. The situation is escalating amid ongoing conflict in the region.",
    "published": "2025-09-20T04:00:04Z"
  },
  {
    "title": "‘This is their attempt to silence him’: Umar Khalid reaches five years in Indian jail without trial",
    "url": "https://www.theguardian.com/world/2025/sep/20/umar-khalid-five-years-in-jail-without-trial-india",
    "image": "https://media.guim.co.uk/ae18859a8b725c057a97c94159ef8d287b7d7d52/1073_106_2690_2151/500.jpg",
    "summary": "India's most prominent political prisoner, detained since 2020, has emerged as a significant symbol of repression under Prime Minister Modi's government. His prolonged imprisonment highlights concerns over civil liberties and dissent in the country. The situation has drawn attention to the broader issues of human rights and freedom of expression in India.",
    "published": "2025-09-20T04:00:03Z"
  },
  {
    "title": "I have now been a journalist for 40 years. The forces ranged against my profession have never been so powerful | George Monbiot",
    "url": "https://www.theguardian.com/commentisfree/2025/sep/20/journalist-40-years-forces-profession-power",
    "image": "https://media.guim.co.uk/7b5700fbb2979071c033cd84161dc2f1e308fba2/0_0_2437_1949/500.jpg",
    "summary": "In his latest commentary, Guardian columnist George Monbiot reflects on his evolving perspective regarding humanity's challenges. He argues that the real issue isn't merely a lack of information, but rather the power dynamics that restrict free expression and control discourse. Monbiot emphasizes the difficulty of confronting authority when it controls the narrative.",
    "published": "2025-09-20T04:00:03Z"
  },
  {
    "title": "Trump news at a glance: president hikes H-1B visa cost to $100,000 a year as aide tells firms to ‘train Americans’",
    "url": "https://www.theguardian.com/us-news/2025/sep/20/trump-administration-news-updates-today-latest",
    "image": "https://media.guim.co.uk/59eb9906dc108507440ca83610919d84feb727a3/718_0_3682_2946/500.jpg",
    "summary": "A recent decision could significantly impact the tech industry, raising concerns among stakeholders. Despite this, the commerce secretary asserts that major companies support the move. The situation reflects a complex dynamic within the industry as it adapts to new regulations.",
    "published": "2025-09-20T02:52:46Z"
  },
  {
    "title": "Attorney investigating Trump critics resigns after pressure from officials – as it happened",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/19/donald-trump-jimmy-kimmel-suspension-abc-federal-reserve-lisa-cook-us-politics-live-news",
    "image": "https://media.guim.co.uk/5a1531ed739138c2fe7a34a193d4f74f0acaac24/443_0_3593_2874/500.jpg",
    "summary": "Donald Trump expressed his desire for Erik Siebert to be removed from his position while Siebert was involved in an investigation related to New York Attorney General Letitia James and former FBI Director James Comey. The news blog reporting on this matter has now concluded its coverage.",
    "published": "2025-09-20T02:11:08Z"
  }
]