[
  {
    "title": "Man accused of killing Georgina Ward in 2020 appears in Dudley court",
    "url": "https://www.theguardian.com/uk-news/2025/oct/16/man-accused-of-killing-georgina-ward-in-2020-appears-in-dudley-court",
    "image": "https://media.guim.co.uk/7aab3982d531456e52823b31504af26f3ba1fef8/0_106_1487_1190/500.jpg",
    "summary": "Daniel Birtwistle, 39, is set to stand trial for the manslaughter of a 24-year-old tattoo artist. He is also facing additional charges, including assault. The trial proceedings will examine the circumstances surrounding the incident.",
    "published": "2025-10-16T16:24:47Z"
  },
  {
    "title": "Russia bombards Ukraine’s gas sites as Zelenskyy flies to US for Trump meeting",
    "url": "https://www.theguardian.com/world/2025/oct/16/russia-strikes-ukraine-gas-sites-zelenskyy-us-trump-meeting-cruise-missiles",
    "image": "https://media.guim.co.uk/c2b5800790b206d904cbf4978b8f494895890ecc/0_0_4413_3529/500.jpg",
    "summary": "Strikes have led to power outages in eight regions of Ukraine amid ongoing tensions. Meanwhile, discussions are set to take place in Washington regarding the potential provision of cruise missiles to Kyiv by the U.S. These developments highlight the escalating conflict and military support efforts for Ukraine.",
    "published": "2025-10-16T16:23:36Z"
  },
  {
    "title": "The latest Prince Andrew abuse claims are a new low for the Royal Family. In this form, it can’t survive | Simon Jenkins",
    "url": "https://www.theguardian.com/commentisfree/2025/oct/16/prince-andrew-abuse-claims-new-low-royal-family",
    "image": "https://media.guim.co.uk/e232abfa9ea5cf6a70195f9d238204168d31af0a/984_0_4241_3394/500.jpg",
    "summary": "Simon Jenkins argues that the strategy of \"The Firm,\" intended to modernize, was already failing but has now completely collapsed due to recent shocking allegations becoming public. The situation highlights the vulnerabilities of the institution. Jenkins emphasizes the impact of these revelations on the organization's future.",
    "published": "2025-10-16T16:23:07Z"
  },
  {
    "title": "‘It’s been a shock’: Taylor Swift fans flock to see German museum’s Ophelia",
    "url": "https://www.theguardian.com/music/2025/oct/16/taylor-swift-fans-german-museum-fate-of-ophelia-painting",
    "image": "https://media.guim.co.uk/02a0f42ac5dbbc736649b556cbbba59c81688768/93_0_1245_996/500.jpg",
    "summary": "Friedrich Heyser’s depiction of a Shakespeare character is thought to have influenced a new music video by a pop superstar. The connection between the artwork and the video highlights the enduring relevance of Shakespeare's themes in modern media. Fans are excited to see how this artistic inspiration translates into the music.",
    "published": "2025-10-16T16:23:05Z"
  },
  {
    "title": "‘Summer is coming sooner and it’s lasting longer’: what has the weather got in store for Australia?",
    "url": "https://www.theguardian.com/environment/2025/oct/16/summer-is-coming-sooner-and-its-lasting-longer-what-the-weather-has-in-store-for-australia",
    "image": "https://media.guim.co.uk/5793ad863778ababddd1db6692bab4c38ca3a8cf/105_0_4320_3456/500.jpg",
    "summary": "Unseasonably high temperatures are anticipated in Tasmania due to abnormal heat. However, conflicting climate factors are creating uncertainty regarding rainfall predictions. This \"tug of war\" among climate drivers complicates the weather outlook for the region.",
    "published": "2025-10-16T16:21:48Z"
  }
]