[
  {
    "title": "Reeves refuses to say she will stick to manifesto pledge on tax rises and insists she must face world ‘as it is’ – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/nov/04/rachel-reeves-speech-tax-budget-labour-keir-starmer-latest-politics-news-live",
    "image": "https://media.guim.co.uk/7ebd2ee66722401ff1d8a55b51fe33ca1c924190/363_0_3411_2729/500.jpg",
    "summary": "In her pre-budget speech, the Chancellor emphasized her commitment to addressing the priorities of the British people. She signaled potential tax increases as part of the government's fiscal strategy. The speech aims to prepare the public for upcoming economic measures.",
    "published": "2025-11-04T09:21:59Z"
  },
  {
    "title": "UK borrowing costs fall and pound hits six-month low as Rachel Reeves pledges ‘iron clad’ commitment to budget fiscal rules – business live",
    "url": "https://www.theguardian.com/business/live/2025/nov/04/tax-rises-inevitable-rachel-reeves-budget-speech-borrowing-pound-stock-markets-business-live-news",
    "image": "https://media.guim.co.uk/68cf1b7ab2dd0c1dd2b4e0289b9527a034ab841e/410_0_3501_2802/500.jpg",
    "summary": "The latest economic and financial news is being covered in real-time, highlighting key developments and trends in the market. Analysts are focusing on significant data releases, central bank policies, and global economic indicators. Investors are keenly monitoring these updates to inform their strategies and decision-making.",
    "published": "2025-11-04T09:21:33Z"
  },
  {
    "title": "US elections 2025 live: Americans go to the polls, with elections in New York City, New Jersey, Virginia and California",
    "url": "https://www.theguardian.com/us-news/live/2025/nov/04/us-elections-2025-live-new-york-city-new-jersey-virginia-california-latest-news-updates-live",
    "image": "https://media.guim.co.uk/0965b087be591a2ae6e1804d1ce1af3e63bad4df/1131_49_3758_3005/500.jpg",
    "summary": "The New York mayoral race is drawing significant attention both in the U.S. and internationally. Democratic candidate Zohran Mamdani is competing against former Governor Andrew Cuomo and Republican Curtis Sliwa. The outcome of this election could have broader implications for political dynamics in New York and beyond.",
    "published": "2025-11-04T09:20:09Z"
  },
  {
    "title": "Public servants are being targeted and MPs have been murdered. But we will prevent fear from destroying our politics | Dan Jarvis",
    "url": "https://www.theguardian.com/commentisfree/2025/nov/04/public-servants-targeted-mps-murdered-fear-destroy-politics",
    "image": "https://media.guim.co.uk/7d38093787023d5d010461e45f73de7d2f5414d2/766_489_2095_1676/500.jpg",
    "summary": "A new law will prohibit protests outside the homes of public officials, as stated by security minister Dan Jarvis. While the right to demonstrate is important, he emphasizes that threatening private residences is unacceptable. The law aims to balance the right to protest with the need for personal safety.",
    "published": "2025-11-04T09:16:05Z"
  },
  {
    "title": "Family speaks out after death of man deported by ICE in vegetative state",
    "url": "https://www.theguardian.com/us-news/2025/nov/04/randall-alberto-gamboa-esquivel-ice-family",
    "image": "https://media.guim.co.uk/a64f3fc72c4bc20a782d16254b2cee910bddfea6/325_0_2921_2336/500.jpg",
    "summary": "The family of Randall Alberto Gamboa Esquivel has accused authorities of negligence and inhumane treatment regarding his case. They claim that the circumstances surrounding his situation were mishandled, leading to significant distress. The allegations highlight concerns about the standards of care provided.",
    "published": "2025-11-04T09:00:24Z"
  }
]