[
  {
    "title": "BoE’s Bailey ‘very concerned’ about threats to Federal Reserve’s independence – business live",
    "url": "https://www.theguardian.com/business/live/2025/sep/03/global-bond-sell-off-japan-government-debt-uk-us-eurozone-pound-falls-business-live-news-updates",
    "image": "https://media.guim.co.uk/d05bcf5e267a991be6b61eac47c681255ed81c52/635_0_6347_5080/500.jpg",
    "summary": "UK 30-year bond yields initially increased in early trading on Tuesday but later decreased. The fluctuations reflect market volatility and changing investor sentiment. Traders are closely monitoring economic indicators that may influence future yield movements.",
    "published": "2025-09-03T14:37:18Z"
  },
  {
    "title": "Epstein survivor describes abuse as lawmakers push for release of case files – live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/03/donald-trump-immigration-tariffs-epstein-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/67db40119ada6f987c0b5e4f7df4d324049e26d2/0_0_4583_3668/500.jpg",
    "summary": "A bipartisan group in the House is pushing for a vote to release files related to Jeffrey Epstein, despite opposition from Donald Trump and House Speaker Mike Johnson. The rally supports this effort, highlighting concerns about transparency and accountability. The push for the legislation underscores ongoing public interest in the Epstein case.",
    "published": "2025-09-03T14:35:00Z"
  },
  {
    "title": "‘Let him come to Moscow,’ Putin says about peace talks with Zelenskyy – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/sep/03/volodymyr-zelenskyy-denmark-support-ukraine-karol-nawrocki-meet-donald-trump-europe-latest-updates-news",
    "image": "https://media.guim.co.uk/5004fe40fe2692d07b4f9f15a97f15687ebfd050/1249_410_3523_2819/500.jpg",
    "summary": "Russian President Vladimir Putin challenges the legitimacy of Ukraine's government amid rising tensions. Meanwhile, Ukrainian President Volodymyr Zelenskyy intensifies his diplomatic efforts in Denmark. Additionally, the Polish president is set to meet with former President Trump, signaling potential shifts in regional alliances.",
    "published": "2025-09-03T14:30:42Z"
  },
  {
    "title": "No 10 won’t say if Angela Rayner will have to resign if ethics adviser says she has broken ministerial code – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/03/farage-starmer-badenoch-pmqs-news-updates-uk-politics-live",
    "image": "https://media.guim.co.uk/d8db59d6ff351623f8c9383b8a7cc72c4eb81633/38_107_2388_1911/500.jpg",
    "summary": "The Deputy Prime Minister has referred herself to an independent adviser after acknowledging that she underpaid stamp duty on her £800,000 flat. A spokesperson for Downing Street confirmed this development. The admission raises concerns over financial compliance and accountability.",
    "published": "2025-09-03T14:25:04Z"
  },
  {
    "title": "‘I watched the bombs fall. I watched the mothers’: how do we grieve the children of Gaza?",
    "url": "https://www.theguardian.com/world/ng-interactive/2025/sep/03/motherhood-gaza-palestinian-children",
    "image": "https://media.guim.co.uk/85ed54dc781f6664babfd356faf375d0bc4dbcd2/0_0_2400_1919/500.jpg",
    "summary": "The author reflects on their personal experiences of mothering while drawing parallels to the struggles faced by Palestine. They emphasize that Palestine is a real and significant issue, not just a symbolic concept. This blending of personal and political highlights the emotional impact of both motherhood and the situation in Palestine.",
    "published": "2025-09-03T14:00:25Z"
  }
]