[
  {
    "title": "Australia chasing 245 to beat England: Women’s Cricket World Cup – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/22/australia-v-england-womens-cricket-world-cup-live",
    "image": "https://media.guim.co.uk/d3d6f57b6372c42709e38a79eedf1430d61fb38a/417_0_4799_3841/500.jpg",
    "summary": "Two undefeated teams face off in Indore, creating anticipation for a thrilling match. Writers will provide live updates and insights throughout the game. Stay tuned for comprehensive coverage of this competitive showdown.",
    "published": "2025-10-22T14:19:18Z"
  },
  {
    "title": "UK inflation stays at 3.8% as food price rises slow for first time since March – as it happened",
    "url": "https://www.theguardian.com/business/live/2025/oct/22/uk-inflation-stays-at-38-as-food-price-rises-slow-for-first-time-since-march-business-live",
    "image": "https://media.guim.co.uk/576056c9200c415c86f7a01b6703b69a6fe03610/1109_312_4690_3752/500.jpg",
    "summary": "Recent inflation data increases the likelihood of an interest rate cut in December. As a result, gold prices have risen following their largest sell-off in five years. Investors are reacting to the potential shift in monetary policy.",
    "published": "2025-10-22T14:18:57Z"
  },
  {
    "title": "‘Just extraordinary’: Louvre visitors marvel at jewellery heist as museum reopens",
    "url": "https://www.theguardian.com/world/2025/oct/22/paris-louvre-jewellery-heist-museum-reopens",
    "image": "https://media.guim.co.uk/15f0766a37851957d4d35ed5c9479951744301c4/1386_235_6377_5102/500.jpg",
    "summary": "Apollo Gallery remains closed while police investigate a €88 million robbery. The gallery's director is being questioned regarding its security measures. Authorities are working to gather information and evidence related to the heist.",
    "published": "2025-10-22T14:13:38Z"
  },
  {
    "title": "From New Girl to Colin from Accounts: your favourite TV romcoms ever",
    "url": "https://www.theguardian.com/tv-and-radio/2025/oct/22/from-new-girl-to-colin-from-accounts-your-favourite-romcoms-ever",
    "image": "https://media.guim.co.uk/080d967f38417f504c99901fc406f4feb879f3dc/451_0_3571_2857/500.jpg",
    "summary": "Guardian readers have voted for the TV show featuring the greatest onscreen kiss of all time, highlighting its impact on romantic relationships. One particular kiss is credited with even saving a marriage. The list showcases various beloved romantic comedies cherished by fans.",
    "published": "2025-10-22T14:13:36Z"
  },
  {
    "title": "Fresh blow for grooming gangs inquiry ex-police chief pulls out of running to be chair – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/oct/22/grooming-gangs-inquiry-mahmood-starmer-caerphilly-pmqs-latest-news-updates",
    "image": "https://media.guim.co.uk/b77a343099f455e139e12c14276eca05f4d9dc35/0_62_2593_2074/500.jpg",
    "summary": "Victims of grooming gangs claim that the government is trying to pressure them into expanding a national inquiry. They argue that this manipulation undermines the seriousness of their experiences. The victims are calling for a more focused investigation into their specific cases.",
    "published": "2025-10-22T14:12:52Z"
  }
]