[
  {
    "title": "Annual energy bills set to rise £35 in October, Trump slaps 50% tariff on India – business live",
    "url": "https://www.theguardian.com/business/live/2025/aug/27/energy-price-cap-rise-trump-tariff-india-business-live-news",
    "image": "https://media.guim.co.uk/6658a30250556fbd333d6b0a9a28fd2689e034ce/704_0_2796_2238/500.jpg",
    "summary": "Stay updated with ongoing coverage of the latest developments in the economy and financial markets. Key trends, events, and analyses are continuously reported to provide insights into the current economic landscape. Follow the updates for comprehensive information on economic indicators and market movements.",
    "published": "2025-08-27T10:38:57Z"
  },
  {
    "title": "Tories and Reform offer only ‘easy answers and snake oil’ on UK-EU relationship, minister warns – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/aug/27/conservatives-consider-deal-afghanistan-migrants-uk-politics-latest-updates-news",
    "image": "https://media.guim.co.uk/47b36a7511c83493f2c6693221763aeda1c34683/1923_356_3689_2951/500.jpg",
    "summary": "Nick Thomas-Symonds criticized Nigel Farage for creating division within communities and inciting anger. He highlighted the negative impact of Farage's rhetoric on social cohesion. The comments reflect ongoing tensions in the political landscape.",
    "published": "2025-08-27T10:38:24Z"
  },
  {
    "title": "Denmark summons US charge d’affaires over alleged attempts to interfere with Greenland’s status – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/aug/27/volodymyr-zelenskyy-substantive-talks-eu-us-security-guarantees-ukraine-europe-latest-updates-news",
    "image": "https://media.guim.co.uk/bf28ad6adfac60e4a982aa9dd07dba4d7df6509c/567_0_3333_2666/500.jpg",
    "summary": "Danish Foreign Minister Lars Løkke Rasmussen asserted that any interference in Denmark's internal affairs is unacceptable. His statement emphasizes the country's commitment to sovereignty and independence. The comments come amid rising tensions regarding external influences.",
    "published": "2025-08-27T10:36:20Z"
  },
  {
    "title": "Donald Trump to chair meeting on Gaza as residents say Israeli forces have advanced into new area in Gaza City – Middle East crisis live",
    "url": "https://www.theguardian.com/world/live/2025/aug/27/donald-trump-meeting-white-house-gaza-israel-middle-east-crisis-latest-updates-news",
    "image": "https://media.guim.co.uk/14257060759189e256012480593eb6627e45dde5/574_0_5600_4480/500.jpg",
    "summary": "US special envoy Steve Witkoff expressed optimism about reaching a resolution in the ongoing conflict. Meanwhile, witnesses reported heavy bombardment in the Zeitoun neighborhood overnight. The situation remains tense as diplomatic efforts continue.",
    "published": "2025-08-27T10:34:45Z"
  },
  {
    "title": "Trump’s 50% tariffs on India come into force as president puts pressure on country over buying Russian oil – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/aug/27/donald-trump-tariffs-india-us-politics-latest-updates-news",
    "image": "https://media.guim.co.uk/dbf56b9eac9b3c76aef3dc2fd49774f3edb80066/623_0_7200_5760/500.jpg",
    "summary": "The Indian commerce ministry is advocating for exporters to expand their market reach, particularly towards China and the Middle East. This move aims to enhance India's trade opportunities and reduce reliance on traditional markets. The initiative reflects a strategic effort to bolster the country's export sector.",
    "published": "2025-08-27T10:32:19Z"
  }
]