[
  {
    "title": "ABC pulls Jimmy Kimmel’s late-night show over Charlie Kirk comments after FCC threats – live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/17/donald-trump-charlie-kirk-free-speech-nyt-cdc-rfk-epstein-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/a0ec82d4c0a9a9af63cf1322209564376de0853a/839_0_3689_2953/500.jpg",
    "summary": "A network has decided to take a show off the air \"indefinitely\" after receiving complaints regarding the host's comments about the killing of Charlie Kirk. The controversy surrounding the remarks led to significant backlash. Further details about the situation and its implications have not been disclosed.",
    "published": "2025-09-17T23:25:31Z"
  },
  {
    "title": "Family of Black student found hanging from tree on school campus hires lawyer Ben Crump",
    "url": "https://www.theguardian.com/us-news/2025/sep/17/delta-state-university-mississippi-hanging-ben-crump",
    "image": "https://media.guim.co.uk/f93b1a58dee080d6e82b90f07fc7fe9af34a5fde/6_0_3548_2839/500.jpg",
    "summary": "The body of Demartravion Reed was discovered by Delta State University staff near the campus pickleball courts, raising numerous questions about the circumstances of his death. Investigators are looking into the case as concerns grow among the university community. Authorities have not yet disclosed further details regarding the investigation.",
    "published": "2025-09-17T23:20:25Z"
  },
  {
    "title": "Jimmy Kimmel Live! suspended indefinitely after host’s Charlie Kirk comments",
    "url": "https://www.theguardian.com/tv-and-radio/2025/sep/18/jimmy-kimmel-live-suspended-indefinitely-after-hosts-charlie-kirk-comments",
    "image": "https://media.guim.co.uk/f1fb3d5dabd91f1f617cc62691fa797a2a0bf266/487_0_1197_958/500.jpg",
    "summary": "ABC has decided to suspend its late-night show following Jimmy Kimmel's remarks accusing Republicans of politicizing the recent killing of Kirk. The network has not specified when the show will return. Kimmel's comments have sparked significant controversy and prompted this programming change.",
    "published": "2025-09-17T23:18:01Z"
  },
  {
    "title": "Privately educated still have ‘vice-like grip’ on most powerful UK jobs",
    "url": "https://www.theguardian.com/society/2025/sep/18/private-schools-educated-most-powerful-jobs",
    "image": "https://media.guim.co.uk/f83384696811db6ae6e47be325c296f2d32b9aa7/363_0_4000_3200/500.jpg",
    "summary": "A recent study reveals that individuals in top professional roles are five times more likely to have attended private schools compared to the general population. This discrepancy highlights potential inequalities in educational access and opportunities. The findings suggest a correlation between educational background and career advancement.",
    "published": "2025-09-17T23:01:26Z"
  },
  {
    "title": "Dracula review – Mina Harker bites back but drama is deadened by tricksy retelling",
    "url": "https://www.theguardian.com/stage/2025/sep/18/dracula-review-lyric-hammersmith-london",
    "image": "https://media.guim.co.uk/c9605213de6e2667e6909e70db1bd7b0f246ca3b/732_0_4393_3515/500.jpg",
    "summary": "The feminist reboot of Bram Stoker’s story suffers due to an overemphasis on framing the narrative. This focus detracts from the overall pace and flow of the film. As a result, it undermines the horror elements, reducing its effectiveness.",
    "published": "2025-09-17T23:01:25Z"
  }
]