[
  {
    "title": "Family of three are first arrivals in UK under ‘one in, one out’ immigration deal",
    "url": "https://www.theguardian.com/uk-news/2025/sep/24/first-arrivals-uk-one-in-one-out-immigration-deal-france",
    "image": "https://media.guim.co.uk/651f5c418a4dd00669f0660dc679e524f7ee5794/614_518_2066_1653/500.jpg",
    "summary": "A small child was included in the first reciprocal intake following the recent removal of four asylum seekers from Britain to France. This marks a significant step in the implementation of a new immigration agreement between the two countries. The initiative aims to streamline the processing of asylum claims and enhance cooperation on immigration issues.",
    "published": "2025-09-24T17:29:21Z"
  },
  {
    "title": "Real Betis v Nottingham Forest, Red Star Belgrade v Celtic: Europa League – live",
    "url": "https://www.theguardian.com/football/live/2025/sep/24/lincoln-chelsea-liverpool-southampton-clockwatch-carabao-cup-live",
    "image": "https://media.guim.co.uk/8ac01da8da94a86e1803bc6bde660519ecb84865/425_0_4414_3531/500.jpg",
    "summary": "Rob Smyth will provide updates and the latest news following the opening matches of the Europa League. Fans can expect insights and highlights from the games. Stay tuned for all the action and developments from this exciting tournament.",
    "published": "2025-09-24T17:26:58Z"
  },
  {
    "title": "How to take the fight to Reform UK and the far right | Letters",
    "url": "https://www.theguardian.com/politics/2025/sep/24/how-to-take-the-fight-to-reform-uk-and-the-far-right",
    "image": "https://media.guim.co.uk/7e837f828cd9d310ce42248e664bed68f4accbda/320_0_3649_2920/500.jpg",
    "summary": "In response to Jonathan Freedland's article, letters from Barry Greatorex, Jennifer Rees, Dr. Sebastian Kraemer, Elizabeth Baker, and Marilyn Adams offer diverse perspectives. The correspondents highlight key points of contention and support their views with personal insights. Their collective response emphasizes the importance of dialogue on the issues raised.",
    "published": "2025-09-24T17:25:30Z"
  },
  {
    "title": "Doctors’ tribunals are in need of urgent reform | Letter",
    "url": "https://www.theguardian.com/society/2025/sep/24/doctors-tribunals-are-in-need-of-urgent-reform",
    "image": "https://media.guim.co.uk/5bab3931300439e226211f95dd5e9c758dd71f2c/1430_0_7212_5773/500.jpg",
    "summary": "Prof Hilary Neve, Dr. Rammina Yassaie, and Annie Mitchell highlight a disparity in disciplinary actions, noting that doctors guilty of sexual misconduct can return to work while those involved in peaceful climate protests experience lengthy suspensions. They emphasize the unfair treatment faced by climate activists compared to those with serious misconduct. Their letter calls for a reevaluation of these policies to ensure just treatment for all.",
    "published": "2025-09-24T17:25:22Z"
  },
  {
    "title": "Preparing students for a world shaped by artificial intelligence | Letters",
    "url": "https://www.theguardian.com/technology/2025/sep/24/preparing-students-for-a-world-shaped-by-artificial-intelligence",
    "image": "https://media.guim.co.uk/280a74d4e439ff97cbf33f249d57cdf7e6fac724/1155_0_6880_5504/500.jpg",
    "summary": "Readers expressed varying opinions on a recent letter claiming that AI negatively impacts learning at universities. Some agreed that AI can hinder traditional educational methods, while others argued it enhances learning opportunities and accessibility. The discussion highlights the complex role of AI in modern education.",
    "published": "2025-09-24T17:25:13Z"
  }
]