[
  {
    "title": "Australia v India: third men’s Twenty20 international – live",
    "url": "https://www.theguardian.com/sport/live/2025/nov/02/australia-v-india-t20-live-third-twenty20-international-cricket-aus-vs-ind-latest",
    "image": "https://media.guim.co.uk/448302fa4a9ee3f2a58c8ebca595449ce4ef5205/424_0_3140_2512/500.jpg",
    "summary": "Australia has elected to bat first in the T20I match at Bellerive Oval. The hosts currently hold a narrow lead in the series. Martin Pegan will provide live updates throughout the game.",
    "published": "2025-11-02T09:13:14Z"
  },
  {
    "title": "Celtic and Rangers meet again, Premier League news and buildup – matchday live",
    "url": "https://www.theguardian.com/football/live/2025/nov/02/old-firm-clash-scottish-league-cup-semi-final-premier-league-buildup-matchday-live",
    "image": "https://media.guim.co.uk/c085638892a50f62981c279c5e9b536343331d9e/1008_301_3821_3059/500.jpg",
    "summary": "Tom Bassam provides updates and previews for an exciting day of events in Scotland and England, highlighting key news and upcoming actions in both regions. Stay tuned for insights and information ahead of the day's activities. Don't miss out on the significant events taking place!",
    "published": "2025-11-02T09:09:38Z"
  },
  {
    "title": "Cambridgeshire train stabbing: attack thought to be isolated incident, says defence secretary – latest updates",
    "url": "https://www.theguardian.com/uk-news/live/2025/nov/02/cambridgeshire-train-stabbing-life-threatening-injuries-arrests-latest-updates",
    "image": "https://media.guim.co.uk/c8fb9faf5e3abb41a9f3bd7f074385fa02a6c37c/0_0_4076_3261/500.jpg",
    "summary": "John Healey reports that further information is developing regarding an incident that has left nine individuals hospitalized with serious, life-threatening injuries. Authorities are investigating the situation as more details come to light. The community is urged to stay informed as updates become available.",
    "published": "2025-11-02T09:07:36Z"
  },
  {
    "title": "India v South Africa: Women’s Cricket World Cup final – live",
    "url": "https://www.theguardian.com/sport/live/2025/nov/02/india-v-south-africa-womens-cricket-world-cup-final-live",
    "image": "https://media.guim.co.uk/5071d8cb043885baf9fccf3f0f5a991ccd608591/426_0_4897_3918/500.jpg",
    "summary": "An over-by-over report is live from Navi Mumbai, where anticipation builds for the trophy's winner. Writers are providing real-time updates and analyses. Fans are encouraged to stay tuned for the unfolding action.",
    "published": "2025-11-02T09:07:28Z"
  },
  {
    "title": "Romesh Ranganathan: ‘I Want Your Soul by Armand Van Helden is so relentlessly catchy I’m sick of it’",
    "url": "https://www.theguardian.com/music/2025/nov/02/romesh-ranganathan-honest-playlist-prince-michael-jackson-bob-marley",
    "image": "https://media.guim.co.uk/7289da27293d81ff23d849d594762d0dedd4e03c/49_366_804_643/500.jpg",
    "summary": "A comedian and presenter jokingly stated he would perform LL Cool J at karaoke if his family's lives were at stake. He humorously pondered what song could make his funeral memorable. The remarks highlight his comedic perspective on life and death.",
    "published": "2025-11-02T09:00:01Z"
  }
]