[
  {
    "title": "Democratic senator who Trump accused of sedition says he’s ‘not backing down’ amid Pentagon investigation – live ",
    "url": "https://www.theguardian.com/us-news/live/2025/nov/26/us-politics-latest-news-pete-hegseth-donald-trump-marjorie-taylor-greene-mark-kelly",
    "image": "https://media.guim.co.uk/0760837a8b109edabbd8e28a9c7bcb4800046916/260_0_2609_2087/500.jpg",
    "summary": "Senator Mark Kelly criticized the investigation into a video where Democrats suggested military members ignore illegal orders, calling it \"so ridiculous.\" He expressed concern over the implications of the probe on political discourse. The senator emphasized the need for a focus on more pressing issues facing the military.",
    "published": "2025-11-26T16:22:25Z"
  },
  {
    "title": "Budget 2025 live: Reeves scraps two-child benefit cap and confirms mansion tax as OBR apologises for leaking details",
    "url": "https://www.theguardian.com/uk-news/live/2025/nov/26/budget-2025-rachel-reeves-tax-cash-isa-minimum-wage-latest-news-updates",
    "image": "https://media.guim.co.uk/5e6bb5f32448909614e918bd5204810c898059cc/284_0_2117_1693/500.jpg",
    "summary": "The Office for Budget Responsibility (OBR) attributed the premature publication of its forecasts to a \"technical error.\" This incident occurred just ahead of the scheduled budget announcement. The OBR has since clarified the situation following the unintentional release of the financial projections.",
    "published": "2025-11-26T16:21:57Z"
  },
  {
    "title": "Noem made decision to continue deportation flights to El Salvador, justice department says",
    "url": "https://www.theguardian.com/us-news/2025/nov/26/kristi-noem-deportation-flights-el-salvador",
    "image": "https://media.guim.co.uk/8214ac7a8a685dc5324f086532b86daa1435814e/892_0_6532_5227/500.jpg",
    "summary": "The Justice Department asserts that the Trump administration complied with a judge's order regarding the return of flights to the U.S. They contend that there was no violation of the court's directive during the administration's handling of the situation. This statement comes amid ongoing scrutiny of the administration's actions.",
    "published": "2025-11-26T16:15:31Z"
  },
  {
    "title": "Online betting firms to pay billions more in UK tax, Reeves confirms",
    "url": "https://www.theguardian.com/society/2025/nov/26/online-betting-firms-tax-gaming-duty-uk-reeves-budget",
    "image": "https://media.guim.co.uk/4d387badd9cf6cb237b1e836eb222ad8dee792dc/625_0_4252_3401/500.jpg",
    "summary": "The Chancellor announced a significant increase in remote gaming duty during Wednesday's budget, raising it from 20% to 40%. This new rate will take effect in April next year. The decision aims to boost tax revenue from the online gambling sector.",
    "published": "2025-11-26T16:14:03Z"
  },
  {
    "title": "Ed Miliband confirms crackdown on North Sea exploration – but new drilling will continue",
    "url": "https://www.theguardian.com/business/2025/nov/26/ed-miliband-confirms-crackdown-on-new-north-sea-oil-and-gas-exploration",
    "image": "https://media.guim.co.uk/8abecf2a5696be0ddd28291b3d68dfd80e4013a5/291_0_2918_2334/500.jpg",
    "summary": "A recently released strategy paper accompanying the budget permits the advancement of new oil and gas projects, provided they are connected to existing fields. This move aims to bolster the energy sector while maintaining some continuity with current operations. The decision has sparked discussions about its potential environmental implications.",
    "published": "2025-11-26T16:12:21Z"
  }
]