[
  {
    "title": "Rachel Reeves looks to reassure bond markets with tax-heavy budget – business live",
    "url": "https://www.theguardian.com/business/live/2025/nov/26/rachel-reeves-budget-uk-tax-rises-cash-isa-bond-markets-gilts-pound-stock-markets-latest-news-updates",
    "image": "https://media.guim.co.uk/79fab6ce4e05e26f2624f47e96d0e8468d64eade/520_0_3716_2972/500.jpg",
    "summary": "The latest economic and financial news is under continuous coverage as the City prepares for upcoming budget announcements. Analysts and stakeholders are closely monitoring potential impacts on markets and fiscal policies. Anticipated changes could significantly influence economic trends and investment strategies.",
    "published": "2025-11-26T07:19:30Z"
  },
  {
    "title": "Former NSW Labor staffer gives secret evidence to MPs about 2014 phone call from Chris Minns querying fundraiser donations",
    "url": "https://www.theguardian.com/australia-news/2025/nov/26/former-nsw-premier-chris-minns-undeclared-donations-query-unearthed-staffer-secret-evidence-ntwnfb",
    "image": "https://media.guim.co.uk/0bbdabcf0e6f6b46d63e81adf127def8c3d1cec2/816_43_1781_1424/500.jpg",
    "summary": "The Premier firmly denies any allegations of misconduct, asserting that the Independent Commission Against Corruption (ICAC) has already looked into the matter. He emphasized his commitment to transparency and integrity in his role. The statement was made in response to recent claims regarding possible wrongdoing.",
    "published": "2025-11-26T07:15:33Z"
  },
  {
    "title": "Are raccoons – AKA trash pandas – really evolving into cute pets? One theory says yes | Helen Pilcher",
    "url": "https://www.theguardian.com/commentisfree/2025/nov/26/raccoon-trash-panda-pet-urban-domesticated",
    "image": "https://media.guim.co.uk/c7ae9b3610f9570e5e16421f3e685b7168fa475e/313_0_1706_1365/500.jpg",
    "summary": "Raccoons, once known for their bold foraging in urban areas, are evolving towards domestication, according to science writer Helen Pilcher. This shift may lead to gradual changes in their appearance as they adapt to living closer to humans. The trend highlights the potential impact of urbanization on wildlife behavior and characteristics.",
    "published": "2025-11-26T07:00:44Z"
  },
  {
    "title": "Wake Up Dead Man: A Knives Out Mystery review – Josh O’Connor excels in another deadpan delight",
    "url": "https://www.theguardian.com/film/2025/nov/26/wake-up-dead-man-a-knives-out-mystery-review-josh-oconnor-excels-in-another-deadpan-delight",
    "image": "https://media.guim.co.uk/4a86a2fe325a9ae5f79a8acad710ea5e0fb3c44a/108_0_3758_3007/500.jpg",
    "summary": "Daniel Craig headlines a new murder mystery featuring a talented cast including O’Connor, Glenn Close, and Josh Brolin. The film delves into themes with a religious undercurrent. Its intriguing premise promises a captivating cinematic experience.",
    "published": "2025-11-26T07:00:44Z"
  },
  {
    "title": "Coupling up: how to avoid money worries in your relationship",
    "url": "https://www.theguardian.com/money/2025/nov/26/money-worries-relationship-marriage-partnership-household-finances-consumer-advice",
    "image": "https://media.guim.co.uk/b402b658380a0a4d7f5ef12d8740083b88d81655/0_0_4000_3200/500.jpg",
    "summary": "The article emphasizes the importance of open communication about finances in relationships, covering topics like joint bank accounts, shared savings, and mortgages. It highlights how discussing financial matters can strengthen partnerships and contribute to a stable future. Ultimately, the focus is on collaboration in managing money for mutual benefit.",
    "published": "2025-11-26T07:00:44Z"
  }
]