[
  {
    "title": "UK ministers ‘risk civil servants feeling under attack’ after staff network rule changes",
    "url": "https://www.theguardian.com/politics/2025/sep/23/uk-civil-servants-staff-network-meeting-rules",
    "image": "https://media.guim.co.uk/aa16defe177029710f28200a4e366c175da792f9/89_0_6830_5464/500.jpg",
    "summary": "New guidance has been issued advising that meetings should only occur outside of working hours. This decision follows reports of \"inappropriate events\" linked to workplace gatherings. The aim is to create a safer and more professional work environment.",
    "published": "2025-09-23T16:44:34Z"
  },
  {
    "title": "Trump attacks Europe on migration, Russian energy purchases and climate policies – as it happened",
    "url": "https://www.theguardian.com/world/live/2025/sep/23/copenhagen-oslo-airport-drones-denmark-norway-russia-nato-estonia-europe-live-latest-news-updates",
    "image": "https://media.guim.co.uk/4208963a3a8e2c9fc93d9006f21b394ce1045803/921_463_4051_3241/500.jpg",
    "summary": "During a speech at the United Nations, U.S. President criticized the current state of Europe, stating it was \"going to hell.\" His remarks highlighted concerns over various challenges facing the region. The comments reflect tensions in international relations and ongoing geopolitical issues.",
    "published": "2025-09-23T16:39:07Z"
  },
  {
    "title": "Your Party is offering a gift to the hard right | Letters",
    "url": "https://www.theguardian.com/politics/2025/sep/23/your-party-is-offering-a-gift-to-the-hard-right",
    "image": "https://media.guim.co.uk/48d2843b3b0a9dc53cfeb9a37d5444e410c74c23/947_0_4737_3789/500.jpg",
    "summary": "Letters from Paul Cavaciuti, Lorraine Du Feu, and Paul Walmsley discuss internal conflicts and disagreements within a nascent left-wing party. They highlight the challenges of uniting different factions and ideas as the party seeks to solidify its identity and goals. The correspondences reflect broader concerns about the viability and direction of the emerging political movement.",
    "published": "2025-09-23T16:36:14Z"
  },
  {
    "title": "My Christian duty to Palestinians | Letter",
    "url": "https://www.theguardian.com/world/2025/sep/23/my-christian-duty-to-palestinians",
    "image": "https://media.guim.co.uk/50d7fdc25676a6c6d30ef4fcb106a0f5d81e111e/184_0_3452_2761/500.jpg",
    "summary": "Rev Canon Lesley McCormack reflects on her struggles with conscience regarding participation in a protest against the ban on Palestine Action. She grapples with the implications of political activism and moral responsibility. Her contemplation highlights the complexities surrounding activism in the context of ongoing conflict in Palestine.",
    "published": "2025-09-23T16:36:07Z"
  },
  {
    "title": "My private messages to a lifelong friend who died | Letters ",
    "url": "https://www.theguardian.com/society/2025/sep/23/my-private-messages-to-a-lifelong-friend-who-died",
    "image": "https://media.guim.co.uk/54926f6087ba8637c65a6a102b50c6a46b8e1bed/256_0_5600_4480/500.jpg",
    "summary": "Heather Lee shares her experience of grieving for her late friend by sending messages on Twitter, highlighting that everyone has their own unique way of coping with loss. She finds solace in these digital interactions as a form of remembrance. Lee's letter emphasizes the importance of respecting diverse expressions of grief.",
    "published": "2025-09-23T16:36:03Z"
  }
]