[
  {
    "title": "Vance urges people to go hard against anyone ‘justifying or celebrating’ Charlie Kirk’s killing – live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/15/donald-trump-politics-washington-dc-national-emergency-ice-charlie-kirk-live-news-updates",
    "image": "https://media.guim.co.uk/aef7e68e1b24d06d0ca8cf103cbf1f34c0976c2c/33_0_3190_2552/500.jpg",
    "summary": "JD Vance stated that the Trump administration would focus on addressing and dismantling groups that celebrate the death of political figure Kirk and those endorsing violence against political opponents. This declaration highlights a commitment to counteracting extremism in political discourse. Vance's remarks reflect ongoing tensions within political factions.",
    "published": "2025-09-15T18:48:13Z"
  },
  {
    "title": "Gulf leaders call on Trump to rein in Israel after Qatar emergency summit",
    "url": "https://www.theguardian.com/world/2025/sep/15/gulf-leaders-call-on-trump-to-rein-in-israel-after-qatar-emergency-summit",
    "image": "https://media.guim.co.uk/477cadaa4a14029fec60a8d39535fe86fb0129a0/350_0_3500_2800/500.jpg",
    "summary": "Arab states have urged the U.S. to utilize its influence to support regional stability and security. In response, they pledged to enhance their cooperation by activating joint defense mechanisms. This collaboration aims to address mutual concerns and strengthen regional alliances.",
    "published": "2025-09-15T18:46:12Z"
  },
  {
    "title": "England’s attacking philosophy changes tack again with arrival of Lee Blackett",
    "url": "https://www.theguardian.com/sport/2025/sep/15/lee-blackett-england-attack-coach-rugby-world-cup-2027",
    "image": "https://media.guim.co.uk/4046346126fb955e7ab82ac96471b35f075d4149/408_0_3515_2813/500.jpg",
    "summary": "Steve Borthwick's assistant has pledged to avoid unconventional strategies and instead prioritize effective tactics to secure victories. The emphasis will be on practical, proven methods rather than flashy plays. This approach aims to enhance the team's performance and win games.",
    "published": "2025-09-15T18:42:32Z"
  },
  {
    "title": "RAF Typhoon jets ready to shoot down drones over Poland, UK says",
    "url": "https://www.theguardian.com/uk-news/2025/sep/15/raf-typhoon-jets-ready-to-shoot-down-drones-over-poland-uk-says",
    "image": "https://media.guim.co.uk/dce57d8bcb514dc4fbd5cb4873ca00556aa1554f/620_0_5000_4000/500.jpg",
    "summary": "John Healey stated that NATO is responding to Russian threats with unity and strength. He emphasized the alliance's commitment to collective defense measures. The remarks reflect a continued focus on security and solidarity among NATO member countries in the face of rising tensions.",
    "published": "2025-09-15T18:40:14Z"
  },
  {
    "title": "Record numbers of Americans have applied for UK citizenship because of London’s values, says Khan",
    "url": "https://www.theguardian.com/politics/2025/sep/15/record-numbers-of-americans-have-applied-for-uk-citizenship-because-of-londons-values-says-khan",
    "image": "https://media.guim.co.uk/a6b6d7735ee9c42dbb05dda9bfa0f6d0a35e9f18/694_124_2233_1787/500.jpg",
    "summary": "Ahead of Donald Trump’s state visit, London’s mayor defended the city against US critics who have targeted its crime rates and diversity. He emphasized London's strengths and resilience in the face of challenges. The mayor aimed to showcase the city positively during the high-profile visit.",
    "published": "2025-09-15T18:38:10Z"
  }
]