[
  {
    "title": "Lammy promises ‘tough new release checks’ as released prisoner arrested – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/nov/07/uk-politics-latest-news-david-lammy-prisoners-labour-keir-starmer",
    "image": "https://media.guim.co.uk/b6359f3b609c171c0e308a5ba15b1cf0d7009ba7/323_0_4152_3323/500.jpg",
    "summary": "The accidental release of Brahim Kaddour-Cherif intensified scrutiny on the justice secretary following a similar incident with an Epping sex offender. This has raised concerns about the effectiveness of the justice system and public safety. The situation is prompting calls for accountability and reform in handling offenders.",
    "published": "2025-11-07T14:17:06Z"
  },
  {
    "title": "Rob Edwards’ link with Wolves reignited after not taking Middlesbrough training",
    "url": "https://www.theguardian.com/football/2025/nov/07/rob-edwards-link-with-wolves-reignited-after-not-taking-middlesbrough-training",
    "image": "https://media.guim.co.uk/95e9a9133048d3e57f0d3dc80119cb1e75b67940/567_536_4419_3537/500.jpg",
    "summary": "Rob Edwards missed Middlesbrough's training on Friday, raising questions about his future with the club. His absence comes as Wolves reportedly show continued interest in him. This situation adds uncertainty regarding Edwards' position at Middlesbrough.",
    "published": "2025-11-07T14:16:29Z"
  },
  {
    "title": "At last, a great institution filled with trusted public figures. Shame the Traitors don’t run Britainn | Marina Hyde",
    "url": "https://www.theguardian.com/commentisfree/2025/nov/07/the-celebrity-traitors-britain-mps",
    "image": "https://media.guim.co.uk/87c98925d4be31f422fb09c37af5dd3c398cbb6c/226_0_3771_3016/500.jpg",
    "summary": "The finale of The Celebrity Traitors showcased impressive deceit among its participants, earning high praise from Guardian columnist Marina Hyde. She remarked that these contestants demonstrated a level of cunning that surpasses that of current politicians. The show concluded on a high note, leaving a lasting impression on viewers.",
    "published": "2025-11-07T14:15:24Z"
  },
  {
    "title": "Sex offender freed from Wandsworth prison by mistake is back in custody",
    "url": "https://www.theguardian.com/society/2025/nov/07/sex-offender-freed-wandsworth-prison-mistake-in-custody-ibrahim-kaddour-cherif",
    "image": "https://media.guim.co.uk/9fd225a890852029c61fa63d03244ba3895c4e09/193_0_1171_937/500.jpg",
    "summary": "Brahim Kaddour-Cherif, who was accidentally released from custody on October 29, has been rearrested in north London. His release had raised concerns about potential risks to public safety. Authorities acted promptly to apprehend him again.",
    "published": "2025-11-07T14:13:24Z"
  },
  {
    "title": "Tuchel ‘delighted’ to recall Bellingham and Foden; Wolves target Edwards not at Boro training: football news – live",
    "url": "https://www.theguardian.com/football/live/2025/nov/07/thomas-tuchel-england-squad-jude-bellingham-weekend-team-news-and-more-football-live",
    "image": "https://media.guim.co.uk/906a70bbe6de1dfef1fffb2212c5a4b49e5f2b4c/0_0_5000_4000/500.jpg",
    "summary": "England manager Thomas Tuchel has announced his latest squad ahead of an action-packed weekend in the Premier League. The selection reflects key players and strategies for upcoming matches. Fans are eager to see how the squad performs in this crucial period.",
    "published": "2025-11-07T14:10:49Z"
  }
]