[
  {
    "title": "Liz Truss warns there is ‘a reckoning coming’ for central banks, and backs Trump in battle with Fed – business live",
    "url": "https://www.theguardian.com/business/live/2025/aug/28/tesla-sales-fall-across-europe-byd-bond-market-shares-ftse-business-live-news-updates",
    "image": "https://media.guim.co.uk/cfdb5cc7bda6dc4d6aea2245075bdbf20e3d9fad/484_0_4840_3872/500.jpg",
    "summary": "Former Prime Minister criticizes the Bank of England, arguing that the UK is in an \"economic doom loop.\" The ongoing economic and financial news highlights concerns about the country's financial stability. Coverage continues as analysts assess the implications of these statements.",
    "published": "2025-08-28T10:40:05Z"
  },
  {
    "title": "Russia hits British Council and EU delegation offices in overnight airstrikes on Kyiv - Europe live",
    "url": "https://www.theguardian.com/world/live/2025/aug/28/ukraine-kyiv-strike-russia-europe-zelenskyy-putin-updates-live-news-latest",
    "image": "https://media.guim.co.uk/73f3dc40757f1c02fa6275f97f063d845d9d9749/184_0_1778_1422/500.jpg",
    "summary": "Ukrainian President Zelenskyy urges a strong response to the \"horrific\" killings of civilians amid ongoing conflict. EU leaders likewise condemn these acts as \"deliberate\" attacks on civilians. The statements reflect growing international outrage over the violence impacting innocent lives in Ukraine.",
    "published": "2025-08-28T10:39:44Z"
  },
  {
    "title": "Minister refuses to deny reports Rachel Reeves considering tax increase for landlords in budget – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/aug/28/latest-uk-politics-news-keir-starmer-rachel-reeves-labour-live-updates",
    "image": "https://media.guim.co.uk/04fcc70fae2cfebfc05b3f3ed628e4b6ea8a10f2/153_0_3085_2469/500.jpg",
    "summary": "Stephen Morgan emphasizes that Labour's priority is on promoting economic growth amidst concerns about a proposed national insurance tax on rental income. He asserts that the party remains committed to addressing economic challenges. The focus is on creating favorable conditions for growth rather than imposing additional burdens on rental income.",
    "published": "2025-08-28T10:33:59Z"
  },
  {
    "title": "Milan close to signing Christopher Nkunku from Chelsea in £36.2m deal",
    "url": "https://www.theguardian.com/football/2025/aug/28/christopher-nkunku-milan-chelsea",
    "image": "https://media.guim.co.uk/5bff3238a074ee55b2e820bd1139f048621c9a5b/944_240_3137_2511/500.jpg",
    "summary": "Milan is set to acquire Chelsea forward Christopher Nkunku for a deal valued at €42 million (£36.2 million). The transfer marks a significant move for both clubs. Nkunku is expected to bolster Milan's attacking options.",
    "published": "2025-08-28T10:22:52Z"
  },
  {
    "title": "Keir Starmer replaces key No 10 aide with more changes to come",
    "url": "https://www.theguardian.com/politics/2025/aug/28/keir-starmer-replaces-key-aide-nin-pandit-no-10-more-changes",
    "image": "https://media.guim.co.uk/11f66ad6a46f47844eba68cd4a61b72e9ec8d886/541_210_3293_2636/500.jpg",
    "summary": "Nin Pandit, the principal private secretary to the Prime Minister, is set to depart from his position after just under ten months in the role. His resignation follows a brief tenure in the top civil service role. The reasons for his departure have not been publicly disclosed.",
    "published": "2025-08-28T10:16:48Z"
  }
]