[
  {
    "title": "Thaksin Shinawatra jailed by Thailand supreme court for one year in major blow to former prime minister",
    "url": "https://www.theguardian.com/world/2025/sep/09/thaksin-shinawatra-former-prime-minister-jailed-by-thailand-supreme-court-for-one-year-ntwnfb",
    "image": "https://media.guim.co.uk/b112a31b0dbe4f25cf04797160be9071340a564d/441_0_3842_3074/500.jpg",
    "summary": "A legal case has arisen over allegations that an individual failed to correctly serve a sentence for corruption and abuse of power, which was issued in 2023. The case has prompted questions about the enforcement of judicial penalties. Further developments in the matter are awaited as the investigation continues.",
    "published": "2025-09-09T04:33:45Z"
  },
  {
    "title": "Australia news live: Mercury Psillakis’s family mourn ‘loving, devoted and ridiculously fun’ surfer killed in shark attack",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/09/australia-news-live-anthony-albanese-vanuatu-china-pacific-forum-murray-watt-nature-protection-laws-ntwnfb",
    "image": "https://media.guim.co.uk/233554aed13835eb1413460e4a44f362afb22a46/102_0_3060_2448/500.jpg",
    "summary": "Please provide the news article or details you would like me to summarize.",
    "published": "2025-09-09T04:33:44Z"
  },
  {
    "title": "Country diary: The world through the eyes of a seal | Ed Douglas",
    "url": "https://www.theguardian.com/environment/2025/sep/09/country-diary-the-world-through-the-eyes-of-a-seal",
    "image": "https://media.guim.co.uk/21b05f30b609291d490c94d031e8bb9098bc0e3a/373_0_4660_3727/500.jpg",
    "summary": "In Ynys Môn, the author reflects on a captivating encounter with unique creatures during a staring contest. They ponder the ways these animals adapt to their black-and-white environment. The experience prompts a deeper appreciation for the resilience of life in such stark surroundings.",
    "published": "2025-09-09T04:30:04Z"
  },
  {
    "title": "Images of Tom Phillips’ remote campsite revealed a day after fugitive father shot dead by New Zealand police",
    "url": "https://www.theguardian.com/world/2025/sep/09/tom-phillips-new-zealand-remote-campsite-images-pictures-revealed",
    "image": "https://media.guim.co.uk/b7ef25c6773f7ffbbd4dfbbf0e95b7f2b7bd370e/0_0_3780_3024/500.jpg",
    "summary": "Authorities have successfully located Phillips' three children after they were missing for four years while on the run with their father. The children are reported to be “doing well under the circumstances.” The search for the family had spanned several years before their discovery.",
    "published": "2025-09-09T04:06:31Z"
  },
  {
    "title": "Lisbon’s funicular tragedy struck a city that is struggling to balance old and new | Larry Ryan",
    "url": "https://www.theguardian.com/commentisfree/2025/sep/09/lisbon-funicular-tragedy-city-struggling-balance-old-and-new",
    "image": "https://media.guim.co.uk/64a9d38eeb43a729132ddd8a816e3029f1389e72/41_0_3937_3150/500.jpg",
    "summary": "Portugal's property and tourism boom is putting significant pressure on its historic cities, making them more vulnerable to change. Writer Larry Ryan highlights the fragility of these urban environments as they face challenges from rapid development. The growing popularity risks overshadowing their cultural heritage and stability.",
    "published": "2025-09-09T04:00:06Z"
  }
]