[
  {
    "title": "Arsenal v OL Lyonnes: Women’s Champions League – live",
    "url": "https://www.theguardian.com/football/live/2025/oct/07/arsenal-v-ol-lyonnes-womens-champions-league-live",
    "image": "https://media.guim.co.uk/a19fe7c948f3fd2c973198d8880eb8b8b0a744f7/171_238_2090_1672/500.jpg",
    "summary": "The article offers a minute-by-minute coverage of a crucial match where the title holders aim for a successful start to their title defense. Luke McLaughlin provides updates and insights throughout the game. Fans can follow the action closely to see if the defending champions can secure a win.",
    "published": "2025-10-07T20:20:36Z"
  },
  {
    "title": "Australia politics live: Muslim Australians gather to mark two years of Gaza war; rents rise and vacancies fall",
    "url": "https://www.theguardian.com/australia-news/live/2025/oct/08/australia-politics-live-gaza-rally-parliament-anthony-albanese-sussan-ley-question-time-andrew-hastie-ntwnfb",
    "image": "https://media.guim.co.uk/4a6c7982960aaa568469db246027f9268e92be66/223_0_4049_3240/500.jpg",
    "summary": "I'm sorry, but I need the specific news content you'd like summarized. Please provide the details, and I'll be happy to help!",
    "published": "2025-10-07T20:19:45Z"
  },
  {
    "title": "Furloughed government workers may not be entitled to back pay, reports say, as Trump claims some jobs ‘will never come back’ – live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/07/donald-trump-national-guard-pam-bondi-mark-carney-government-shutdown-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/a6ab464d0f79a5f1e9fd9788ad65fa72a736bddb/649_0_6500_5203/500.jpg",
    "summary": "A White House memo disclosed by various U.S. media outlets indicates that the government does not plan to guarantee back pay for federal workers who continue to work during the shutdown. This decision has raised concerns among affected employees about financial security. The memo highlights the challenges and uncertainty surrounding the ongoing government shutdown.",
    "published": "2025-10-07T20:15:34Z"
  },
  {
    "title": "‘Kardashian of Cheshire’ paedophile jailed for luxury handbag fraud",
    "url": "https://www.theguardian.com/uk-news/2025/oct/07/kardashian-of-cheshire-paedophile-jailed-for-luxury-handbag",
    "image": "https://media.guim.co.uk/e530412020204c2b91eae56558580feda62b51a4/22_183_1098_878/500.jpg",
    "summary": "Jack Watkin showcased a lavish lifestyle after defrauding victims, including his father and friends, out of nearly £200,000. His fraudulent activities involved deception to acquire funds from those close to him. Ultimately, his actions led to financial ruin for multiple individuals while he pretended to live a millionaire's life.",
    "published": "2025-10-07T20:10:23Z"
  },
  {
    "title": "Corrections and clarifications",
    "url": "https://www.theguardian.com/news/2025/oct/07/corrections-and-clarifications",
    "summary": "Brian Patten, a notable British poet and writer, has made significant contributions to contemporary poetry. His works often reflect themes of love, loss, and the human experience. Patten continues to influence new generations of poets with his unique style and accessibility.",
    "published": "2025-10-07T20:00:04Z"
  }
]