[
  {
    "title": "Senate fails to pass short-term funding bill, with both parties blaming the other for looming government shutdown – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/19/donald-trump-jimmy-kimmel-suspension-abc-federal-reserve-lisa-cook-us-politics-live-news",
    "image": "https://media.guim.co.uk/c489c989c8ff25c7413543bfe3208e78c9028d55/562_342_2946_2357/500.jpg",
    "summary": "The Republican-controlled Senate has rejected a continuing resolution that had previously been approved by the House. This decision puts government funding at risk, as it is set to lapse at the end of September. The failure to pass the resolution raises concerns about a potential government shutdown.",
    "published": "2025-09-19T21:22:15Z"
  },
  {
    "title": "Labour rules against dozens of motions about Palestine being debated at party conference",
    "url": "https://www.theguardian.com/politics/2025/sep/19/labour-rules-against-dozens-of-motions-about-palestine-being-debated-at-party-conference",
    "image": "https://media.guim.co.uk/455429b77857dbcdfb321f10fc45eaa5a9a43a79/1235_0_5158_4126/500.jpg",
    "summary": "Calls have emerged for sanctions against Israel and a trade ban on activities that violate international law, highlighting the ongoing tensions surrounding the country's actions. These motions, however, have faced rejection in various forums. The situation reflects growing global frustration over perceived injustices.",
    "published": "2025-09-19T20:52:05Z"
  },
  {
    "title": "RFK Jr’s vaccine advisers remove prescription need for Covid vaccine, emphasizing personal choice",
    "url": "https://www.theguardian.com/us-news/2025/sep/19/acip-vote-no-prescription-covid-vaccine",
    "image": "https://media.guim.co.uk/df5d121a11d5154a81630ec718279a6fe55407ed/446_0_4458_3567/500.jpg",
    "summary": "After a contentious meeting, healthcare professionals and experts expressed significant confusion regarding the committee's recommendations. Many attendees felt the discussions lacked clarity and direction. This ambiguity has raised concerns about future decisions in healthcare policy.",
    "published": "2025-09-19T20:50:06Z"
  },
  {
    "title": "Estonia requests Nato article 4 consultation after ‘unacceptable’ violation of its airspace by Russian MiG-31s – as it happened",
    "url": "https://www.theguardian.com/world/live/2025/sep/19/eu-sanctions-russia-oil-ukraine-vladimir-putin-volodymyr-zelenskyy-donald-trump-france-macron-europe-live-news",
    "image": "https://media.guim.co.uk/2b9a3bdac6c1558afbf9445cff2c5644686bbd7f/242_0_2049_1639/500.jpg",
    "summary": "NATO has condemned what it calls \"reckless Russian behavior\" following the interception of three MiG-31 fighters over Estonian airspace by its jets. This incident underscores ongoing tensions between NATO and Russia. The alliance emphasizes the need for vigilance and readiness in response to such provocations.",
    "published": "2025-09-19T20:27:27Z"
  },
  {
    "title": "New Zealand 19-34 Canada: Women’s Rugby World Cup 2025 semi-final – as it happened",
    "url": "https://www.theguardian.com/sport/live/2025/sep/19/new-zealand-v-canada-womens-rugby-world-cup-2025-semi-final-live",
    "image": "https://media.guim.co.uk/59364719b0984a1bd061611b73955c7a4012834a/314_0_4760_3809/500.jpg",
    "summary": "Canada defeated the Black Ferns by scoring five tries in a commanding performance. This victory ended New Zealand's title defense in the tournament. As a result, Canada secured a spot in the final.",
    "published": "2025-09-19T20:22:50Z"
  }
]