[
  {
    "title": "Police assaulted as far-right rally led by Tommy Robinson sparks clashes",
    "url": "https://www.theguardian.com/uk-news/2025/sep/13/unite-the-kingdom-far-right-rally-london-tommy-robinson-police-assaulted",
    "image": "https://media.guim.co.uk/da19315ad3260f40773e4e24c7c0bbb2fe1f4c8e/109_0_5623_4501/500.jpg",
    "summary": "Over 110,000 people participated in the Unite the Kingdom event, advocating for unity amid political divisions. Meanwhile, around 5,000 counter-protesters gathered nearby to express their opposing views. The event highlighted the contrasting opinions within the community regarding national unity and identity.",
    "published": "2025-09-13T15:25:20Z"
  },
  {
    "title": "Everton v Aston Villa, Fulham v Leeds, Championship updates and more: football clockwatch – live",
    "url": "https://www.theguardian.com/football/live/2025/sep/13/everton-v-aston-villa-fulham-v-leeds-championship-updates-and-more-football-clockwatch-live",
    "image": "https://media.guim.co.uk/3f01fc982b3a54d90bc95b56ae88a0bbe40d6e99/414_43_3034_2427/500.jpg",
    "summary": "Stay updated with live coverage of the Premier League matches starting at 3pm this afternoon. Our writers will provide real-time updates and insights as the games unfold. Don't miss any key moments or highlights!",
    "published": "2025-09-13T15:23:27Z"
  },
  {
    "title": "Police say 110,000 attending ‘unite the kingdom’ rally in London, with some in crowd attacking officers – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/13/uk-politics-latest-news-unite-the-kingdom-march-far-right-rally-london-labour-keir-starmer",
    "image": "https://media.guim.co.uk/42917aaac388a66b0457a04458b3f2bc3a1a04ac/1037_202_4023_3218/500.jpg",
    "summary": "The Metropolitan Police estimate that around 110,000 people attended a rally, though they acknowledge it's difficult to accurately gauge attendance. Tensions escalated when a group in Whitehall began throwing projectiles at law enforcement officers. The situation highlights ongoing unrest surrounding the event.",
    "published": "2025-09-13T15:21:36Z"
  },
  {
    "title": "‘It was personal, critical’: Bristol parents’ long battle over council Send services",
    "url": "https://www.theguardian.com/education/2025/sep/13/bristol-parents-send-services-council-battle",
    "image": "https://media.guim.co.uk/cdee7d2c7d4beeccbea215ea809e2ac4a7f27d2c/414_131_2086_1669/500.jpg",
    "summary": "City authorities have consented to an independent investigation following a leak that raised allegations of social media surveillance three years ago. The investigation aims to address concerns over privacy and accountability. This decision comes in response to public outcry and demands for transparency in government practices.",
    "published": "2025-09-13T15:07:05Z"
  },
  {
    "title": "Charlie Kirk’s US campus tour will continue despite his death, widow says – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/13/charlie-kirk-suspect-tyler-robinson-erika-kirk-us-politics-latest-news-donald-trump",
    "image": "https://media.guim.co.uk/4ef3a1799aa47a877a94ba4204664a5c985dac29/210_0_1333_1067/500.jpg",
    "summary": "Erika Kirk expressed her enduring connection to her late husband, emphasizing that his voice will continue to be a part of her life. She conveyed her love and remembrance of him during this challenging time. The statement highlights the lasting impact of loved ones after their passing.",
    "published": "2025-09-13T15:01:28Z"
  }
]