[
  {
    "title": "Labour condemns Nigel Farage after he ducks calls for probe into potential Reform UK links to Russia – UK politics live ",
    "url": "https://www.theguardian.com/politics/live/2025/nov/25/nigel-farage-nathan-gill-labour-reform-uk-russia-keir-starmer-uk-politics-live-news",
    "image": "https://media.guim.co.uk/6f3be033903775454125fda3bca9cde8f61df429/568_0_6422_5140/500.jpg",
    "summary": "Nigel Farage has decided against pursuing a broader investigation following the sentencing of Nathan Gill, the former leader of Reform UK in Wales. Farage's announcement comes in the wake of last week's court proceedings. The decision indicates a focus on moving forward rather than reopening the situation.",
    "published": "2025-11-25T09:21:32Z"
  },
  {
    "title": "US to hold Russia-Ukraine peace talks in Abu Dhabi after Kyiv hit with deadly overnight strikes - Europe live ",
    "url": "https://www.theguardian.com/world/live/2025/nov/25/us-russia-ukraine-peace-talks-abu-dhabi-kyiv-strikes-zelenskyy-putin-europe-live-news",
    "image": "https://media.guim.co.uk/eb053601e69d2a0f8cc056d984033cbd97ca488f/252_0_4589_3672/500.jpg",
    "summary": "US Army Secretary Daniel Driscoll is set to hold a meeting today after reportedly engaging in discussions with Russian officials on Monday night. The focus of these meetings has not been disclosed. This follows ongoing tensions and strategic dialogues between the two nations.",
    "published": "2025-11-25T09:17:15Z"
  },
  {
    "title": "Crick: A Mind in Motion by Matthew Cobb review – the charismatic philanderer who changed science",
    "url": "https://www.theguardian.com/books/2025/nov/25/crick-a-mind-in-motion-by-matthew-cobb-review-the-charismatic-philanderer-who-changed-science",
    "image": "https://media.guim.co.uk/2953f8ac1c1befba93e34089044b0cbfcb02f8f9/0_288_2150_1720/500.jpg",
    "summary": "A new biography explores the complex character of James Watson, co-discoverer of DNA's structure, highlighting his brilliance and hubris. The book delves into how his genius propelled scientific breakthroughs, while his arrogance often sparked controversy. Watson's legacy is portrayed as a blend of remarkable achievements and contentious views.",
    "published": "2025-11-25T09:00:28Z"
  },
  {
    "title": "Dracula review – Luc Besson’s romantic reimagining of Gothic classic is ridiculous but watchable ",
    "url": "https://www.theguardian.com/film/2025/nov/25/dracula-a-love-tale-review-luc-besson-caleb-landry-jones-christoph-waltz",
    "image": "https://media.guim.co.uk/a7bb997002686c681769dd8deec016daacc52258/248_0_3405_2725/500.jpg",
    "summary": "Besson's adaptation of Bram Stoker's story, though not strictly necessary, showcases ambition and style. The film features strong performances from Caleb Landry Jones and Christoph Waltz. Overall, it offers a fresh take on a classic tale.",
    "published": "2025-11-25T09:00:28Z"
  },
  {
    "title": "EasyJet profits climb as package holidays sell well despite price rises",
    "url": "https://www.theguardian.com/business/2025/nov/25/easyjet-profits-package-holidays-price-rise",
    "image": "https://media.guim.co.uk/20669a283de80de33dd993232dca9feba9a9f339/615_0_4375_3502/500.jpg",
    "summary": "A travel firm has identified Majorca, Tenerife, Costa Blanca, Dalaman, and Lanzarote as the most popular package holiday destinations. These locations are favored by travelers for their appealing offerings. The trend highlights ongoing interest in sun-soaked vacation spots.",
    "published": "2025-11-25T08:58:12Z"
  }
]