[
  {
    "title": "Thomas Tuchel hints Elliot Anderson will start for England in Serbia",
    "url": "https://www.theguardian.com/football/2025/sep/06/thomas-tuchel-hints-elliot-anderson-will-start-for-england-in-serbia",
    "image": "https://media.guim.co.uk/4542b6470383cb692e467c61d9493aa59512591e/228_0_3076_2460/500.jpg",
    "summary": "Thomas Tuchel commended Elliot Anderson following England's win over Andorra, highlighting the player's performance. He hinted that Anderson may be in line to start in the upcoming World Cup qualifier against Serbia. The coach's endorsement underscores Anderson's growing importance in the national team.",
    "published": "2025-09-06T19:16:36Z"
  },
  {
    "title": "US Open tennis 2025: Aryna Sabalenka v Amanda Anisimova, women’s singles final – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/06/us-open-tennis-2025-aryna-sabalenka-amanda-anisimova-womens-singles-final-live",
    "image": "https://media.guim.co.uk/a6b2ebb06e902ef18cd81cf74863160eda90b76b/218_132_2858_2286/500.jpg",
    "summary": "Aryna Sabalenka is striving to defend her title at a major tennis event, while Amanda Anisimova seeks to overcome her past challenges at Wimbledon. Katy Murrells provides ongoing coverage of their matches. The competition highlights their contrasting journeys as they aim for success on the court.",
    "published": "2025-09-06T19:11:38Z"
  },
  {
    "title": "Mikel Arteta should heed a lesson from Fabian Hürzeler and seize the moment | Jonathan Wilson",
    "url": "https://www.theguardian.com/football/2025/sep/06/arteta-should-have-heeded-a-lesson-from-hurzeler-and-seized-the-moment",
    "image": "https://media.guim.co.uk/2fe877fc36eea4e493e697136237a7bff6d4a3ec/466_0_3119_2495/500.jpg",
    "summary": "Brighton capitalized on their opportunities, showcasing a strong performance. In contrast, Mikel Arteta's Arsenal missed a critical chance to secure a victory against Liverpool. This contrast highlights the pressure on Arsenal to seize future moments.",
    "published": "2025-09-06T19:00:00Z"
  },
  {
    "title": "Keir Starmer confirms first batch of junior ministers in post-Rayner reshuffle – as it happened",
    "url": "https://www.theguardian.com/politics/live/2025/sep/06/no-early-election-angela-rayner-resignation-nigel-farage-reform-uk-politics-live-news-latest",
    "image": "https://media.guim.co.uk/ef89e6d973b2d1173f1dff0d29de38013d336ef3/393_0_3928_3143/500.jpg",
    "summary": "Chief Secretary Darren Jones stated that Angela Rayner's resignation accelerated an upcoming reshuffle within the Labour party. He emphasized that there is no division among party members despite the changes. The party is navigating the transition while maintaining unity.",
    "published": "2025-09-06T18:44:12Z"
  },
  {
    "title": "Reshuffle of junior ministers raises fears over future of Labour’s workers’ rights bill",
    "url": "https://www.theguardian.com/politics/2025/sep/06/reshuffle-of-junior-ministers-raises-fears-over-future-of-labours-workers-rights-bill",
    "image": "https://media.guim.co.uk/c2e8d22909e2d7bcef2080f8b3a9a0aa725e25ac/0_0_1064_850/500.jpg",
    "summary": "Tensions are rising over potential conflicts regarding extensive reforms following the dismissal of employment rights minister Justin Madders. Critics argue that the removal of Madders and the sidelining of union allies could lead to significant opposition. Stakeholders anticipate a contentious debate as reforms are pursued.",
    "published": "2025-09-06T18:35:23Z"
  }
]