[
  {
    "title": "Canada v Australia: international men’s football friendly – live",
    "url": "https://www.theguardian.com/football/live/2025/oct/11/canada-vs-australia-socceroos-live-updates-international-football-friendly-latest",
    "image": "https://media.guim.co.uk/fb91f62319b4747491a7c0dacca9b5eb2c088e87/502_0_4626_3700/500.jpg",
    "summary": "The Socceroos begin their North America tour with a match against the World Cup co-host in Montreal. Updates will be provided by Martin Pegan as the game unfolds. Fans can follow along for minute-by-minute coverage.",
    "published": "2025-10-10T23:12:37Z"
  },
  {
    "title": "‘Substantial’ federal layoffs begin as Congress remains deadlocked over funding to end shutdown – live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/10/letitia-james-donald-trump-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/84c7b03bccaa2922d85ef889e5129dcd2e773dba/475_0_5000_4000/500.jpg",
    "summary": "Multiple U.S. government agencies, including the Treasury, Department of Health and Human Services, Department of Homeland Security, and Department of Education, have confirmed impending budget cuts. While specific figures have not been released, the cuts will likely impact various programs and services. The unannounced reductions signal ongoing fiscal challenges within the federal budget.",
    "published": "2025-10-10T23:05:37Z"
  },
  {
    "title": "Quick cryptic crossword No 80",
    "url": "https://www.theguardian.com/crosswords/quick-cryptic/80",
    "summary": "I'm sorry, but I can't summarize a specific crossword puzzle or its clues without the content itself. If you provide details or specific clues from the crossword, I'd be happy to help summarize or discuss them!",
    "published": "2025-10-10T23:00:07Z"
  },
  {
    "title": "Prize crossword No 29,823",
    "url": "https://www.theguardian.com/crosswords/prize/29823",
    "summary": "I'm sorry, but I don't have the content of \"Prize crossword No 29,823\" to summarize. If you could provide some details about the crossword or its themes, I'd be happy to help summarize that information!",
    "published": "2025-10-10T23:00:07Z"
  },
  {
    "title": "Using a swearword in your Google search can stop the AI answer. But should you?",
    "url": "https://www.theguardian.com/technology/2025/oct/11/using-a-swearword-in-your-google-search-can-stop-the-ai-answer-but-should-you",
    "image": "https://media.guim.co.uk/fd6f8285b6f0afabcf0abaff9eba8e2b82879291/0_628_4372_3498/500.jpg",
    "summary": "Artificial intelligence extends beyond deepfakes, impacting various fields like smartphones, customer service, healthcare, and legal cases. Its pervasive presence raises questions about whether it can be avoided in daily life. The conversation is shifting towards understanding its broader implications and applications.",
    "published": "2025-10-10T23:00:07Z"
  }
]