[
  {
    "title": "Eli Lilly calls UK ‘worst country in Europe’ for drug prices; gold nears record high - business live",
    "url": "https://www.theguardian.com/business/live/2025/sep/24/markets-economy-gold-eli-lilly-drug-prices-business-live-news",
    "image": "https://media.guim.co.uk/83e559ba4a139bcb8f310cb1756063f459fb6377/396_0_3963_3171/500.jpg",
    "summary": "Spot gold is trading slightly below a recent record high achieved on Monday. The increase in gold prices reflects ongoing market trends and economic uncertainties. Investors are closely watching gold as a safe-haven asset amid fluctuating market conditions.",
    "published": "2025-09-24T08:48:20Z"
  },
  {
    "title": "‘It was hectic’: Memories of the last time the Wallabies won at Eden Park in 1986 | Angus Fontaine",
    "url": "https://www.theguardian.com/sport/2025/sep/24/memories-of-1986-the-last-time-wallabies-beat-all-blacks-at-eden-park",
    "image": "https://media.guim.co.uk/c5cbe54b3d6fdedb847cf63d91bef48ef6364662/442_44_2732_2186/500.jpg",
    "summary": "The All Blacks have maintained an unbeaten record at their Auckland home for over 30 years. Former Australian players, who were part of the last winning team there, believe Joe Schmidt's squad can replicate that success. They are optimistic about breaking the All Blacks' stronghold in the upcoming match.",
    "published": "2025-09-24T08:46:08Z"
  },
  {
    "title": "Pat McFadden dismisses Tory claims that Morgan McSweeney misled elections watchdog – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/24/labour-tories-conservatives-reform-uk-politics-live-news-updates",
    "image": "https://media.guim.co.uk/f370a1954bbd763f601ad5e18ccb47db59859162/845_0_4225_3380/500.jpg",
    "summary": "A cabinet minister announced that the Electoral Commission has investigated allegations concerning the chief of staff, who is described as \"talented.\" The minister emphasized the importance of this inquiry to uphold transparency. Further details about the claims or outcomes have not been disclosed.",
    "published": "2025-09-24T08:46:01Z"
  },
  {
    "title": "‘No alternative’ to continuing invasion, claims Russia, as Trump says Ukraine could regain all land lost – latest updates",
    "url": "https://www.theguardian.com/world/live/2025/sep/24/russia-ukraine-trump-zelenskyy-unga-drones-europe-latest-news-updates",
    "image": "https://media.guim.co.uk/4e0f9c2bbeea7042b22425c5285121f37c6eac71/403_0_5000_4000/500.jpg",
    "summary": "The Kremlin reacted to U.S. President Biden's endorsement of Ukraine during a speech at the UN General Assembly, emphasizing a commitment to Russia's interests. They expressed discontent with Western support for Ukraine, framing it as provocative. The Russian government continues to assert its position amid ongoing tensions with the West over the Ukraine conflict.",
    "published": "2025-09-24T08:45:52Z"
  },
  {
    "title": "Typhoon Ragasa live: Two million people evacuated in southern China after deaths in Taiwan and Philippines",
    "url": "https://www.theguardian.com/world/live/2025/sep/24/typhoon-ragasa-live-china-hong-kong-taiwan-philippines-latest-storm-news-updates",
    "image": "https://media.guim.co.uk/08e97b9bdc83bc743cba156fd6a74772f9b88251/295_0_2700_2160/500.jpg",
    "summary": "Schools and businesses in Hong Kong and Guangdong are closing in anticipation of severe winds and heavy rainfall. This weather event follows significant damage caused by similar conditions in Taiwan and the Philippines. Authorities are preparing for potential disruptions and hazards in the affected regions.",
    "published": "2025-09-24T08:39:28Z"
  }
]