[
  {
    "title": "West Ham v Newcastle: Premier League – live",
    "url": "https://www.theguardian.com/football/live/2025/nov/02/west-ham-v-newcastle-premier-league-live-updates",
    "image": "https://media.guim.co.uk/cfda31864fc7be42050b76083e381de1a7831722/595_0_3225_2581/500.jpg",
    "summary": "West Ham is facing off against Newcastle in a crucial match as they aim to revive their struggling season. John Brewin provides a minute-by-minute report on the game's developments. Fans are eager to see if West Ham can turn their fortunes around on home ground.",
    "published": "2025-11-02T14:16:20Z"
  },
  {
    "title": "Celtic v Rangers: Scottish League Cup semi-final – live",
    "url": "https://www.theguardian.com/football/live/2025/nov/02/celtic-v-rangers-scottish-league-cup-semi-final-live",
    "image": "https://media.guim.co.uk/769b2d6607763f93966180f563e3860fd097d566/460_111_3074_2461/500.jpg",
    "summary": "A minute-by-minute report is underway to determine which struggling team between the Old Firm sides will reach the final. The coverage is provided by Billy Munday, who will keep fans updated throughout the match. The anticipation builds as both teams aim for victory.",
    "published": "2025-11-02T14:15:59Z"
  },
  {
    "title": "Cambridgeshire train stabbing: suspects both British and ‘nothing to suggest’ attack was terrorism, say police – latest updates",
    "url": "https://www.theguardian.com/uk-news/live/2025/nov/02/cambridgeshire-train-stabbing-life-threatening-injuries-arrests-latest-updates",
    "image": "https://media.guim.co.uk/c64113b57144b27bf5bd5799829b195ed0b3600b/0_0_3471_2777/500.jpg",
    "summary": "Two men have been arrested for attempted murder following an incident that left two individuals in life-threatening condition. The authorities are investigating the circumstances surrounding the event. No further details about the victims or the incident have been released yet.",
    "published": "2025-11-02T14:15:03Z"
  },
  {
    "title": "Leicester 1-4 Arsenal, Brighton 2-3 Manchester United, and more: WSL – live",
    "url": "https://www.theguardian.com/football/live/2025/nov/02/leicester-v-arsenal-brighton-v-manchester-united-and-more-wsl-live",
    "image": "https://media.guim.co.uk/3280106f43555bf71abbbe7d48714ef789726c32/781_60_2725_2181/500.jpg",
    "summary": "Yara El-Shaboury covers the latest developments in football, focusing on Arsenal's efforts to narrow the lead at the top of the league. The team aims to secure crucial points in their upcoming matches. Fans are eager to see how the action unfolds across different grounds.",
    "published": "2025-11-02T14:14:48Z"
  },
  {
    "title": "India v South Africa: Women’s Cricket World Cup final – live",
    "url": "https://www.theguardian.com/sport/live/2025/nov/02/india-v-south-africa-womens-cricket-world-cup-final-live",
    "image": "https://media.guim.co.uk/835313a1cb12aa627d55046e87bb12a015d1c1d4/1198_333_2325_1861/500.jpg",
    "summary": "An over-by-over report is being provided on the anticipated trophy match in Navi Mumbai, featuring insights from various writers. The excitement builds as fans eagerly await to see which team will claim victory. Stay tuned for detailed analysis and updates throughout the match.",
    "published": "2025-11-02T14:12:36Z"
  }
]