[
  {
    "title": "Australia news live: Kumanjayi White autopsy handed to prosecutors to decide on criminal charges; chemical leak in Brisbane CBD",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/22/australia-news-live-anthony-albanese-new-york-israel-palestine-donald-trump-optus-triple-zero-ntwnfb",
    "image": "https://media.guim.co.uk/395a333774f38f0216bf45fbc567d269ba73bdb6/1711_645_5497_4397/500.jpg",
    "summary": "I'm sorry, but it seems you haven't provided the news article or its content to summarize. Could you please share the information you would like me to summarize?",
    "published": "2025-09-22T05:33:58Z"
  },
  {
    "title": "TV tonight: hunting the virus that could cause the next pandemic ",
    "url": "https://www.theguardian.com/tv-and-radio/2025/sep/22/tv-tonight-hunting-the-virus-that-could-cause-the-next-pandemic",
    "image": "https://media.guim.co.uk/9cc33e3fb77646a755fb9504512f794270863ffa/1004_0_2981_2385/500.jpg",
    "summary": "Dr. Chris van Tulleken explores a disease that could make COVID-19 seem like a mere \"warning shot.\" Additionally, the fun thriller \"The Guest\" wraps up its storyline. This evening's viewing offers insightful health exploration alongside engaging entertainment.",
    "published": "2025-09-22T05:20:03Z"
  },
  {
    "title": "Vodafone franchisees warned of ‘massive impact’ of commission cuts on mental health",
    "url": "https://www.theguardian.com/business/2025/sep/22/vodafone-franchisees-warned-of-massive-impact-of-commission-cuts-on-mental-health",
    "image": "https://media.guim.co.uk/3b1a08a894d52beb69e451301a9356ce53ed518d/285_0_5039_4033/500.jpg",
    "summary": "Small business owners expressed concerns about stress related to telecom issues four years prior to a significant legal action. This culminated in the launch of a £120 million High Court claim involving 62 businesses against a telecoms group. The claim seeks redress for the issues these businesses faced.",
    "published": "2025-09-22T05:00:06Z"
  },
  {
    "title": "‘Same magic’: ancient Irish road bowling has been revived by TikTok, drones and Bill Murray",
    "url": "https://www.theguardian.com/world/2025/sep/22/same-magic-ancient-irish-road-bowling-revived-by-tiktok-drones-bill-murray",
    "image": "https://media.guim.co.uk/0ccde7368850b287314c88fa964119165e0ba7b5/956_0_5452_4363/500.jpg",
    "summary": "After experiencing a decline, the King and Queen of the Roads, often referred to as the \"Wimbledon\" of the sport, has made a resurgence. It now attracts competitors and large crowds from across Europe. The event highlights the renewed interest and enthusiasm in the sport.",
    "published": "2025-09-22T05:00:05Z"
  },
  {
    "title": "More than 150 lawyers and refugee NGOs report being ‘pressured into silence’ by far-right protesters",
    "url": "https://www.theguardian.com/uk-news/2025/sep/22/more-than-150-lawyers-and-refugee-ngos-report-being-pressured-into-silence-by-far-right-protesters",
    "image": "https://media.guim.co.uk/225615b4a89d3df44a5a433f5d36b4ed91ec48e4/24_0_2915_2333/500.jpg",
    "summary": "Two groups that support UK asylum seekers have shut down their offices due to credible threats to their safety. The decision highlights growing concerns about the security of organizations assisting vulnerable populations. This closure reflects the increasing hostility towards asylum advocacy amid a challenging political climate.",
    "published": "2025-09-22T05:00:05Z"
  }
]