[
  {
    "title": "England v Pakistan: Women’s Cricket World Cup – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/15/england-v-pakistan-womens-cricket-world-cup-live",
    "image": "https://media.guim.co.uk/050b22dae49d1e9f4288698b69a09630b1903e51/260_152_3820_3056/500.jpg",
    "summary": "England faces Pakistan in Colombo, aiming to keep their perfect tournament record intact. The match promises to be a thrilling showdown as both teams vie for victory. Join our writers for detailed over-by-over coverage.",
    "published": "2025-10-15T10:20:29Z"
  },
  {
    "title": "Zelenskyy appoints new leader of Odesa after mayor dismissed for having Russian passport – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/oct/15/russia-ukraine-nato-france-latest-europe-live-news-updates",
    "image": "https://media.guim.co.uk/6b4a8c5f91c72f5e7a57c9d9dcf5007f301d3653/0_0_6842_5473/500.jpg",
    "summary": "Ex-mayor Hennadiy Trukhanov has denied allegations of possessing a Russian passport. He claims the accusations are false and plans to pursue legal action to contest them. Trukhanov's case will be taken to court as he seeks to clear his name.",
    "published": "2025-10-15T10:20:17Z"
  },
  {
    "title": "Supreme court to hear Voting Rights Act challenge that could affect control of Congress – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/15/donald-trump-federal-government-shutdown-redistricting-voting-rights-act-kash-patel-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/7e8775e32cb6047f194b2f5815622a3aa4c8c769/1248_0_6269_5015/500.jpg",
    "summary": "The GOP is aiming to have Section 2 of the Voting Rights Act, which prohibits discrimination in voting, declared unconstitutional. This move comes amid various redistricting disputes occurring nationwide. The party argues that the section has led to legal challenges and complications in the redistricting process.",
    "published": "2025-10-15T10:16:54Z"
  },
  {
    "title": "Raila Odinga, key Kenyan opposition figure and former PM, dies aged 80",
    "url": "https://www.theguardian.com/world/2025/oct/15/raila-odinga-former-kenya-pm-dies",
    "image": "https://media.guim.co.uk/f33f721974b469db5bb5d78fe0aa85acb1307ef4/453_0_4527_3621/500.jpg",
    "summary": "Prominent Kenyan politician Raila Odinga, who made five presidential bids and significantly shaped the country's political landscape, has passed away in India. His death marks the end of an era in Kenyan politics. Tributes are pouring in as the nation reflects on his legacy.",
    "published": "2025-10-15T10:05:28Z"
  },
  {
    "title": "Brexit has had ‘severe and long lasting’ impact on economy, says Reeves, as she confirms budget tax rises – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/oct/15/keir-starmer-kemi-badenoch-pmqs-china-epping-rachel-reeves-imf-uk-politics-live-news-updates",
    "image": "https://media.guim.co.uk/cf1d7f25096a4a8b761518ca054246d555cd1118/836_223_6555_5247/500.jpg",
    "summary": "The Chancellor attributed the struggling UK economy to several factors, including the country's departure from the EU, ongoing austerity measures, and the financial impact of Liz Truss's mini-budget. These elements have contributed to economic challenges facing the nation. The government's focus is on addressing these issues to stabilize and revitalize the economy.",
    "published": "2025-10-15T10:00:57Z"
  }
]