[
  {
    "title": "Premier League buildup, Barcelona return to Camp Nou and more – matchday live",
    "url": "https://www.theguardian.com/football/live/2025/nov/22/premier-league-buildup-barcelona-return-to-camp-nou-and-more-matchday-live",
    "image": "https://media.guim.co.uk/7a1d609c14a11cf071729342b523f09c3a588fba/0_0_5000_4000/500.jpg",
    "summary": "This report provides insights and previews into the upcoming significant football matches. It includes discussions on key teams, players, and strategies to watch for. Fans can expect expert analysis to enhance their understanding of the day's matches.",
    "published": "2025-11-22T11:12:11Z"
  },
  {
    "title": "Daily Mail owner strikes £500m deal to buy Telegraph titles",
    "url": "https://www.theguardian.com/media/2025/nov/22/daily-mail-owner-strikes-deal-buy-telegraph-titles-rothermere",
    "image": "https://media.guim.co.uk/d40c46be98f72f485fe4f6a9152fd523f234cac1/516_0_5160_4128/500.jpg",
    "summary": "The acquisition agreement between DMGT and Redbird IMI is expected to prompt a thorough investigation by regulatory authorities. This scrutiny will likely focus on the implications of the merger for market competition. The outcome could significantly impact the future operations of both companies.",
    "published": "2025-11-22T11:03:30Z"
  },
  {
    "title": "Ukraine’s allies to meet at G20 summit after Zelenskyy warns of ‘impossible choice’ over Trump plan to end war – live",
    "url": "https://www.theguardian.com/world/live/2025/nov/22/russia-ukraine-war-trump-peace-plan-g20-zelenskyy-putin-europe-latest-news-updates",
    "image": "https://media.guim.co.uk/7de8538cbd542fa42f97fcfba6e382079dad0576/405_0_2500_2001/500.jpg",
    "summary": "Trump has proposed a peace plan for Ukraine that requires significant concessions, including surrendering territory to Russia. He asserts that this approach is necessary for achieving peace. Critics argue that such demands undermine Ukraine's sovereignty and territorial integrity.",
    "published": "2025-11-22T11:02:41Z"
  },
  {
    "title": "Trump’s Ukraine peace plan is a gift to Putin | Kenneth Roth",
    "url": "https://www.theguardian.com/commentisfree/2025/nov/22/trump-ukraine-peace-plan-gift-to-putin",
    "image": "https://media.guim.co.uk/f48a0fd7db749a69469ccb06a3e6f799d325607f/351_0_3538_2832/500.jpg",
    "summary": "The proposed plan poses a significant threat to Ukraine's democracy and could undermine its sovereignty. Critics argue that it compromises the nation's ability to self-govern. Concerns arise over the potential long-term implications for Ukraine's independence and democratic processes.",
    "published": "2025-11-22T11:00:39Z"
  },
  {
    "title": "Republicans will be left holding the bill for Trump’s policies in the midterms | Sidney Blumenthal",
    "url": "https://www.theguardian.com/commentisfree/2025/nov/22/republicans-midterm-elections-trump",
    "image": "https://media.guim.co.uk/15166bda67b796c568b824b99c032f334e32e66b/254_0_2498_1998/500.jpg",
    "summary": "The unwavering loyalty of GOP members to the president has raised concerns about their prospects in the upcoming November 4 elections. Critics suggest this blind allegiance may alienate voters. The situation could hinder the party's overall performance during the elections.",
    "published": "2025-11-22T11:00:38Z"
  }
]