[
  {
    "title": "World Cup qualifying news, Potter’s big Sweden bow and more – matchday live",
    "url": "https://www.theguardian.com/football/live/2025/nov/15/world-cup-qualifying-news-potters-big-sweden-bow-and-more-matchday-live",
    "image": "https://media.guim.co.uk/4eae2dc154df3e009aa112f962f942c647895403/0_0_5000_4000/500.jpg",
    "summary": "Will Magee hosts a pre-match show featuring news, discussions, and analysis leading up to the day's football events. Tune in for expert insights and team updates. Stay informed and get ready for the excitement of game day!",
    "published": "2025-11-15T10:11:34Z"
  },
  {
    "title": "‘He was quite a private person’: expansive auction shows Gene Hackman as actor and artist",
    "url": "https://www.theguardian.com/film/2025/nov/15/gene-hackman-auction-actor-artist",
    "image": "https://media.guim.co.uk/35531138349aa8ddd8e4705caab721dd3eb9d6ec/2_0_5315_4255/500.jpg",
    "summary": "Bonhams is auctioning more than 400 items from the estate of a late Oscar-winning actor, including a draft script of \"The Silence of the Lambs.\" The collection also features the actor's unique artwork. The auction showcases a range of memorabilia from his storied career.",
    "published": "2025-11-15T10:02:06Z"
  },
  {
    "title": "Father of teen whose death was linked to social media has ‘lost faith’ in Ofcom",
    "url": "https://www.theguardian.com/technology/2025/nov/15/molly-russell-family-social-media-ofcom",
    "image": "https://media.guim.co.uk/0d9b8eb0a8ba1d3419f3057adaf8c9dd87ad03f0/212_0_2918_2334/500.jpg",
    "summary": "Ian Russell criticized the regulatory watchdog for its lack of urgency in addressing issues and for not fully utilizing its powers as needed. He expressed concerns about the agency's effectiveness in enforcing regulations. Russell's comments highlight a call for stronger action from the watchdog to ensure compliance and protect public interests.",
    "published": "2025-11-15T10:00:07Z"
  },
  {
    "title": "Big content is taking on AI – but it’s far from the David v Goliath tale they’d have you believe | Alexander Avila ",
    "url": "https://www.theguardian.com/commentisfree/2025/nov/15/big-content-ai-entertainment-media-conglomerates-tech",
    "image": "https://media.guim.co.uk/b2dd5ef0cc9ba94cf63aa13edaca49ba306a0738/804_0_3750_3000/500.jpg",
    "summary": "Video essayist Alexander Avila argues that partnerships between media conglomerates and tech companies primarily benefit those corporations, neglecting the interests of artists. He highlights the imbalance in compensation and recognition for creators amidst these deals. Avila calls attention to the need for a more equitable system that supports and values artists' contributions.",
    "published": "2025-11-15T10:00:06Z"
  },
  {
    "title": "Icelandic is in danger of dying out because of AI and English-language media, says former PM",
    "url": "https://www.theguardian.com/world/2025/nov/15/icelandic-is-in-danger-of-dying-out-because-of-ai-and-english-language-media-says-former-pm",
    "image": "https://media.guim.co.uk/85174e4859cfa1f34bac56d0766f0edf293352d7/165_85_1018_815/500.jpg",
    "summary": "Katrín Jakobsdóttir and her co-author urge the 350,000 speakers of the Icelandic language to actively advocate for its preservation. They emphasize the importance of community involvement in maintaining the language's relevance in modern society. The call to action aims to enhance awareness and commitment to safeguarding Icelandic for future generations.",
    "published": "2025-11-15T10:00:06Z"
  }
]