[
  {
    "title": "Trump claims with little evidence that use of Tylenol, or acetaminophen, in pregnancy is linked to autism – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/22/donald-trump-charlie-kirk-autism-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/5575e702c456e7484aca274f2f22e2453f0c92d6/86_0_5478_4385/500.jpg",
    "summary": "President and RKF Jr held a news conference addressing the controversial new drug guidance. They discussed the implications of the policy and its potential impact on public health. The conference highlighted differing opinions and raised concerns among various stakeholders.",
    "published": "2025-09-22T21:27:34Z"
  },
  {
    "title": "Ballon d’Or 2025: Dembélé and Bonmatí claim top awards, Wiegman and Hampton win prizes – live",
    "url": "https://www.theguardian.com/football/live/2025/sep/22/ballon-dor-2025-who-will-be-voted-the-best-male-and-female-footballers-live",
    "image": "https://media.guim.co.uk/29b761bc715e62eb6d0730965216030e8f634cf6/0_0_5000_4000/500.jpg",
    "summary": "Ousmane Dembélé and Aitana Bonmatí have been awarded the main prizes in a recent ceremony. Hannah Hampton and Sarina Wiegman also received accolades for their contributions. The event highlights outstanding achievements in sports.",
    "published": "2025-09-22T21:26:51Z"
  },
  {
    "title": "France recognises state of Palestine, Emmanuel Macron tells UN general assembly – Middle East crisis live",
    "url": "https://www.theguardian.com/world/live/2025/sep/22/palestinian-state-gaza-israel-middle-east-hamas-benjamin-netanyahu-latest-live-updates",
    "image": "https://media.guim.co.uk/944e804bb81f5a77f0d68dd7363ee27724e20944/29_0_4598_3681/500.jpg",
    "summary": "The French president announced important updates during an official address. Meanwhile, Trump is scheduled for high-stakes meetings on Tuesday with leaders from Ukraine, the EU, and various Middle Eastern nations. These discussions aim to address pressing global issues and reinforce international collaborations.",
    "published": "2025-09-22T21:26:29Z"
  },
  {
    "title": "Australia news live: Albanese calls on world to choose different path in Middle East conflict and remembers Zomi Frankcom at UN",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/23/australia-news-live-albanese-new-york-palestine-united-nations-donald-trump-mark-butler-paracetamol-pregnancy-ntwnfb",
    "image": "https://media.guim.co.uk/611e77c307ef224ce96ba03169220bfb9c1bdf88/209_0_3483_2787/500.jpg",
    "summary": "I'm sorry, but I need more context or specific details about the news you would like summarized. Could you please provide the details or key points you want summarized?",
    "published": "2025-09-22T21:25:40Z"
  },
  {
    "title": "London fashion week’s headline act suggests its blue skies ahead at Burberry",
    "url": "https://www.theguardian.com/fashion/2025/sep/22/london-fashion-weeks-headline-act-suggests-its-blue-skies-ahead-at-burberry",
    "image": "https://media.guim.co.uk/b3f1f310689563afa79d57fd21e120d2c0f9c6c4/1000_0_5000_4000/500.jpg",
    "summary": "Britain's largest luxury brand is experiencing a significant surge in success, symbolized by a canvas ceiling painted in a vibrant summer blue. This artistic touch reflects the brand's positive momentum in the market. The news highlights the upward trend in the luxury sector.",
    "published": "2025-09-22T21:13:40Z"
  }
]