[
  {
    "title": "Tottenham v Fulham: Premier League – live",
    "url": "https://www.theguardian.com/football/live/2025/nov/29/tottenham-v-fulham-premier-league-live",
    "image": "https://media.guim.co.uk/b98c0c98563ad35b28ea505bc6c6aa708ed08064/1055_0_3018_2415/500.jpg",
    "summary": "In a minute-by-minute report, Thomas Frank's Spurs aim to recover from two consecutive defeats while facing Marco Silva's team. The match promises to be a tense showdown as both sides seek to improve their performances. Scott Murray provides live coverage of the unfolding game.",
    "published": "2025-11-29T21:16:57Z"
  },
  {
    "title": "Strictly Come Dancing: week 10 – as it happened",
    "url": "https://www.theguardian.com/tv-and-radio/live/2025/nov/29/strictly-come-dancing-week-10-live",
    "image": "https://media.guim.co.uk/1b7565c29585277befef4a5800824b85a3f9157d/437_0_3952_3163/500.jpg",
    "summary": "Karen Carney and Amber Davies achieved perfect scores of 40 during the latest dance challenge at Elstree Studios. The Instant Dance round introduced unexpected twists to the leaderboard rankings. As the competition intensifies, uncertainty looms over which couples may be eliminated before the quarter-finals.",
    "published": "2025-11-29T21:14:51Z"
  },
  {
    "title": "Vision, instinct and tenacity: Stanway shines as Lionesses lay down a marker | Sophie Downey",
    "url": "https://www.theguardian.com/football/2025/nov/29/vision-instinct-and-tenacity-stanway-shines-as-lionesses-lay-down-a-marker",
    "image": "https://media.guim.co.uk/1059d0cc75038f194a48e9de587d677a8bbf8733/1078_0_6538_5231/500.jpg",
    "summary": "The midfielder's three goals showcase her diverse skill set and abilities on the field. Each goal exemplifies the unique attributes that have contributed to her development as a player. Her performance highlights the versatility and talent that define her success.",
    "published": "2025-11-29T21:11:54Z"
  },
  {
    "title": "Sandi’s Great Riviera Rail Trip review – Toksvig’s wonder-filled travelogue is a bibliophile’s fantasy",
    "url": "https://www.theguardian.com/tv-and-radio/2025/nov/29/sandis-great-riviera-rail-trip-review-toksvig-french-coast-channel-4",
    "image": "https://media.guim.co.uk/0eb4036da91e049689c38770380ee95a45dc1b67/242_59_3446_2757/500.jpg",
    "summary": "The QI presenter explores the French south coast, expressing delight over stories of famous writers who once visited the region. She admires the homes of these authors, adding a touch of literary appreciation to her journey. The experience feels like an unintentional literary tour.",
    "published": "2025-11-29T21:05:47Z"
  },
  {
    "title": "What Rosa Parks can teach us about resistance today | Jan-Werner Mueller",
    "url": "https://www.theguardian.com/commentisfree/2025/nov/29/rosa-parks-resistance-today",
    "image": "https://media.guim.co.uk/8e1e7eb70d8ca7e541588f83af83a23fa058bb1b/241_0_2402_1923/500.jpg",
    "summary": "Rosa Parks' narrative emphasizes her immense courage in standing against racial injustice. However, it also highlights the legal repercussions of her actions in defying segregation laws. Her story serves as a reminder of the complexities involved in the fight for civil rights.",
    "published": "2025-11-29T20:58:03Z"
  }
]