[
  {
    "title": "Transfer deadline day: City agree Donnarumma deal, Guéhi to Liverpool move collapses – live",
    "url": "https://www.theguardian.com/football/live/2025/sep/01/transfer-deadline-day-guehi-wissa-martinez-ederson-latest-and-more-live",
    "image": "https://media.guim.co.uk/7ed8f801cc410f7b90776bdd50bf511f934cce3a/175_0_1013_810/500.jpg",
    "summary": "Will Magee is providing ongoing coverage of the late developments in the transfer window, highlighting key events and their implications. Stay tuned for updates on player movements and their impacts on teams. This report will capture the drama and excitement as the deadline approaches.",
    "published": "2025-09-01T21:27:39Z"
  },
  {
    "title": "Australia politics live: new rules for cosmetic procedures industry; AMA criticises calls to lower tobacco excise",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/02/australia-politics-live-labor-coalition-anthony-albanese-sussan-ley-question-time-cosmetic-surgery-tobacco-excise-ntwnfb",
    "image": "https://media.guim.co.uk/3e46a64dc1bf4c30377d1d564fe301b2c2516069/488_0_4164_3333/500.jpg",
    "summary": "I'm unable to access live news updates directly. However, I can help summarize any specific articles or topics you provide. Please share the details you'd like me to summarize!",
    "published": "2025-09-01T21:26:08Z"
  },
  {
    "title": "Aston Villa snap up Jadon Sancho and Harvey Elliott in loan deals",
    "url": "https://www.theguardian.com/football/2025/sep/01/aston-villa-jadon-sancho-harvey-elliott-loan-deals-transfer-deadline-day",
    "image": "https://media.guim.co.uk/a3b1e26d81fe5788b778a2179e5b13d859103a41/129_0_1975_1580/500.jpg",
    "summary": "Aston Villa completed loan signings for Manchester United's Jadon Sancho and Liverpool's Harvey Elliott on transfer deadline day. This strengthens their squad ahead of the upcoming season. Both players bring significant potential and experience to the team.",
    "published": "2025-09-01T21:20:19Z"
  },
  {
    "title": "Away the lad: how Isak’s long and messy departure from Newcastle unfolded | Louise Taylor",
    "url": "https://www.theguardian.com/football/2025/sep/01/alexander-isak-newcastle-liverpool-eddie-howe-saudi-arabia-owners",
    "image": "https://media.guim.co.uk/9d63acc65dbcd49efc11b42ba4285323812ab197/75_0_1483_1186/500.jpg",
    "summary": "A player's journey started with a pay rise proposal and continued with a successful season on the field. This culminated in a record-breaking transfer to Liverpool, setting a new benchmark for British football. The story highlights the player's growth and high demand in the sport.",
    "published": "2025-09-01T21:17:23Z"
  },
  {
    "title": "Nicolas Jackson gets his wish after Chelsea and Bayern Munich agree loan move",
    "url": "https://www.theguardian.com/football/2025/sep/01/nicolas-jackson-gets-his-wish-after-chelsea-and-bayern-munich-agree-loan-move",
    "image": "https://media.guim.co.uk/58a0273cb8e20aab7161996306c464ded1dc0cf7/499_0_4369_3495/500.jpg",
    "summary": "Nicolas Jackson's loan move to Bayern Munich has been finalized after a prolonged negotiation with Chelsea. The transfer saw the Bundesliga champions resolve a tense standoff over the player's situation. Jackson is set to join Bayern in pursuit of a successful season.",
    "published": "2025-09-01T21:12:31Z"
  }
]