[
  {
    "title": "FBI investigating shooting at Dallas immigration facility as ‘act of targeted violence’ – live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/24/donald-trump-jimmy-kimmel-freedom-of-speech-immigration-government-shutdown-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/2a31ae3af7399a58e942cf59ad12d39e233d5ff4/575_0_4583_3667/500.jpg",
    "summary": "The Dallas police chief reported that early evidence indicates the shooter had 'anti-Ice' messages on rounds found at the scene. A Department of Homeland Security official confirmed that ICE detainees were among the victims. This connection has raised concerns about the motivations behind the shooting.",
    "published": "2025-09-24T15:33:42Z"
  },
  {
    "title": "Supercentenarian gives scientists insight on secrets of healthy old age",
    "url": "https://www.theguardian.com/science/2025/sep/24/supercentenarian-gives-scientists-insight-on-secrets-of-healthy-old-age",
    "image": "https://media.guim.co.uk/613178464ee68fbb284882bfe3f96a52c31fda45/182_0_750_600/500.jpg",
    "summary": "Tests on Maria Branyas Morera, the world's oldest person who passed away at 117, provided doctors with valuable insights into aging and longevity. Her unique genetic makeup and health history contribute to research on extended lifespan. The findings may help inform strategies for healthier aging in the general population.",
    "published": "2025-09-24T15:32:44Z"
  },
  {
    "title": "Nottinghamshire v Warwickshire, tributes paid to Dickie Bird, and more: county cricket – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/24/nottinghamshire-v-warwickshire-hampshire-v-surrey-and-more-county-cricket-live",
    "image": "https://media.guim.co.uk/f7c819d4564a071a70a2cdc4eb76f9843b27575e/282_0_4767_3814/500.jpg",
    "summary": "Nottinghamshire aims to secure the County Championship title as they face Surrey in the final round of the season. Tanya Aldred provides live updates from the first day of this crucial match. The outcome will determine if Notts can maintain their lead and clinch the championship.",
    "published": "2025-09-24T15:30:42Z"
  },
  {
    "title": "Nigel Farage swans around peddling hate on Nick Ferrari’s phone-in | John Crace",
    "url": "https://www.theguardian.com/politics/2025/sep/24/nigel-farage-swans-around-peddling-hate-on-nick-ferraris-phone-in",
    "image": "https://media.guim.co.uk/7cab416840d8c29a926d1c1ecfee4a0344ec269d/2285_667_2957_2366/500.jpg",
    "summary": "The article discusses various cultural and social issues in the UK, highlighting immigrants' impact on traditional practices like hunting waterfowl. It contrasts this with the influence of sharia law in London, reflecting broader societal tensions. Overall, it critiques the relativistic approach to these complex topics, as represented by a figure referred to as \"Nige.\"",
    "published": "2025-09-24T15:27:07Z"
  },
  {
    "title": "‘Ukraine is only the first’, Zelenskyy warns UN as he highlights global threats – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/sep/24/russia-ukraine-trump-zelenskyy-unga-drones-europe-latest-news-updates",
    "image": "https://media.guim.co.uk/683af768ddcf5deba163461dff47c0a4f652a28e/319_0_3201_2560/500.jpg",
    "summary": "The Kremlin has rejected claims made by the US president that Ukraine could recover all territory lost due to Russia's invasion. Russian officials emphasized the improbability of Ukraine reclaiming its land. This statement highlights ongoing tensions between Russia and Western nations regarding the conflict in Ukraine.",
    "published": "2025-09-24T15:27:06Z"
  }
]