[
  {
    "title": "Ashes second Test, day four: England all out for 241 as Australia close on victory – live",
    "url": "https://www.theguardian.com/sport/live/2025/dec/07/australia-vs-england-live-ashes-second-2nd-test-day-four-aus-v-eng-cricket-scores-updates-gabba-brisbane",
    "image": "https://media.guim.co.uk/c8b9d9c22be6dd5059b6735816e9765b5c740657/148_132_2750_2199/500.jpg",
    "summary": "England faces a daunting challenge in Brisbane, needing a significant turnaround to compete. James Wallace provides live updates from the Gabba as the match unfolds. The situation looks critical for the England team.",
    "published": "2025-12-07T09:18:07Z"
  },
  {
    "title": "Starmer says Rayner will return to cabinet – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/dec/07/keir-starmer-labour-reform-conservatives-your-party-uk-politics-latest-news-updates",
    "image": "https://media.guim.co.uk/ef89e6d973b2d1173f1dff0d29de38013d336ef3/393_0_3928_3143/500.jpg",
    "summary": "The Prime Minister praised a former deputy, highlighting her potential to become a significant figure in the Labour movement. He expressed confidence in her abilities and influence within the party. The statement reinforces the importance of her role in shaping future initiatives.",
    "published": "2025-12-07T09:16:07Z"
  },
  {
    "title": "Premier League buildup, FA Cup second round updates, and more – live",
    "url": "https://www.theguardian.com/football/live/2025/dec/07/premier-league-buildup-fa-cup-second-round-updates-and-more-live",
    "image": "https://media.guim.co.uk/9b6a91e516d60b8e80c79f7e65ac248e188ca955/0_0_5000_4000/500.jpg",
    "summary": "Join our writers for coverage leading up to the FA Cup matches between Brighton and West Ham, as well as Fulham and Crystal Palace. Stay updated on the latest developments in Scottish football and European leagues. Don't miss the buildup to this exciting weekend of matches!",
    "published": "2025-12-07T09:15:13Z"
  },
  {
    "title": "Hostile powers sending spies to west’s universities, says former security chief",
    "url": "https://www.theguardian.com/world/2025/dec/07/hostile-powers-spying-universities-canada-former-security-chief",
    "image": "https://media.guim.co.uk/42da6fe8a515f5a08855effff3c090881e63616b/761_0_4279_3424/500.jpg",
    "summary": "Canadian expert David Vigneault has issued a warning about China's aggressive efforts to steal advanced technologies, describing them as 'industrial-strength' operations. He highlights the significant threat this poses to national security and innovation. Vigneault emphasizes the need for vigilance and countermeasures to protect intellectual property.",
    "published": "2025-12-07T09:00:17Z"
  },
  {
    "title": "C of E to challenge Tommy Robinson ‘put Christ back into Christmas’ message ",
    "url": "https://www.theguardian.com/world/2025/dec/07/church-of-england-campaign-challenging-tommy-robinson-put-christ-back-into-christmas-message",
    "image": "https://media.guim.co.uk/ea446b5178b53151a2c6e7381903d0a1c4a8df10/419_0_3333_2667/500.jpg",
    "summary": "Church leaders are countering the use of Christian symbols by far-right groups by promoting an inclusive message of \"Outsiders welcome.\" They aim to reclaim religious imagery for a more diverse and accepting faith community. This initiative seeks to challenge extremist interpretations and foster unity among believers.",
    "published": "2025-12-07T09:00:17Z"
  }
]