[
  {
    "title": "Wolves sack Pereira, buildup to Celtic and Rangers and two Premier League games – matchday live",
    "url": "https://www.theguardian.com/football/live/2025/nov/02/old-firm-clash-scottish-league-cup-semi-final-premier-league-buildup-matchday-live",
    "image": "https://media.guim.co.uk/4551d9339b951cea32b24877b5865a376c8e66a8/233_50_2439_1951/500.jpg",
    "summary": "Join Tom Bassam for updates and previews as Scotland and England gear up for another exciting day of action in sports. Get ready for the latest news and insights. Don't miss out on the key highlights!",
    "published": "2025-11-02T12:35:06Z"
  },
  {
    "title": "Leicester v Arsenal, Brighton v Manchester United, and more: WSL – live",
    "url": "https://www.theguardian.com/football/live/2025/nov/02/leicester-v-arsenal-brighton-v-manchester-united-and-more-wsl-live",
    "image": "https://media.guim.co.uk/9f948bc69fccda0bee661fac62360ae80c2170cc/293_0_2829_2263/500.jpg",
    "summary": "Arsenal aims to narrow the gap at the top of the league as they compete in their latest match. Yara El-Shaboury provides live updates and coverage from the various stadiums. Fans eagerly follow the action and anticipate Arsenal's performance.",
    "published": "2025-11-02T12:34:26Z"
  },
  {
    "title": "Cambridgeshire train stabbing: suspects both British and ‘nothing to suggest’ attack was terrorism, say police – latest updates",
    "url": "https://www.theguardian.com/uk-news/live/2025/nov/02/cambridgeshire-train-stabbing-life-threatening-injuries-arrests-latest-updates",
    "image": "https://media.guim.co.uk/c64113b57144b27bf5bd5799829b195ed0b3600b/0_0_3471_2777/500.jpg",
    "summary": "Two men have been arrested on suspicion of attempted murder following an incident that left two individuals in critical condition. Authorities are investigating the circumstances surrounding the event. The situation remains serious as the victims fight for their lives.",
    "published": "2025-11-02T12:33:52Z"
  },
  {
    "title": "India v South Africa: Women’s Cricket World Cup final – live",
    "url": "https://www.theguardian.com/sport/live/2025/nov/02/india-v-south-africa-womens-cricket-world-cup-final-live",
    "image": "https://media.guim.co.uk/150e3beb9cb8d213ee9f245e21c20e0003185680/857_0_4668_3734/500.jpg",
    "summary": "An over-by-over report is being provided for the ongoing match in Navi Mumbai, where the anticipation builds for the eventual trophy winner. Writers are giving insights and updates throughout the game. Fans can follow the live commentary to see which team will claim victory.",
    "published": "2025-11-02T12:32:19Z"
  },
  {
    "title": "Dead Man Walking review – searing honesty and humanity in ENO’s staging of Heggie’s compelling opera",
    "url": "https://www.theguardian.com/music/2025/nov/02/dead-man-walking-review-eno-london-coliseum-jake-heggie-christine-rice",
    "image": "https://media.guim.co.uk/ff62e99b99c5141de69f68293f98358b0ddd462b/1088_421_3826_3061/500.jpg",
    "summary": "The UK premiere of Heggie and Terrence McNally’s adaptation of Sister Helen Prejean's memoir explores themes of truth, compassion, and capital punishment. The production is marked by emotional depth, with powerful performances that convey empathy and pathos. It offers a poignant reflection on a deeply controversial issue.",
    "published": "2025-11-02T12:18:15Z"
  }
]