[
  {
    "title": "China victory day parade live: Xi, Putin and Kim Jong-un appear together as Trump accuses them of conspiring against US",
    "url": "https://www.theguardian.com/world/live/2025/sep/03/china-victory-day-military-parade-80th-japan-surrender-live-updates-xi-jinping-putin-kim-jong-un-latest",
    "image": "https://media.guim.co.uk/b12c5010d64f1814acd813f6a3c606b33b696ce4/696_0_2104_1684/500.jpg",
    "summary": "Xi Jinping showcased China's military capabilities at an event featuring leaders from Russia, North Korea, Iran, and Myanmar. The display emphasizes China's growing military influence and partnerships. This gathering highlights the deepening ties between these nations amid global geopolitical tensions.",
    "published": "2025-09-03T03:02:11Z"
  },
  {
    "title": "Australia politics live: Chalmers bullish on economy despite weak GDP data; Pocock scores Senate win on aged home care bill",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/03/australia-politics-live-labor-coalition-greens-anthony-albanese-sussan-ley-question-time-nauru-immigration-asylum-ntwnfb",
    "image": "https://media.guim.co.uk/182ab9fbbfa1de419e8857f2d613109234da47ab/340_0_6325_5063/500.jpg",
    "summary": "I'm sorry, but I need more information to provide a summary. Could you please provide the content or details of the news you would like summarized?",
    "published": "2025-09-03T03:00:27Z"
  },
  {
    "title": "Trump news at a glance: president shrugs off ill health rumours as ‘fake news’",
    "url": "https://www.theguardian.com/us-news/2025/sep/03/trump-administration-news-updates-today",
    "image": "https://media.guim.co.uk/63489c66ab0e6dcb98aeaf94042b3d89a2e319d4/1303_759_3910_3130/500.jpg",
    "summary": "Donald Trump stated he was \"very active over the weekend\" while responding to speculation regarding his health, asserting there is nothing wrong with him. He downplayed concerns raised by critics and maintained his usual public persona. The remarks came amid a backdrop of ongoing discussions in US politics.",
    "published": "2025-09-03T02:07:33Z"
  },
  {
    "title": "Labor is poised to make a big call on our nation’s carbon emissions target. But who is Albanese going to listen to?  | Clear Air",
    "url": "https://www.theguardian.com/environment/2025/sep/03/climate-crisis-labor-carbon-emissions-target-albanese-big-call",
    "image": "https://media.guim.co.uk/ffb8980b34266677cab2d1d5938a9216eb1e27f5/442_431_3557_2847/500.jpg",
    "summary": "Australia's target for reducing emissions by 2035 will serve as a key indicator of its commitment to tackling the climate crisis. This target is expected to be a significant benchmark for evaluating the nation's environmental policies and actions. The outcome will reflect Australia's overall dedication to sustainable practices and climate responsibility.",
    "published": "2025-09-03T02:02:43Z"
  },
  {
    "title": "US House committee releases batch of Epstein records as White House fights release of all files – as it happened",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/02/congress-returns-government-shutdown-funding-trump-announcement-us-politics-live-latest-updates",
    "image": "https://media.guim.co.uk/37dd38e8ca0e0fcabf8e02a039a62a031d60968c/694_509_4364_3491/500.jpg",
    "summary": "A Republican-led oversight committee has released more than 33,000 pages of documents as part of their investigation into a deceased sex offender. The files are intended to provide insight into the circumstances surrounding the individual's offenses. The release underscores ongoing scrutiny and accountability related to the case.",
    "published": "2025-09-03T01:59:53Z"
  }
]