[
  {
    "title": "Australia news live: Malcolm Turnbull says Coalition consumed by ‘fact-free, reality-free culture war’ over climate",
    "url": "https://www.theguardian.com/australia-news/live/2025/nov/17/australia-news-live-schools-act-asbestos-education-sand-coalition-climate-energy-net-zero-sussan-ley-leadership-challenge-andrew-hastie-liberals-nationals-ntwnfb",
    "image": "https://media.guim.co.uk/f2ad974ffab26aa80fc5a06226117ee6ec56ccf1/0_0_3359_2687/500.jpg",
    "summary": "I apologize, but I can't summarize content without knowing what specific news you're referring to. Please provide the details or context of the news you'd like me to summarize.",
    "published": "2025-11-17T05:20:53Z"
  },
  {
    "title": "China and Japan are in a war of words over Taiwan – what happens next?",
    "url": "https://www.theguardian.com/world/2025/nov/17/china-and-japan-are-in-a-war-of-words-over-taiwan-what-happens-next",
    "image": "https://media.guim.co.uk/878707b7ee2d5eb1447a2a0d4773b39557637dc7/824_0_4164_3333/500.jpg",
    "summary": "Japan's new hawkish Prime Minister has sparked tensions with Beijing by hinting at possible Japanese involvement in a military conflict between China and Taiwan. The remarks reflect a significant shift in Japan's defense posture amid increasing regional tensions. This development adds to the already strained relations between Japan and China.",
    "published": "2025-11-17T05:11:13Z"
  },
  {
    "title": "England, please be competitive. The Ashes’ claim to the greatest rivalry depends on it | Jack Snape",
    "url": "https://www.theguardian.com/sport/2025/nov/17/england-please-be-competitive-the-ashes-claim-to-the-greatest-rivalry-depends-on-it",
    "image": "https://media.guim.co.uk/cfe1fb5b48a893f3637ddf676accbe300e46bc00/0_0_3520_2815/500.jpg",
    "summary": "The long-anticipated Test series in Australia has lacked excitement for over a decade, falling flat compared to expectations. Critics question whether a more compelling cricket rivalry exists outside of this Australian setting. The ongoing trend raises concerns about the future appeal of Test matches in Australia.",
    "published": "2025-11-17T05:08:06Z"
  },
  {
    "title": " Not OK? Booker winner Flesh ignites debate about state of masculinity ",
    "url": "https://www.theguardian.com/books/2025/nov/17/david-szalay-booker-prize-novel-crisis-masculinity-debate",
    "image": "https://media.guim.co.uk/5989d97ba07aec6abd8e02f55cc6dc6f03576f76/662_0_6609_5288/500.jpg",
    "summary": "David Szalay's protagonist exemplifies toxic masculinity, highlighting contemporary societal issues surrounding men's roles and identities. The narrative addresses the growing concerns about a perceived 'crisis of masculinity' in today's world. Szalay's portrayal serves as a commentary on the challenges and transformations facing modern masculinity.",
    "published": "2025-11-17T05:00:06Z"
  },
  {
    "title": "Rape victims in Scotland will be protected when giving evidence, says lord advocate",
    "url": "https://www.theguardian.com/uk-news/2025/nov/17/rape-victims-in-scotland-will-be-protected-when-giving-evidence-says-lord-advocate",
    "image": "https://media.guim.co.uk/419fd30370dcb08ab1ace7fb9c28641c36f69e2c/0_201_2244_1794/500.jpg",
    "summary": "The Supreme Court has ruled that 'rape shield' laws, which are designed to protect victims from intrusive cross-examination during trials, may potentially infringe on men's rights to a fair trial. This decision raises concerns about the balance between protecting victims and ensuring defendants receive due process. The ruling highlights the complexities of legal protections in sexual assault cases.",
    "published": "2025-11-17T05:00:05Z"
  }
]