[
  {
    "title": "Gaza aid flotilla: more than a dozen vessels intercepted by Israeli forces; Greta Thunberg arrested – live",
    "url": "https://www.theguardian.com/world/live/2025/oct/01/israel-gaza-aid-global-sumud-flotilla-middle-east-crisis-latest-updates",
    "image": "https://media.guim.co.uk/1dc8eff7cd550ab162294c9a1525393e9bf0e162/107_0_705_564/500.jpg",
    "summary": "The Israeli foreign ministry shared a video of climate activist Greta Thunberg's arrest during an incident involving vessels carrying approximately 500 activists. These vessels were intercepted about 75 miles off the coast of the conflict-affected region. The arrest highlights ongoing tensions surrounding activism related to the situation in the area.",
    "published": "2025-10-02T05:14:55Z"
  },
  {
    "title": "Farage, Trump, Musk: your boy Javier Milei just took one hell of a beating. Why so quiet?",
    "url": "https://www.theguardian.com/commentisfree/2025/oct/02/javier-milei-argentina-nigel-farage-donald-trump-elon-musk",
    "image": "https://media.guim.co.uk/996506581235387566b94c7c00e62c029c8a6d64/167_0_1665_1333/500.jpg",
    "summary": "Argentina's president gained popularity among right-wing supporters for his bold economic moves, likened to a chainsaw approach. However, as the nation grapples with severe financial turmoil, he has remained notably silent. Columnist Aditya Chakrabortty critiques this silence amid the chaos.",
    "published": "2025-10-02T05:00:41Z"
  },
  {
    "title": "Kemi Badenoch vows to repeal Climate Change Act",
    "url": "https://www.theguardian.com/environment/2025/oct/02/kemi-badenoch-vows-to-repeal-climate-change-act",
    "image": "https://media.guim.co.uk/fbeaf1cbe8ccf3bd7c17fd207340ae9fb71edc5a/500_0_5000_4000/500.jpg",
    "summary": "The Tory leader has proposed replacing the current climate strategy with a focus on \"cheap energy,\" marking a significant shift from the long-standing bipartisan agreement on climate policies. This new approach aims to prioritize affordability over traditional climate initiatives. Critics are concerned about the potential environmental impacts of this change.",
    "published": "2025-10-02T05:00:40Z"
  },
  {
    "title": "Europe’s air safety at risk amid cost-cutting and staff pressures, study warns",
    "url": "https://www.theguardian.com/global/2025/oct/02/europes-air-safety-at-risk-amid-cost-cutting-and-staff-pressures-study-warns",
    "image": "https://media.guim.co.uk/46f8413bf0ea59c92930dcc037f547053f5de89f/1480_0_3835_3067/500.jpg",
    "summary": "Researchers have discovered that the pursuit of profit in various industries has significantly compromised safety protocols. Workers feel powerless to contest decisions that may jeopardize their well-being. This study highlights the need for a reevaluation of corporate priorities to better safeguard employee safety.",
    "published": "2025-10-02T05:00:40Z"
  },
  {
    "title": "UK fifth-worst country in Europe for loss of green space to development",
    "url": "https://www.theguardian.com/environment/2025/oct/02/uk-fifth-worst-country-in-europe-for-loss-of-green-space-to-development",
    "image": "https://media.guim.co.uk/5f251ac45d5fd94b7f7ea7656dde2a00c3df243d/334_0_3331_2666/500.jpg",
    "summary": "In the past five years, England, Wales, and Northern Ireland have lost 1,680 football pitches' worth of protected natural land. This significant decline raises concerns about environmental preservation and habitat loss. The report highlights ongoing challenges related to land management and conservation efforts in the region.",
    "published": "2025-10-02T05:00:40Z"
  }
]