[
  {
    "title": "Australia v India: second men’s Twenty20 international – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/31/australia-v-india-t20-live-second-twenty20-international-cricket-aus-vs-ind-latest",
    "image": "https://media.guim.co.uk/db7709b9809165e03e90ba12bd938dfd1c406609/672_0_4886_3908/500.jpg",
    "summary": "Australia has opted to bowl first against their arch-rivals in a sold-out match at the MCG for the second game of the T20 series. Martin Pegan will provide live updates throughout the game. Fans are eagerly anticipating this clash.",
    "published": "2025-10-31T09:21:42Z"
  },
  {
    "title": " Government ‘warmly welcomes’ move to make Andrew an ‘ordinary member of the public’ – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/oct/31/uk-politics-prince-andrew-latest-news-updates-labour-conservatives-keir-starmer-rachel-reeves",
    "image": "https://media.guim.co.uk/8cecbc77c719778e1ce8191d66e7ae7fb84465ec/1369_0_3168_2536/500.jpg",
    "summary": "Chris Bryant has proposed that Andrew should agree to any requests from the US Senate to travel to the United States. This comes in relation to inquiries regarding the crimes of Jeffrey Epstein. Bryant's suggestion emphasizes the importance of addressing these serious allegations.",
    "published": "2025-10-31T09:16:47Z"
  },
  {
    "title": "Ukraine reports fresh Russian attacks amid reports Moscow used ‘secret’ missile in recent months – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/oct/31/ukraine-russian-attacks-secret-missile-netherlands-dutch-elections-europe-live-latest-news-updates",
    "image": "https://media.guim.co.uk/97b92369719435dfe021905cda7094521b5b4592/279_0_1187_950/500.jpg",
    "summary": "The 9M729 cruise missile's development led Donald Trump to withdraw the U.S. from a nuclear arms control agreement with Russia. This decision was made during his first term as president. The move heightened tensions between the two nations regarding nuclear arms.",
    "published": "2025-10-31T09:16:25Z"
  },
  {
    "title": "‘Extreme heebie-jeebies’: writers on their scariest movies of all time",
    "url": "https://www.theguardian.com/film/2025/oct/31/halloween-scariest-movies-of-all-time",
    "image": "https://media.guim.co.uk/7742b3ea9db731464b2b930ba6034dcecce13ddf/320_0_2513_2009/500.jpg",
    "summary": "The Guardian's writers have chosen their most terrifying films for Halloween, highlighting classics like \"The Shining,\" \"The Descent,\" and \"The Strangers.\" The selection showcases a range of horror that has left a lasting impact on audiences. Readers are invited to explore these chilling titles as they celebrate the spooky season.",
    "published": "2025-10-31T09:02:21Z"
  },
  {
    "title": "Frankenstein to Kenny Dalglish: the seven best films to watch on TV this week",
    "url": "https://www.theguardian.com/tv-and-radio/2025/oct/31/frankenstein-to-kenny-dalglish-the-seven-best-films-to-watch-on-tv-this-week",
    "image": "https://media.guim.co.uk/0ffce1a0d05bc665c07be6e23063a23b3cc56153/478_15_4825_3862/500.jpg",
    "summary": "Oscar Isaac and Jacob Elordi headline Guillermo del Toro's new gothic adaptation of a classic tale. The film showcases a dark and intricate narrative. Meanwhile, football legend shares his life's journey through the highs and lows of the sport in a documentary with Asif Kapadia.",
    "published": "2025-10-31T09:00:21Z"
  }
]