[
  {
    "title": "New Zealand edge home to beat England and seal series sweep: third men’s ODI – live",
    "url": "https://www.theguardian.com/sport/live/2025/nov/01/new-zealand-v-england-third-mens-cricket-one-day-international-live",
    "image": "https://media.guim.co.uk/a68d56da46a04cf396a09e994a672751705c90d2/249_0_3331_2666/500.jpg",
    "summary": "The third ODI between New Zealand and England took place in Wellington, with real-time commentary and analysis provided by our writers. The match featured key moments that elicited strong reactions from fans and commentators. Stay tuned for detailed insights and highlights from the game.",
    "published": "2025-11-01T08:17:01Z"
  },
  {
    "title": "Premier League buildup, Earps book revelations and more – matchday live ",
    "url": "https://www.theguardian.com/football/live/2025/nov/01/premier-league-buildup-earps-book-revelations-and-more-matchday-live",
    "image": "https://media.guim.co.uk/3fb7834f63dbb643b558df45f2d4daf3ae3be9fe/867_0_6010_4812/500.jpg",
    "summary": "Billy Munday will host a segment featuring news, previews, and discussions leading up to an exciting day of events. Listeners can expect insights and analysis on the day's action. Stay tuned for in-depth coverage!",
    "published": "2025-11-01T08:16:23Z"
  },
  {
    "title": "The best theatre to stream this month: The Unlikely Pilgrimage of Harold Fry goes an extra mile",
    "url": "https://www.theguardian.com/stage/2025/nov/01/best-theatre-stream-this-month-unlikely-pilgrimage-harold-fry",
    "image": "https://media.guim.co.uk/85a53c6090e5e65f65be1b31fe2a585132a9b17a/305_327_1466_1173/500.jpg",
    "summary": "Passenger is reimagining songs from his acclaimed musical, while Tanika Gupta adapts Ibsen's work with a contemporary Hollywood twist. Additionally, TikTok is emerging as a platform for aspiring young playwrights to showcase their talent. This reflects a growing trend of reinterpreting classic works and utilizing digital platforms in the arts.",
    "published": "2025-11-01T08:00:31Z"
  },
  {
    "title": "India search for perfect end in historic Women’s Cricket World Cup final against South Africa",
    "url": "https://www.theguardian.com/sport/2025/nov/01/india-search-perfect-end-historic-womens-cricket-world-cup-final-south-africa",
    "image": "https://media.guim.co.uk/c0b556be7ed7f4d83b70d3881e657bed0e58a491/443_193_1807_1445/500.jpg",
    "summary": "The hosts face a crucial opportunity to overcome years of institutional misogyny following a challenging semi-final match. However, the exhausting nature of the game raises doubts about their ability to capitalize on this chance. The situation highlights both the progress made and the significant hurdles still to overcome.",
    "published": "2025-11-01T08:00:30Z"
  },
  {
    "title": "Would Celtic gamble on O’Neill if idol brings success against oldest rivals?",
    "url": "https://www.theguardian.com/football/2025/nov/01/martin-oneill-celtic-rangers-manager-scottish-league-cup-semi-final",
    "image": "https://media.guim.co.uk/e02b05998014825c42d1e380d956b2d8465503c5/170_0_2388_1910/500.jpg",
    "summary": "The outcome of the Scottish League Cup semi-final against Rangers may significantly influence the future of the current manager. A victory could lead to a surprising full-time appointment, while a loss might prompt the search for a new managerial candidate. This match is pivotal for the club's direction moving forward.",
    "published": "2025-11-01T08:00:30Z"
  }
]