[
  {
    "title": "Rachel Reeves says Labour’s Youth Guarantee will ‘abolish long-term youth unemployment’ – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/29/rachel-reeves-labour-party-conference-youth-guarantee-unemployment-uk-politics-live-latest-news",
    "image": "https://media.guim.co.uk/5a59b30e3b68e5aec9de018f01b3c08b8c6f5bad/505_0_4910_3930/500.jpg",
    "summary": "The Chancellor is set to announce a new pledge at the Labour Party conference, reminiscent of Gordon Brown's signature policy initiative. This strategy aims to address key economic issues facing the country. The move signals a strong commitment to establish a progressive agenda within the party.",
    "published": "2025-09-29T07:15:42Z"
  },
  {
    "title": "Australia news live: Albanese government urged to protect Australians on aid ships bound for Gaza; search for Dezi Freeman scaled back",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/29/australia-news-live-optus-suffers-fresh-triple-zero-glitch-labors-first-deficit-not-as-bad-as-feared",
    "image": "https://media.guim.co.uk/b4ab67863d1553ac73a94e0a0d1a9a95404ed577/1365_0_6827_5464/500.jpg",
    "summary": "I'm sorry, but I need more context or content from the news article you'd like summarized. Please provide further details or the main points of the news.",
    "published": "2025-09-29T07:15:13Z"
  },
  {
    "title": "Woman raped by group of men in Oxfordshire churchyard",
    "url": "https://www.theguardian.com/uk-news/2025/sep/29/woman-raped-by-group-of-men-in-oxfordshire-churchyard-banbury",
    "image": "https://media.guim.co.uk/c9571475a74d58e7280c46440c3f0bc5377a1d43/414_0_4099_3280/500.jpg",
    "summary": "Police are seeking witnesses regarding an incident that occurred at St Mary’s Church in Banbury town centre. They are urging anyone with information to come forward. The investigation aims to gather details to better understand the situation.",
    "published": "2025-09-29T07:08:47Z"
  },
  {
    "title": "Surprise change of CEO at GSK; ‘Moral hazard’ fears over Jaguar Land Rover’s £1.5bn state loan guarantee – business live",
    "url": "https://www.theguardian.com/business/live/2025/sep/29/moral-hazard-fears-jlr-jaguar-land-rover-government-loan-gsk-ceo-astrazeneca-listing-dollar-shutdown-business-live-news",
    "image": "https://media.guim.co.uk/93a963962303e4034d3bdd8149d02e3940fdd356/333_0_3333_2668/500.jpg",
    "summary": "The latest economic and financial news highlights ongoing developments in global markets, analyzing trends and reactions to various economic indicators. Key factors influencing the economy include inflation rates, interest rate changes, and geopolitical events. Analysts are closely monitoring these dynamics to forecast future implications for investors and policymakers.",
    "published": "2025-09-29T07:06:35Z"
  },
  {
    "title": "Go fake yourself! The creators of trippy, four-hour art forgery epic Rohtko on their quest for truth",
    "url": "https://www.theguardian.com/stage/2025/sep/29/art-forgery-epic-rohtko-quest-for-truth-chinese-maths-teacher",
    "image": "https://media.guim.co.uk/7c0e709e545dfc1606490c1b8d5dfa2cdab8422f/229_0_2280_1825/500.jpg",
    "summary": "Łukasz Twarkowski's play, inspired by a scandal involving a New York gallery and a Chinese maths teacher, challenges audiences to critically examine their beliefs. The narrative intertwines themes of art, identity, and deception. The play provokes deep reflection on truth and perception in contemporary society.",
    "published": "2025-09-29T07:00:35Z"
  }
]