[
  {
    "title": "Ballon d’Or 2025: who will be voted the best men’s and women’s footballers? – live",
    "url": "https://www.theguardian.com/football/live/2025/sep/22/ballon-dor-2025-who-will-be-voted-the-best-male-and-female-footballers-live",
    "image": "https://media.guim.co.uk/74b7553d51f62743bf77d077cc73e707ead30131/534_0_4833_3866/500.jpg",
    "summary": "A live report by Michael Butler is underway to determine the recipients of the best men's and women's footballers awards. Fans are eagerly awaiting the announcement of the winners. Stay tuned for updates on this prestigious recognition in football.",
    "published": "2025-09-22T18:47:39Z"
  },
  {
    "title": "Allies’ recognition of Palestine angers Netanyahu – but his options for response are limited",
    "url": "https://www.theguardian.com/world/2025/sep/22/allies-recognition-of-palestine-angers-netanyahu-but-his-options-for-response-are-limited",
    "image": "https://media.guim.co.uk/a29041e9f0a95076521dd504a54bd308354baf2c/524_0_4012_3210/500.jpg",
    "summary": "The Israeli prime minister has issued threats regarding unilateral actions and potential annexation. However, he is cautious not to jeopardize the diplomatic deal promoted by Trump. Balancing these pressures poses a significant challenge for his administration.",
    "published": "2025-09-22T18:45:27Z"
  },
  {
    "title": "Trump to meet with world leaders at UN general assembly as summit focuses on two-state solution – Middle East crisis live",
    "url": "https://www.theguardian.com/world/live/2025/sep/22/palestinian-state-gaza-israel-middle-east-hamas-benjamin-netanyahu-latest-live-updates",
    "image": "https://media.guim.co.uk/b3e994dcbc1989bd01ae3af5616680d9708aaf72/11_0_4458_3566/500.jpg",
    "summary": "Former President Trump is set to address the UN General Assembly in New York on Tuesday. During this visit, he will engage in crucial meetings with leaders from Ukraine, the EU, and various Middle Eastern countries. These discussions are expected to focus on pressing global issues and diplomatic relations.",
    "published": "2025-09-22T18:45:03Z"
  },
  {
    "title": "Trump’s Fed pick doubles down on calls to aggressively cut interest rates",
    "url": "https://www.theguardian.com/business/2025/sep/22/trump-federal-reserve-stephen-miran-interest-rates",
    "image": "https://media.guim.co.uk/e25674e0a991028d707593b9fc0a741634ddf063/333_0_3334_2668/500.jpg",
    "summary": "Stephen Miran predicts that interest rates will fall below 3% by the end of the year. He downplays concerns that tariffs imposed by the US president will lead to increased inflation. Miran's outlook suggests confidence in economic stability despite current trade policies.",
    "published": "2025-09-22T18:37:05Z"
  },
  {
    "title": "Trump press secretary denies president is weaponizing justice department and dodges question on autism announcement – live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/22/donald-trump-charlie-kirk-autism-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/2634bbbbf1bb558047074a6df983813ba889847a/538_0_4501_3601/500.jpg",
    "summary": "Karoline Leavitt accused the media of \"gaslighting\" regarding reports of a pressure campaign. She avoided directly addressing queries about an anticipated announcement related to acetaminophen. The controversy highlights tensions between media narratives and political responses.",
    "published": "2025-09-22T18:36:40Z"
  }
]