[
  {
    "title": "Breeders’ Cup 2025 horse racing: day one – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/31/breeders-cup-2025-horse-racing-day-one-live",
    "image": "https://media.guim.co.uk/5f4f7d57706485ef9c5fe01c90cc55a60e41c6e9/496_0_3875_3103/500.jpg",
    "summary": "Greg Wood provides updates on a major horse racing event in California, renowned for its prestige. The event promises excitement and top-tier competition. Stay tuned for the latest news and developments.",
    "published": "2025-10-31T22:16:23Z"
  },
  {
    "title": "Judge rules Trump can’t require citizenship proof on federal voting form – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/31/donald-trump-filibuster-shutdown-snap-food-refugees-drug-boats-latest-news-updates",
    "image": "https://media.guim.co.uk/ac379054da177b9482de14e14cf2837c15b62c7b/660_0_3824_3060/500.jpg",
    "summary": "A federal judge has ruled that a directive issued by former President Trump is unconstitutional, citing a breach of the separation of powers. The decision underscores the judiciary's role in checking executive authority. This ruling may have implications for future actions by presidential administrations.",
    "published": "2025-10-31T21:54:21Z"
  },
  {
    "title": "A luxury cruise ship stopped at a remote Australian island. Suzanne Rees was left behind and died alone",
    "url": "https://www.theguardian.com/australia-news/2025/oct/31/suzanne-rees-lizard-island-death-cruise-ship-coral-adventurer",
    "image": "https://media.guim.co.uk/a457bd1e9cfa2805eb1e832e6cbe95da8b1565fb/0_23_821_656/500.jpg",
    "summary": "After the Coral Adventurer departed from Lizard Island without an 80-year-old passenger, the ship returned five hours later. The woman's body was discovered the following day. Her family is seeking answers regarding the circumstances surrounding her departure and death.",
    "published": "2025-10-31T21:33:01Z"
  },
  {
    "title": "Maine mother awarded $25m in wrongful death suit over 15-year-old girl",
    "url": "https://www.theguardian.com/us-news/2025/oct/31/maine-mother-daughter-wrongful-death-lawsuit",
    "image": "https://media.guim.co.uk/3c6e6cc29a94c1c05ab74c35fa6605d271a45db2/0_0_3720_2976/500.jpg",
    "summary": "A jury awarded Lyndsey Sutherland a verdict in her favor regarding the death of her daughter, Jazzy Vincent, due to doctors' failure to diagnose leukemia. The case highlighted shortcomings in medical care that contributed to the tragic outcome. The ruling underscores accountability in healthcare practices when faced with critical illness.",
    "published": "2025-10-31T21:27:10Z"
  },
  {
    "title": "Trump justice department seeks 2020 election records from Georgia county",
    "url": "https://www.theguardian.com/us-news/2025/oct/31/trump-georgia-2020-election-records",
    "image": "https://media.guim.co.uk/a4f3df85990b7ec4081507632a72cd5a8a1bde5c/375_0_3750_3000/500.jpg",
    "summary": "A request to Fulton County highlights efforts to revive former President Trump's false claims regarding the 2020 election results. This move reflects a continuing determination among some to challenge the legitimacy of the election outcome. The ongoing focus on these falsehoods remains a contentious issue in American politics.",
    "published": "2025-10-31T21:04:03Z"
  }
]