[
  {
    "title": "Asylum changes seek to use children as a weapon, says Labour peer Alf Dubs",
    "url": "https://www.theguardian.com/uk-news/2025/nov/18/asylum-changes-use-children-as-a-weapon-labour-peer-alf-dubs",
    "image": "https://media.guim.co.uk/8d2d10741c1846b04888b93d87b468b50de95f34/250_0_2269_1815/500.jpg",
    "summary": "Dubs, a former child refugee, criticized Shabana Mahmood's plans, labeling them as \"shabby.\" He believes these proposals will exacerbate tensions within communities. Dubs calls for more thoughtful approaches to address the needs of refugees and local populations.",
    "published": "2025-11-18T10:23:22Z"
  },
  {
    "title": "Reform’s plan to cut EU citizens’ benefits would risk trade war with Europe, Labour claims – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/nov/18/labour-asylum-seekers-keir-starmer-reform-nigel-farage-uk-politics-latest-news",
    "image": "https://media.guim.co.uk/402d8fa4db4800094ca464131cc6c6fb7d051536/1780_919_2565_2053/500.jpg",
    "summary": "Reform UK claims to have identified £25 billion in savings through proposed cuts. In response, Labour criticizes these figures as unrealistic, labeling them \"Farage’s fantasy numbers.\" The disagreement highlights ongoing tensions between the two parties regarding fiscal policies.",
    "published": "2025-11-18T10:21:56Z"
  },
  {
    "title": "Golden Goal: Jude Bellingham for England v Slovakia (2024)",
    "url": "https://www.theguardian.com/football/2025/nov/18/golden-goal-jude-bellingham-for-england-v-slovakia-2024",
    "image": "https://media.guim.co.uk/f78fb20fb9c6cf9a0989d102f262a675ef38d968/1963_488_6130_4907/500.jpg",
    "summary": "Jude Bellingham's stunning bicycle kick in the 95th minute sparked an emotional celebration among England fans. His last-gasp goal sealed a memorable victory, showcasing his talent and impact on the team. The dramatic moment highlighted the excitement and passion of football, uniting supporters in joy.",
    "published": "2025-11-18T10:03:20Z"
  },
  {
    "title": "Stock market sell-off continues, as Google boss warns ‘no company immune’ if AI bubble bursts – business live",
    "url": "https://www.theguardian.com/business/live/2025/nov/18/stock-market-sell-off-ai-bubble-google-nvidia-ftse-100-bitcoin-business-live-news",
    "image": "https://media.guim.co.uk/3ccbfec548a26b1be54e8697e6563377ca7bae09/135_0_6315_5052/500.jpg",
    "summary": "Asian shares are experiencing a decline, contributing to a broader economic downturn. Additionally, bitcoin has plummeted to its lowest value in seven months. This reflects ongoing volatility in the financial markets.",
    "published": "2025-11-18T10:03:12Z"
  },
  {
    "title": "‘Do we live in a war zone?’: how US schools prepare for a shooting",
    "url": "https://www.theguardian.com/tv-and-radio/2025/nov/18/thoughts-and-prayers-documentary-us-school-shootings",
    "image": "https://media.guim.co.uk/14ebb1b5d4dfb2d9e66afc22cf6c393253149bd4/60_0_1800_1440/500.jpg",
    "summary": "The HBO documentary \"Thoughts and Prayers\" reveals the grim environment faced by children in the U.S. due to the $3 billion active shooter preparedness industry. It highlights the pervasive fear and anxiety surrounding gun violence in schools. The film underscores the impact of this industry on children’s everyday lives and mental well-being.",
    "published": "2025-11-18T10:02:30Z"
  }
]