[
  {
    "title": "Australia politics live: Andrew Wilkie moves motion on gambling ad free vote saying parliament ‘paralysed’ despite support for action",
    "url": "https://www.theguardian.com/australia-news/live/2025/nov/26/politics-live-labor-epbc-nature-laws-murray-watt-greens-coalition-anthony-albanese-sussan-ley-ted-obrien-national-press-club-ndis-fines-cpi-question-time-ntwnfb",
    "image": "https://media.guim.co.uk/9222c824b4c5ec45b4014ba98ecb55497f8ab2ac/0_0_6880_5504/500.jpg",
    "summary": "Please provide the news article or details you'd like summarized, and I'll be happy to help!",
    "published": "2025-11-26T01:32:19Z"
  },
  {
    "title": "US triples national park fee for non-residents, amid ‘new’ fee for Americans",
    "url": "https://www.theguardian.com/us-news/2025/nov/25/national-park-fee-non-residents",
    "image": "https://media.guim.co.uk/854a000b0f1f3b203e8f2b3e0cf7bc0adef9d599/866_0_4328_3464/500.jpg",
    "summary": "The Interior Department, after cutting funding for conservation organizations, has announced a fee increase, claiming it is intended for conservation efforts. This move has sparked criticism and skepticism regarding its true motives. Advocates argue that genuine support for conservation should not involve defunding established organizations.",
    "published": "2025-11-26T01:31:37Z"
  },
  {
    "title": "Joan Templeman, wife of billionaire Richard Branson, dies aged 80",
    "url": "https://www.theguardian.com/business/2025/nov/26/joan-templeman-wife-richard-branson-dies-aged-80",
    "image": "https://media.guim.co.uk/9b2890214b5669f6af79c701f78987c52500ec35/250_0_2500_2000/500.jpg",
    "summary": "British billionaire Richard Branson expressed deep sorrow over the passing of his wife, Joan, who was his partner for 50 years. He described himself as \"heartbroken\" by her loss. Branson's tribute highlights the profound impact of their long-lasting relationship.",
    "published": "2025-11-26T01:24:49Z"
  },
  {
    "title": "Hegseth orders US Navy secretary to investigate Arizona senator Mark Kelly for ‘potentially unlawful comments’ - live",
    "url": "https://www.theguardian.com/us-news/live/2025/nov/25/us-politics-pam-bondi-appeal-james-comey-letitia-james-cases-donald-trump-venezuela-latest-updates",
    "image": "https://media.guim.co.uk/88cf58ae42ba1f14911ec3de02ee68753e6b721b/258_0_3107_2486/500.jpg",
    "summary": "Donald Trump's former Defense Secretary sent a memo to John Phelan requesting a review of comments made by Kelly. House Democrats referenced a video that confirms the FBI is looking into the matter. The investigation appears to be gaining traction concerning the statements made.",
    "published": "2025-11-26T01:07:43Z"
  },
  {
    "title": "Trump news at a glance: Pete Hegseth increases administration’s attacks on senator Mark Kelly",
    "url": "https://www.theguardian.com/us-news/2025/nov/25/trump-administration-news-updates-today-latest",
    "image": "https://media.guim.co.uk/8f1a9e41dc57ef3b5913f7aff7d32e87c7234133/0_0_3333_2667/500.jpg",
    "summary": "Former President Trump's defense secretary has instructed the US Navy secretary to investigate remarks made by Kelly that may violate legal guidelines. The comments were deemed potentially unlawful and have prompted scrutiny within military ranks. This incident highlights ongoing tensions and political challenges surrounding military leadership and accountability.",
    "published": "2025-11-26T00:44:48Z"
  }
]