[
  {
    "title": "Israel moves prisoners ahead of exchange Gaza; Hamas official says disarmament ‘out of the question’ – live",
    "url": "https://www.theguardian.com/world/live/2025/oct/11/israel-gaza-ceasefire-hamas-hostages-netanyahu-trump-middle-east-latest-news-updates",
    "image": "https://media.guim.co.uk/373bb91e694a157d575f69e59bb39001116b511f/704_0_6250_5000/500.jpg",
    "summary": "Under a truce agreement, Israel plans to release prisoners, including those serving life sentences for serious offenses, in return for hostages. This deal aims to facilitate negotiations and improve humanitarian conditions. The exchange is part of ongoing efforts to address the conflict and alleviate tensions in the region.",
    "published": "2025-10-11T15:15:17Z"
  },
  {
    "title": "England set Sri Lanka 254 to win after Nat Sciver-Brunt century: Women’s Cricket World Cup – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/11/england-v-sri-lanka-womens-cricket-world-cup-live",
    "image": "https://media.guim.co.uk/d468d89c63063bbc2ea805a164bbe69ca81cdb33/134_0_2782_2225/500.jpg",
    "summary": "Nat Sciver-Brunt's team is set to compete against Sri Lanka in a cricket match. Live updates and commentary will be provided throughout the game. Follow for detailed over-by-over reports.",
    "published": "2025-10-11T15:13:26Z"
  },
  {
    "title": "Four people dead in shooting during Mississippi homecoming celebration",
    "url": "https://www.theguardian.com/us-news/2025/oct/11/leland-mississippi-mass-shooting",
    "image": "https://media.guim.co.uk/55a649372cf41b5e4f78ffeea492c2945b40675e/192_0_6456_5164/500.jpg",
    "summary": "A shooting in Leland, a small city, left one person dead and sixteen others injured following a high school football game. The incident has shocked the community and raised concerns about safety at public events. Authorities are investigating the circumstances surrounding the attack.",
    "published": "2025-10-11T14:57:13Z"
  },
  {
    "title": "Steve Clarke sets Scotland record and urges team to avoid complacency",
    "url": "https://www.theguardian.com/football/2025/oct/11/steve-clarke-scotland-manager-belarus-world-cup-qualifying",
    "image": "https://media.guim.co.uk/02c499f551ab8fc5e907c9cecc5245f91ac02a47/925_100_5545_4436/500.jpg",
    "summary": "Steve Clarke aims for World Cup qualification as Scotland prepares to host Belarus, marking a personal milestone in his managerial career. The match is pivotal for the team's chances in the qualification process. Clarke's leadership continues to focus on achieving success for the national team.",
    "published": "2025-10-11T14:06:36Z"
  },
  {
    "title": "The Gaza effect: how a global pro-Palestine protest movement met repression and resistance",
    "url": "https://www.theguardian.com/world/2025/oct/11/the-gaza-effect-how-a-global-pro-palestine-protest-movement-met-repression-and-resistance",
    "image": "https://media.guim.co.uk/38bdab37cda3dc45d9796cfa4aa6dce8f61c46d2/1_0_4998_4000/500.jpg",
    "summary": "Solidarity marches across the West are challenging government responses to dissent, prompting actions such as arrests and bans. These developments are reshaping the boundaries of free speech. The situation reflects a growing tension between public demonstration and governmental authority.",
    "published": "2025-10-11T14:04:49Z"
  }
]