[
  {
    "title": "Israeli hostage release: IDF says Red Cross on way to pick up first Gaza hostages - live updates",
    "url": "https://www.theguardian.com/world/live/2025/oct/13/gaza-ceasefire-live-updates-israel-hostages-release-hamas-trump-middle-east",
    "image": "https://media.guim.co.uk/4195decfffa40bef1f2301e8ea9485da4c40ae72/295_0_2835_2268/500.jpg",
    "summary": "Donald Trump is set to arrive in Israel soon after the anticipated release of 20 Israeli hostages. The release is expected to occur at 8 AM local time. This visit comes amid ongoing tensions and events in the region.",
    "published": "2025-10-13T05:19:54Z"
  },
  {
    "title": "Australia news live: Victoria police don’t know if Dezi Freeman is still alive; AFP investigating Lidia Thorpe comments at pro-Palestine rally",
    "url": "https://www.theguardian.com/australia-news/live/2025/oct/13/australia-news-live-qantas-hack-data-leak-scam-warning-nsw-sydney-potholes-social-media-ban-anika-wells-albanese-sussan-ley-labor-liberal-coalition-ntwnfb",
    "image": "https://media.guim.co.uk/5a44c4f5cb572bc3b3a42fcc28b2e19137087456/655_531_3896_3117/500.jpg",
    "summary": "I need more context or details about the specific news you would like summarized. Please provide the text or main points!",
    "published": "2025-10-13T05:16:18Z"
  },
  {
    "title": "Monday briefing: How social media is mainstreaming far-right rhetoric",
    "url": "https://www.theguardian.com/world/2025/oct/13/monday-briefing-how-social-media-is-mainstreaming-far-right-rhetoric",
    "image": "https://media.guim.co.uk/31a5106986c8fc1e443eff8b22b7a0a841accf01/0_0_5000_4000/500.jpg",
    "summary": "Today's newsletter highlights the increasing normalization of far-right views on platforms like Facebook, once considered extreme. This shift has caught the attention of frontbench politicians. As a result, these views are becoming more integrated into mainstream discourse.",
    "published": "2025-10-13T05:13:46Z"
  },
  {
    "title": "Victoria’s ‘major crime problem’ and ‘lack of trust’ in police sparks force’s biggest overhaul in years",
    "url": "https://www.theguardian.com/australia-news/2025/oct/13/victoria-police-restructure-overhaul-crime-trust",
    "image": "https://media.guim.co.uk/cfc98a3cf67a3f768d730c48861786a8db043558/654_0_6507_5209/500.jpg",
    "summary": "The chief commissioner emphasized the need for a new approach to policing in light of a restructuring announcement. This shift aims to address evolving community needs and challenges. The changes reflect a commitment to modernize police operations and improve public safety.",
    "published": "2025-10-13T05:11:01Z"
  },
  {
    "title": "UK MPs urged to investigate TikTok’s plans to cut 439 content moderator jobs",
    "url": "https://www.theguardian.com/technology/2025/oct/13/uk-mps-tiktok-plans-cut-content-moderator-jobs",
    "image": "https://media.guim.co.uk/dbc281b2b0620161a08b28ce0622939ae40719c6/330_0_3340_2675/500.jpg",
    "summary": "Trade unions and online safety experts have issued a letter highlighting concerns that job losses in certain sectors may lead to increased exposure of children to harmful online content. They argue that reduced workforce capacity could weaken child protection measures on digital platforms. The call emphasizes the urgent need for safeguarding children's online experiences amid economic changes.",
    "published": "2025-10-13T05:00:13Z"
  }
]