[
  {
    "title": "Strictly Come Dancing: week six results – live",
    "url": "https://www.theguardian.com/tv-and-radio/live/2025/nov/01/strictly-come-dancing-week-six-live",
    "image": "https://media.guim.co.uk/7aa4ad5f0a7f638d28fdc5dc997c1c30da9ce108/0_1003_3304_2644/500.jpg",
    "summary": "During the Halloween Spooktacular, Lewis Cope achieved the first perfect score of 40, while Karen Carney impressed with her performance inspired by Peaky Blinders. Several pairs found themselves near the bottom of the leaderboard. The suspense continues as viewers wonder which contestants will be eliminated.",
    "published": "2025-11-02T20:18:33Z"
  },
  {
    "title": "NFL week nine: Colts v Steelers, Falcons v Patriots, Texans v Broncos and more – live",
    "url": "https://www.theguardian.com/sport/live/2025/nov/02/nfl-week-nine-colts-v-steelers-falcons-v-patriots-chiefs-bills-live",
    "image": "https://media.guim.co.uk/6ad93b9b392d770d5643f7104955826418a5f077/279_0_3429_2743/500.jpg",
    "summary": "Join Graham Searles for the latest updates from a packed day of sports events, highlighting the excitement surrounding the Chiefs vs. Bills game. The day promises thrilling moments as teams compete fiercely. Stay tuned for more highlights and key takeaways from the day's action.",
    "published": "2025-11-02T20:18:25Z"
  },
  {
    "title": "Australia politics live: Liberals under pressure after Nationals abandon net zero target; Labor spruiks rise in bulk-billing GPs",
    "url": "https://www.theguardian.com/australia-news/live/2025/nov/03/australia-politics-live-nationals-net-zero-liberals-labor-bulk-billing-optus-sussan-ley-anthony-albanese-question-time",
    "image": "https://media.guim.co.uk/1259cb292f6d9403a4b03c9458fcb375a4c9c44c/753_0_6341_5073/500.jpg",
    "summary": "Please provide the news article or details you'd like summarized, and I'll be happy to help!",
    "published": "2025-11-02T20:17:17Z"
  },
  {
    "title": "FBI fires top official amid Kash Patel’s outrage over reports of agency jet use",
    "url": "https://www.theguardian.com/us-news/2025/nov/02/fbi-fires-top-official-kash-patel-jet-use",
    "image": "https://media.guim.co.uk/e504121e7f92a514c0b72041a88c2c1fbb571065/369_0_5000_4000/500.jpg",
    "summary": "Patel expressed anger upon learning that he traveled to visit his girlfriend, prompting controversy. In light of this incident, the agency has decided to fire the official responsible for overseeing the fleet. The situation has raised concerns about accountability and oversight within the organization.",
    "published": "2025-11-02T20:14:35Z"
  },
  {
    "title": "Cambridgeshire train stabbing: one suspect held on suspicion of attempted murder; police commend ‘heroic’ rail staff member",
    "url": "https://www.theguardian.com/uk-news/live/2025/nov/02/cambridgeshire-train-stabbing-life-threatening-injuries-arrests-latest-updates",
    "image": "https://media.guim.co.uk/c64113b57144b27bf5bd5799829b195ed0b3600b/0_0_3471_2777/500.jpg",
    "summary": "A 32-year-old man arrested for the Huntingdon train knife attack is now regarded as the sole suspect, according to transport police. Authorities continue to investigate the incident. Further details about the attack or the suspect have not been disclosed.",
    "published": "2025-11-02T20:12:39Z"
  }
]