[
  {
    "title": "Breeders’ Cup 2025 horse racing: day two – live",
    "url": "https://www.theguardian.com/sport/live/2025/nov/01/breeders-cup-2025-day-two-live",
    "image": "https://media.guim.co.uk/6d75c613f1eac6f9c1eaf4b81fc3ac483e3333cd/305_0_3596_2876/500.jpg",
    "summary": "Greg Wood will provide updates on nine additional races, including the highly anticipated Breeders’ Cup Classic. The updates will cover key developments and insights leading up to the events. Fans can stay informed on the latest happenings in the racing world.",
    "published": "2025-11-01T18:24:37Z"
  },
  {
    "title": "Tottenham v Chelsea: Premier League – live",
    "url": "https://www.theguardian.com/football/live/2025/nov/01/tottenham-v-chelsea-premier-league-live-score-updates",
    "image": "https://media.guim.co.uk/eddba8eb169502f181d94d64e3782bd0d10857db/364_119_3581_2865/500.jpg",
    "summary": "Scott Murray provides live coverage of an exciting London derby featuring two teams battling for consistency. The match promises to be thrilling as both sides look to improve their standings. Fans can expect a lively atmosphere as the action unfolds.",
    "published": "2025-11-01T18:24:12Z"
  },
  {
    "title": "Strictly Come Dancing: week six – live",
    "url": "https://www.theguardian.com/tv-and-radio/live/2025/nov/01/strictly-come-dancing-week-six-live",
    "image": "https://media.guim.co.uk/8a4ff75eb5d473c672285213d7c968181b214c82/161_0_3413_2731/500.jpg",
    "summary": "The Halloween Spooktacular features a mix of eerie soundtracks, including works by Nick Cave and Beethoven, along with a playful nod to a cheeky song. The event raises anticipation about which performances will delight the audience and which might disappoint. It promises a blend of thrills and chills for attendees.",
    "published": "2025-11-01T18:20:03Z"
  },
  {
    "title": "Iga Swiatek serves warning to rivals by crushing Madison Keys at WTA Finals",
    "url": "https://www.theguardian.com/sport/2025/nov/01/iga-swiatek-serves-warning-to-rivals-by-crushing-madison-keys-at-wta-finals",
    "image": "https://media.guim.co.uk/823333dd2cd4116fa05220f8b7b54c85357a4cc0/862_0_3465_2772/500.jpg",
    "summary": "Iga Swiatek began her WTA Finals campaign strongly, defeating Madison Keys with a dominant score of 6-1, 6-2. The match showcased Swiatek's superior form as she dispatched a sluggish Keys. The victory took place in Saudi Arabia.",
    "published": "2025-11-01T18:08:04Z"
  },
  {
    "title": "JD Vance repeats comments he wants wife Usha to convert to Christianity",
    "url": "https://www.theguardian.com/us-news/2025/nov/01/jd-vance-usha-christianity",
    "image": "https://media.guim.co.uk/e36b653efcd6a894990fc6e39f1a012f2801d86b/424_0_4269_3416/500.jpg",
    "summary": "During a Turning Point USA event attended by 10,000 people, US Vice President expressed his preference for his wife, who is Hindu, to embrace Christianity. This statement sparked discussions on faith and personal beliefs. The remarks highlight the intersection of faith and personal relationships in public discourse.",
    "published": "2025-11-01T18:01:53Z"
  }
]