[
  {
    "title": "NFL week nine: Bills v Chiefs, Steelers stun Colts, Bears earn wild win over Bengals – live",
    "url": "https://www.theguardian.com/sport/live/2025/nov/02/nfl-week-nine-colts-v-steelers-falcons-v-patriots-chiefs-bills-live",
    "image": "https://media.guim.co.uk/70f642145962ac64b272ad6e77987ef90dc2c030/100_0_5811_4649/500.jpg",
    "summary": "Graham Searles will provide updates on the Bills vs. Chiefs game following an eventful day in the NFL. Chicago secured a thrilling 47-42 victory, while Pittsburgh pulled off an upset against Indianapolis. Fans can expect live commentary and analysis during the game.",
    "published": "2025-11-02T22:16:45Z"
  },
  {
    "title": "Australia politics live: Liberal frontbencher admits Coalition ‘down in the dumps’ but backs Ley; Littleproud rejects ‘puerile’ net zero argument ",
    "url": "https://www.theguardian.com/australia-news/live/2025/nov/03/australia-politics-live-nationals-net-zero-liberals-labor-bulk-billing-optus-sussan-ley-anthony-albanese-question-time",
    "image": "https://media.guim.co.uk/cdb6eae2b2c2e47eb259d858de8fafd49c41f220/190_660_4999_3999/500.jpg",
    "summary": "Please provide the news article or details you'd like summarized, and I'll assist you with that!",
    "published": "2025-11-02T22:09:06Z"
  },
  {
    "title": "FBI fires top official amid Kash Patel’s outrage over reports of agency jet use",
    "url": "https://www.theguardian.com/us-news/2025/nov/02/fbi-fires-top-official-kash-patel-jet-use",
    "image": "https://media.guim.co.uk/e504121e7f92a514c0b72041a88c2c1fbb571065/369_0_5000_4000/500.jpg",
    "summary": "Patel was reportedly angry after it was revealed that he flew to visit his girlfriend. This revelation came as the agency announced the firing of an official responsible for overseeing the fleet. The situation has raised concerns about accountability within the agency.",
    "published": "2025-11-02T21:12:16Z"
  },
  {
    "title": "Game of Wool: Britain’s Best Knitter review – Tom Daley is a twinkling, passionate joy of a presenter",
    "url": "https://www.theguardian.com/tv-and-radio/2025/nov/02/game-of-wool-britains-best-knitter-tom-daley-review-channel-4",
    "image": "https://media.guim.co.uk/ca3f05cff7285b2d8f07b83f0aca45541f7e22f3/171_0_2659_2128/500.jpg",
    "summary": "The former diver excels as a contestant on the Bake Off, bringing significant improvement to the show. His presence elevates the overall experience, making him a standout star. Viewers see an impressive 80% enhancement whenever he appears on screen.",
    "published": "2025-11-02T21:00:13Z"
  },
  {
    "title": "Corrections and clarifications",
    "url": "https://www.theguardian.com/news/2025/nov/02/corrections-and-clarifications2",
    "summary": "\"Locomotion No 1\" is a significant piece of artwork by artist David Hockney that features vibrant colors and bold lines. The piece, created using a unique slithered technique, captures the essence of movement and energy. Its artistic style continues to draw attention and acclaim in the contemporary art scene.",
    "published": "2025-11-02T21:00:12Z"
  }
]