[
  {
    "title": "England given target of 331 to beat South Africa: second men’s one-day international – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/04/england-v-south-africa-second-mens-one-day-international-live",
    "image": "https://media.guim.co.uk/54b4ba4abb26b2bf5601a4624ae819afac81c804/1392_375_6411_5129/500.jpg",
    "summary": "England aims to recover from a significant defeat in the first ODI as they prepare to face South Africa at Lord's. The match provides an opportunity for the team to reassess and improve their performance. Join our writers for live updates and insights.",
    "published": "2025-09-04T16:44:18Z"
  },
  {
    "title": "RFK Jr grilled in tense hearing about chaos at federal health agencies and vaccines – live updates",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/04/donald-trump-tariffs-immigration-technology-epstein-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/0d34ae23b6cc0655f7cad1023e9794f21e7fe324/697_0_3834_3069/500.jpg",
    "summary": "Trump's health secretary is facing intense scrutiny regarding his plans to \"make America healthy again,\" as lawmakers question the impact of recent department layoffs and budget cuts. Critics are concerned about how these measures align with public health goals. The discussion highlights ongoing challenges in the administration's health policies.",
    "published": "2025-09-04T16:43:10Z"
  },
  {
    "title": "Kazakhstan 0-1 Wales: World Cup 2026 qualifier – as it happened",
    "url": "https://www.theguardian.com/football/live/2025/sep/04/kazakhstan-v-wales-world-cup-2026-qualifier-live",
    "image": "https://media.guim.co.uk/27173c7d927d1e881b185b354c5f2f672bf46a12/319_0_5228_4183/500.jpg",
    "summary": "Kieffer Moore scored the sole goal in a tense match where Wales faced relentless pressure from their determined opponents. Despite securing the victory, Wales had to fight hard to maintain their lead until the final moments. The game showcased a strong performance from both sides, but Wales ultimately emerged as winners.",
    "published": "2025-09-04T16:42:21Z"
  },
  {
    "title": "Fast-moving wildfire destroys multiple structures in historic Gold Rush California town",
    "url": "https://www.theguardian.com/us-news/2025/sep/03/california-wildfires-chinese-camp",
    "image": "https://media.guim.co.uk/95472574a31c041a76c2be34086d78e3e945e811/412_0_4821_3855/500.jpg",
    "summary": "A fire in Chinese Camp, a historic town established by Chinese miners in the 1850s, was reportedly triggered by lightning, according to authorities. The blaze has drawn attention due to the town's rich history. Investigations are ongoing to assess the damage and impact of the fire.",
    "published": "2025-09-04T16:33:30Z"
  },
  {
    "title": "Starmer declines to say if he will sack Rayner if she is found to have broken ministerial code – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/04/tories-flat-tax-angela-rayner-keir-starmer-news-updates-uk-politics-live",
    "image": "https://media.guim.co.uk/884a58e77166912a805d0111233636e1f85b9e28/108_0_1139_911/500.jpg",
    "summary": "Keir Starmer anticipates receiving a report from his ethics adviser regarding Angela Rayner soon. The report is expected to address ethical concerns related to Rayner. Starmer’s prompt expectation indicates the issue's significance for the party.",
    "published": "2025-09-04T16:30:49Z"
  }
]