[
  {
    "title": "News live: national park reopens as police say Dezi Freeman might have left area; Creative Australia awards $100,000 grant to Khaled Sabsabi",
    "url": "https://www.theguardian.com/australia-news/live/2025/oct/14/australia-news-live-jim-chalmers-superannuation-concession-tax-cybercrime-anthony-albanese-sussan-ley-coalition-penny-wong-israel-gaza-ntwnfb",
    "image": "https://media.guim.co.uk/73ec32dcf391f687de003950a03d9ab9dfd5532a/88_0_4560_3648/500.jpg",
    "summary": "Sure! Please provide the news article or the details you would like me to summarize.",
    "published": "2025-10-14T04:11:03Z"
  },
  {
    "title": "What does the end of free support for Windows 10 mean for its users?",
    "url": "https://www.theguardian.com/technology/2025/oct/14/what-does-the-end-of-free-support-for-windows-10-mean-for-its-users",
    "image": "https://media.guim.co.uk/71a48d53658f00aa075ebdb5fb4eb034bc14a59e/48_0_3559_2848/500.jpg",
    "summary": "Computers operating with outdated software will remain functional but will increasingly face security risks. Over time, the lack of updates will make them more susceptible to viruses and malware. Users are encouraged to upgrade their software to ensure continued protection against cyber threats.",
    "published": "2025-10-14T04:00:16Z"
  },
  {
    "title": "Doors, drains and paving perils: protecting your home from flooding",
    "url": "https://www.theguardian.com/environment/2025/oct/14/protecting-home-flood-defence-doors-drains-paving",
    "image": "https://media.guim.co.uk/6b2c3dd2dbc457cbab9ca58ccadfe943d628bb99/177_0_3415_2732/500.jpg",
    "summary": "Climate change and deteriorating protective measures are increasing the risk to homes in England. However, there are still strategies and resources available to mitigate these risks. Homeowners are encouraged to take proactive steps to safeguard their properties.",
    "published": "2025-10-14T04:00:11Z"
  },
  {
    "title": "Almost all external insulation fitted under Tory scheme needs repair or replacing, report finds",
    "url": "https://www.theguardian.com/environment/2025/oct/14/external-insulation-previous-government-scheme-repair-replacing-report-finds",
    "image": "https://media.guim.co.uk/2bb908af2971dd6cf657fa08057b58f0f80eee88/867_0_4109_3288/500.jpg",
    "summary": "Homeowners who utilized government programs to fund renovations are now facing issues with cladding that may lead to damp conditions. This has raised concerns about the quality and safety of the materials recommended. Many affected homeowners are seeking assistance and accountability from the government.",
    "published": "2025-10-14T04:00:11Z"
  },
  {
    "title": "The flood-prone Worcestershire town being abandoned by insurers",
    "url": "https://www.theguardian.com/environment/2025/oct/14/tenbury-wells-flood-prone-worcestershire-town-abandoned-by-insurers",
    "image": "https://media.guim.co.uk/21bd4a061ec5add026981d72b131d4f346d9595f/560_0_5600_4480/500.jpg",
    "summary": "Tenbury Wells is at risk of financial ruin from potential flooding, yet its request for funding to bolster flood defenses has been denied. The rejection raises concerns about the town's ability to cope with future deluges. Local officials are expressing frustration over the lack of support for necessary infrastructure improvements.",
    "published": "2025-10-14T04:00:10Z"
  }
]