[
  {
    "title": "Australia news live: Chinese fighter jet released flares near RAAF aircraft in ‘unsafe and unprofessional’ incident, Marles says",
    "url": "https://www.theguardian.com/australia-news/live/2025/oct/20/australia-news-live-space-debris-wa-albanese-trump-meeting-labor-supermarkets-price-gouging-barnaby-joyce-nationals-coalition-sussan-ley-net-zero-ntwnfb",
    "image": "https://media.guim.co.uk/f10bd10c54d402b28cba5e430d5083c6e48f2f0c/185_99_2793_2235/500.jpg",
    "summary": "Please provide the news article you would like summarized, and I'll be happy to help!",
    "published": "2025-10-20T06:16:42Z"
  },
  {
    "title": " The Uncool by Cameron Crowe review – inside rock’s wildest decade",
    "url": "https://www.theguardian.com/film/2025/oct/20/the-uncool-by-cameron-crowe-review-inside-rocks-wildest-decade",
    "image": "https://media.guim.co.uk/9387e8d367cf9e5a13caf13a16ac630fb7657cd0/121_0_4615_3692/500.jpg",
    "summary": "The director of \"Almost Famous\" shares captivating anecdotes from his life, including experiences with a drug-fueled David Bowie and impressing Joni Mitchell. These stories showcase his encounters with iconic musicians and provide a glimpse into the rock and roll world. The pieces are engaging and reminiscent of the vibrant music scene of the past.",
    "published": "2025-10-20T06:00:37Z"
  },
  {
    "title": "Travelodge guest suffers sleepless night as hotel says it is ‘overbooked’",
    "url": "https://www.theguardian.com/money/2025/oct/20/travelodge-guest-hotel-overbooked-room",
    "image": "https://media.guim.co.uk/2c661445e957e39a5a3e72f09348eef78d8acc0e/395_0_3105_2484/500.jpg",
    "summary": "Customers have reported being turned away due to a lack of accommodation, often being redirected to hotels miles away in the middle of the night. Many have found themselves stranded and forced to wait outside in the early hours. This situation highlights ongoing issues with booking and availability in the hospitality industry.",
    "published": "2025-10-20T06:00:35Z"
  },
  {
    "title": "Bill Nighy is the agony uncle you never knew you needed: best podcasts of the week",
    "url": "https://www.theguardian.com/tv-and-radio/2025/oct/20/bill-nighy-is-the-agony-uncle-you-never-knew-you-needed-best-podcasts-of-the-week",
    "image": "https://media.guim.co.uk/216cf2ad455a12fbdd37cc7c21fd6fb22e0c388f/3444_245_2381_1905/500.jpg",
    "summary": "The actor captivates with his insightful responses to reader questions, showcasing his unexpected wisdom. Meanwhile, notable figures like Obama, Paul McCartney, and Ayo Edebiri come together to honor an influential African musical legend. Their collective tribute highlights the impact of African music on global culture.",
    "published": "2025-10-20T06:00:35Z"
  },
  {
    "title": "Jacinta Allan blames ‘very small number’ of counter-protesters for violence at Melbourne immigration rally",
    "url": "https://www.theguardian.com/australia-news/2025/oct/20/melbourne-protests-anti-immigration-rallies-counter-protest-police-injured",
    "image": "https://media.guim.co.uk/ff034e19589378f448541be38276b3647c5154fb/4_0_5840_4672/500.jpg",
    "summary": "The Victorian Premier reassures the public that the city is safe and law enforcement has the required authority to maintain order. This statement follows an incident on Sunday where two police officers were hospitalized. The premier's comments aim to bolster confidence in public safety amid ongoing challenges.",
    "published": "2025-10-20T05:59:48Z"
  }
]