[
  {
    "title": "Australia politics live: Angus Taylor ejected after lights briefly go out during question time; childcare costs up 11% as inflation spikes",
    "url": "https://www.theguardian.com/australia-news/live/2025/nov/26/politics-live-labor-epbc-nature-laws-murray-watt-greens-coalition-anthony-albanese-sussan-ley-ted-obrien-national-press-club-ndis-fines-cpi-question-time-ntwnfb",
    "image": "https://media.guim.co.uk/45d9a0865d21a419bf18b4749f4c223662ee0d0b/28_0_6880_5504/500.jpg",
    "summary": "Please provide the news content you'd like summarized, and I'll be happy to assist you!",
    "published": "2025-11-26T05:20:26Z"
  },
  {
    "title": "Sydney weather: thunderstorms roll in as parts of NSW brace for catastrophic fire risk amid soaring temperatures",
    "url": "https://www.theguardian.com/australia-news/2025/nov/26/nsw-bushfire-warnings-catastrophic-danger-lower-central-west-plains-total-fire-ban",
    "image": "https://media.guim.co.uk/e65248b4b2e3541c816b240ccbf9f5bc687b7fbf/121_210_506_405/500.jpg",
    "summary": "Total fire bans and school closures have been implemented in several areas due to the highest fire danger experienced in two years. Authorities are taking precautionary measures to protect communities from potential wildfires. Residents are urged to stay vigilant and adhere to safety guidelines during this critical period.",
    "published": "2025-11-26T05:04:49Z"
  },
  {
    "title": "‘It is a dream come true!’ Meet Britain’s bus driver of the year – and six other unsung heroes",
    "url": "https://www.theguardian.com/lifeandstyle/2025/nov/26/it-is-a-dream-come-true-meet-britains-bus-driver-of-the-year-and-six-other-unsung-heroes",
    "image": "https://media.guim.co.uk/15e5e33190142663a0bae7b6598191f7ce5d987e/0_121_4219_3375/500.jpg",
    "summary": "This year's unique awards honor a diverse range of individuals, from outstanding lollipop people to dedicated convenience store managers. The celebration highlights the important but often overlooked contributions of these unsung heroes. Their achievements showcase the value of dedication across various community roles.",
    "published": "2025-11-26T05:00:43Z"
  },
  {
    "title": "Rachel Reeves’s high-stakes autumn budget in five key charts",
    "url": "https://www.theguardian.com/uk-news/2025/nov/26/five-key-charts-2025-budget-statement-rachel-reeves",
    "image": "https://media.guim.co.uk/92091d93cf8725406fdc44432525ad7c1552c3ae/1369_26_6622_5301/500.jpg",
    "summary": "The Chancellor will announce tax and spending strategies influenced by low productivity, elevated borrowing costs, and ongoing cost of living issues. These plans aim to address economic challenges faced by the nation. Key measures will likely reflect efforts to stabilize the financial situation for individuals and businesses.",
    "published": "2025-11-26T05:00:42Z"
  },
  {
    "title": "Plastic nurdles found at 84% of UK sites of special scientific interest",
    "url": "https://www.theguardian.com/environment/2025/nov/26/plastic-nurdles-found-at-uk-sites-of-special-scientific-interest",
    "image": "https://media.guim.co.uk/d924ce0ac8206c3c06034cad2f228fb8fc2d99e2/665_0_6880_5504/500.jpg",
    "summary": "Environmental charity Fidra reports that 168 out of 195 Sites of Special Scientific Interest (SSSIs) it surveyed are contaminated with small plastic pellets. The findings highlight significant concerns about pollution in protected areas. Fidra is calling for action to address this environmental issue.",
    "published": "2025-11-26T05:00:42Z"
  }
]