[
  {
    "title": "Australia news live: Conroy says Labor unconcerned by PNG-China discussions and blames ‘process delay’ for failure to sign treaty",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/17/australia-news-live-liberal-sussan-ley-net-zero-target-climate-crisis-anthony-albanese-donald-trump-trade-tariffs-politics-ntwnfb",
    "image": "https://media.guim.co.uk/96d530493494aaa80fb4e32dbab10a0744f02c83/318_0_4583_3667/500.jpg",
    "summary": "Certainly! However, I need specific content or details about the news you would like summarized. Please provide the information, and I'll be happy to help!",
    "published": "2025-09-17T06:49:59Z"
  },
  {
    "title": "UTS’s teacher education program set to close as university reveals plan to slash more than 1,000 subjects",
    "url": "https://www.theguardian.com/australia-news/2025/sep/17/utss-teacher-education-program-set-to-close-as-university-reveals-plan-to-slash-over-1000-subjects",
    "image": "https://media.guim.co.uk/92d8ab5f36f46eaf8ada1d4b7b4c9017c60800a4/141_0_2919_2335/500.jpg",
    "summary": "The University of Technology Sydney has proposed cutting 1,101 subjects, with 463 of them having no enrollments and not being taught in 2024. The decision aims to streamline the academic offerings. The proposal highlights the university's efforts to improve efficiency and resource allocation.",
    "published": "2025-09-17T06:37:24Z"
  },
  {
    "title": "Queensland deputy premier labels BHP ‘unAustralian’ as mining giant blames job cuts on coal royalties scheme",
    "url": "https://www.theguardian.com/australia-news/2025/sep/17/bhp-queensland-deputy-premier-labels-unaustralian-as-mining-giant-blames-job-cuts-on-coal-royalties-scheme",
    "image": "https://media.guim.co.uk/ca5a5687b24175e5d8d2522e89ed483fe72820e0/665_0_3333_2669/500.jpg",
    "summary": "Jarrod Bleijie has defended the controversial levy amid BHP Mitsubishi Alliance's decision to mothball the Saraji South mine. The move will lead to significant job losses, with 750 positions being eliminated. This response comes as the region grapples with the economic impacts of the mine's closure.",
    "published": "2025-09-17T06:32:50Z"
  },
  {
    "title": "Keir Starmer is betting everything on an America that doesn’t exist any more | Rafael Behr",
    "url": "https://www.theguardian.com/commentisfree/2025/sep/17/keir-starmer-america-donald-trump-britain",
    "image": "https://media.guim.co.uk/9af6baafc57fc470bf132b771a6e52d356e0d919/1519_0_3751_3001/500.jpg",
    "summary": "Rafael Behr argues that aligning closely with Trump poses significant risks for Britain. He advocates for fostering stronger relationships with more dependable allies in the region. The column highlights the importance of prioritizing stable partnerships over risky political gambles.",
    "published": "2025-09-17T06:00:29Z"
  },
  {
    "title": "On Drugs by Justin Smith-Ruiu review – a philosopher’s guide to psychedelics",
    "url": "https://www.theguardian.com/books/2025/sep/17/on-drugs-by-justin-smith-ruiu-review-a-philosophers-guide-to-psychedelics",
    "image": "https://media.guim.co.uk/71880c86db91fcd42075f05d376c9775e920a400/597_0_6007_4807/500.jpg",
    "summary": "The article delves into the intersection of drugs and philosophy, posing a hypothetical scenario of René Descartes experiencing psychedelic substances. It examines how such experiences could influence his philosophical ideas. The exploration aims to challenge and expand traditional philosophical concepts through the lens of drug experiences.",
    "published": "2025-09-17T06:00:29Z"
  }
]