[
  {
    "title": "‘Weapons decide who survive’, Zelenskyy tells UN after Trump offers show of support – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/sep/24/russia-ukraine-trump-zelenskyy-unga-drones-europe-latest-news-updates",
    "image": "https://media.guim.co.uk/edc015ae180de3d62db0b600a826b4628f47d3b4/904_0_1798_1440/500.jpg",
    "summary": "The Kremlin has rejected U.S. President Joe Biden's assertion that Ukraine has the potential to reclaim all territory lost since the onset of the invasion. Russian officials emphasized the complicated realities on the ground, challenging the feasibility of such a complete recovery. Tensions continue as both sides navigate the ongoing conflict and diplomatic discussions.",
    "published": "2025-09-24T13:33:54Z"
  },
  {
    "title": "Two people detained by US immigration reportedly shot at Dallas Ice facility – live updates",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/24/donald-trump-jimmy-kimmel-freedom-of-speech-immigration-government-shutdown-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/4ec0d4e2c1f0fae53ac4b3f802a7f1d4e3501465/836_240_1425_1141/500.jpg",
    "summary": "The ICE director reported that three individuals were shot, with two of them detained at the ICE facility. The incident is under investigation and further details are emerging. CNN is providing ongoing coverage of the situation.",
    "published": "2025-09-24T13:32:57Z"
  },
  {
    "title": "Lord Ashcroft’s son Andrew takes over father’s 3.4% stake worth £100m in Tottenham",
    "url": "https://www.theguardian.com/football/2025/sep/23/lord-ashcrofts-son-andrew-buys-34-stake-worth-100m-in-tottenham",
    "image": "https://media.guim.co.uk/e06ec60ae1a3f8cac7daf6c65258c20baf1aa4e4/196_0_2308_1846/500.jpg",
    "summary": "The price of the Tottenham shares has not been revealed, but they are estimated to have cost approximately £100 million based on recent valuations. This indicates a significant investment in the football club. Further details on the buyer or the implications of the purchase are not provided.",
    "published": "2025-09-24T13:29:32Z"
  },
  {
    "title": "Multiple people shot at Texas Ice office as suspected gunman dies",
    "url": "https://www.theguardian.com/us-news/2025/sep/24/dallas-ice-shooting-texas-immigration-center-latest",
    "image": "https://media.guim.co.uk/4ec0d4e2c1f0fae53ac4b3f802a7f1d4e3501465/836_240_1425_1141/500.jpg",
    "summary": "Three individuals were shot at a Dallas immigration office, according to officials. The suspected shooter reportedly died from a self-inflicted gunshot wound. Authorities are investigating the incident further.",
    "published": "2025-09-24T13:29:12Z"
  },
  {
    "title": "Italy’s far-right government revives holiday for saint at ‘core of our nation’s identity’",
    "url": "https://www.theguardian.com/world/2025/sep/24/italy-to-revive-national-holiday-in-honour-of-patron-saint-francis-of-assisi",
    "image": "https://media.guim.co.uk/5469b46d0f6373b410e395e0ff65b1af59f252a3/0_0_3160_2526/500.jpg",
    "summary": "Millions of Italian workers are anticipated to receive a day off on October 4th to celebrate Saint Francis of Assisi. This holiday recognizes the saint's contribution to society and his legacy of peace and compassion. The day off aims to honor Italy's cultural heritage and values associated with the saint.",
    "published": "2025-09-24T13:28:26Z"
  }
]