[
  {
    "title": "US Open 2025: Osaka v Gauff, Swiatek wins, Auger-Aliassime beats Rublev on day nine – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/01/us-open-tennis-2025-swiatek-osaka-gauff-de-minaur-musetti-day-nine-live",
    "image": "https://media.guim.co.uk/f26785b1bc6b5ca4d0a75940f2553b00ab35d7a5/579_0_5791_4633/500.jpg",
    "summary": "Taha Hashim provides live updates on day nine of the tournament, where former champions Naomi Osaka and Coco Gauff are set to compete in the fourth round. This highly anticipated match features two popular players in women's tennis. Fans can expect exciting tennis as they battle for a place in the next round.",
    "published": "2025-09-01T18:45:51Z"
  },
  {
    "title": "The Smashing Machine review – Dwayne Johnson only possible casting for crisis-riddled UFC champ Mark Kerr",
    "url": "https://www.theguardian.com/film/2025/sep/01/the-smashing-machine-review-dwayne-johnson-mark-kerr",
    "image": "https://media.guim.co.uk/2d747ad966270fe2e11834b168815a1ca30d0aa2/94_0_2813_2250/500.jpg",
    "summary": "Former pro wrestler Johnson portrays Kerr, a massive figure who experiences a dramatic breakdown after suffering an unexpected loss. The character's meltdown highlights the intense pressures faced by athletes. The storyline showcases themes of resilience and the impact of defeat on one's identity.",
    "published": "2025-09-01T18:45:20Z"
  },
  {
    "title": "Transfer deadline day: Guéhi move hits snag; Isak, Jackson and Wissa deals agreed – live",
    "url": "https://www.theguardian.com/football/live/2025/sep/01/transfer-deadline-day-guehi-wissa-martinez-ederson-latest-and-more-live",
    "image": "https://media.guim.co.uk/aa4d060273b35ea2fcd3c48387d741cf266a6f87/472_0_2598_2079/500.jpg",
    "summary": "Will Magee provides live updates on the late drama surrounding the transfer window and its aftermath. Fans can stay engaged with real-time developments and reactions. The coverage promises to highlight key moments and implications for teams and players.",
    "published": "2025-09-01T18:42:02Z"
  },
  {
    "title": "Angela Rayner’s Hove flat: five questions for the deputy PM",
    "url": "https://www.theguardian.com/politics/2025/sep/01/angela-rayners-hove-flat-five-questions-for-the-deputy-pm",
    "image": "https://media.guim.co.uk/ecba2c443a254e5a2cd9a0552863dd12df61981c/521_42_2603_2082/500.jpg",
    "summary": "An inquiry may probe Labour politician Angela Rayner regarding the financial arrangements surrounding her acquisition of an £800,000 home. Questions could arise about the sources of funds and transparency related to the purchase. This scrutiny follows her elevated profile within the party and government.",
    "published": "2025-09-01T18:13:32Z"
  },
  {
    "title": "Stroke centres in England given AI tool that will help 50% of patients recover",
    "url": "https://www.theguardian.com/society/2025/sep/01/stroke-centres-in-england-given-ai-tool-that-will-help-50-of-patients-recover",
    "image": "https://media.guim.co.uk/100e8d95635db64273062b5eb903a02d8e01c636/375_0_4125_3300/500.jpg",
    "summary": "The NHS has implemented life-saving software across all its centers to enhance patient care. This initiative aims to significantly reduce the number of patients who experience serious disabilities. By streamlining processes and improving treatment outcomes, the software is expected to benefit countless individuals.",
    "published": "2025-09-01T18:00:14Z"
  }
]