[
  {
    "title": "Trump administration blocked from suspending Snap benefits for millions of Americans",
    "url": "https://www.theguardian.com/us-news/2025/oct/31/judge-blocks-trump-snap-suspension",
    "image": "https://media.guim.co.uk/f9d2e6cdc61b8fdc2a7babec150550ec6eea7d7f/392_0_3900_3122/500.jpg",
    "summary": "A judge has issued a temporary restraining order to prevent the discontinuation of food aid benefits set to take effect on Saturday. The ruling states that the halting of these benefits is unlawful. This decision aims to protect those reliant on food assistance until a further determination is made.",
    "published": "2025-10-31T18:25:12Z"
  },
  {
    "title": "Judge blocks suspension of Snap food aid during shutdown – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/31/donald-trump-filibuster-shutdown-snap-food-refugees-drug-boats-latest-news-updates",
    "image": "https://media.guim.co.uk/07b229d1eac114f30d6758b19b617cbe5a13903d/421_0_6569_5254/500.jpg",
    "summary": "A federal court ruling was issued just before over 40 million Americans were at risk of losing their food stamp benefits. The decision impacts those relying on these assistance programs for sustenance. The timing of the ruling raises concerns about food security for many vulnerable households.",
    "published": "2025-10-31T18:22:47Z"
  },
  {
    "title": "The Guardian view on Andrew’s downfall: Britain’s relationship with the royals needs a reset | Editorial",
    "url": "https://www.theguardian.com/commentisfree/2025/oct/31/the-guardian-view-on-andrews-downfall-britains-relationship-with-the-royals-needs-a-reset",
    "image": "https://media.guim.co.uk/0e20a5ea887fcb6fa293c1b017ce88800fa24187/361_0_4080_3264/500.jpg",
    "summary": "The retirement of the former prince from public life is a positive step. However, ongoing issues related to royal secrecy and entitlement still need to be addressed. Continued scrutiny and reform of these matters are essential for transparency.",
    "published": "2025-10-31T18:21:16Z"
  },
  {
    "title": " Nexperia halts chip supplies to China in threat to global car production ",
    "url": "https://www.theguardian.com/business/2025/oct/31/nexperia-halts-chip-supples-china-threat-car-production",
    "image": "https://media.guim.co.uk/c6f3a470c807774a7dee51dc4b36531e313ba7b4/0_1263_5242_4194/500.jpg",
    "summary": "A Dutch-controlled company has notified its customers about a suspension of operations amidst escalating tensions. Despite the challenges, the company is reportedly seeking to ease the trade conflict. Efforts are being made to find a resolution and continue business relations.",
    "published": "2025-10-31T18:20:25Z"
  },
  {
    "title": "The Guardian view on the atrocities in El Fasher: the responsibility for these horrors extends beyond Sudan’s borders | Editorial",
    "url": "https://www.theguardian.com/commentisfree/2025/oct/31/the-guardian-view-on-the-atrocities-in-el-fasher-the-responsibility-for-these-horrors-extends-beyond-sudans-borders",
    "image": "https://media.guim.co.uk/e50164bc69076375e0ed7e29e56195ca6b87d100/500_0_5000_4000/500.jpg",
    "summary": "An editorial critiques the global community for failing to prevent another genocide after promising \"never again\" in the wake of the Darfur tragedy. Despite warning signs of impending catastrophe, the world has remained inactive. This inaction raises concerns about the effectiveness of international commitments to prevent future atrocities.",
    "published": "2025-10-31T18:15:34Z"
  }
]