[
  {
    "title": "Et tu? More Queensland high schools taught wrong Caesar topic as student speaks out after exam",
    "url": "https://www.theguardian.com/australia-news/2025/oct/29/queensland-high-schools-taught-wrong-caesar-topic",
    "image": "https://media.guim.co.uk/fe8a38746c1f44ae9081c8d092d8f4cc88caea13/3961_127_3483_2786/500.jpg",
    "summary": "Approximately 140 Year 12 students from nine schools have been impacted by an ancient history exam mishap. One student reported that journalists have been stationed outside their school all day. The situation has drawn significant media attention.",
    "published": "2025-10-29T07:16:00Z"
  },
  {
    "title": "Ley had ‘a really strong point to make’ on Joy Division T-shirt, Liberal MP says – as it happened",
    "url": "https://www.theguardian.com/australia-news/live/2025/oct/29/federal-politics-parliament-victoria-queensland-bom-labor-coalition-anthony-albanese-sussan-ley-abs-inflation-apec-summit-afp-press-club-ntwnfb",
    "image": "https://media.guim.co.uk/2ab9c4f2792f59bc3aca7f176167592b2273ff82/629_0_6285_5028/500.jpg",
    "summary": "The blog has officially ceased operations and will no longer be updated. Readers are encouraged to seek alternative sources for similar content. Thank you to all who supported the blog throughout its run.",
    "published": "2025-10-29T07:15:32Z"
  },
  {
    "title": "BBC journalist barred from leaving Vietnam and repeatedly interrogated",
    "url": "https://www.theguardian.com/world/2025/oct/29/bbc-journalist-barred-from-leaving-vietnam-and-repeatedly-interrogated",
    "image": "https://media.guim.co.uk/a51fd84416902786dfeda5e64f8e55bce14d71c1/349_0_3493_2794/500.jpg",
    "summary": "BBC has expressed deep concern for the wellbeing of a journalist after Vietnamese police confiscated their ID card and renewed passport. The situation raises fears about the journalist's safety and rights. The BBC is calling for the reinstatement of the journalist's documents to ensure their protection.",
    "published": "2025-10-29T07:14:36Z"
  },
  {
    "title": "New Zealand beat England by five wickets in second men’s cricket one-day international – live reaction",
    "url": "https://www.theguardian.com/sport/live/2025/oct/29/new-zealand-v-england-second-cricket-one-day-international-live",
    "image": "https://media.guim.co.uk/0e77585254a123a62014ad004a227eb1a7233ed8/156_0_3331_2666/500.jpg",
    "summary": "In Hamilton, writers provide live updates and analysis of the second one-day international match between New Zealand and England. The coverage includes key moments, player performances, and expert commentary. Fans can follow the unfolding action and reactions from the match.",
    "published": "2025-10-29T07:14:06Z"
  },
  {
    "title": "Shark feeding frenzy off popular Australian surf beach captured in chilling footage ",
    "url": "https://www.theguardian.com/australia-news/2025/oct/29/shark-feeding-frenzy-snapper-rocks-gold-coast-surf-beach-australia-video",
    "image": "https://media.guim.co.uk/9e8d695d5ce5de5d055b733606ef17dc35f05ba7/291_0_1875_1500/500.jpg",
    "summary": "Experts praise the opportunity for people to witness predators closely feasting on bait fish at Rainbow Bay, Gold Coast, near Snapper Rocks. This event highlights a unique marine experience for locals and visitors alike. Such sights enhance appreciation for the region's vibrant marine life.",
    "published": "2025-10-29T07:07:08Z"
  }
]