[
  {
    "title": "US reportedly ready for next phase of Venezuela military operations – live",
    "url": "https://www.theguardian.com/us-news/live/2025/nov/24/us-politics-trump-venezuela-marjorie-tayor-greene-latest-updates",
    "image": "https://media.guim.co.uk/bd47ce712adff823ff5ff656368093e9e741d82d/133_0_3277_2621/500.jpg",
    "summary": "The Trump administration has officially designated Venezuelan leader Nicolás Maduro as a member of a foreign terrorist organization. This label may pave the way for new sanctions against Venezuela. The move reflects ongoing U.S. efforts to pressure Maduro's government amid a deteriorating humanitarian and political crisis in the country.",
    "published": "2025-11-24T14:11:16Z"
  },
  {
    "title": "Trump hints at ‘something good’ after Ukraine peace talks as EU says ‘work remains’ – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/nov/24/ukraine-russia-war-peace-talks-europe-us-trump-germany-latest-updates",
    "image": "https://media.guim.co.uk/2652d12c781637ae1bfff112ebf12968267f63f2/565_0_5160_4128/500.jpg",
    "summary": "EU leaders acknowledge advancements in ongoing discussions but stress that multiple challenges remain. German politician Merz emphasizes that achieving peace is a gradual process that won't occur immediately. The comments reflect a cautious optimism amid complex negotiations.",
    "published": "2025-11-24T14:09:13Z"
  },
  {
    "title": "Argentina lodge complaint and urge investigation into Tom Curry over alleged tunnel scuffle",
    "url": "https://www.theguardian.com/sport/2025/nov/24/argentina-complaint-investigation-tom-curry-tunnel-six-nations-rugby-union",
    "image": "https://media.guim.co.uk/c49d210d223d4621f32aee8a80bdd2f51dcb76d9/447_0_2776_2220/500.jpg",
    "summary": "Argentina has requested Six Nations Rugby to investigate a post-match incident involving England flanker Tom Curry and their head coach, Felipe Contepomi. The incident occurred after a recent match, prompting Argentina's call for clarity. The team seeks a formal review to address the situation.",
    "published": "2025-11-24T14:03:30Z"
  },
  {
    "title": "European defence company shares fall amid Ukraine peace talk hopes; Novo Nordisk reports Ozempic fails to help with Alzheimer’s – business live",
    "url": "https://www.theguardian.com/business/live/2025/nov/24/bhp-walks-away-takeover-approach-anglo-mining-merger-uk-budget-cbi-ftse-pound-business-live-news",
    "image": "https://media.guim.co.uk/6797c69e1e249d8761d0831bc75b874ed8f2d080/301_0_4164_3333/500.jpg",
    "summary": "Novo Nordisk's semaglutide drug has been found ineffective in treating Alzheimer's disease, as reported in recent economic and financial news. The company's announcement has implications for its research and development strategies moving forward. This setback highlights ongoing challenges in finding effective Alzheimer's treatments.",
    "published": "2025-11-24T14:03:18Z"
  },
  {
    "title": "This art is rubbish: why artists meticulously recreate our trash – so well they even confuse cleaners",
    "url": "https://www.theguardian.com/artanddesign/2025/nov/24/artists-creating-pieces-based-on-rubbish-recreating-our-trash",
    "image": "https://media.guim.co.uk/3ef87d3fc4fd7813d9253aff58bf1a0da663af5a/678_459_2760_2208/500.jpg",
    "summary": "Artists are creating valuable works from unconventional materials like resin fruit peels, bronze bin bags, and marble toilet rolls. These items, often seen as trash, are being transformed into sought-after art pieces. The trend showcases a growing appreciation for creative repurposing in the art world.",
    "published": "2025-11-24T14:00:29Z"
  }
]