[
  {
    "title": "Poland shoots down drones over its territory amid Russian attack on Ukraine",
    "url": "https://www.theguardian.com/world/2025/sep/10/poland-shoots-down-drones-over-its-territory-amid-russian-attack-on-ukraine-says-military",
    "image": "https://media.guim.co.uk/98c5fd8fa47e64df62bc6d1a58b3bbd268be9c25/495_0_3250_2601/500.jpg",
    "summary": "Donald Tusk has warned that Poland is now closer to military conflict than it has been since World War II. He emphasized the urgency of addressing escalating tensions and the potential risks involved. Tusk's statement highlights growing concerns over regional stability and security.",
    "published": "2025-09-10T15:32:25Z"
  },
  {
    "title": "Poland ‘closer to conflict than at any time since WW2’ as UK forces are asked to bolster Nato air defences – live",
    "url": "https://www.theguardian.com/world/live/2025/sep/10/poland-pm-condemns-repeated-violation-of-airspace-amid-russian-attack-on-ukraine-follow-live",
    "image": "https://media.guim.co.uk/92578a1472baee91e63f8d63d17b71d38123b961/541_0_2416_1934/500.jpg",
    "summary": "Canadian Prime Minister Mark Carney criticized Russian President Vladimir Putin for showing a complete disregard for peaceful resolutions. Carney's comments reflect concerns over Russia's aggressive actions and lack of diplomacy. He emphasizes the need for a committed international response to uphold peace.",
    "published": "2025-09-10T15:30:56Z"
  },
  {
    "title": "Zack Polanski’s victory brings hope for a new kind of politics | Letters",
    "url": "https://www.theguardian.com/politics/2025/sep/10/zack-polanskis-victory-brings-hope-for-a-new-kind-of-politics",
    "image": "https://media.guim.co.uk/2c66d7cfb24e275d92619de302c41feb430259c4/311_0_4675_3741/500.jpg",
    "summary": "Readers share their thoughts on recent articles covering the election of the new Green party leader. They express diverse opinions and insights regarding the party's direction and leadership choice. The letters reflect a mix of support, concern, and hopes for the future of the Green party.",
    "published": "2025-09-10T15:29:06Z"
  },
  {
    "title": "Don’t clap along with the far right – fight them | Letter ",
    "url": "https://www.theguardian.com/world/2025/sep/10/dont-clap-along-with-the-far-right-fight-them",
    "image": "https://media.guim.co.uk/2fd49555f88421bf61fd843a03b16f31eab6256c/412_0_6830_5464/500.jpg",
    "summary": "Aleisha Omeike emphasizes the need for organized action against the increasing racism and misogyny in Britain, responding to Rohan Sathyamoorthy's article. She calls for collective efforts to address these societal issues. The urgency of tackling discrimination is highlighted in her message.",
    "published": "2025-09-10T15:28:36Z"
  },
  {
    "title": "Surrey v Warwickshire, Somerset v Yorkshire and more: county cricket – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/10/surrey-v-warwickshire-somerset-v-yorkshire-and-more-county-cricket-live",
    "image": "https://media.guim.co.uk/f0ff7d69f121d19d04ce8d7c69d556f5c26cbf89/707_0_2685_2149/500.jpg",
    "summary": "Tanya Alfred provides key updates from day three of the County Championship, highlighting matches taking place at Lord's, the Oval, and other venues. The report covers crucial developments and performances from the games. Stay tuned for more insights as the championship progresses.",
    "published": "2025-09-10T15:28:22Z"
  }
]