[
  {
    "title": "Trump celebrates Jimmy Kimmel suspension; some networks replace show with Charlie Kirk tribute – live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/17/donald-trump-charlie-kirk-free-speech-nyt-cdc-rfk-epstein-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/a0ec82d4c0a9a9af63cf1322209564376de0853a/839_0_3689_2953/500.jpg",
    "summary": "ABC has announced that the show will be taken off the air indefinitely after receiving complaints regarding comments made by the host about the killing of right-wing activist Kirk. The decision follows backlash from viewers and concerns over the host's remarks. Further details on the show's return have yet to be provided.",
    "published": "2025-09-18T04:35:39Z"
  },
  {
    "title": "Explainer: What did Jimmy Kimmel say about Charlie Kirk’s killing?",
    "url": "https://www.theguardian.com/us-news/2025/sep/18/what-did-jimmy-kimmel-say-said-comments-about-charlie-kirk",
    "image": "https://media.guim.co.uk/a0ec82d4c0a9a9af63cf1322209564376de0853a/911_0_3691_2953/500.jpg",
    "summary": "During his Monday evening monologue, Jimmy Kimmel speculated that Tyler Robinson, the alleged killer of Kirk, could be a pro-Trump Republican. Kimmel’s comments linked the crime to political affiliations. The suggestion sparked discussions about the intersection of politics and violence.",
    "published": "2025-09-18T04:35:13Z"
  },
  {
    "title": "Australia news live: Sussan Ley says Labor’s new emissions target ‘fails on both counts’ of cost and credibility",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/18/australia-news-live-santos-takeover-2035-emissions-target-chris-bowen-anthony-albanese-sussan-ley-environment-climate-crisis-ntwnfb",
    "image": "https://media.guim.co.uk/a4435643cdd0373659ea0533242d5f15de5b349e/346_0_3443_2756/500.jpg",
    "summary": "I'm sorry, but I need specific content or details from the news article you'd like summarized. Please provide the text or key points you'd like me to summarize!",
    "published": "2025-09-18T04:34:13Z"
  },
  {
    "title": "Country diary: Swallows on the wire, berries in the hedges | Virginia Spiers",
    "url": "https://www.theguardian.com/environment/2025/sep/18/country-diary-swallows-on-the-wire-berries-in-the-hedges",
    "image": "https://media.guim.co.uk/0d1289c5011423468afdf8ff2b84bb4c857af086/0_0_1543_1234/500.jpg",
    "summary": "In St Dominic, Tamar Valley, early autumn has brought a plentiful yield of ash keys and acorns. Additionally, apple and pear trees are heavily laden with fruit. This indicates a bountiful season for local foliage and crops.",
    "published": "2025-09-18T04:30:32Z"
  },
  {
    "title": "No more forced job cuts at Australian National University, staff told, but $250m restructure to continue",
    "url": "https://www.theguardian.com/australia-news/2025/sep/18/australian-national-university-no-more-forced-job-cuts-anu-restructure",
    "image": "https://media.guim.co.uk/c017396124a3bfb3ea30c82d125ba81f61c43e6d/902_0_6181_4945/500.jpg",
    "summary": "The Australian National Dictionary Centre has received crucial support from an anonymous donor, ensuring its continued operation. However, the future of the Australian National University music school is still uncertain. This funding raises hope amid concerns about the school's sustainability.",
    "published": "2025-09-18T04:10:23Z"
  }
]