[
  {
    "title": "Charlie Kirk’s US campus tour will continue despite his death, widow says – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/13/charlie-kirk-suspect-tyler-robinson-erika-kirk-us-politics-latest-news-donald-trump",
    "image": "https://media.guim.co.uk/4ef3a1799aa47a877a94ba4204664a5c985dac29/210_0_1333_1067/500.jpg",
    "summary": "Erika Kirk expressed her enduring connection to her late husband, emphasizing that his voice will live on in her heart. She highlighted the memories and impact he had on her life. Despite his passing, she feels his presence will continue to resonate.",
    "published": "2025-09-13T21:24:01Z"
  },
  {
    "title": "Brentford v Chelsea: Premier League – as it happened",
    "url": "https://www.theguardian.com/football/live/2025/sep/13/brentford-v-chelsea-premier-league-live",
    "image": "https://media.guim.co.uk/f1ab24f21f09bbcedb8c17d687cfa33172d84056/273_759_5056_4045/500.jpg",
    "summary": "Fábio Carvalho scored a last-minute goal, helping Brentford secure a 1-1 draw against Chelsea. The match saw both teams battling for supremacy, but Carvalho's late strike ensured the points were shared. This result highlights Brentford's resilience in a competitive London derby.",
    "published": "2025-09-13T21:20:20Z"
  },
  {
    "title": "Brentford’s Fábio Carvalho hits last-gasp equaliser to frustrate Chelsea",
    "url": "https://www.theguardian.com/football/2025/sep/13/brentford-chelsea-premier-league-match-report",
    "image": "https://media.guim.co.uk/fb75e931a43d736006cf90815275dbe9829b241b/457_0_2615_2092/500.jpg",
    "summary": "Chelsea faced frustration as they were held to a 2-2 draw by Brentford after Fábio Carvalho's stoppage-time equalizer. The Blues had hoped to secure a win but were unable to maintain their lead. The match ended in disappointment for Chelsea fans.",
    "published": "2025-09-13T21:13:45Z"
  },
  {
    "title": "Bottles thrown at police as 100 officers clash with ‘unite the kingdom’ marchers – UK politics live as it happened",
    "url": "https://www.theguardian.com/politics/live/2025/sep/13/uk-politics-latest-news-unite-the-kingdom-march-far-right-rally-london-labour-keir-starmer",
    "image": "https://media.guim.co.uk/42917aaac388a66b0457a04458b3f2bc3a1a04ac/1037_202_4023_3218/500.jpg",
    "summary": "The Metropolitan Police estimate that around 110,000 people participated in a rally, while a smaller group of counter-protesters was contained in a designated area. The event highlights a significant public demonstration, reflecting differing opinions on the issues at stake. The police managed the crowd to ensure safety during the gathering.",
    "published": "2025-09-13T20:05:17Z"
  },
  {
    "title": "Josh Pyke: ‘I turned around and throat-punched the guy – and the whole gig stopped’",
    "url": "https://www.theguardian.com/culture/2025/sep/14/josh-pyke-10-questions-interview",
    "image": "https://media.guim.co.uk/9cac7ad93d3e7ef1fbe948968492ea8aaec90e9a/0_1443_3151_2519/500.jpg",
    "summary": "An Australian musician shares insights on survival skills and reveals his experience as a door-to-door salesman. He discusses the challenges of balancing his music career with unconventional jobs. Additionally, he mentions a popular pop star whose appeal he struggles to understand.",
    "published": "2025-09-13T20:00:15Z"
  }
]