[
  {
    "title": "Australia news live: two MPs cleared in Jacinta Allan manure investigation; search for couple missing in Tasmanian light plane called off",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/23/australia-news-live-albanese-new-york-palestine-united-nations-donald-trump-mark-butler-paracetamol-pregnancy-ntwnfb",
    "image": "https://media.guim.co.uk/a7550bd072c921726a2c637d58a1089367b8fe73/1248_0_6240_4992/500.jpg",
    "summary": "Please provide the news or article you would like summarized, and I will be happy to help!",
    "published": "2025-09-23T07:24:23Z"
  },
  {
    "title": "Gold hits record high in best year since 1979; JLR production shutdown extended by another week – business live",
    "url": "https://www.theguardian.com/business/live/2025/sep/23/gold-price-on-track-best-year-since-1979-record-high-global-economy-uk-growth-business-live-news",
    "image": "https://media.guim.co.uk/b81f258a8a10268e186bfdb55c3fc3ba832ad6b3/458_0_4583_3667/500.jpg",
    "summary": "Gold prices have surged to $3,759 per ounce. Meanwhile, Jaguar Land Rover is facing ongoing disruptions due to a recent cyber-attack. The combined situation highlights significant economic and operational challenges in the market.",
    "published": "2025-09-23T07:21:52Z"
  },
  {
    "title": "B&Q owner lifts profit forecast amid strong demand for kitchens",
    "url": "https://www.theguardian.com/business/2025/sep/23/b-and-q-owner-profits-kitchens-kingfisher-uk",
    "image": "https://media.guim.co.uk/48ecbe75cba7cba12df065c594e3f4ca7f88894a/644_0_2845_2277/500.jpg",
    "summary": "Kingfisher reported strong sales in garden accessories, outdoor paint, and plants due to favorable weather conditions in the UK. The good weather contributed to increased consumer interest in gardening and outdoor activities. Overall, this boosted the company's performance in these product categories.",
    "published": "2025-09-23T07:09:30Z"
  },
  {
    "title": "Afternoon Update: Trump’s ‘cruel’ autism claims; a legal win for the greater glider; and which AFL grand final team to back",
    "url": "https://www.theguardian.com/australia-news/2025/sep/23/afternoon-update-tuesday-ntwnfb",
    "image": "https://media.guim.co.uk/595ec2fbf5f5d1cea70e97319e06139d7c07e698/345_0_4680_3744/500.jpg",
    "summary": "Australia's chief medical officer, along with other experts, has criticized the Trump administration's recent announcement, highlighting concerns over public health implications. The condemnation reflects a broader apprehension about the potential impact of U.S. policy decisions on global health issues. This response underscores the importance of international collaboration in addressing health challenges.",
    "published": "2025-09-23T07:05:21Z"
  },
  {
    "title": "Global investment in renewable energy up 10% on 2024 despite Trump rollback",
    "url": "https://www.theguardian.com/environment/2025/sep/23/global-investment-in-renewable-energy-up-10-on-2024-despite-trump-rollback",
    "image": "https://media.guim.co.uk/b6f0c9d0d95a952a2f220f51660eca73003d83c8/364_0_3065_2452/500.jpg",
    "summary": "Experts report that the growth rate in the sector has dipped slightly compared to previous first halves, yet it remains robust and resilient. This indicates ongoing stability despite the minor slowdown. Overall, the industry continues to exhibit strength amid evolving market conditions.",
    "published": "2025-09-23T07:00:42Z"
  }
]