[
  {
    "title": "Far right’s show of force leaves Met desperately kettling counter-protesters",
    "url": "https://www.theguardian.com/politics/2025/sep/13/far-rights-show-of-force-leaves-met-desperately-kettling-counter-protesters",
    "image": "https://media.guim.co.uk/fa7156680c204f41f48954929127edbe47c23ee9/1224_463_6214_4971/500.jpg",
    "summary": "Police faced significant challenges managing violent clashes incited by Tommy Robinson and other provocative speakers. The situation escalated as brawlers overwhelmed law enforcement efforts to maintain order. The unrest highlights ongoing tensions surrounding Robinson's controversial influence.",
    "published": "2025-09-13T22:21:21Z"
  },
  {
    "title": "Trump administration reportedly has plan to send national guard to Louisiana – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/13/charlie-kirk-suspect-tyler-robinson-erika-kirk-us-politics-latest-news-donald-trump",
    "image": "https://media.guim.co.uk/3d1ce0d457a72e97eb99e82157f59ac8f675e244/272_0_5365_4292/500.jpg",
    "summary": "Leaked documents reveal plans to deploy 1,000 troops for law enforcement operations in urban areas. The deployment aims to enhance security and public safety. This move has raised concerns about the militarization of police and potential civil liberties implications.",
    "published": "2025-09-13T22:05:00Z"
  },
  {
    "title": "Elon Musk calls for dissolution of parliament at far-right rally in London",
    "url": "https://www.theguardian.com/technology/2025/sep/13/elon-musk-calls-for-dissolution-of-parliament-at-far-right-rally-in-london",
    "image": "https://media.guim.co.uk/5e94db6facccea3459b942c5d868c20bd50e9eb4/879_0_863_690/500.jpg",
    "summary": "A US-based tech executive spoke via video link at the \"unite the kingdom\" protest organized by Tommy Robinson. The protest aimed to bring together supporters around a common cause. The involvement of the tech boss highlights the event's reach beyond the UK.",
    "published": "2025-09-13T21:44:27Z"
  },
  {
    "title": "Somerset pull off record chase against Hampshire to claim T20 Blast title",
    "url": "https://www.theguardian.com/sport/2025/sep/13/somerset-pull-off-record-chase-against-hampshire-to-claim-t20-blast-title",
    "image": "https://media.guim.co.uk/de28fdf6fe19b95a89d5c6d46cff5f4fbfd2b849/296_71_2608_2086/500.jpg",
    "summary": "Will Smeed scored 94 runs off 58 balls as Somerset secured a six-wicket victory over Hampshire at Edgbaston. This win allowed Somerset to clinch the trophy for the third time. The team accomplished the feat with one over remaining in the match.",
    "published": "2025-09-13T21:30:37Z"
  },
  {
    "title": "Mainoo uncomfortable having to fight for Manchester United spot, says Amorim",
    "url": "https://www.theguardian.com/football/2025/sep/13/mainoo-uncomfortable-having-to-fight-for-manchester-united-spot-says-amorim",
    "image": "https://media.guim.co.uk/5bef377f403db49eced3946df8ed733357ba703d/52_0_1863_1490/500.jpg",
    "summary": "Ruben Amorim remarked that Kobbie Mainoo, at just 20, is still adapting to the competitive nature of securing his position. He highlighted Mainoo's potential, suggesting that the young player could evolve into the world's top midfielder. Amorim's comments emphasize both encouragement and the need for Mainoo to embrace the challenge ahead.",
    "published": "2025-09-13T21:30:15Z"
  }
]