[
  {
    "title": "US government to shut down within hours if no funding deal agreed – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/30/us-government-shutdown-funding-trump-vance-portland-hegseth-latest-updates",
    "image": "https://media.guim.co.uk/bf2bb008bedc4d1fb7f36e8c4a2eba524b694a6e/1584_0_7920_6336/500.jpg",
    "summary": "Crunch meetings between Donald Trump and Congressional leaders did not yield any progress on preventing a government shutdown. Senator JD Vance expressed concerns, stating, \"I think we’re headed into a shutdown.\" The lack of agreement highlights ongoing challenges in reaching a budget deal.",
    "published": "2025-09-30T10:18:46Z"
  },
  {
    "title": "Netanyahu says he did not agree to Palestinian state as part of Trump Gaza plan, and IDF will remain ‘in most of the territory’ – live",
    "url": "https://www.theguardian.com/world/live/2025/sep/30/netanyahu-israel-gaza-hamas-trump-peace-plan-latest-news-middle-east-crisis-live",
    "image": "https://media.guim.co.uk/7fbc4a01c269f5db73728c44b73ea6a3dc6d8f9f/306_0_3202_2563/500.jpg",
    "summary": "Israeli Prime Minister shared details of his meeting with Donald Trump in a Telegram post. Meanwhile, a senior Hamas official stated that the group will review the proposals presented. The developments highlight ongoing diplomatic efforts and tensions in the region.",
    "published": "2025-09-30T10:18:24Z"
  },
  {
    "title": "Europe must give strong and united response to Russian drone incursions, says von der Leyen – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/sep/30/europe-russia-drones-ukraine-rutte-von-der-leyen-poland-kellogg-latest-updates",
    "image": "https://media.guim.co.uk/6fdb8185396973882dbb01bfd9ce26b58437039c/1199_0_5994_4795/500.jpg",
    "summary": "The President of the European Commission met with the NATO Secretary General to discuss security matters. Meanwhile, the UK, France, Germany, and Sweden have pledged support to strengthen Denmark's security in preparation for upcoming summits in Copenhagen. This collaboration highlights ongoing efforts to enhance security in the region.",
    "published": "2025-09-30T10:17:05Z"
  },
  {
    "title": "Lady Gaga review – from skeletons to sexy plague doctors, this is a glorious, ridiculous spectacle",
    "url": "https://www.theguardian.com/music/2025/sep/30/lady-gaga-review-o2-arena-london-mayhem-ball",
    "image": "https://media.guim.co.uk/c05bb39c43b4e67f00f788bdbda6dbf40a9515e4/1124_1441_2359_1888/500.jpg",
    "summary": "Lady Gaga's eighth world tour embraces over-the-top camp, showcasing her theatricality. The performance features a Nietzschean nemesis and an ecstatic audience, immersed in the experience. Chappell Roan's presence is overshadowed by Gaga's spectacular return to the stage.",
    "published": "2025-09-30T10:09:48Z"
  },
  {
    "title": "Streeting praises health staff from overseas and says Reform UK would be ‘disaster’ for NHS – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/30/labour-conference-starmer-speech-streeting-nhs-reform",
    "image": "https://media.guim.co.uk/96b001866a425c7abb4c236f375cf9e5b819962b/307_0_6776_5421/500.jpg",
    "summary": "The Health Secretary will address the Labour conference to introduce plans for an \"online hospital\" designed to reduce patient waiting times. This initiative aims to improve healthcare accessibility and efficiency. The proposal highlights the government's commitment to modernizing health services through digital solutions.",
    "published": "2025-09-30T10:07:42Z"
  }
]