[
  {
    "title": "Sale concede 26 unanswered points to slump to home loss to Glasgow in Euro opener",
    "url": "https://www.theguardian.com/sport/2025/dec/05/sale-concede-26-unanswered-points-to-slump-to-home-loss-to-glasgow-in-euro-opener",
    "image": "https://media.guim.co.uk/7157df423e8109ea66fa0409aaa15847b8341dd0/447_0_4159_3327/500.jpg",
    "summary": "In an injury-affected match, Sale Sharks fell short against Glasgow Warriors, losing 26-21 in the Investec Champions Cup. Despite having a lead at one point, the team couldn't maintain their advantage. This defeat highlights ongoing challenges for head coach Alex Sanderson's squad.",
    "published": "2025-12-05T22:16:12Z"
  },
  {
    "title": "Thomas Tuchel keeps his cool amid cringe, confusion and drama of World Cup draw | David Hytner",
    "url": "https://www.theguardian.com/football/2025/dec/05/thomas-tuchel-keeps-his-cool-amid-cringe-confusion-and-drama-of-world-cup-draw",
    "image": "https://media.guim.co.uk/17a0a93bc42c4d7471d00cce4a57025a229e46cb/1053_319_3684_2948/500.jpg",
    "summary": "The England manager expressed contentment in concentrating on controllable factors following a memorable yet disappointing draw. The match is likely to be remembered for its negative aspects. His focus remains on future improvements despite the setback.",
    "published": "2025-12-05T22:09:43Z"
  },
  {
    "title": "World Cup draw: group-by-group analysis for the 2026 tournament",
    "url": "https://www.theguardian.com/football/2025/dec/05/world-cup-draw-group-by-group-analysis-for-the-2026-tournament",
    "image": "https://media.guim.co.uk/8d33204ebfd4b82f0974852a3403608285d9d212/0_0_5000_4000/500.jpg",
    "summary": "The article outlines the qualification paths for each team in the tournament, highlighting their journeys and key performances. It identifies the favorites based on recent form and team strengths. Additionally, it points out crucial matchups that fans should watch closely for potential upsets and thrilling gameplay.",
    "published": "2025-12-05T22:09:38Z"
  },
  {
    "title": "Supreme court to decide legality of Trump’s order to restrict birthright citizenship – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/dec/05/trump-pete-hegseth-signal-politics-updates",
    "image": "https://media.guim.co.uk/c55cb65a49483a4c16aed7253602e734516d69ec/456_0_4560_3648/500.jpg",
    "summary": "The court has not specified a date for oral arguments but is expected to schedule them within the next few months. Updates regarding the timeline are anticipated soon. Further developments will clarify the court's proceedings.",
    "published": "2025-12-05T22:02:22Z"
  },
  {
    "title": "US Capitol pipe bomb suspect says he believed Trump’s 2020 election lie",
    "url": "https://www.theguardian.com/us-news/2025/dec/05/dc-pipe-bomb-suspect-court",
    "image": "https://media.guim.co.uk/ec9149d8e08c51b123d1731a463bc1a4c56a56ef/375_0_3293_2634/500.jpg",
    "summary": "Brian Cole Jr. made his first court appearance, facing charges for allegedly planting two devices in Washington on January 5, 2021. The incident is tied to events surrounding the Capitol riots. Legal proceedings are now underway as the case unfolds.",
    "published": "2025-12-05T21:57:55Z"
  }
]