[
  {
    "title": "Australia politics live: Senate resumes after Hanson suspended from parliament",
    "url": "https://www.theguardian.com/australia-news/live/2025/nov/24/australia-politics-live-sussan-ley-andrew-hastie-liberal-leadership-libspill-labor-environment-nature-law-senate-greens-coalition-climate-crisis-ntwnfb",
    "image": "https://media.guim.co.uk/dbc944d66402f58424c9cbcdbb7f76dc46c739f0/974_0_5536_4431/500.jpg",
    "summary": "Please provide the news content you'd like summarized, and I'll be happy to help!",
    "published": "2025-11-24T07:18:24Z"
  },
  {
    "title": "Farage urged to explain conspiracy theories linked to antisemitism he voiced in US media",
    "url": "https://www.theguardian.com/politics/2025/nov/24/farage-urged-to-explain-conspiracy-theories-linked-to-antisemitism-he-voiced-in-us-media",
    "image": "https://media.guim.co.uk/34c37469523bcfc6d3c010a1def131e745245bcb/0_0_4320_3456/500.jpg",
    "summary": "Reform UK leader engaged in promoting far-right views during web TV and radio appearances from 2009 to 2018. These discussions included controversial talking points associated with far-right ideologies. This revelation raises concerns about his past stance on various issues as he leads the political party.",
    "published": "2025-11-24T07:00:32Z"
  },
  {
    "title": "Holbein: Renaissance Master by Elizabeth Goldring review – a magnificent portrait of the artist",
    "url": "https://www.theguardian.com/books/2025/nov/24/holbein-renaissance-master-by-elizabeth-goldring-review-a-magnificent-portrait-of-the-artist",
    "image": "https://media.guim.co.uk/c8977107f093af18f2ae6c774259238413e3261b/507_299_4160_3327/500.jpg",
    "summary": "A newly released scholarly biography, the first in over a century, provides a compelling exploration of the life of the individual who captured the essence of the Tudor court. The work is praised for its depth and insights, enriching our understanding of this historical figure. This biography promises to be a significant contribution to Tudor studies.",
    "published": "2025-11-24T07:00:30Z"
  },
  {
    "title": "England plot route to Ashes recovery as Mark Wood admits they were ‘hit hard in round one’",
    "url": "https://www.theguardian.com/sport/2025/nov/24/cricket-mark-wood-england-ashes-perth-to-brisbane-test",
    "image": "https://media.guim.co.uk/80743f58872243a1dbbfc9a8950746560c7a3e74/541_34_2459_1967/500.jpg",
    "summary": "A fast bowler is contemplating driving from Perth to Brisbane. Meanwhile, there is uncertainty among tourists regarding whether Test players will compete against the Prime Minister's XI. The decision is still pending as the situation develops.",
    "published": "2025-11-24T06:49:19Z"
  },
  {
    "title": "‘Stone-cold killers’: New Zealand to eradicate feral cats by 2050",
    "url": "https://www.theguardian.com/world/2025/nov/24/new-zealand-to-eradicate-feral-cats-by-2050",
    "image": "https://media.guim.co.uk/ce6077451decf947b2e71fa77a1570d2c67f42ea/32_0_929_744/500.jpg",
    "summary": "Feral cats, previously managed through localized catch-and-kill methods, will now face organized eradication efforts. These large-scale programs aim to control their populations more effectively. The initiative reflects growing concerns over the environmental impact of feral cats.",
    "published": "2025-11-24T06:12:58Z"
  }
]