[
  {
    "title": "Australia politics live: Ley says she values Indian community ‘incredibly’ as she rejects Nampijinpa Price immigration claim",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/04/australia-politics-live-bob-carr-daniel-andrews-beijing-putin-question-time-labor-coalition-anthony-albanese-sussan-ley-ntwnfb",
    "image": "https://media.guim.co.uk/53204ddb7c8320e039b5c21c3952d8f3ecafc6b5/788_0_5473_4379/500.jpg",
    "summary": "I’m sorry, but I cannot follow live events or access live news feeds. However, if you provide details or a specific article you'd like summarized, I'd be happy to help!",
    "published": "2025-09-04T02:59:14Z"
  },
  {
    "title": "White House vows to appeal after judge sides with Harvard and reverses billions in Trump cuts – as it happened",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/03/donald-trump-immigration-tariffs-epstein-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/9b14c0471ec0692c614c2b2cd1d915767d12243c/213_0_4069_3256/500.jpg",
    "summary": "A spokesperson criticized an \"activist judge\" following a ruling that deemed the administration's cuts to university research as illegal retaliation. The decision highlights tensions between the judiciary and the administration over government actions affecting academic funding. The ruling has implications for how governmental entities handle financial support for research institutions.",
    "published": "2025-09-04T01:48:44Z"
  },
  {
    "title": "Maine shooting survivors sue US government, alleging army failed to stop deadly attack",
    "url": "https://www.theguardian.com/us-news/2025/sep/03/maine-shooting-survivors-government-lawsuit",
    "image": "https://media.guim.co.uk/6db9de9bc8eca0c2a65c857dbaef13adccd25297/414_0_4099_3280/500.jpg",
    "summary": "The U.S. Army has been accused of consistently breaching its own protocols following a shooting incident in 2023 involving a reservist that resulted in 18 fatalities. Investigations revealed lapses in oversight and adherence to existing guidelines. The revelations have sparked calls for accountability and reform within military practices.",
    "published": "2025-09-04T01:19:30Z"
  },
  {
    "title": "Top Democrat says intelligence briefing cancelled after attacks by far-right Laura Loomer",
    "url": "https://www.theguardian.com/us-news/2025/sep/03/mark-warner-democrat-laura-loomer",
    "image": "https://media.guim.co.uk/9f520420b5325ccb3a48cb858f46664d0527a1b8/333_0_3333_2667/500.jpg",
    "summary": "Senator Mark Warner stated that officials revoked an invitation due to a \"campaign of baseless attacks\" from an extremist supporter of Donald Trump. The decision reflects escalating tensions and divisive rhetoric surrounding political events. Warner's remarks highlight concerns about the impact of extremist views on public discourse.",
    "published": "2025-09-04T00:42:34Z"
  },
  {
    "title": "Old master painting looted by Nazis recovered a week after being spotted in Argentinian property listing",
    "url": "https://www.theguardian.com/world/2025/sep/04/nazi-looted-old-master-painting-giuseppe-ghislandi-recovered-argentina-property-listing-ntwnfb",
    "image": "https://media.guim.co.uk/34be32c3d063ac08c81c8388cfe7f4f7c27e540b/8_175_3027_2423/500.jpg",
    "summary": "A portrait titled \"Portrait of a Lady,\" created by Italian artist Giuseppe Ghislandi, has been returned after being handed over by the daughter of the late Nazi financier Friedrich Kadgien. The artwork's restitution underscores ongoing efforts to address issues of art looted during World War II. This handover is part of a broader movement to reclaim stolen cultural heritage.",
    "published": "2025-09-04T00:33:55Z"
  }
]