[
  {
    "title": "Thames Water creditors propose new rescue plan; Tesco ups profit outlook despite pressure on household budgets – business live",
    "url": "https://www.theguardian.com/business/live/2025/oct/02/thames-water-creditors-rescue-plan-tesco-profit-markets-business-live-news",
    "image": "https://media.guim.co.uk/55c7b125803beb3009c9c8c615dd2a3f85696bdd/458_0_4583_3667/500.jpg",
    "summary": "Creditors managing a firm have announced plans to write off loans, increase investments, and pay pollution fines. This development signals a positive outlook for the company. Meanwhile, European shares have reached a record high in response to these financial improvements.",
    "published": "2025-10-02T09:17:37Z"
  },
  {
    "title": "‘Russia will not stop until they are forced to do so,’ Danish PM warns as she opens European leaders summit – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/oct/02/epc-european-political-community-leaders-copenhagen-denmark-ukraine-russia-europe-live",
    "image": "https://media.guim.co.uk/ed27b0372ad6924ac08728696ae27138904e3aff/0_345_3733_2988/500.jpg",
    "summary": "Over 45 leaders convened in Copenhagen for the seventh summit of the European Political Community. The gathering aims to address key political and economic challenges facing Europe. Discussions focus on strengthening cooperation and enhancing regional stability.",
    "published": "2025-10-02T09:15:43Z"
  },
  {
    "title": "‘Utter nonsense’ to say PM tried to incite violence against Farage, minister says – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/oct/02/reform-uk-zia-yusuf-keir-starmer-nigel-farage-immigration-asylum-labour-climate-change-uk-politics-live",
    "image": "https://media.guim.co.uk/c38ea29ec527c8763088feac40975525796aaf66/473_0_4358_3487/500.jpg",
    "summary": "Migration Minister Mike Tapp criticized Reform UK's head of policy, labeling him as 'snowflakery.' This remark came amid a debate on immigration policies. The exchange highlights ongoing tensions between political parties regarding immigration.",
    "published": "2025-10-02T09:07:18Z"
  },
  {
    "title": "Gaza aid flotilla: more than a dozen vessels intercepted by Israeli forces; Greta Thunberg arrested – live",
    "url": "https://www.theguardian.com/world/live/2025/oct/01/israel-gaza-aid-global-sumud-flotilla-middle-east-crisis-latest-updates",
    "image": "https://media.guim.co.uk/1dc8eff7cd550ab162294c9a1525393e9bf0e162/107_0_705_564/500.jpg",
    "summary": "The Israeli foreign ministry shared a video of climate activist Greta Thunberg’s arrest. This occurred when vessels carrying around 500 activists were intercepted approximately 75 miles off the coast of the conflict-affected area. The incident highlights ongoing tensions related to protests and humanitarian issues in the region.",
    "published": "2025-10-02T09:03:30Z"
  },
  {
    "title": "‘It’s been beyond difficult’: earthworks of HS2 take toll on Chilterns residents",
    "url": "https://www.theguardian.com/environment/2025/oct/02/hs2-earthworks-toll-on-chilterns-residents",
    "image": "https://media.guim.co.uk/ba0244d85bdcc88d533dd40f1eda9915a86ca14c/454_0_4520_3618/500.jpg",
    "summary": "Residents express concerns over significant changes to their environment due to a rail project encroaching on an area of outstanding natural beauty. Complaints include flooding, increased dust, and overall disruption to their daily lives. The project has sparked debates over the balance between development and environmental preservation.",
    "published": "2025-10-02T09:00:44Z"
  }
]