[
  {
    "title": "Supreme court to hear Voting Rights Act challenge that could affect control of Congress – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/15/donald-trump-federal-government-shutdown-redistricting-voting-rights-act-kash-patel-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/7e8775e32cb6047f194b2f5815622a3aa4c8c769/1248_0_6269_5015/500.jpg",
    "summary": "The GOP is attempting to have Section 2 of the Voting Rights Act, which aims to prevent voting discrimination, declared unconstitutional. This effort comes amid ongoing disputes over redistricting efforts across the country. The move highlights the broader political and legal battles surrounding voting rights in the U.S.",
    "published": "2025-10-15T14:20:04Z"
  },
  {
    "title": "UK government borrowing costs fall as Reeves hints at tax rises – business live",
    "url": "https://www.theguardian.com/business/live/2025/oct/15/rachel-reeves-uk-beacon-of-stability-growth-imf-budget-tax-spending-stock-markets-business-live-news",
    "image": "https://media.guim.co.uk/5b8bdff87a5b43e5629205086456b5ddbc437c73/625_0_6253_5005/500.jpg",
    "summary": "Stay updated with real-time news regarding economic trends and financial markets. Key developments impacting global economies and investment avenues are highlighted. Expert analysis provides insights into ongoing financial shifts and their implications.",
    "published": "2025-10-15T14:19:02Z"
  },
  {
    "title": "Sweden, Estonia, and Finland pledge to increase spending on weapons purchases from US – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/oct/15/russia-ukraine-nato-france-latest-europe-live-news-updates",
    "image": "https://media.guim.co.uk/07daa153d415a3842375865252675d0a46688e17/426_0_4163_3331/500.jpg",
    "summary": "NATO Secretary-General Mark Rutte announced the expectation of additional financial commitments, highlighting that $2 billion has already been pledged through the existing funding mechanism.",
    "published": "2025-10-15T14:15:33Z"
  },
  {
    "title": "USWNT great Christen Press to retire at the end of the 2025 NWSL season",
    "url": "https://www.theguardian.com/football/2025/oct/15/christen-press-uswnt-retires-angel-city-manchester-united",
    "image": "https://media.guim.co.uk/a1b6f350acca65cca1fe1ea83ff785506af47a5a/775_0_3875_3100/500.jpg",
    "summary": "USWNT forward Christen Press has announced her retirement from professional soccer after a 14-year career. During her time on the national team, she made 155 appearances and scored 64 goals. Press leaves behind a significant legacy in women's soccer.",
    "published": "2025-10-15T14:11:11Z"
  },
  {
    "title": "From Heat to thermals: Al Pacino and Robert De Niro have paired up to flog puffer jackets",
    "url": "https://www.theguardian.com/film/2025/oct/15/from-heat-to-thermals-al-pacino-and-robert-de-niro-have-paired-up-to-flog-puffer-jackets",
    "image": "https://media.guim.co.uk/06919a6479dc1192a0f10e4058c739869fde6452/351_0_1661_1329/500.jpg",
    "summary": "After three decades since their last collaboration, two Hollywood icons reunite in a new advertisement for coats. The nostalgic partnership brings excitement to fans. The ad showcases their enduring chemistry and style.",
    "published": "2025-10-15T14:10:18Z"
  }
]