[
  {
    "title": "US Open tennis 2025: Auger-Aliassime v De Minaur, Anisimova v Swiatek on day 11 – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/03/us-open-tennis-2025-auger-aliassime-v-de-minaur-anisimova-v-swiatek-on-day-11-live",
    "image": "https://media.guim.co.uk/6bc38ad34397527f6272d2ab40014c8c2a556069/241_0_4298_3438/500.jpg",
    "summary": "Daniel Harris is providing live updates on the ongoing singles quarter-finals at Flushing Meadows. Fans can follow his rolling report for the latest developments. Stay tuned for key moments and results from the matches.",
    "published": "2025-09-03T17:29:57Z"
  },
  {
    "title": "Only two more Republicans needed to force vote on Epstein files release, bill co-sponsor says – live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/03/donald-trump-immigration-tariffs-epstein-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/966119b82ed9b3bd7935028173318e2c72db156e/767_0_4248_3398/500.jpg",
    "summary": "Donald Trump labeled the ongoing scrutiny over Jeffrey Epstein's files as a \"Democrat hoax that never ends.\" This statement comes amid efforts by a bipartisan group of lawmakers to compel a vote on related legislation. The situation highlights a contentious political divide surrounding Epstein's case and its implications.",
    "published": "2025-09-03T17:29:53Z"
  },
  {
    "title": "Trump says ‘you’ll see things happen’ if US is unhappy with Putin’s decisions – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/sep/03/volodymyr-zelenskyy-denmark-support-ukraine-karol-nawrocki-meet-donald-trump-europe-latest-updates-news",
    "image": "https://media.guim.co.uk/6dda344675221d2736430f538d245e3cf1e0ecf5/234_0_3545_2836/500.jpg",
    "summary": "During a meeting with Polish President Karol Nawrocki, Trump commented on rising tensions following President Putin's warning that Russia might resort to military action if diplomatic efforts do not succeed. The discussion comes amid increasing concerns over regional security and potential escalations. The meeting highlights ongoing geopolitical challenges faced by NATO allies in the face of Russian threats.",
    "published": "2025-09-03T17:26:00Z"
  },
  {
    "title": "Farage a ‘Putin-loving, free speech impostor’ says Democrat before Reform head’s US speech – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/03/farage-starmer-badenoch-pmqs-news-updates-uk-politics-live",
    "image": "https://media.guim.co.uk/6015fae3e517fdff1435548d88f3150d00bc8b00/255_0_3332_2665/500.jpg",
    "summary": "Jamie Raskin labeled UK politician Nigel Farage as a \"Trump sycophant\" ahead of Farage's appearance before the House Judiciary Committee in Washington. This remark highlights tensions surrounding Farage's political alignment with former President Trump. Farage's testimony comes amid ongoing discussions about international political influences.",
    "published": "2025-09-03T17:25:54Z"
  },
  {
    "title": "Met police chief calls for review of law after Graham Linehan arrest",
    "url": "https://www.theguardian.com/uk-news/2025/sep/03/met-police-chief-calls-for-review-of-law-after-graham-linehan-arrest",
    "image": "https://media.guim.co.uk/bd08c80828e8b94e4ec75d7c9d91f6200767d5fd/1067_298_2686_2150/500.jpg",
    "summary": "Rowley emphasizes that police officers should avoid engaging in divisive cultural debates, asserting that they are placed in a challenging position. He suggests that involvement in such \"toxic culture wars\" distracts from their primary responsibilities. This statement highlights concerns about the role of law enforcement in contentious social issues.",
    "published": "2025-09-03T17:24:12Z"
  }
]