[
  {
    "title": "Everton v Aston Villa, Fulham v Leeds, Championship updates and more: football clockwatch – live",
    "url": "https://www.theguardian.com/football/live/2025/sep/13/everton-v-aston-villa-fulham-v-leeds-championship-updates-and-more-football-clockwatch-live",
    "image": "https://media.guim.co.uk/3f01fc982b3a54d90bc95b56ae88a0bbe40d6e99/414_43_3034_2427/500.jpg",
    "summary": "Join our writers for live updates on the afternoon’s 3 PM kick-offs in the Premier League and other leagues. Stay informed about key moments and scores as they unfold. Don't miss out on the action!",
    "published": "2025-09-13T14:26:33Z"
  },
  {
    "title": "New Zealand 46-17 South Africa: Women’s Rugby World Cup quarter-final – as it happened",
    "url": "https://www.theguardian.com/sport/live/2025/sep/13/new-zealand-v-south-africa-womens-rugby-world-cup-quarter-final-live",
    "image": "https://media.guim.co.uk/d34ebd3762d8d768d8f08386db225876384e8f4e/324_293_3010_2408/500.jpg",
    "summary": "The Black Ferns showcased a commanding performance, scoring eight tries to defeat their opponents 46-17 at Sandy Park. This victory secured their spot in the semi-finals. Their dominance on the field highlighted their strong capabilities in the tournament.",
    "published": "2025-09-13T14:25:55Z"
  },
  {
    "title": "FBI director ridiculed by far right for clumsy response to Charlie Kirk’s killing",
    "url": "https://www.theguardian.com/us-news/2025/sep/13/fbi-director-kash-patel-ridiculed-far-right-charlie-kirk-killing",
    "image": "https://media.guim.co.uk/bc093de90ea9eeaa644c5aebdfa0e383029fbdd2/258_0_5202_4160/500.jpg",
    "summary": "Kash Patel faced harsh criticism, including personal insults regarding his management of an investigation and derogatory comments about his ethnicity. Additionally, remarks were made about his reference to Valhalla, further fueling the controversy. The situation highlights tensions surrounding Patel's role and public perception.",
    "published": "2025-09-13T14:25:34Z"
  },
  {
    "title": "Police say 110,000 attending ‘unite the kingdom’ rally in London, with some in crowd attacking officers – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/13/uk-politics-latest-news-unite-the-kingdom-march-far-right-rally-london-labour-keir-starmer",
    "image": "https://media.guim.co.uk/42917aaac388a66b0457a04458b3f2bc3a1a04ac/1037_202_4023_3218/500.jpg",
    "summary": "The Metropolitan Police estimate around 110,000 people attended a rally, though they find it challenging to confirm the exact numbers. Tensions escalated when a group in Whitehall began throwing projectiles at police officers. The situation reflects the rally's intensity and potential unrest.",
    "published": "2025-09-13T14:18:34Z"
  },
  {
    "title": "New Zealand blitz South Africa after break to reach World Cup semi-finals",
    "url": "https://www.theguardian.com/sport/2025/sep/13/new-zealand-south-africa-womens-rugby-world-cup-match-report",
    "image": "https://media.guim.co.uk/48ceb7c3dffd4f8984b5aaebd0c67f1c9830c36b/905_0_6041_4833/500.jpg",
    "summary": "The world champions showcased an impressive performance in the second half, defeating South Africa 46-17. This victory secured their spot in the semifinals. Their dominant display highlighted their strength as a team.",
    "published": "2025-09-13T14:14:48Z"
  }
]