[
  {
    "title": "Manchester United striker Melvine Malard likened to Eric Cantona by Marc Skinner",
    "url": "https://www.theguardian.com/football/2025/sep/17/manchester-united-striker-melvine-malard-likened-to-eric-cantona-by-marc-skinner",
    "image": "https://media.guim.co.uk/c873a4183c982192a461075944bd11573feacadb/913_0_5999_4800/500.jpg",
    "summary": "Manchester United head coach Marc Skinner has drawn a comparison between striker Melvine Malard's persona and that of club legend Eric Cantona. Skinner highlighted Malard's confidence and competitive spirit, similar to the iconic French forward. The comparison emphasizes Malard's potential impact on the team moving forward.",
    "published": "2025-09-17T10:37:50Z"
  },
  {
    "title": "Surrey v Nottinghamshire, Sussex v Yorkshire, and more: county cricket, day three – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/17/surrey-v-nottinghamshire-sussex-v-yorkshire-and-more-county-cricket-day-three-live",
    "image": "https://media.guim.co.uk/6f12be0aeb035998f0fc6c1e7a7f6ac4875cd299/414_0_4574_3659/500.jpg",
    "summary": "Live updates are being provided from various matches in the County Championship's Division One and Two. The report covers ongoing games, player performances, and significant moments. Fans can follow the latest developments and scores in real-time.",
    "published": "2025-09-17T10:37:25Z"
  },
  {
    "title": "World Athletics Championships 2025: Gout Gout makes bow, Josh Kerr goes for gold and more – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/17/world-athletics-championships-2025-womens-pole-vault-final-mens-1500m-final-and-more-live",
    "image": "https://media.guim.co.uk/ea38aa3883521a22fc3653d50bc257aaca13dada/665_0_6578_5263/500.jpg",
    "summary": "On the fifth evening of events in Tokyo, Yara El-Shaboury provides the latest updates and news. The report covers key highlights and developments from the ongoing activities. Stay tuned for real-time coverage and insights.",
    "published": "2025-09-17T10:35:45Z"
  },
  {
    "title": "Israel opens ‘temporary’ route for residents to flee as troops and tanks push deeper into Gaza City – Middle East crisis live",
    "url": "https://www.theguardian.com/world/live/2025/sep/17/israel-gaza-offensive-middle-east-latest-news-updates",
    "image": "https://media.guim.co.uk/dad4acce2be5806245ac17c34832dac741e21c76/866_0_4800_3840/500.jpg",
    "summary": "The Israeli military announced that Salah al-Din street will be accessible for 48 hours. Additionally, another coastal route will only be open for two hours. These measures may impact local travel and logistics.",
    "published": "2025-09-17T10:35:29Z"
  },
  {
    "title": "Donald Trump to meet the king as protesters gather in London and Windsor – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/17/donald-trump-uk-state-visit-king-charles-windsor-politics-latest-news-updates-labour-keir-starmer",
    "image": "https://media.guim.co.uk/096b52516f60fd003b74104db42ace802eb7ba25/130_0_5136_4109/500.jpg",
    "summary": "During his state visit to the UK, the US president will engage in multiple events in Windsor on his first full day. These activities are part of a formal agenda leading up to a state banquet. The visit underscores the diplomatic relations between the two nations.",
    "published": "2025-09-17T10:32:33Z"
  }
]