[
  {
    "title": "England v Canada: Women’s Rugby World Cup final – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/27/england-v-canada-womens-rugby-world-cup-final-live",
    "image": "https://media.guim.co.uk/da117f3c5c7e844bc6dece083e95b266f2692c83/467_168_3158_2528/500.jpg",
    "summary": "The Red Roses face Canada in a highly anticipated match for the championship title at Twickenham, drawing a sold-out crowd. The event promises an exciting atmosphere as both teams compete for the ultimate prize. Follow along with live updates from Luke McLaughlin.",
    "published": "2025-09-27T15:16:21Z"
  },
  {
    "title": "Crystal Palace v Liverpool, Atlético v Real Madrid and more: clockwatch – live",
    "url": "https://www.theguardian.com/football/live/2025/sep/27/crystal-palace-v-liverpool-atletico-v-real-madrid-and-more-clockwatch-live",
    "image": "https://media.guim.co.uk/77919e24ee02558ee4116440ff5afba97d41d74b/412_133_3035_2429/500.jpg",
    "summary": "Stay updated with live coverage as our writers provide real-time updates from the afternoon Premier League matches and other games. Don't miss the latest scores and highlights. Join us for an engaging sports experience!",
    "published": "2025-09-27T15:14:23Z"
  },
  {
    "title": "Ryder Cup 2025: day two – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/27/ryder-cup-2025-day-two-live",
    "image": "https://media.guim.co.uk/511e8b45d1cd3b2cb3401b645b38ae49d4c7f7b4/371_301_3490_2792/500.jpg",
    "summary": "European teams are looking to extend their lead on day two at Bethpage Black. Live updates provide hole-by-hole coverage of the ongoing golf event. Stay tuned for the latest developments from the tournament.",
    "published": "2025-09-27T15:13:55Z"
  },
  {
    "title": "US military brass brace for firings as Pentagon chief orders top-level meeting",
    "url": "https://www.theguardian.com/us-news/2025/sep/27/us-military-leaders-meeting-pete-hegseth",
    "image": "https://media.guim.co.uk/1d0fe0bb4a43af667099163e5bfe59006e38e03b/771_0_5000_4000/500.jpg",
    "summary": "Pete Hegseth organized a gathering for hundreds of military generals and admirals in Virginia. The event focused on receiving a motivational address centered on the concept of 'warrior ethos.' This initiative aimed to reinforce military values and leadership principles among senior officers.",
    "published": "2025-09-27T15:07:22Z"
  },
  {
    "title": "Labour conference chance to show alternative to ‘toxic divide and decline’ offered by Reform, says Starmer – as it happened",
    "url": "https://www.theguardian.com/politics/live/2025/sep/27/railway-operators-trains-public-ownership-labour-party-conference-uk-politics-live-latest-news",
    "image": "https://media.guim.co.uk/21c840c1f00847aa2e39c287cdce437eefe4ec09/661_0_4663_3730/500.jpg",
    "summary": "At the Labour Party conference, the Prime Minister emphasized it as a significant opportunity to present their case to the nation. He highlighted the importance of the event in shaping public perception. The conference serves as a platform for the party to outline its policies and connect with constituents.",
    "published": "2025-09-27T15:03:42Z"
  }
]