[
  {
    "title": "Australia news live: Ley says nuclear a technology ‘we should consider for the future’ after Coalition’s net zero meeting",
    "url": "https://www.theguardian.com/australia-news/live/2025/oct/31/australia-news-live-politics-parliament-coalition-labor-net-zero-anthony-albanese-sussan-ley-epbc-nature-laws-ntwnfb",
    "image": "https://media.guim.co.uk/09719c98cf89cab2321405f962f5ab96b47b95cb/349_0_5685_4548/500.jpg",
    "summary": "I'm sorry, but I need more context or specific information about the news you'd like summarized. Please provide additional details or the main content you'd like me to summarize.",
    "published": "2025-10-31T01:33:58Z"
  },
  {
    "title": "‘Yes, we’ve been to the moon before’: Nasa rebuffs Kim Kardashian conspiracy theory",
    "url": "https://www.theguardian.com/science/2025/oct/30/nasa-kim-kardashian-moon-landings",
    "image": "https://media.guim.co.uk/d169fa810e9dc81d087407451d08e5c338e73084/326_0_5319_4255/500.jpg",
    "summary": "NASA chief Sean Duffy reaffirmed the authenticity of the 1969 moon landing following a claim by a US celebrity on a TV show that it was staged. Duffy emphasized the extensive evidence supporting the successful Apollo 11 mission. The statement comes amid continuing conspiracy theories questioning the lunar landing’s legitimacy.",
    "published": "2025-10-31T01:25:08Z"
  },
  {
    "title": "Trump news at a glance: Four Senate Republicans join Democrats to reject global tariffs",
    "url": "https://www.theguardian.com/us-news/2025/oct/30/trump-news-at-a-glance-latest-updates-news-today",
    "image": "https://media.guim.co.uk/38cdf13709125090f7b47586965b3416d219f08d/467_0_3829_3062/500.jpg",
    "summary": "The Senate experienced unusual opposition on Thursday, October 30, but the House is expected to refrain from any similar initiatives. Key US political developments continue to unfold in this context. The overall atmosphere remains tense as both chambers navigate their differences.",
    "published": "2025-10-31T01:01:00Z"
  },
  {
    "title": "Former NSW MP Gareth Ward sentenced to almost six years in prison for sexually abusing two men ",
    "url": "https://www.theguardian.com/australia-news/2025/oct/31/gareth-ward-sentenced-for-sexually-abusing-two-men-ntwnfb",
    "image": "https://media.guim.co.uk/8927ce73c94348c50cdbadd80f2f6a40463b47b5/591_0_5908_4726/500.jpg",
    "summary": "Ward, who recently resigned as the member for Kiama, appeared via video link from Cessnock prison. His resignation occurred in early August. The circumstances surrounding his resignation and incarceration remain unclear in the news report.",
    "published": "2025-10-31T01:00:04Z"
  },
  {
    "title": "‘Seed of hope’: Gaza grandmother is reunited with her Australian family after more than a decade",
    "url": "https://www.theguardian.com/world/2025/oct/31/gaza-grandmother-reunited-with-her-australian-family",
    "image": "https://media.guim.co.uk/3cf213412ca226ddcba4a0b619ac448d787c9aa4/57_0_2461_1970/500.jpg",
    "summary": "Shamikh Badra's 79-year-old mother, Fatma, has finally arrived in Australia after years of efforts to bring her over. The emotional moment was marked by a kiss on the forehead, symbolizing their long-awaited reunion. This milestone reflects the challenges faced by families seeking to reunite across borders.",
    "published": "2025-10-31T00:29:27Z"
  }
]