[
  {
    "title": "Ravens v Steelers, Jaguars v Colts and Bills v Bengals: NFL week 14 – live",
    "url": "https://www.theguardian.com/sport/live/2025/dec/07/ravens-v-steelers-jaguars-v-colts-and-bills-v-bengals-nfl-week-14-live",
    "image": "https://media.guim.co.uk/a4d2951bd812bdd6260d02a99653b0ac16573dce/225_0_4143_3315/500.jpg",
    "summary": "Graham Searles will provide live updates on tonight's NFL games, featuring a matchup between the Ravens and Steelers at M&T Bank Stadium. Fans can expect timely insights and scores throughout the event. Tune in for all the action and highlights.",
    "published": "2025-12-07T19:14:39Z"
  },
  {
    "title": "Brighton bans Guardian from stadium over reporting on Tony Bloom ",
    "url": "https://www.theguardian.com/football/2025/dec/07/brighton-bans-guardian-from-stadium-over-reporting-on-tony-bloom",
    "image": "https://media.guim.co.uk/68a7f7d32ec2a00a0ff931e8396e7118289f7b4a/229_0_2498_1999/500.jpg",
    "summary": "A Premier League club has imposed a ban on reporters and photographers, citing concerns over the nature of their reporting. A spokesperson from The Guardian stated that their coverage serves the public interest. The ban highlights tensions between the club and the media regarding transparency and accountability.",
    "published": "2025-12-07T18:52:36Z"
  },
  {
    "title": "Fulham 1-2 Crystal Palace: Premier League – as it happened",
    "url": "https://www.theguardian.com/football/live/2025/dec/07/fulham-v-crystal-palace-premier-league-live",
    "image": "https://media.guim.co.uk/1e54ae5d9adce0f2133d978f809378485ef354f4/496_0_4503_3602/500.jpg",
    "summary": "Marc Guehi scored a late header to secure victory in an exciting match. The game featured a stunning goal from Harry Wilson that captivated fans. Overall, it showcased thrilling moments and intense competition.",
    "published": "2025-12-07T18:44:22Z"
  },
  {
    "title": "Crystal Palace up to fourth after Marc Guéhi’s late header stuns Fulham",
    "url": "https://www.theguardian.com/football/2025/dec/07/fulham-crystal-palace-premier-league-match-report",
    "image": "https://media.guim.co.uk/238cc2492d7113143df8937854a164d3f260fd73/81_15_4335_3468/500.jpg",
    "summary": "Eddie Nketiah scored the opening goal in Crystal Palace's 2-1 victory over Fulham. Harry Wilson equalized for Fulham with a first-half goal. The match ended with Palace securing the win.",
    "published": "2025-12-07T18:38:40Z"
  },
  {
    "title": "Man arrested after people at Heathrow allegedly attacked with ‘form of pepper spray’ ",
    "url": "https://www.theguardian.com/uk-news/2025/dec/07/man-arrested-after-people-attacked-with-form-of-pepper-spray-at-heathrow-terminal-3-car-park",
    "image": "https://media.guim.co.uk/19b8d4cf2b7b29462432e3ac0828533a1d37b477/0_0_1536_1229/500.jpg",
    "summary": "Police suspect that an incident at an airport car park involved the theft of a suitcase, with the individuals involved being acquaintances. Investigators are looking into the circumstances surrounding the event. Further details about the suspects or the suitcase's contents have not been released.",
    "published": "2025-12-07T18:33:59Z"
  }
]