[
  {
    "title": "Women and children to lose out most from Home Office plan to tighten rules on refugee family reunions, experts say – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/01/women-children-home-office-refugee-family-reunions-uk-politics-live-latest-updates-news",
    "image": "https://media.guim.co.uk/cc47c631a1ff2f3529b59cf416cffb2a701ba439/711_0_6880_5504/500.jpg",
    "summary": "The Refugee Council warns that proposed financial and language requirements for refugees will either divide families or compel them to undertake perilous journeys. These measures are criticized for undermining the safety and unity of vulnerable individuals. The organization calls for a more compassionate approach to refugee support.",
    "published": "2025-09-01T09:40:43Z"
  },
  {
    "title": "Transfer deadline day: Isak deal agreed; Sancho, Jackson, Donnarumma and more – live",
    "url": "https://www.theguardian.com/football/live/2025/sep/01/transfer-deadline-day-guehi-wissa-martinez-ederson-latest-and-more-live",
    "image": "https://media.guim.co.uk/6e28c81c68d5db1aab4bd20800d604dd8c0abcb1/237_0_1920_1536/500.jpg",
    "summary": "Daniel Harris is providing a rolling report on the latest developments and updates as deadline day unfolds. Expect a variety of significant moves and news throughout the day. Stay tuned for real-time insights and highlights.",
    "published": "2025-09-01T09:39:57Z"
  },
  {
    "title": "UK manufacturing downturn continues as new orders slide; Profits surge at Royal Mail – business live",
    "url": "https://www.theguardian.com/business/live/2025/sep/01/factory-activity-us-tariffs-uk-house-price-drop-mortgage-interest-rates-business-live-news-updates",
    "image": "https://media.guim.co.uk/931d11a23666de0b8a2b0e280544fbe3feee3900/215_0_3366_2692/500.jpg",
    "summary": "Factory orders have decreased due to weak market conditions, the impact of US tariffs, and declining client confidence. These factors have collectively contributed to a challenging environment for manufacturers. The downturn signals potential risks for the overall economy.",
    "published": "2025-09-01T09:35:43Z"
  },
  {
    "title": "Crossword editor’s desk: what happened to funny adverts?",
    "url": "https://www.theguardian.com/crosswords/crossword-blog/2025/sep/01/crossword-editors-desk-what-happened-to-funny-adverts",
    "image": "https://media.guim.co.uk/f7806ac405bc833b57b6ce45d4822dcf36e5f6a5/427_0_4180_3344/500.jpg",
    "summary": "A recent Genius puzzle pays tribute to the nostalgic era of entertaining TV commercials. It engages fans by incorporating clever references and callbacks to these memorable advertisements. The puzzle highlights the creativity and humor that defined a significant aspect of television history.",
    "published": "2025-09-01T09:34:22Z"
  },
  {
    "title": "Afghanistan earthquake live: more than 800 dead after shallow quake strikes country’s east, state media reports",
    "url": "https://www.theguardian.com/world/live/2025/sep/01/afghanistan-earthquake-live-hundreds-after-shallow-quake-strikes-countrys-east-state-media-reports",
    "image": "https://media.guim.co.uk/4a505703b0a4050ac22ad1014630c49509de5ce0/0_0_2333_1867/500.jpg",
    "summary": "In Kunar province, multiple villages have been reported as \"completely destroyed,\" according to the Ministry of Public Health. Rescue operations are currently ongoing to assist affected residents. The devastation highlights the urgent need for humanitarian aid in the region.",
    "published": "2025-09-01T09:31:04Z"
  }
]