[
  {
    "title": "Australia v England: Ashes second Test, day three – live",
    "url": "https://www.theguardian.com/sport/live/2025/dec/06/australia-vs-england-live-ashes-second-2nd-test-day-three-aus-v-eng-cricket-scores-updates-gabba-brisbane",
    "image": "https://media.guim.co.uk/d9ff649ec8cf36ba074647110bb8ff271f86ef15/0_0_3841_3075/500.jpg",
    "summary": "The hosts gained a significant advantage with a 177-run lead in their first innings at the Gabba. They will now bowl under lights, aiming to capitalize on their momentum. Follow our writers for the latest updates.",
    "published": "2025-12-06T09:17:42Z"
  },
  {
    "title": "World Cup draw reaction, Q&A and fixture schedule to come – matchday live",
    "url": "https://www.theguardian.com/football/live/2025/dec/06/world-cup-draw-reaction-with-fixture-schedule-to-come-matchday-live",
    "image": "https://media.guim.co.uk/f30a1f2ca2452654077674084371a78e5ff088bb/378_0_5000_4000/500.jpg",
    "summary": "Stay updated with the latest reactions to the World Cup draw as well as pre-match news from our team of writers. They provide insights and analysis on the teams, matchups, and what to expect in the tournament. Don't miss their expert opinions leading up to the event.",
    "published": "2025-12-06T09:16:19Z"
  },
  {
    "title": "The New Yorker at 100: Netflix documentary dives inside a groundbreaking magazine",
    "url": "https://www.theguardian.com/film/2025/dec/06/the-new-yorker-at-100-netflix-documentary",
    "image": "https://media.guim.co.uk/59d0a27a20b6375ba8d0471edadf69b6f12bdcfa/703_0_2700_2160/500.jpg",
    "summary": "Film-maker Marshall Curry releases a new documentary that explores the inner workings and significance of a beloved institution. The film aims to provide both revealing insights and a celebratory perspective. It highlights the impact and cultural importance of this institution through compelling storytelling.",
    "published": "2025-12-06T09:03:47Z"
  },
  {
    "title": "John Swinney defends immigration as Scotland faces rise of Reform",
    "url": "https://www.theguardian.com/politics/2025/dec/06/john-swinney-defends-immigration-as-scotland-faces-rise-of-reform",
    "image": "https://media.guim.co.uk/a291d5143a8fbc0cb1824ddb38ee617544fbe43b/0_270_5735_4590/500.jpg",
    "summary": "The First Minister has strongly defended diversity in a recent statement as the SNP gears up for its campaign ahead of the Holyrood elections in May. Emphasizing the importance of inclusivity, the leader aimed to reassure supporters about the party's commitment to diversity. This rallying message comes as the SNP seeks to strengthen its position in the upcoming elections.",
    "published": "2025-12-06T09:00:48Z"
  },
  {
    "title": "Harbadus attacks Andvaria: cyber war game tests Nato defences against Russia",
    "url": "https://www.theguardian.com/world/2025/dec/06/harbadus-attacks-andvaria-cyber-war-game-tests-nato-defences-against-russia",
    "image": "https://media.guim.co.uk/0f4445594cdf91d8875faa05b2a51ce400d60867/582_30_4784_3827/500.jpg",
    "summary": "Troops faced significant challenges over the span of a week, including widespread power blackouts and public disorder. Communication with space was also disrupted, adding to the chaos. These incidents tested the resilience and preparedness of military forces.",
    "published": "2025-12-06T09:00:47Z"
  }
]