[
  {
    "title": "Nottinghamshire v Warwickshire, tributes paid to Dickie Bird, and more: county cricket – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/24/nottinghamshire-v-warwickshire-hampshire-v-surrey-and-more-county-cricket-live",
    "image": "https://media.guim.co.uk/f7c819d4564a071a70a2cdc4eb76f9843b27575e/282_0_4767_3814/500.jpg",
    "summary": "Nottinghamshire aims to secure the County Championship title against Surrey as the season’s final round begins. Tanya Aldred will provide updates throughout the first day of the match. Fans are eager to see if Notts can maintain their lead and clinch the championship.",
    "published": "2025-09-24T16:44:16Z"
  },
  {
    "title": "Oklahoma official says all high schools will have Turning Point chapters after Charlie Kirk killing",
    "url": "https://www.theguardian.com/us-news/2025/sep/24/turning-point-oklahoma-high-schools",
    "image": "https://media.guim.co.uk/05d4f4fea3c43aba2af5a16f1fc091b6f0b41ebe/453_0_4534_3626/500.jpg",
    "summary": "Conservative youth groups, led by Ryan Walters, are mobilizing to confront what they perceive as \"woke indoctrination\" in educational institutions. The initiative aims to promote conservative values and challenge progressive ideologies. Walters emphasizes the importance of equipping young people to engage in these cultural debates.",
    "published": "2025-09-24T16:37:17Z"
  },
  {
    "title": "FBI investigating shooting at Dallas immigration facility as ‘act of targeted violence’ – live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/24/donald-trump-jimmy-kimmel-freedom-of-speech-immigration-government-shutdown-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/2a31ae3af7399a58e942cf59ad12d39e233d5ff4/575_0_4583_3667/500.jpg",
    "summary": "Dallas police chief reports that initial evidence indicates the shooter had \"anti-ICE\" messages in their possession. A Department of Homeland Security official has confirmed that ICE detainees were among the victims of the shooting. The investigation into the incident is ongoing.",
    "published": "2025-09-24T16:34:41Z"
  },
  {
    "title": "Andy Burnham says Britain needs ‘wholesale change’ as Labour MPs prepare for conference – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/24/labour-tories-conservatives-reform-uk-politics-live-news-updates",
    "image": "https://media.guim.co.uk/351d549f47d01c9d8533975fa94569bf659d5cec/125_225_5659_4527/500.jpg",
    "summary": "Manchester's mayor has called on Keir Starmer to disclose his plans for reforms, emphasizing the need for clarity in leadership. Despite speculation, he denies any intention to replace the Prime Minister. The mayor's comments highlight ongoing discussions about the future direction of the Labour Party.",
    "published": "2025-09-24T16:32:43Z"
  },
  {
    "title": "Claudia Cardinale obituary",
    "url": "https://www.theguardian.com/film/2025/sep/24/claudia-cardinale-obituary",
    "image": "https://media.guim.co.uk/3d4e9e8a2573a13bcdd0b888d5288ea28f1f4d8d/0_0_4746_3795/500.jpg",
    "summary": "The Italian film star, celebrated for iconic roles in classics like \"The Leopard,\" \"Once Upon a Time in the West,\" \"The Pink Panther,\" and \"8½,\" has passed away. Known for his remarkable talent and charisma, he left a significant mark on cinema. His contributions to film history will be remembered by fans and filmmakers alike.",
    "published": "2025-09-24T16:20:08Z"
  }
]