[
  {
    "title": "England v Sri Lanka: Women’s Cricket World Cup – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/11/england-v-sri-lanka-womens-cricket-world-cup-live",
    "image": "https://media.guim.co.uk/107d52eeda7fe74c6c00ddcf38fb61c51eb5bb30/66_0_3122_2497/500.jpg",
    "summary": "Nat Sciver-Brunt's team is set to compete against Sri Lanka in an exciting match. Follow the live updates and commentary from our writers as the game unfolds. Stay tuned for over-by-over coverage of the action.",
    "published": "2025-10-11T10:17:01Z"
  },
  {
    "title": "Trump says ‘for the most part, there is consensus’ on next stages of Gaza ceasefire plan – live",
    "url": "https://www.theguardian.com/world/live/2025/oct/11/israel-gaza-ceasefire-hamas-hostages-netanyahu-trump-middle-east-latest-news-updates",
    "image": "https://media.guim.co.uk/427d10da50f878783a74c19da746f351f08fe8e7/834_0_4416_3535/500.jpg",
    "summary": "U.S. President stated that Hamas is currently assembling hostages while displaced Palestinians are starting to return to northern Gaza. The situation highlights ongoing tensions and humanitarian challenges in the region. Efforts to address the crisis continue amidst the complexities of the conflict.",
    "published": "2025-10-11T10:11:20Z"
  },
  {
    "title": "Democrats refuse to fold over shutdown as Republican outrage builds",
    "url": "https://www.theguardian.com/us-news/2025/oct/11/republicans-democrats-us-government-shutdown",
    "image": "https://media.guim.co.uk/a6c3459f9a92fac4bb646fc6445b3d99f18efadf/607_0_3333_2667/500.jpg",
    "summary": "The party remains firm in its stance on healthcare, showing readiness to endure potential backlash. This commitment is particularly welcomed by its progressive supporters. The determination signals a potential long-term strategy for the party's agenda.",
    "published": "2025-10-11T10:00:21Z"
  },
  {
    "title": "Man will plead guilty to threatening Pride event after Charlie Kirk’s death",
    "url": "https://www.theguardian.com/us-news/2025/oct/11/texas-man-threaten-pride-event-charlie-kirk",
    "image": "https://media.guim.co.uk/711611f14b9e3914b8dcae4b7bfcd6fc1fb816ea/606_0_6037_4833/500.jpg",
    "summary": "Joshua Wayne Cole is set to plead guilty in court for making online threats regarding a shooting at an LGBTQ+ parade in Texas. His posts raised significant concerns about public safety and the potential for violence at the event. This case highlights ongoing issues related to online hate and threats to marginalized communities.",
    "published": "2025-10-11T10:00:21Z"
  },
  {
    "title": "Is London in the grip of a crime wave? It’s not so simple",
    "url": "https://www.theguardian.com/uk-news/2025/oct/11/is-london-in-the-grip-of-a-wave-its-not-so-simple",
    "image": "https://media.guim.co.uk/46bd98640d5057dd9cad689a49c95e2d059f2f78/337_0_3365_2692/500.jpg",
    "summary": "Concerns about escalating crime rates are believed to be contributing to the exodus of wealthy individuals from urban areas. Despite public perception, statistics indicate a decline in certain high-profile crimes, such as watch theft. This disparity between perception and reality highlights the complexities of crime's impact on affluent communities.",
    "published": "2025-10-11T10:00:20Z"
  }
]