[
  {
    "title": "Aston Villa v Arsenal: Premier League – live",
    "url": "https://www.theguardian.com/football/live/2025/dec/06/aston-villa-v-arsenal-premier-league-live",
    "image": "https://media.guim.co.uk/98a26d84a3447fb73efbdc56744c391996e6d788/337_80_2366_1893/500.jpg",
    "summary": "Barry Glendenning is providing live updates as the leaders tackle a challenging match at Villa Park. The commentary will cover key moments and developments throughout the game. Fans can stay informed with minute-by-minute insights.",
    "published": "2025-12-06T12:39:09Z"
  },
  {
    "title": "Arsenal v Liverpool: Women’s Super League – live",
    "url": "https://www.theguardian.com/football/live/2025/dec/06/arsenal-v-liverpool-womens-super-league-live",
    "image": "https://media.guim.co.uk/d0c069e5365e8baf65970cfcf94bc2e441d10b34/266_0_2500_2000/500.jpg",
    "summary": "The WSL season resumes with Arsenal aiming to regain momentum in their title quest as they face the bottom club. Emillia Hawkins provides live updates on the match. Fans can follow the action to see if Arsenal can secure a crucial victory.",
    "published": "2025-12-06T12:36:24Z"
  },
  {
    "title": "Archer’s pillow shot becomes awkward symbol of England’s Ashes nightmare I Simon Burnton",
    "url": "https://www.theguardian.com/sport/2025/dec/06/jofra-archer-pillow-shot-symbol-england-ashes-nightmare-cricket",
    "image": "https://media.guim.co.uk/d0988f37ef7fd5f56e4bf246bdc4318c6723d8d4/188_28_865_692/500.jpg",
    "summary": "A bowler's preference for creature comforts highlights the challenges faced by a touring cricket team. This laid-back attitude appears to be contributing to their struggles on the tour. Ultimately, the team's relaxed approach may be costing them in terms of performance and results.",
    "published": "2025-12-06T12:33:50Z"
  },
  {
    "title": "EU says US ‘still our biggest ally’ despite release of policy paper supporting Europe’s far-right – as it happened",
    "url": "https://www.theguardian.com/world/live/2025/dec/06/eu-europe-latest-news-updates-russia-ukraine-war",
    "image": "https://media.guim.co.uk/21e6d989ee68aa50125b0e5bdefb908bfd45533d/1432_130_5688_4553/500.jpg",
    "summary": "The Trump administration's recent policy paper openly expresses support for Europe's nationalist far-right parties. This move marks a significant alignment with populist movements across the continent. The document could influence U.S. relations with European nations and their political landscapes.",
    "published": "2025-12-06T12:30:09Z"
  },
  {
    "title": "Target of racist slurs accuses Farage of emboldening ‘toxic environment’ online",
    "url": "https://www.theguardian.com/politics/2025/dec/06/target-of-racist-slurs-accuses-farage-of-emboldening-toxic-environment-online",
    "image": "https://media.guim.co.uk/d9c7944e7735c253a654d392b4d047ec34dd6d01/177_0_2698_2159/500.jpg",
    "summary": "A broadcaster has criticized a party leader for fostering a \"dangerous\" cultural shift within the organization, in response to alleged social media posts made by a Reform councillor. The broadcaster claims these posts contribute to a harmful environment. The situation highlights broader concerns regarding accountability and the influence of political figures on public discourse.",
    "published": "2025-12-06T12:27:25Z"
  }
]