[
  {
    "title": "Gaza ceasefire live: Trump says hostages ‘probably’ released Monday; IDF says Gaza City still ‘extremely dangerous’",
    "url": "https://www.theguardian.com/world/live/2025/oct/09/gaza-ceasefire-live-trump-says-hostages-probably-released-monday-idf-says-gaza-city-still-extremely-dangerous",
    "image": "https://media.guim.co.uk/42684000f384b5ad0960cdd629b40a3720859fa0/342_0_2700_2160/500.jpg",
    "summary": "President Donald Trump announced a breakthrough in the Israel-Hamas conflict, revealing that both parties have agreed to the \"first phase\" of his plan. This phase includes a pause in fighting and the release of certain hostages and prisoners. The development is seen as a significant step toward easing tensions in the region.",
    "published": "2025-10-09T05:16:44Z"
  },
  {
    "title": "Australia politics live: Ted O’Brien ejected from question time after Jim Chalmers says carbon tax claim ‘not based on reality’",
    "url": "https://www.theguardian.com/australia-news/live/2025/oct/09/australia-politics-live-opera-house-rally-palestine-gaza-parliament-senate-estimates-anthony-albanese-sussan-ley-question-time-ntwnfb",
    "image": "https://media.guim.co.uk/8ed12485c3a30089da3efe3af291a472873d0063/232_0_3000_2400/500.jpg",
    "summary": "Sure! Please provide the news article or details you'd like summarized.",
    "published": "2025-10-09T05:15:21Z"
  },
  {
    "title": "‘A fatal blow’: Italian producers fear effects of Trump’s ‘war against pasta’",
    "url": "https://www.theguardian.com/us-news/2025/oct/09/a-fatal-blow-italian-producers-fear-effects-of-trumps-war-against-pasta",
    "image": "https://media.guim.co.uk/c169d334cf02c79581b1112b9ee71624c2c0bb02/108_1_531_425/500.jpg",
    "summary": "The US president has threatened to implement steep 92% tariffs on major manufacturers, raising concerns among family-run businesses that could also be adversely affected. This proposed tariff could significantly impact the profitability and viability of smaller firms reliant on materials and products from larger manufacturers. The potential policy change has sparked widespread unrest and uncertainty in the business community.",
    "published": "2025-10-09T05:00:17Z"
  },
  {
    "title": "Worried about rising bills and getting by? Keir Starmer has the answer: try chewing a flag! | Aditya Chakrabortty",
    "url": "https://www.theguardian.com/commentisfree/2025/oct/09/rising-bills-cost-of-living-patriotism-flags-keir-starmer",
    "image": "https://media.guim.co.uk/ec8ae83f7ad8e410b562afe3fb8fd2803f56f8e6/0_0_5000_4000/500.jpg",
    "summary": "Guardian columnist Aditya Chakrabortty criticizes the Prime Minister for focusing on patriotism instead of addressing the pressing issue of rising living costs. He warns that this disconnect could ultimately jeopardize the PM's political standing. Chakrabortty emphasizes the need for the government to prioritize economic concerns over ideological messages.",
    "published": "2025-10-09T05:00:16Z"
  },
  {
    "title": "‘A safe haven’: Buckinghamshire man invites Americans to enter house raffle",
    "url": "https://www.theguardian.com/uk-news/2025/oct/09/a-safe-haven-buckinghamshire-man-invites-americans-to-enter-house-raffle",
    "image": "https://media.guim.co.uk/724865dab3a83c7fdbf518ab9fa9e8b02fa9af84/683_0_6827_5464/500.jpg",
    "summary": "A man is optimistic that liberal Americans seeking to escape the political climate of Donald Trump’s America will purchase tickets for his offerings. He aims to cater to this demographic's desire for a more progressive environment. The initiative reflects a response to the growing divide in American politics.",
    "published": "2025-10-09T05:00:16Z"
  }
]