[
  {
    "title": "Man charged after mass stabbing on train in Cambridgeshire",
    "url": "https://www.theguardian.com/uk-news/2025/nov/03/man-charged-after-mass-stabbing-on-cambridgeshire-train",
    "image": "https://media.guim.co.uk/d53ecc103f576505fab51a739f240f49dfc2c771/551_0_4163_3332/500.jpg",
    "summary": "A suspect was arrested following an incident during the Saturday evening service from Doncaster to London King’s Cross. Authorities responded to the situation, ensuring passenger safety. Further details about the incident and the suspect have not been disclosed.",
    "published": "2025-11-03T09:16:14Z"
  },
  {
    "title": "Oil price rises after Opec+ pauses oil output hikes amid glut fears – business live",
    "url": "https://www.theguardian.com/business/live/2025/nov/03/oil-price-rises-opec-pauses-oil-output-hikes-uk-manufacturing-stock-market-business-live-news",
    "image": "https://media.guim.co.uk/69d17126764db38ba3dcbc65016775bc7b0ca5b0/354_0_3058_2447/500.jpg",
    "summary": "Opec+ has decided to pause oil output increases beyond December due to concerns over a potential surplus in crude oil. This decision comes amid ongoing economic and financial developments affecting the oil market. Market analysts are closely monitoring the situation for its impact on prices and global supply.",
    "published": "2025-11-03T09:09:28Z"
  },
  {
    "title": "‘I can’t go on anymore’: Mazón resigns as Valencia leader and acknowledges mistakes during deadly 2024 floods – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/nov/03/valencia-spain-europe-ukraine-serbia-czech-republic-latest-live-news-updates",
    "image": "https://media.guim.co.uk/ec6e07800d48fbd7596e116183649217cbbe63be/912_0_5040_4032/500.jpg",
    "summary": "In October 2024, flooding resulted in the deaths of 229 people, leading to widespread public outrage. Amidst this crisis, Mazón faced intense pressure and daily calls for his resignation. The situation highlighted significant concerns over disaster preparedness and government accountability.",
    "published": "2025-11-03T09:08:13Z"
  },
  {
    "title": "3 Cold Dishes review – Burna Boy produces deftly directed revenge tales with echoes of Kill Bill",
    "url": "https://www.theguardian.com/film/2025/nov/03/3-cold-dishes-review-burna-boy",
    "image": "https://media.guim.co.uk/2159aaa6c0582cac8459c5ee3115b233cb61b2d8/870_0_2144_1716/500.jpg",
    "summary": "Asurf Oluseyi's latest thriller weaves together three interconnected narratives with a flair reminiscent of Quentin Tarantino. However, the film suffers from uneven storytelling, impacting its overall coherence. The blend of styles offers intrigue but lacks fluidity.",
    "published": "2025-11-03T09:00:28Z"
  },
  {
    "title": "Queen Esther by John Irving review – a disappointing companion to The Cider House Rules",
    "url": "https://www.theguardian.com/books/2025/nov/03/queen-esther-by-john-irving-review-a-disappointing-companion-to-the-cider-house-rules",
    "image": "https://media.guim.co.uk/7b91a4dcf11997b6a86df2f53c962b9f2355e4c4/0_69_2560_2048/500.jpg",
    "summary": "The novel features a once-great author who briefly revisits an orphanage in St. Cloud. It starts with the story of an adopted girl but meanders through various unrelated plots. Overall, the narrative lacks focus and cohesion.",
    "published": "2025-11-03T09:00:27Z"
  }
]