[
  {
    "title": "Police to give update after two killed in Manchester synagogue attack – latest",
    "url": "https://www.theguardian.com/uk-news/live/2025/oct/02/police-reports-stabbing-synagogue-greater-manchester-live",
    "image": "https://media.guim.co.uk/09f20100fbf2630c0e0352f448c48247471f5999/386_0_3289_2632/500.jpg",
    "summary": "During a violent incident coinciding with Yom Kippur, a suspect killed two individuals before being shot dead by police. The attack has raised concerns in the community. Authorities are investigating the motives behind the assault.",
    "published": "2025-10-02T14:17:19Z"
  },
  {
    "title": "Trump to meet with Project 2025 architect on cutting ‘Democrat agencies’ amid government shutdown – live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/02/government-shutdown-trump-democrats-latest-updates",
    "image": "https://media.guim.co.uk/67f0cf364ead08501750764e4c7d8c49cf1252d5/200_0_6588_5271/500.jpg",
    "summary": "Trump highlighted his meeting with Russ Vought, known for his work on Project 2025, to discuss potential cuts while the federal government remains shut down for a second day. He emphasized the importance of reducing spending amid the shutdown. Efforts to address the government closure are ongoing.",
    "published": "2025-10-02T14:16:19Z"
  },
  {
    "title": "People in the US: share your views on the US government shutdown",
    "url": "https://www.theguardian.com/us-news/2025/oct/02/us-government-shutdown-callout",
    "image": "https://media.guim.co.uk/cc39b284ec7bda1dc1c9e16265336d2dd8458bea/306_0_3055_2444/500.jpg",
    "summary": "The Democrats are currently rejecting the Republican spending bill, sparking discussions about their strategy amid the shutdown. There is interest in public opinion regarding the Democrats' stance. Additionally, the party's potential demands to resolve the shutdown are also being explored.",
    "published": "2025-10-02T14:13:09Z"
  },
  {
    "title": "Focus on US mass shooters’ political beliefs undermines fight against gun violence",
    "url": "https://www.theguardian.com/us-news/2025/oct/02/mass-shooting-suspects-political-beliefs-analysis",
    "image": "https://media.guim.co.uk/5e79af87d6c39bea95ab7c7c73985fb88d95b485/250_0_2500_2000/500.jpg",
    "summary": "Relying predominantly on politics to analyze mass violence overlooks the evolving dynamics of radicalization. This approach may miss critical factors that contribute to violent behavior. A broader understanding is necessary to address the complexities of modern radicalization.",
    "published": "2025-10-02T14:00:52Z"
  },
  {
    "title": "I Regret Almost Everything by Keith McNally audiobook review – the life of a hospitality legend",
    "url": "https://www.theguardian.com/books/2025/oct/02/i-regret-almost-everything-by-keith-mcnally-audiobook-review-the-life-of-a-hospitality-legend",
    "image": "https://media.guim.co.uk/18f30e5668aaf004629766ff384b54c65afb534f/7_91_1142_913/500.jpg",
    "summary": "Richard E. Grant narrates a memoir by a restaurateur that explores his life experiences, including significant highs, lows, and regrets. The book reveals personal stories, such as the controversial decision to bar James Corden from his establishment. It offers an intimate look at the challenges and triumphs faced in the culinary world.",
    "published": "2025-10-02T14:00:52Z"
  }
]