[
  {
    "title": "UK is ‘worst country in Europe’ for drug prices, says Mounjaro maker",
    "url": "https://www.theguardian.com/business/2025/sep/24/uk-is-worst-country-in-europe-for-drug-prices-says-mounjaro-maker-eli-lilly",
    "image": "https://media.guim.co.uk/cfb0b8b12c1f092f4892da010fafab6351616360/318_0_3633_2909/500.jpg",
    "summary": "Eli Lilly's CEO warns that Britain's stringent pricing regulations may cause the country to miss access to new medications. He emphasizes that higher payments are necessary to ensure timely availability of innovative treatments. The statement highlights concerns over the potential impact of cost control measures on healthcare advancements in the UK.",
    "published": "2025-09-24T07:27:15Z"
  },
  {
    "title": "Typhoon Ragasa live: Two million people evacuated in southern China after deaths in Taiwan and Philippines",
    "url": "https://www.theguardian.com/world/live/2025/sep/24/typhoon-ragasa-live-china-hong-kong-taiwan-philippines-latest-storm-news-updates",
    "image": "https://media.guim.co.uk/08e97b9bdc83bc743cba156fd6a74772f9b88251/295_0_2700_2160/500.jpg",
    "summary": "Schools and businesses in Hong Kong and Guangdong are closing in preparation for severe weather conditions, including strong winds and heavy rain. This follows significant destruction caused by recent storms in Taiwan and the Philippines. Authorities are taking precautions to ensure safety as the adverse weather approaches the region.",
    "published": "2025-09-24T07:27:09Z"
  },
  {
    "title": "Australia news live: Albanese posts selfie with Trump; inflation jump wipes out 2026 rate cut hopes, economists say",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/24/australia-news-live-anthony-albanese-new-york-united-nations-donald-trump-climate-crisis-palestine-israel-gaza-ntwnfb",
    "image": "https://media.guim.co.uk/ae72e010f495611151caa541dc8ab6d9d2027cca/45_0_1350_1080/500.jpg",
    "summary": "Please provide the news article or content you would like summarized.",
    "published": "2025-09-24T07:25:51Z"
  },
  {
    "title": "Eli Lilly calls UK ‘worst country in Europe’ for drug prices; gold nears record high - business live",
    "url": "https://www.theguardian.com/business/live/2025/sep/24/markets-economy-gold-eli-lilly-drug-prices-business-live-news",
    "image": "https://media.guim.co.uk/83e559ba4a139bcb8f310cb1756063f459fb6377/396_0_3963_3171/500.jpg",
    "summary": "Spot gold is trading slightly below a new record high reached on Monday. The precious metal continues to attract attention amid economic uncertainties. Investors are closely monitoring its price movements for potential trends.",
    "published": "2025-09-24T07:14:08Z"
  },
  {
    "title": "WSL still grappling with how to fit League Cup into football ecosystem",
    "url": "https://www.theguardian.com/football/2025/sep/24/wsl-still-grappling-with-how-to-fit-league-cup-into-womens-football-ecosystem",
    "image": "https://media.guim.co.uk/39349a0e6dd341f1b12dd483cadfc03b21f9671d/433_0_4299_3440/500.jpg",
    "summary": "The competition's complex format and absence of a distinct identity pose challenges, yet it provides WSL2 teams with increased opportunities for gameplay. This could enhance their development and exposure. Overall, the mixed aspects create a unique environment for the teams involved.",
    "published": "2025-09-24T07:00:19Z"
  }
]