[
  {
    "title": "Australia news live: Optus identifies seven more people unable to call triple zero; Meta to use AI to detect under-18s",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/22/australia-news-live-anthony-albanese-new-york-israel-palestine-donald-trump-optus-triple-zero-ntwnfb",
    "image": "https://media.guim.co.uk/04b112f4886c15bbe6ed126aec014d3f8513f3c1/401_0_3936_3149/500.jpg",
    "summary": "Please provide the news article or details you'd like summarized, and I'll be happy to help!",
    "published": "2025-09-22T07:30:08Z"
  },
  {
    "title": "Seven at 30: David Fincher’s devilish thriller is a chilling immersion in evil",
    "url": "https://www.theguardian.com/film/2025/sep/22/seven-movie-1995-david-fincher",
    "image": "https://media.guim.co.uk/d2379991a85073eea4c3100d8391da926476e010/328_0_2096_1677/500.jpg",
    "summary": "The serial killer film faced pressure from studio executives and test screenings to tone down its dark themes for a broader appeal. Despite this, the filmmakers maintained a grim narrative, aiming to take audiences to a more unforgiving emotional landscape. The commitment to its raw portrayal reflects a bold decision in mainstream filmmaking.",
    "published": "2025-09-22T07:14:05Z"
  },
  {
    "title": "Rachel Reeves says Gatwick second runway shows government is ‘backing builders, not blockers’ – business live",
    "url": "https://www.theguardian.com/business/live/2025/sep/22/rachel-reeves-gatwick-second-runway-growth-jobs-environmental-disaster-business-live-news",
    "image": "https://media.guim.co.uk/98d32f79f771396c5070d1197b355c9d7ee69fd2/421_0_4448_3558/500.jpg",
    "summary": "Green Party's Zack Polanski criticized the decision to proceed with the second runway at Gatwick Airport, labeling it a \"disaster.\" This marks a significant point in the ongoing debate about airport expansion and its environmental impact. The news highlights the increasing tensions between economic development and sustainability concerns.",
    "published": "2025-09-22T07:10:21Z"
  },
  {
    "title": "Premier League: 10 talking points from the weekend’s action",
    "url": "https://www.theguardian.com/football/2025/sep/22/premier-league-10-talking-points-from-the-weekends-action",
    "image": "https://media.guim.co.uk/c1797d55f350cd18eddd2d7ffa84f42f3f43904c/0_0_5000_4000/500.jpg",
    "summary": "Aston Villa continues to face challenges on the field, compounded by ongoing issues for West Ham. Meanwhile, Brighton has opted to take a cautious approach with Carlos Baleba's development. The situation highlights the varying struggles and strategies of the teams in the league.",
    "published": "2025-09-22T07:00:06Z"
  },
  {
    "title": "Twickenham stage set for England to deliver fairytale finish and lasting legacy",
    "url": "https://www.theguardian.com/sport/2025/sep/22/twickenham-stage-set-for-england-to-deliver-fairytale-finish-and-lasting-legacy",
    "image": "https://media.guim.co.uk/7b80158cb9eff177ad8c3c9d437aeddd75742dbc/385_0_3849_3079/500.jpg",
    "summary": "The Women's Rugby World Cup is nearing its thrilling conclusion, with an impressive 82,000 fans set to support England's Red Roses. However, Canada poses a significant challenge and should not be taken lightly. Excitement builds as the final match approaches.",
    "published": "2025-09-22T07:00:05Z"
  }
]