[
  {
    "title": "US Open tennis 2025: Alcaraz through, Townsend in action after Pegula eases past Li – live",
    "url": "https://www.theguardian.com/sport/live/2025/aug/31/us-open-tennis-2025-carlos-alcaraz-aryna-sabalenka-pegula-fritz-townsend-day-eight-live",
    "image": "https://media.guim.co.uk/3be8601df513c0f83c0b28d70f5f29c568e02379/1790_250_4332_3465/500.jpg",
    "summary": "The fourth round of singles matches is beginning at the US Open in Flushing Meadows. Fans can stay updated on all the latest developments and highlights from the tournament. Excitement builds as top players compete for a chance to advance further.",
    "published": "2025-08-31T20:29:42Z"
  },
  {
    "title": "Guéhi’s stunner inspires Crystal Palace to emphatic victory at Aston Villa",
    "url": "https://www.theguardian.com/football/2025/aug/31/aston-villa-crystal-palace-premier-league-match-report",
    "image": "https://media.guim.co.uk/a3da1c6af079f0c739eab25cd8ac0e02bc0e12b9/605_0_4468_3575/500.jpg",
    "summary": "Crystal Palace secured a commanding 3-0 victory over winless Aston Villa in the Premier League. Jean-Philippe Mateta and Ismaïla Sarr both scored in the match. The win highlights Palace's strong performance, while Aston Villa continues to struggle this season.",
    "published": "2025-08-31T20:22:05Z"
  },
  {
    "title": "Corrections and clarifications",
    "url": "https://www.theguardian.com/news/2025/aug/31/corrections-and-clarifications1",
    "summary": "Park Chan-wook's latest film, featuring Emily Beecham, has garnered attention for its exploration of complex themes. The movie, which intertwines personal narratives with broader societal issues, showcases the director's unique storytelling style. Critics praise Beecham's performance as a standout element in the film.",
    "published": "2025-08-31T20:00:39Z"
  },
  {
    "title": "My Tennis Maestro review – unforced errors keep Italian coming-of-age comedy from grand slam",
    "url": "https://www.theguardian.com/film/2025/aug/31/my-tennis-maestro-review-pierfrancesco-favino",
    "image": "https://media.guim.co.uk/5d89b8fe0014a7c4bc9e93e3e093138ca58aba96/457_0_3901_3119/500.jpg",
    "summary": "Pierfrancesco Favino stars as a charming but flawed coach in a film about a teenage tennis hopeful. The movie suffers from being overly long and somewhat indecisive. Ultimately, it fails to compete with more impactful recent releases.",
    "published": "2025-08-31T20:00:38Z"
  },
  {
    "title": "Educating Yorkshire review – the joyful return of this school show is just the blast of optimism we need",
    "url": "https://www.theguardian.com/tv-and-radio/2025/aug/31/channel-4-educating-yorkshire-review-the-joyful-return-of-this-school-show-is-just-the-blast-of-optimism-we-need",
    "image": "https://media.guim.co.uk/ee8959a25303501430201cc1b78d1eae542440fe/1085_0_6488_5191/500.jpg",
    "summary": "The return of the fly-on-the-wall series offers an uplifting perspective on children thriving with support, contrasting the negative narratives surrounding education in Britain. Its timely release provides a refreshing and hopeful view of the potential in young lives. This positive portrayal serves as a welcome antidote to prevailing bad news in the education sector.",
    "published": "2025-08-31T20:00:38Z"
  }
]