[
  {
    "title": "Gaza ceasefire live: Israel says body handed over by Hamas is not one of the hostages",
    "url": "https://www.theguardian.com/world/live/2025/oct/15/gaza-ceasefire-israel-hamas-palestine-aid-hostages-detainees-prisoners-live-news-updates",
    "image": "https://media.guim.co.uk/1fa1942e1069e28a7952e7ca5c08d14a65eef438/593_0_1993_1595/500.jpg",
    "summary": "Israel announced a reduction in aid flow by half and indicated that the Rafah crossing would not open as scheduled. This decision is linked to delays in the process of returning hostages' bodies. The situation underscores the ongoing complexities surrounding humanitarian efforts in the region.",
    "published": "2025-10-15T13:29:16Z"
  },
  {
    "title": "Sweden, Estonia, and Finland pledge to increase spending on weapons purchases from US – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/oct/15/russia-ukraine-nato-france-latest-europe-live-news-updates",
    "image": "https://media.guim.co.uk/07daa153d415a3842375865252675d0a46688e17/426_0_4163_3331/500.jpg",
    "summary": "NATO Secretary-General Mark Rutte announced expectations for additional financial commitments, highlighting that $2 billion has already been pledged through the existing mechanism. This indicates ongoing support and investment in NATO initiatives. The statement reinforces the alliance's focus on maintaining and increasing defense funding.",
    "published": "2025-10-15T13:28:55Z"
  },
  {
    "title": "England v Pakistan: Women’s Cricket World Cup game hit by rain – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/15/england-v-pakistan-womens-cricket-world-cup-live",
    "image": "https://media.guim.co.uk/d5b701950e1c297fea9d5c78df031135321c25f9/615_0_6847_5478/500.jpg",
    "summary": "England faces Pakistan in Colombo, aiming to preserve their perfect tournament record. The match is anticipated by fans and analysts alike. Join the live over-by-over report for updates and insights.",
    "published": "2025-10-15T13:28:51Z"
  },
  {
    "title": "Raila Odinga, towering Kenyan opposition figure, dies aged 80",
    "url": "https://www.theguardian.com/world/2025/oct/15/raila-odinga-former-kenya-pm-dies",
    "image": "https://media.guim.co.uk/f33f721974b469db5bb5d78fe0aa85acb1307ef4/453_0_4527_3621/500.jpg",
    "summary": "Veteran Kenyan politician Raila Odinga, who contested the presidency five times and significantly shaped the nation's political landscape, has passed away in India. His death marks the end of an era in Kenyan politics. Tributes are likely to follow as the country reflects on his impactful legacy.",
    "published": "2025-10-15T13:28:49Z"
  },
  {
    "title": "Starmer says he will publish witness statements for collapsed China spy trial – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/oct/15/keir-starmer-kemi-badenoch-pmqs-china-epping-rachel-reeves-imf-uk-politics-live-news-updates",
    "image": "https://media.guim.co.uk/a608a7b4df8b74e5e5689af8fcf6ce3ca013b47a/370_350_2283_1826/500.jpg",
    "summary": "The Prime Minister plans to release complete statements regarding a specific case. He attributes its failure to the actions of the previous government. This move aims to clarify the situation and hold past leadership accountable.",
    "published": "2025-10-15T13:26:36Z"
  }
]