[
  {
    "title": "UK private sector growth hits four-month low as JLR production shutdown hurts manufacturing – business live",
    "url": "https://www.theguardian.com/business/live/2025/sep/23/gold-price-on-track-best-year-since-1979-record-high-global-economy-uk-growth-business-live-news",
    "image": "https://media.guim.co.uk/bfd843445e219422226741ab9c2f957671f7ef15/560_0_5600_4480/500.jpg",
    "summary": "Jaguar Land Rover is experiencing manufacturing disruptions due to a recent cyber-attack. This incident is impacting production levels and overall operations. Meanwhile, the OECD has released its latest economic outlook, providing insights into global economic conditions.",
    "published": "2025-09-23T13:32:38Z"
  },
  {
    "title": "Trump to address UN general assembly as Israeli attacks on Gaza City continue – Middle East crisis live",
    "url": "https://www.theguardian.com/world/live/2025/sep/23/gaza-israel-palestinian-state-recognition-donald-trump-un-unga-latest-news-live-updates",
    "image": "https://media.guim.co.uk/0a53750903b79f83688de3607e10debccbe459d7/211_0_4680_3744/500.jpg",
    "summary": "The US president is set to speak at the UN General Assembly in New York following a significant diplomatic move, as the UK, France, Belgium, Canada, Australia, and Portugal have officially recognized a Palestinian state. This recognition comes amid ongoing discussions about the Israeli-Palestinian conflict and potential peace efforts. The president's address will likely address these developments and the US's stance on the matter.",
    "published": "2025-09-23T13:31:47Z"
  },
  {
    "title": "Nato ready to ‘defend every inch of allied territory’, says Rutte after Russian incursions – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/sep/23/copenhagen-oslo-airport-drones-denmark-norway-russia-nato-estonia-europe-live-latest-news-updates",
    "image": "https://media.guim.co.uk/6a74fbf25428da308a6e69160da2966a77ae22a0/955_0_4545_3636/500.jpg",
    "summary": "NATO chief addressed recent violations of Estonian airspace, highlighting heightened tensions in the region. This discussion coincides with drone incidents reported at airports in Copenhagen and Oslo. The events underscore growing concerns over airspace security in Europe.",
    "published": "2025-09-23T13:28:58Z"
  },
  {
    "title": "Energy bills: millions of Britons ‘at risk of overpaying if they fail to read meter’",
    "url": "https://www.theguardian.com/money/2025/sep/23/energy-bills-millions-overpaying-meter-readings-uswitch",
    "image": "https://media.guim.co.uk/9bfec409c8919814779cebbcf4048ba725b03212/342_179_3728_2982/500.jpg",
    "summary": "Uswitch advises customers on standard tariffs without smart meters to submit their meter readings around October 1. This ensures accurate billing and helps avoid estimated charges. Timely submissions are crucial for effective energy management during the transition to winter rates.",
    "published": "2025-09-23T13:27:16Z"
  },
  {
    "title": "Ed Davey to deliver keynote speech at Lib Dem conference – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/23/lib-dem-ed-davey-conference-donald-trump-keir-starmer-labour-reform-tory-latest-politics-live-news-updates",
    "image": "https://media.guim.co.uk/0697b2943905bdbd2f3b9cacc0c1886e74c57a5a/691_0_5935_4748/500.jpg",
    "summary": "The leader of the Liberal Democrats has emphasized the importance of combating the rise of far-right politics. This stance reflects a broader concern about the influence of extremist ideologies in modern democracies. The party aims to promote progressive values and inclusivity in response to these challenges.",
    "published": "2025-09-23T13:22:43Z"
  }
]