[
  {
    "title": "White House says new CDC director nominee to be announced ‘very soon’ – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/aug/28/cdc-susan-monarez-trump-news-updates-us-politics-live",
    "image": "https://media.guim.co.uk/ba247cae7e2663c841d3eeadee12c7373f2f9c32/462_0_4583_3667/500.jpg",
    "summary": "Karoline Leavitt supported Trump's decision to fire Susan Monarez, stating he had \"every right\" to do so. She claimed that Monarez was \"not aligned\" with Trump's Maha agenda. The remarks highlight ongoing tensions within Trump's team regarding their strategic direction.",
    "published": "2025-08-28T19:22:34Z"
  },
  {
    "title": "US Open tennis 2025: Sinner in action, Swiatek and Osaka through on day five – live",
    "url": "https://www.theguardian.com/sport/live/2025/aug/28/us-open-tennis-2025-swiatek-sinner-osaka-musetti-day-five-live",
    "image": "https://media.guim.co.uk/faf8e797ae61d150d41d911d009565e5bfe1f245/132_0_2988_2390/500.jpg",
    "summary": "Daniel Harris is providing live updates from the second round of a significant event in New York. Stay tuned for the latest developments as they unfold. Key highlights and crucial moments will be shared throughout the coverage.",
    "published": "2025-08-28T19:21:18Z"
  },
  {
    "title": "Israeli forces raid former air defence base near Syrian capital",
    "url": "https://www.theguardian.com/world/2025/aug/28/israeli-forces-former-air-defence-base-southern-syria-damascus",
    "image": "https://media.guim.co.uk/c736f26552752d678e412534c9e2f152229eafd8/822_605_4463_3573/500.jpg",
    "summary": "Recent military operations south of Damascus mark the deepest incursion into Syrian territory since the ousting of Bashar al-Assad last year. This development signifies a significant escalation in territorial control and military engagement in the region. The impact of this operation on the ongoing conflict remains to be seen.",
    "published": "2025-08-28T18:38:53Z"
  },
  {
    "title": "Champions League group-phase draw: Liverpool face Real Madrid and potential Alexander-Arnold reunion – as it happened",
    "url": "https://www.theguardian.com/football/live/2025/aug/28/champions-league-draw-2025-26-group-phase-fixtures-revealed-live",
    "image": "https://media.guim.co.uk/e7e8509750eb0084860214fe079c4eab3995da10/919_44_4798_3838/500.jpg",
    "summary": "In this season's group stage, several well-known rivals are set to face each other once more. Expectations are high as fans anticipate intense matchups. The reunions are expected to reignite past rivalries and excitement.",
    "published": "2025-08-28T17:46:16Z"
  },
  {
    "title": "Judges to rule on Epping hotel injunction on Friday – as it happened",
    "url": "https://www.theguardian.com/politics/live/2025/aug/28/latest-uk-politics-news-keir-starmer-rachel-reeves-labour-live-updates",
    "image": "https://media.guim.co.uk/ce98a439324cf0ec721f78c26607e0cdcd8d57b5/137_0_2501_2001/500.jpg",
    "summary": "The Home Office and the owner of Bell Hotel are contesting a high court injunction that was recently issued to Epping Council. The injunction is connected to local regulatory matters concerning the hotel. This legal challenge highlights ongoing tensions between government authorities and local governance.",
    "published": "2025-08-28T17:26:46Z"
  }
]