[
  {
    "title": "Australia politics live: eSafety boss says Roblox must do more to protect children from predators despite escaping under-16s ban",
    "url": "https://www.theguardian.com/australia-news/live/2025/nov/05/australia-politics-live-nauru-deportations-labor-greens-coalition-anthony-albanese-sussan-ley-nationals-leadership-net-zero-question-time-ntwnfb",
    "image": "https://media.guim.co.uk/364b963d442ecda4f691fa72170769a777be06aa/315_0_3331_2666/500.jpg",
    "summary": "It seems you haven't provided the specific news article or details you'd like summarized. Please share the content or main points you'd like me to summarize, and I'll be happy to help!",
    "published": "2025-11-04T23:18:19Z"
  },
  {
    "title": "Mamdani‑Cuomo race draws Trump into New York City politics amid high‑stakes elections across US – live",
    "url": "https://www.theguardian.com/us-news/live/2025/nov/04/us-elections-2025-live-new-york-city-new-jersey-virginia-california-latest-news-updates-live",
    "image": "https://media.guim.co.uk/e3def557ba64d46d0fce182ef785e87458600861/779_0_4728_3785/500.jpg",
    "summary": "Donald Trump has endorsed former New York Governor George Pataki, as a Democratic socialist candidate aims to make history by becoming the city's first Muslim mayor. This endorsement highlights a surprising political alignment amid a competitive mayoral race. The election has drawn significant attention due to its potential to reshape the city's leadership.",
    "published": "2025-11-04T23:17:18Z"
  },
  {
    "title": "UPS plane crashes near Louisville international airport in Kentucky",
    "url": "https://www.theguardian.com/us-news/2025/nov/04/louisville-plane-crash-airport-kentucky-latest",
    "image": "https://media.guim.co.uk/3fe2bf457c732f8b5b89df71b4bddc914c357b61/566_88_1626_1302/500.jpg",
    "summary": "Local police have reported an unspecified number of injuries following an incident that caused a plume of smoke visible south of the airport shortly before 5:30 PM. Emergency services are responding to the situation. Further details on the cause of the smoke and the nature of the injuries are pending.",
    "published": "2025-11-04T23:11:53Z"
  },
  {
    "title": "Liverpool 1-0 Real Madrid: Champions League – as it happened",
    "url": "https://www.theguardian.com/football/live/2025/nov/04/liverpool-v-real-madrid-champions-league-live",
    "image": "https://media.guim.co.uk/12920ebbcdb379acca20e59cad2c3390e4fe5ad0/219_0_4237_3390/500.jpg",
    "summary": "Alexis Mac Allister scored the winning goal for Liverpool with a header in the second half, leading the team to a deserved victory. Trent Alexander-Arnold faced criticism upon his return to the team. The match was closely monitored by reporter Scott Murray.",
    "published": "2025-11-04T22:35:53Z"
  },
  {
    "title": "MPs ask HMRC to explain child benefit error that froze payments to parents",
    "url": "https://www.theguardian.com/society/2025/nov/04/mps-ask-hmrc-explain-child-benefit-error-froze-payments-parents",
    "image": "https://media.guim.co.uk/a7e4305222a921212ae652b88afb468ef7fb80c3/0_366_3899_3119/500.jpg",
    "summary": "A significant number of 23,500 families were mistakenly flagged for fraud due to erroneous data suggesting they had left the UK. This has raised concerns and calls for accountability regarding the handling of such sensitive information. Officials are now being urged to provide explanations and rectify the situation for those affected.",
    "published": "2025-11-04T22:34:51Z"
  }
]