[
  {
    "title": "New Zealand v England: third men’s cricket one-day international – live",
    "url": "https://www.theguardian.com/sport/live/2025/nov/01/new-zealand-v-england-third-mens-cricket-one-day-international-live",
    "image": "https://media.guim.co.uk/4f55632f82891b67965250eb81952f61909724b2/346_0_4500_3600/500.jpg",
    "summary": "New Zealand faces England in the third ODI match in Wellington, with live updates provided by our writers. Fans can follow the game as it unfolds, highlighting key moments and performances. Stay tuned for detailed commentary and insights throughout the match.",
    "published": "2025-11-01T06:26:04Z"
  },
  {
    "title": "Xi Jinping’s moment and whirlwind diplomatic tours: key takeaways from the Apec summit in South Korea",
    "url": "https://www.theguardian.com/world/2025/nov/01/xi-jinpings-moment-and-whirlwind-diplomatic-tours-key-takeaways-from-the-apec-summit-in-south-korea",
    "image": "https://media.guim.co.uk/40b37888ef436254b19597973cd9c6c2f4243346/16_0_1409_1128/500.jpg",
    "summary": "In Donald Trump's absence at the APEC summit, the remaining leaders successfully discussed key global economic issues and strengthened trade partnerships. They focused on cooperation in areas like sustainability and digital economy. The summit highlighted the importance of unity among member countries despite the U.S. leader's decision to return to Washington.",
    "published": "2025-11-01T06:14:35Z"
  },
  {
    "title": "TV tonight: iconic 90s girlband members tell all about the industry ",
    "url": "https://www.theguardian.com/tv-and-radio/2025/nov/01/tv-tonight-iconic-90s-girlband-members-tell-all-about-the-industry",
    "image": "https://media.guim.co.uk/eb1d884e842bb2ef48f6691a8b5cf7fd8bb41879/357_0_3569_2857/500.jpg",
    "summary": "Mel Blatt and Kéllé Bryan open up in a new series that promises candid discussions. Additionally, viewers can expect the dramatic conclusion of \"Nine Bodies in a Mexican Morgue.\" Tune in tonight for these engaging shows.",
    "published": "2025-11-01T06:00:32Z"
  },
  {
    "title": "Tim Dowling: disaster strikes at a gig – they laugh at my jokes",
    "url": "https://www.theguardian.com/lifeandstyle/2025/nov/01/tim-dowling-disaster-strikes-at-a-gig-the-audience-laughs-at-my-jokes",
    "image": "https://media.guim.co.uk/b98461879c0babf5fce3c316241102669a30256e/625_0_3750_3000/500.jpg",
    "summary": "Crafting humorously unfunny anecdotes is a challenging task that requires skill. Writers must navigate the delicate balance between relatable experiences and poorly executed punchlines. Successfully achieving this can be an art form, highlighting the complexity of humor in storytelling.",
    "published": "2025-11-01T06:00:31Z"
  },
  {
    "title": "From Bugonia to All’s Fair: your complete entertainment guide to the week ahead",
    "url": "https://www.theguardian.com/culture/2025/nov/01/bugonia-alls-fair-pluribus-these-new-puritans-othello-cat-burns",
    "image": "https://media.guim.co.uk/23c866aa8e6cbf8affd4b7dcacf337903242cc53/0_0_5000_4000/500.jpg",
    "summary": "Yorgos Lanthimos teams up with Emma Stone for a unique kidnapping thriller titled \"Poor Things.\" In another project, Kim Kardashian and Sarah Paulson portray characters entwined with the legal system in Ryan Murphy's Los Angeles storyline. These collaborations showcase a diverse range of narratives from the creators.",
    "published": "2025-11-01T06:00:31Z"
  }
]