[
  {
    "title": "Premier League and WSL buildup, Earps book revelations, Vieira sacked – matchday live ",
    "url": "https://www.theguardian.com/football/live/2025/nov/01/premier-league-buildup-earps-book-revelations-and-more-matchday-live",
    "image": "https://media.guim.co.uk/0ab0fb1cbe95e513042e178accb98f06d26d36d9/380_0_3802_3041/500.jpg",
    "summary": "Billy Munday will host a segment featuring news updates, event previews, and discussions. The focus is on gearing up for an exciting day of activities ahead. Tune in to stay informed and engaged with the latest happenings.",
    "published": "2025-11-01T11:03:14Z"
  },
  {
    "title": "What the New York mayor’s race will reveal about the Democratic party",
    "url": "https://www.theguardian.com/us-news/2025/nov/01/new-york-mayoral-race-democratic-party",
    "image": "https://media.guim.co.uk/2ecb63034e33f371c64c77df4148b750084958b3/314_0_3129_2503/500.jpg",
    "summary": "The contrasting political views of the two leading candidates are expected to significantly influence the upcoming midterm elections. These differences may shape voter priorities and party strategies. Observers are closely watching how these dynamics will unfold in the election cycle.",
    "published": "2025-11-01T11:00:34Z"
  },
  {
    "title": "HMRC likely to have breached privacy laws in stopping child benefit – experts  ",
    "url": "https://www.theguardian.com/politics/2025/nov/01/hmrc-likely-to-have-breached-privacy-laws-in-stopping-child-benefit-experts",
    "image": "https://media.guim.co.uk/f31b3d47c0a016dff03b2e39796bc2f12d960378/0_0_2750_2201/500.jpg",
    "summary": "A watchdog has alerted the tax authority after families' payments were halted due to incorrect travel data. The flawed information led to unjust suspensions of financial assistance for affected families. The situation raises concerns about the accuracy of the data used to determine eligibility for payments.",
    "published": "2025-11-01T11:00:34Z"
  },
  {
    "title": "‘The rainbow of colours reminded me of my childhood’: Guillaume Lavrut’s best phone picture",
    "url": "https://www.theguardian.com/lifeandstyle/2025/nov/01/guillaume-lavrut-best-phone-picture",
    "image": "https://media.guim.co.uk/69271293236f10c1f99dd025a2728b500308a82d/0_516_2154_1723/500.jpg",
    "summary": "While on holiday in his hometown of Aurillac, a photographer discovered a picturesque puddle that beautifully reflected umbrellas. This captivating scene inspired him to capture the moment through his lens. The enchanting image highlights the artistic possibilities found in everyday environments.",
    "published": "2025-11-01T11:00:33Z"
  },
  {
    "title": "US food banks are rushing to stock supplies amid Snap lapse: ‘garner all the resources that we can’",
    "url": "https://www.theguardian.com/us-news/2025/nov/01/food-banks-stock-resources-snap-lapse",
    "image": "https://media.guim.co.uk/e0d54c09522795be770fbf40f466473177fe2622/500_0_5000_4000/500.jpg",
    "summary": "Food insecurity for millions of Americans is expected to rise as officials from the Trump administration announce that SNAP benefits will be halted. This situation arises as the government shutdown enters its second month. The cessation of these benefits could have severe repercussions for families relying on assistance for their nutritional needs.",
    "published": "2025-11-01T11:00:33Z"
  }
]