[
  {
    "title": "Nottingham Forest latest and buildup to Liverpool v Manchester United – matchday live",
    "url": "https://www.theguardian.com/football/live/2025/oct/19/nottingham-forest-latest-and-buildup-to-liverpool-v-manchester-united-matchday-live",
    "image": "https://media.guim.co.uk/6b2afb41f98d3556e8ef27c0b4b9b7ffde4d3e9f/0_0_5000_4000/500.jpg",
    "summary": "Engage with our writers for insights and commentary as we prepare for the day's major sporting events. Get a sneak peek into discussions surrounding the key games. Stay informed and entertained leading up to the action.",
    "published": "2025-10-19T09:17:24Z"
  },
  {
    "title": "Australia v India: men’s first one-day international – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/19/australia-v-india-mens-cricket-one-day-international-live",
    "image": "https://media.guim.co.uk/b6d35207ad56ad1261bbae162eb67b954c6da08b/614_0_3071_2457/500.jpg",
    "summary": "The summer of cricket kicks off with the first ODI taking place at Optus Stadium in Perth. Rob Smyth will provide live updates throughout the match. Fans can expect thrilling action as teams compete in this season opener.",
    "published": "2025-10-19T09:17:07Z"
  },
  {
    "title": "Reports of Israeli attack on Gaza amid rising tensions over ceasefire – Middle East crisis live",
    "url": "https://www.theguardian.com/world/live/2025/oct/19/gaza-ceasefire-israel-hamas-rafah-hostages-middle-east-crisis-live-news-updates",
    "image": "https://media.guim.co.uk/85ee715af78630c14671ec9b5be6bb18734c8fef/123_0_4800_3840/500.jpg",
    "summary": "Israeli media report ongoing accusations between Hamas and Israel regarding violations of a US-brokered ceasefire. Both sides are blaming each other for the breaches. Tensions remain high as the ceasefire continues to be challenged.",
    "published": "2025-10-19T09:15:57Z"
  },
  {
    "title": "India v England: Women’s Cricket World Cup – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/19/india-v-england-womens-cricket-world-cup-live",
    "image": "https://media.guim.co.uk/afb8dc5dd4a1cdb1fb0e0eb91eaf062c39e623f1/371_44_6711_5368/500.jpg",
    "summary": "England faces off against the co-hosts at Holkar Stadium, with both teams vying for a spot in the semi-finals. The match promises excitement as they compete for advancement in the tournament. Join our writers for live updates and analysis.",
    "published": "2025-10-19T09:09:03Z"
  },
  {
    "title": "‘Disorder, fright and confusion’: looking back at the devastating Wall Street crash of 1929",
    "url": "https://www.theguardian.com/books/2025/oct/19/wall-street-crash-1929-andrew-ross-sorkin",
    "image": "https://media.guim.co.uk/3d0577f71b7e90bf1e5976279f7166975230fc0f/153_0_2864_2292/500.jpg",
    "summary": "Andrew Ross Sorkin's new book, \"1929,\" examines the stock market crash that profoundly impacted the United States. The book explores the lessons learned from this historical event and its relevance to contemporary financial challenges. Sorkin invites readers to reflect on the consequences of economic turmoil and the importance of historical awareness.",
    "published": "2025-10-19T09:01:09Z"
  }
]