[
  {
    "title": "US Open tennis 2025: Jannik Sinner defeats Félix Auger-Aliassime in men’s semi-final – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/05/us-open-tennis-2025-jannik-sinner-v-felix-auger-aliassime-mens-semi-final-live",
    "image": "https://media.guim.co.uk/4076922232c6c827759e9f232ec8b29892e21012/334_0_2373_1899/500.jpg",
    "summary": "Bryan Armen Graham will provide live updates from the men's semi-finals at Flushing Meadows. Fans can expect detailed game-by-game reports. Stay tuned for the latest developments in the match.",
    "published": "2025-09-06T02:57:13Z"
  },
  {
    "title": "Police announce $1m reward for information on Dezi Freeman and warn public not to go looking for ‘high-risk’ Porepunkah fugitive",
    "url": "https://www.theguardian.com/australia-news/2025/sep/06/dezi-freeman-porepunkah-search-victoria-police-announce-reward-for-information-ntwnfb",
    "image": "https://media.guim.co.uk/785f5cab3cf0138a63277936552950ed5405c075/178_0_1957_1566/500.jpg",
    "summary": "Victoria has announced its largest reward ever for information leading to the arrest of the alleged killer of two police officers as the manhunt continues into its 12th day. Authorities are intensifying efforts in the alpine region where the suspect is believed to be hiding. The reward reflects the urgency and seriousness of the situation as the community seeks justice for the fallen officers.",
    "published": "2025-09-06T02:55:58Z"
  },
  {
    "title": "Western United to sit out 2025-26 A-League season with club put into ‘hibernation’",
    "url": "https://www.theguardian.com/football/2025/sep/06/western-united-to-sit-out-2025-26-a-league-season",
    "image": "https://media.guim.co.uk/0d32d7afb360bbced3f8b1ffa0ae979fa5d2aa62/125_0_3948_3158/500.jpg",
    "summary": "Western United has been temporarily banned from the A-League and will miss the 2025-26 season due to ongoing issues. The club's participation in the league is currently suspended until further notice. This decision reflects the challenges facing the team amid its troubled circumstances.",
    "published": "2025-09-06T02:41:19Z"
  },
  {
    "title": "Trump, misled by video of 2020 protests shown on Fox, threatens to send troops to Portland – as it happened",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/05/donald-trump-pentagon-department-of-war-immigration-tariffs-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/cfca5917286444f66c62b2c529ab8bd6f2957631/375_0_3750_3000/500.jpg",
    "summary": "The President emphasized the importance of caution in lifting COVID-19 vaccine mandates, highlighting the effectiveness of the vaccines. He underscored the need for a careful approach to ensure public safety. The statement reflects ongoing discussions about vaccine requirements in the U.S.",
    "published": "2025-09-06T02:04:45Z"
  },
  {
    "title": "Trump, apparently misled by video of 2020 protests, threatens to send troops to Portland",
    "url": "https://www.theguardian.com/us-news/2025/sep/05/trump-portland-video-protests",
    "image": "https://media.guim.co.uk/a821d39a19afae5bc94e16960d68c7617c5355cc/458_0_3750_3000/500.jpg",
    "summary": "U.S. President mistakenly underestimates the size of anti-ICE rallies after a television report utilized outdated footage from George Floyd protests. The misleading visuals contributed to confusion regarding the scale of current demonstrations. This incident highlights the importance of accurate media reporting in reflecting ongoing social movements.",
    "published": "2025-09-06T01:49:00Z"
  }
]