[
  {
    "title": "Australia news live: Sussan Ley says cost of net zero ‘looks too high’ as she sidesteps question on climate ructions",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/17/australia-news-live-liberal-sussan-ley-net-zero-target-climate-crisis-anthony-albanese-donald-trump-trade-tariffs-politics-ntwnfb",
    "image": "https://media.guim.co.uk/0d6add0940e9fe3d440eaecb674d44040122831a/0_0_5975_4783/500.jpg",
    "summary": "Please provide the news article or details you'd like summarized, and I'll be happy to assist!",
    "published": "2025-09-17T05:27:48Z"
  },
  {
    "title": "TV tonight: Molly Parker is an amnesiac doctor in this new medical drama",
    "url": "https://www.theguardian.com/tv-and-radio/2025/sep/17/tv-tonight-molly-parker-is-an-amnesiac-doctor-in-this-new-medical-drama",
    "image": "https://media.guim.co.uk/258d2cbc3118cd4322baa09d5b4e33a7d200c875/639_0_6369_5097/500.jpg",
    "summary": "Amy Larsen experiences amnesia, forgetting the last eight years of her life due to a car accident, as depicted in the latest episode of \"Doc.\" The episode also raises significant questions surrounding the Madeleine McCann case. Tune in this evening for more insights.",
    "published": "2025-09-17T05:20:26Z"
  },
  {
    "title": "Bold and ‘brat’: Marks & Spencer bets on womenswear to revive autumn fortunes ",
    "url": "https://www.theguardian.com/business/2025/sep/17/marks-spencer-womenswear-revive-autumn-fortunes",
    "image": "https://media.guim.co.uk/b900a38dedb70076886da7e75ec8bc177669dcaa/0_0_2100_1680/500.jpg",
    "summary": "A retailer is working to recover from a summer cyber-attack by offering a new selection of fashion items targeted at a broader age demographic. The strategy aims to attract diverse customers and boost sales. This initiative reflects the company's commitment to rebuilding its brand and customer trust following the security breach.",
    "published": "2025-09-17T05:00:29Z"
  },
  {
    "title": "If Labour admitted there is a genocide in Gaza, it would have to admit its own hand in it | Owen Jones",
    "url": "https://www.theguardian.com/commentisfree/2025/sep/17/labour-genocide-gaza-british-palestinians-fighter-jets",
    "image": "https://media.guim.co.uk/c506c2e81fc2e3dec6d5d92243bdc89eb4b3d311/260_0_5030_4024/500.jpg",
    "summary": "Owen Jones, a Guardian columnist, criticizes the Labour Party for distancing itself from British Palestinians and for its role in supplying parts for fighter jets. He argues that these actions place Labour at odds with international sentiment. The party appears increasingly disconnected from pressing global issues, according to Jones.",
    "published": "2025-09-17T05:00:28Z"
  },
  {
    "title": "Labour must rethink growth strategy to curb rise of far right, says top economist",
    "url": "https://www.theguardian.com/politics/2025/sep/17/labour-growth-far-right-economy-andy-haldane",
    "image": "https://media.guim.co.uk/a409cee36e09c16876428771cf4ea00985f6e1c1/0_0_2335_1867/500.jpg",
    "summary": "Former Bank of England chief economist Andy Haldane emphasizes the urgent need for investment in neglected communities to combat rising populist sentiments. He argues that addressing economic disparities is crucial for fostering social cohesion. Haldane's comments highlight the growing concerns over the impact of neglect on community well-being.",
    "published": "2025-09-17T05:00:26Z"
  }
]