[
  {
    "title": "Australia news live: time to ‘calm things down’, Burke says after Thorpe’s Palestine rally comments; scam warning as Qantas data hits dark web",
    "url": "https://www.theguardian.com/australia-news/live/2025/oct/13/australia-news-live-qantas-hack-data-leak-scam-warning-nsw-sydney-potholes-social-media-ban-anika-wells-albanese-sussan-ley-labor-liberal-coalition-ntwnfb",
    "image": "https://media.guim.co.uk/39f8843188c9b9c5d36605e65609209817ba4109/1035_0_7857_6286/500.jpg",
    "summary": "I'm sorry, but I can't summarize the news without the specific details or text you'd like me to summarize. Please provide the content or main points you'd like summarized!",
    "published": "2025-10-12T22:16:13Z"
  },
  {
    "title": "Gaza ceasefire live: Trump says ‘war is over’ as he heads to Middle East for release of hostages",
    "url": "https://www.theguardian.com/world/live/2025/oct/12/gaza-ceasefire-live-aid-relief-hamas-release-israel-hostages",
    "image": "https://media.guim.co.uk/b826099457fa74a398182d2a2a34105b1b0e6877/500_0_5000_4000/500.jpg",
    "summary": "The Israeli prime minister acknowledges significant security challenges facing the nation. He expresses optimism that hostages will be released the following day. The situation remains tense as the government navigates these challenges.",
    "published": "2025-10-12T22:04:44Z"
  },
  {
    "title": "Jonathan Powell had no role in dropping of China spy case, senior minister says",
    "url": "https://www.theguardian.com/politics/2025/oct/12/jonathan-powell-no-role-dropping-china-spy-case-senior-minister-says",
    "image": "https://media.guim.co.uk/7c7106d5666d095a082dc707126b184e062f8535/366_57_3596_2876/500.jpg",
    "summary": "Bridget Phillipson stated that the national security adviser did not participate in discussions prior to the Crown Prosecution Service's decision to drop its prosecution. This clarification comes amidst scrutiny of the prosecution's handling of the case. Phillipson's comments aim to address concerns over transparency and accountability.",
    "published": "2025-10-12T22:02:41Z"
  },
  {
    "title": "Colts QB Richardson taken to hospital with orbital fracture after elastic band mishap",
    "url": "https://www.theguardian.com/sport/2025/oct/12/colts-qb-richardson-taken-to-hospital-with-orbital-fracture-after-elastic-band-mishap",
    "image": "https://media.guim.co.uk/8f3379717b46ae3dd1ad91a2be5b248b52ddcfb5/116_106_1464_1170/500.jpg",
    "summary": "The Colts played without backup quarterback Anthony Richardson due to an orbital fracture he sustained before Sunday’s game. His absence added pressure on the team's starting quarterback. Despite the setback, the Colts secured a win.",
    "published": "2025-10-12T21:30:06Z"
  },
  {
    "title": "Green party reaches 100,000 members for first time after Polanski becomes leader",
    "url": "https://www.theguardian.com/politics/2025/oct/12/green-party-reaches-100000-members-for-first-time-after-polanski-becomes-leader",
    "image": "https://media.guim.co.uk/c9fafa82f2f9374068a49d257ec4abcde273be0c/575_0_5748_4598/500.jpg",
    "summary": "Since Zack Polanski became leader of the Green Party in England and Wales last month, the party has experienced a nearly 50% increase in membership. This surge indicates a growing interest and support for the party's platform. Polanski's leadership appears to be resonating with voters in the region.",
    "published": "2025-10-12T21:30:02Z"
  }
]