[
  {
    "title": "Australia news live: Waters says climate risk report scenarios ‘will come to pass’ as a result of Labor’s ‘weak’ emissions target",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/18/australia-news-live-santos-takeover-2035-emissions-target-chris-bowen-anthony-albanese-sussan-ley-environment-climate-crisis-ntwnfb",
    "image": "https://media.guim.co.uk/8f3141603c3e19c25d8805463261e555658d61cf/839_0_5666_4535/500.jpg",
    "summary": "Please provide the news content you'd like me to summarize.",
    "published": "2025-09-18T06:47:24Z"
  },
  {
    "title": "Bank of England expected to leave UK interest rates on hold and slow bond-selling QT programme – business live",
    "url": "https://www.theguardian.com/business/live/2025/sep/18/bank-of-england-uk-interest-rates-bond-selling-qt-programme-andrew-bailey-business-live",
    "image": "https://media.guim.co.uk/1569d81fc094ab2948d99c38fcb53b3898d72b72/610_0_4591_3674/500.jpg",
    "summary": "Stay updated with the latest developments in the economy and financial markets, as key events and trends unfold. Expert analysis and insights will provide context on market movements and economic indicators. Follow along for real-time updates and in-depth coverage of significant financial news.",
    "published": "2025-09-18T06:40:36Z"
  },
  {
    "title": "Trump celebrates Jimmy Kimmel suspension as some networks replace show with Charlie Kirk tribute – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/18/jimmy-kimmel-charlie-kirk-comments-show-cancelled-suspended-monologue-trump-us-politics-live",
    "image": "https://media.guim.co.uk/306674dfc9eced5d884c681dfe68c36b08dcafbe/518_0_3084_2469/500.jpg",
    "summary": "The indefinite removal of \"Jimmy Kimmel Live!\" has sparked outrage as it coincides with the Trump administration's crackdown on commentary. The controversy follows the killing of Charlie Kirk, heightening tensions around free speech. Critics argue this reflects an ongoing attack on comedic and political discourse.",
    "published": "2025-09-18T06:38:14Z"
  },
  {
    "title": "Labor’s 2035 emissions target; ABC barred from Trump’s UK press conference; and a blackbird’s message",
    "url": "https://www.theguardian.com/australia-news/2025/sep/18/afternoon-update-thursday-ntwnfb",
    "image": "https://media.guim.co.uk/04641e7802ad1d391388f2ad8f4e07be7fdc13c5/413_0_6318_5054/500.jpg",
    "summary": "The target emissions reduction of 62-70% from 2005 levels is less ambitious compared to the UK's goals. However, it exceeds the targets set by New Zealand, Japan, and Canada. This indicates a moderate stance on emissions compared to leading countries.",
    "published": "2025-09-18T06:30:34Z"
  },
  {
    "title": "Clown Town by Mick Herron review – more fun and games with the Slow Horses",
    "url": "https://www.theguardian.com/books/2025/sep/18/clown-town-by-mick-herron-review-slough-house-slow-horses-ride-on-in-triumph",
    "image": "https://media.guim.co.uk/8c06a991f91a0497bf99e5e80d5fc9bd692197dc/1224_105_6558_5245/500.jpg",
    "summary": "The ninth installment of the Slough House series delves into IRA infiltration, blending sharp humor, unexpected plot twists, and elements of real-world intrigue. This novel continues to showcase the series' trademark style. Readers can expect a compelling narrative filled with excitement and depth.",
    "published": "2025-09-18T06:00:37Z"
  }
]