[
  {
    "title": "WTA Finals tennis: Sabalenka v Pegula; Gauff beats ailing Paolini in straight sets – live",
    "url": "https://www.theguardian.com/sport/live/2025/nov/04/wta-finals-tennis-coco-gauff-v-jasmine-paolini-aryna-sabalenka-v-jessica-pegula-live",
    "image": "https://media.guim.co.uk/622fa5d6d3c32777a817493316b0e3b04beda9a4/1319_486_2746_2198/500.jpg",
    "summary": "Yara El-Shaboury will be covering the latest group-stage matches of the season-ending tournament. Fans can expect insightful commentary and analysis. Stay tuned for updates on the competition's progress.",
    "published": "2025-11-04T16:24:42Z"
  },
  {
    "title": "Friedrich Merz says Syrians no longer have reason for asylum in Germany",
    "url": "https://www.theguardian.com/world/2025/nov/04/friedrich-merz-syrians-no-reason-asylum-germany",
    "image": "https://media.guim.co.uk/c033e4acd8158ea6980985494a306804d2df63ed/1273_22_3744_2998/500.jpg",
    "summary": "The Chancellor has indicated that deportations may commence \"in the near future\" as part of the government's efforts to address the increasing influence of the Alternative for Germany (AfD) party. This move aims to tackle concerns surrounding immigration and national security. The government is under pressure to respond to the growing support for the far-right party's policies.",
    "published": "2025-11-04T16:13:42Z"
  },
  {
    "title": "Wolves, Saints and the baffling choices made in the search for stability",
    "url": "https://www.theguardian.com/football/2025/nov/04/wolves-southampton-football-daily-newsletter",
    "image": "https://media.guim.co.uk/b6ee400e329989098f1ea84501a0054427f18107/0_0_5000_4000/500.jpg",
    "summary": "In today's Football Daily, the focus is on the unusual simultaneous sacking of managers at Wolves and Southampton. Both clubs are facing challenges this season, leading to a shake-up in their coaching staff. The situation highlights the pressures and unpredictability of football management.",
    "published": "2025-11-04T16:13:05Z"
  },
  {
    "title": "US elections 2025 live: Donald Trump weighs in as Americans go to the polls in New York City, New Jersey, Virginia and California",
    "url": "https://www.theguardian.com/us-news/live/2025/nov/04/us-elections-2025-live-new-york-city-new-jersey-virginia-california-latest-news-updates-live",
    "image": "https://media.guim.co.uk/88a9be04ff4e347897e06aabd63cfa5e1dbf3434/293_0_2500_2000/500.jpg",
    "summary": "US President Joe Biden criticized Jewish voters supporting Democratic New York mayoral candidate Zohran Mamdani, calling them \"stupid.\" This comment sparked backlash and raised concerns about political discourse. Mamdani's campaign is seen as controversial within the Jewish community due to his positions and statements.",
    "published": "2025-11-04T16:12:09Z"
  },
  {
    "title": "Zelenskyy calls for Ukraine to join EU before 2030 after commission delivers warning on corruption - Europe live",
    "url": "https://www.theguardian.com/world/live/2025/nov/04/european-union-eu-latest-news-updates-live",
    "image": "https://media.guim.co.uk/dc048cce5c7bafaba8ff588429afecb6bf3b9711/341_0_3240_2592/500.jpg",
    "summary": "The EU emphasizes the necessity for fundamental reforms, particularly concerning the rule of law, for a candidate country to potentially conclude accession negotiations by the end of 2028. These reforms are seen as crucial for meeting EU standards. Progress hinges on addressing these key areas.",
    "published": "2025-11-04T16:03:06Z"
  }
]