[
  {
    "title": "Putin says western troops in Ukraine would be ‘legitimate targets’ as European countries pledge security support – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/sep/05/volodymyr-zelenskyy-ukraine-robert-fico-slovakia-vladimir-putin-russia-energy-europe-live-news-updates",
    "image": "https://media.guim.co.uk/10279a80b8c79471003152985f4eab373b3512da/759_0_3496_2797/500.jpg",
    "summary": "French President Emmanuel Macron announced that 26 countries have pledged security guarantees for Ukraine. This statement comes as Ukrainian President Volodymyr Zelenskyy meets with Slovakia's Prime Minister Robert Fico. The meeting occurs amid rising tensions regarding Russian energy supplies.",
    "published": "2025-09-05T13:16:33Z"
  },
  {
    "title": "US labor market ‘has headed off a cliff-edge’ with just 22,000 jobs added in August – business live",
    "url": "https://www.theguardian.com/business/live/2025/sep/05/ons-crisis-retail-sales-error-uk-house-prices-record-high-us-jobs-report-business-live-news-updates",
    "image": "https://media.guim.co.uk/0070e71e0122b1d8877cd732b7eea519a348c0aa/715_0_4183_3347/500.jpg",
    "summary": "The recent US jobs report reveals a significant slowdown in hiring during the summer months. Employers added fewer jobs than expected, indicating potential economic challenges ahead. Analysts are concerned about the implications for consumer spending and overall economic growth.",
    "published": "2025-09-05T13:15:58Z"
  },
  {
    "title": "Rayner says she ‘deeply regrets not seeking specialist tax advice’ as she steps down – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/05/angela-rayner-stamp-duty-labour-starmer-reform-nigel-farage-uk-politics-live-news-updates",
    "image": "https://media.guim.co.uk/548c85e07b6173161b515e9503fe83ca2eac0715/581_0_5122_4098/500.jpg",
    "summary": "Labour leader Keir Starmer reassured his deputy, emphasizing their integral role within the party. He expressed confidence in their contributions and partnership. The statement aims to bolster unity and support amidst ongoing political challenges.",
    "published": "2025-09-05T13:13:24Z"
  },
  {
    "title": "Stones ruled out for England, Tottenham latest, Russo’s new deal as WSL kicks off: football news – live",
    "url": "https://www.theguardian.com/football/live/2025/sep/05/tottenham-latest-russo-new-arsenal-deal-internationals-world-cup-qualifiers-wsl-football-news-live",
    "image": "https://media.guim.co.uk/318aaf5f37035cd311b50cc9cffeb5e59a73fe17/0_232_1850_1480/500.jpg",
    "summary": "Denmark and Scotland are set to face off in an upcoming football match as part of the World Cup qualifiers. Fans are eagerly anticipating the match and other qualifiers scheduled for the weekend. Keep an eye on updates as teams compete for a spot in the tournament.",
    "published": "2025-09-05T13:13:23Z"
  },
  {
    "title": "Thomas Tuchel says John Stones must stay fit to keep alive World Cup hopes",
    "url": "https://www.theguardian.com/football/2025/sep/05/thomas-tuchel-john-stones-stay-fit-world-cup",
    "image": "https://media.guim.co.uk/f0c19460758346d9337ff9779ad78e4012426e08/50_182_2412_1929/500.jpg",
    "summary": "Thomas Tuchel has cast uncertainty over John Stones's World Cup prospects following a new injury. The defender has withdrawn from England's qualifiers against Andorra and Serbia due to the setback. This raises concerns about his fitness for the upcoming tournament.",
    "published": "2025-09-05T13:08:00Z"
  }
]