[
  {
    "title": "WTA Finals tennis: Aryna Sabalenka v Amanda Anisimova in semi-finals; Rybakina denies Pegula – live",
    "url": "https://www.theguardian.com/sport/live/2025/nov/07/wta-finals-tennis-rybakina-pegula-sabalenka-anisimova-live",
    "image": "https://media.guim.co.uk/9ac8a6695d441227a342d8e00ecd54bde7efae67/287_190_3624_2898/500.jpg",
    "summary": "Niall McVeigh will host a match featuring two top players vying for a spot in the final against Elena Rybakina. The event will take place in Riyadh. This showdown promises to be a thrilling competition.",
    "published": "2025-11-07T19:16:03Z"
  },
  {
    "title": "US consumer sentiment drops to near record low as shutdown persists",
    "url": "https://www.theguardian.com/business/2025/nov/07/us-consumer-sentiment-shutdown",
    "image": "https://media.guim.co.uk/2f193fbb434ace8e466f46fbff0f15c95f50aacc/658_0_6565_5253/500.jpg",
    "summary": "A recent survey reveals that Americans across various age groups, income levels, and political affiliations share significant economic concerns. These anxieties highlight a widespread sentiment regarding financial stability and uncertainty in the current economy. The findings indicate a common ground in economic feelings despite diverse backgrounds.",
    "published": "2025-11-07T19:12:17Z"
  },
  {
    "title": "Trump says ‘looking at’ exemption for Hungary from Russian oil and gas sanctions – live",
    "url": "https://www.theguardian.com/us-news/live/2025/nov/07/donald-trump-government-shutdown-air-traffic-flights-snap-viktor-orban-hungary-ukraine-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/539cf32af0bc5a4a030290e50afc0b87f01ccf3a/529_0_4656_3725/500.jpg",
    "summary": "US President Joe Biden praised Hungarian Prime Minister Viktor Orbán as a \"great leader\" during their meeting at the White House. The leaders discussed various bilateral issues, highlighting the importance of their ongoing relationship. The commendation has drawn attention given Orbán's controversial policies in Hungary.",
    "published": "2025-11-07T19:11:27Z"
  },
  {
    "title": "‘I have to be alert’: Raya’s unbeaten run goes on and on for miserly Arsenal",
    "url": "https://www.theguardian.com/football/2025/nov/07/i-have-to-be-alert-rayas-unbeaten-run-goes-on-and-on-for-miserly-arsenal",
    "image": "https://media.guim.co.uk/87bad4c72e3629804a7147fa117579ab248e11f1/382_0_3821_3057/500.jpg",
    "summary": "The goalkeeper remains humble after his team matched a long-standing record of clean sheets that has been in place for 122 years. He emphasizes the importance of teamwork and continuous improvement. The achievement is celebrated, but he maintains a focus on future challenges.",
    "published": "2025-11-07T19:08:24Z"
  },
  {
    "title": "Tuchel wants Bellingham’s fire so long as England’s ace leaves his ego at door | Jacob Steinberg",
    "url": "https://www.theguardian.com/football/2025/nov/07/tuchel-wants-bellinghams-fire-so-long-as-englands-ace-leaves-his-ego-at-door",
    "image": "https://media.guim.co.uk/c5f30b3e4890678971b4e72ee450991a72a70fa0/0_0_4737_3790/500.jpg",
    "summary": "The Real Madrid midfielder is in an offensive-focused team, but the manager will closely monitor his performance. This suggests a balance between offensive strategy and individual accountability. Expectations remain high for his contributions to the team's attacking play.",
    "published": "2025-11-07T19:00:41Z"
  }
]