[
  {
    "title": "US Open tennis 2025: Raducanu beats Tjen, Norrie and Djokovic in action on day four – live",
    "url": "https://www.theguardian.com/sport/live/2025/aug/27/us-open-tennis-2025-raducanu-djokovic-and-pegula-in-action-on-day-four-live",
    "image": "https://media.guim.co.uk/a60a93695e30966712cc8a7392df3f4d177d1b65/3_0_2982_2386/500.jpg",
    "summary": "Daniel Harris is providing live updates on a hectic day of events at Flushing Meadows. The report covers various activities and highlights throughout the day. Stay tuned for the latest developments.",
    "published": "2025-08-27T16:46:43Z"
  },
  {
    "title": "Senior Trump official says president hasn’t decided when to nominate replacement for Lisa Cook – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/aug/27/donald-trump-tariffs-india-us-politics-latest-updates-news",
    "image": "https://media.guim.co.uk/4523728d4e38daded4077fba70fe66741480535f/1469_30_2014_1611/500.jpg",
    "summary": "Kevin Hassett responded to reports that Donald Trump had someone he favored for a specific role, indicating his views on the matter. His comments come amid ongoing speculation about potential appointments in Trump's orbit. The context of his remarks suggests a possible alignment or insight into Trump's decision-making process.",
    "published": "2025-08-27T16:45:34Z"
  },
  {
    "title": "‘Inconsequential’ texts, leaked letters and expensive clothes: five takeaways from the Higgins v Reynolds defamation ruling",
    "url": "https://www.theguardian.com/law/2025/aug/27/inconsequential-texts-leaked-letters-and-expensive-clothes-five-takeaways-from-the-higgins-v-reynolds-defamation-ruling-ntwnfb",
    "image": "https://media.guim.co.uk/4508e8816867b64a78b7011f231ac713a9921bb3/302_0_1875_1500/500.jpg",
    "summary": "A Washington Supreme Court judge has issued a 360-page ruling determining that Higgins defamed her former boss, Reynolds, through social media posts. The ruling highlights the legal implications of statements made online and their potential to harm reputations. This case underscores the importance of responsible communication in digital platforms.",
    "published": "2025-08-27T16:38:14Z"
  },
  {
    "title": "Minneapolis Catholic school shooting: two children killed and 17 injured",
    "url": "https://www.theguardian.com/us-news/2025/aug/27/minneapolis-active-shooter-school",
    "image": "https://media.guim.co.uk/df7d63d4628bac33d299e716263e8e81e3829315/122_0_3781_3024/500.jpg",
    "summary": "A shooting in south Minneapolis resulted in multiple injuries, including 14 children. Police confirmed that the suspected shooter is also dead. The incident has raised concerns and prompted investigations into the circumstances surrounding the event.",
    "published": "2025-08-27T16:27:49Z"
  },
  {
    "title": "Return of UN nuclear inspectors to Iran met with protests by MPs",
    "url": "https://www.theguardian.com/world/2025/aug/27/return-of-un-nuclear-inspectors-to-iran-met-with-protests-by-mps",
    "image": "https://media.guim.co.uk/faa9ddc1b69f0a31b388c112b08e0a4f7f0e0769/76_0_2945_2356/500.jpg",
    "summary": "Iranian officials claim that the readmission of certain individuals violates a law enacted following the attacks by Israel and the US in June. This law was established to safeguard national security and respond to perceived threats. The situation highlights ongoing tensions in the region and the implications of foreign interventions in Iran's politics.",
    "published": "2025-08-27T16:21:33Z"
  }
]