[
  {
    "title": "World Athletics Championships 2025: 100m finals, men’s 10,000m and more – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/14/world-athletics-championships-2025-100m-finals-mens-10000m-and-more-live",
    "image": "https://media.guim.co.uk/a1a0e746103a19e554a4d017d910cf21fc90017d/393_0_5284_4227/500.jpg",
    "summary": "Daniel Harris is reporting live from Tokyo, covering an exciting evening of sports as athletes compete for medals. The atmosphere is electric with anticipation for the upcoming events. Stay tuned for updates on the results and key highlights.",
    "published": "2025-09-14T11:19:20Z"
  },
  {
    "title": "France v Ireland: Women’s Rugby World Cup 2025 quarter-final – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/14/france-v-ireland-womens-rugby-world-cup-2025-quarter-final-live",
    "image": "https://media.guim.co.uk/80a1318f36f2ee758adececd23c8f471ffa935d2/768_0_4202_3361/500.jpg",
    "summary": "Daniel Gallan provides live updates from the third quarter-final match taking place at Sandy Park in Exeter. Follow along for minute-by-minute coverage of the game's progress. Stay tuned for key moments and insights throughout the match.",
    "published": "2025-09-14T11:17:45Z"
  },
  {
    "title": "Aston Villa v Chelsea in the WSL; Southampton v Portsmouth, and more – matchday live",
    "url": "https://www.theguardian.com/football/live/2025/sep/14/manchester-derby-buildup-wsl-news-and-a-championship-grudge-match-matchday-live",
    "image": "https://media.guim.co.uk/992a36dc3b89380872eb8d693ec73ce8bb5e39c9/727_0_3829_3064/500.jpg",
    "summary": "Stay updated on a hectic day in European football with the latest news and developments. Key matches, transfers, and injury updates are making headlines across various leagues. Don't miss any important highlights from today's action-packed events.",
    "published": "2025-09-14T11:17:32Z"
  },
  {
    "title": "Far-right AfD forecast to make gains as North Rhine-Westphalia goes to polls",
    "url": "https://www.theguardian.com/world/2025/sep/14/germany-north-rhine-westphalia-local-elections-vote",
    "image": "https://media.guim.co.uk/1e17640998f77ffc86b33a3bdb3a1a32b6eea767/471_0_3491_2793/500.jpg",
    "summary": "Elections in Germany's most populous state mark a crucial test for Friedrich Merz, who is running as chancellor. This electoral contest will gauge public support for his leadership and policies. The results could impact his political future and the direction of Germany's government.",
    "published": "2025-09-14T11:11:39Z"
  },
  {
    "title": "Mandelson was ‘worth the risk’ as US ambassador, business secretary says",
    "url": "https://www.theguardian.com/politics/2025/sep/14/mandelson-was-worth-the-risk-as-us-ambassador-business-secretary-says",
    "image": "https://media.guim.co.uk/d737ce240f933be7970f82548f34b531c7cf72bd/468_0_4680_3744/500.jpg",
    "summary": "Peter Kyle acknowledges the unique abilities of Peter Mandelson but also highlights concerns regarding Mandelson's associations with Jeffrey Epstein. The comments suggest a tension between recognizing Mandelson's contributions and the implications of his connections. This situation raises questions about the impact of personal relationships on professional reputations.",
    "published": "2025-09-14T11:08:27Z"
  }
]