[
  {
    "title": "Expert panel advises against prostate cancer screening for most men in UK",
    "url": "https://www.theguardian.com/society/2025/nov/28/prostate-cancer-screening-not-expected-to-be-made-widely-available-in-uk",
    "image": "https://media.guim.co.uk/964c7b65dd35f6b76d18a3a74651df4916cfc48f/735_0_5766_4614/500.jpg",
    "summary": "Charities have voiced significant disappointment following government advisers' conclusions that the harms of screening all men for certain health conditions would outweigh the potential benefits. This finding raises concerns about the future of preventative health measures aimed at male populations. The decision impacts ongoing discussions regarding public health strategies and resource allocation.",
    "published": "2025-11-28T16:24:22Z"
  },
  {
    "title": "National guard shooting suspect to be charged with murder as Trump steps up immigration crackdown – US politics live ",
    "url": "https://www.theguardian.com/us-news/live/2025/nov/28/trump-washington-dc-shooting-politics-updates",
    "image": "https://media.guim.co.uk/5fa5bb189a8fcb56fe806c3c88ffb49a8864babf/0_0_3156_2525/500.jpg",
    "summary": "The U.S. attorney for Washington, D.C. has escalated charges to first-degree murder following the death of a National Guard member. Meanwhile, the U.S. president announced plans to \"permanently pause\" migration from certain \"third world countries.\" This statement has raised concerns about its implications for immigration policy.",
    "published": "2025-11-28T16:23:08Z"
  },
  {
    "title": "Chelsea Football Club: an apology ",
    "url": "https://www.theguardian.com/football/2025/nov/28/chelsea-an-apology-football-daily",
    "image": "https://media.guim.co.uk/e18afbf9cdfd705700c1744ce608326acdeab871/454_0_5000_4000/500.jpg",
    "summary": "In today's Football Daily, it explores the surprising notion that Todd Boehly and Clearlake Capital may have a romantic view of football. Their strategies and investments in the sport suggest a deeper appreciation for its traditions and culture. This revelation challenges common perceptions about their business-focused approach.",
    "published": "2025-11-28T16:18:55Z"
  },
  {
    "title": "Zelenskyy chief of staff resigns after property raid by Ukraine’s anti-corruption agencies – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/nov/28/europe-latest-news-andriy-yermak-anti-corruption-zelenskyy-ukraine-russia-war-peace-talks-putin",
    "image": "https://media.guim.co.uk/8585aa23df8935d5526042ba9469ac78ca2439ce/192_0_1434_1147/500.jpg",
    "summary": "Ukrainian President Volodymyr Zelenskyy addressed the resignation of his chief of staff, Andriy Yermak, seeking to quell rumors and speculation surrounding the decision. Zelenskyy emphasized a desire for transparency amid changing leadership dynamics. The resignation comes amidst ongoing challenges in Ukraine’s political landscape.",
    "published": "2025-11-28T16:17:26Z"
  },
  {
    "title": "No 10 dismisses claim that OBR revelations show Reeves misled public about need for tax rises in budget – UK politics live ",
    "url": "https://www.theguardian.com/politics/live/2025/nov/28/workers-rights-bill-unfair-dismissal-uk-politics-latest-news-updates-labour-budget-keir-starmer",
    "image": "https://media.guim.co.uk/c0bd7148a2ad825edf852af383dc2802df685233/1033_0_6880_5504/500.jpg",
    "summary": "Downing Street has dismissed allegations that the chancellor provided misleading information to voters regarding public finances before the upcoming budget. The claims suggest a lack of transparency in financial reporting. The government maintains confidence in the integrity of its fiscal communication.",
    "published": "2025-11-28T16:16:04Z"
  }
]