[
  {
    "title": "Hybrid attacks such as drones ‘part of new reality’, Danish minister warns, as Russia embarks on huge army call-up – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/sep/29/moldova-voters-pro-eu-government-russia-drones-europe-live",
    "image": "https://media.guim.co.uk/953898f4ae3b7d965da1916ca6a56766ca8c19f3/293_0_4208_3367/500.jpg",
    "summary": "Danish Minister Peter Hummelgaard likened the recent increase in hybrid attacks on Europe to the 9/11 terrorist attacks in terms of their impact and threat level. In response to these security concerns, Russia has mobilized 135,000 military personnel. This escalation highlights the tightening geopolitical tensions in the region.",
    "published": "2025-09-29T14:18:47Z"
  },
  {
    "title": "Andy Burnham calls for UK to rejoin EU within his lifetime and rejects claim he is fiscally irresponsible – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/29/rachel-reeves-labour-party-conference-youth-guarantee-unemployment-uk-politics-live-latest-news",
    "image": "https://media.guim.co.uk/fffb026f6bb604ce40d8b2ff99e2ad9ea0e305d7/947_0_6072_4860/500.jpg",
    "summary": "The Mayor of Greater Manchester expressed a strong attachment to the city, stating he would have to be \"wrenched\" out if he were to leave. He also advocates for the UK to rejoin the European Union, highlighting his commitment to closer ties with Europe. His comments reflect ongoing debates about the benefits of EU membership post-Brexit.",
    "published": "2025-09-29T14:17:38Z"
  },
  {
    "title": "Bank of England’s Ramsden says inflation will fall to target as jobs market weakens; gold hits new record high – business live",
    "url": "https://www.theguardian.com/business/live/2025/sep/29/moral-hazard-fears-jlr-jaguar-land-rover-government-loan-gsk-ceo-astrazeneca-listing-dollar-shutdown-business-live-news",
    "image": "https://media.guim.co.uk/bc39d850fa88b0455bc21d1f74749621ee3f6385/0_0_4824_3861/500.jpg",
    "summary": "The Bank of England's deputy governor stated that the ongoing core disinflation process will persist as wage growth decreases. This trend is expected to mitigate inflation pressures in the economy. The remarks indicate confidence in the effectiveness of current monetary policies.",
    "published": "2025-09-29T14:13:28Z"
  },
  {
    "title": "Mormon church shooting suspect had Trump sign outside home, records show",
    "url": "https://www.theguardian.com/us-news/2025/sep/29/mormon-church-shooting-trump-sign",
    "image": "https://media.guim.co.uk/f9ae701bcf5d3cf0cdcf630b8278465fb6d43a20/83_0_1385_1108/500.jpg",
    "summary": "Google Maps images have revealed that a shooting suspect, who was killed by police, displayed a Trump sign outside his Michigan home. The incident has drawn public attention due to the political symbolism associated with the sign. Further details about the circumstances surrounding the shooting are emerging as the investigation continues.",
    "published": "2025-09-29T14:07:44Z"
  },
  {
    "title": "‘We never dreamt one song would take us round the world six times’: the Ting Tings on That’s Not My Name",
    "url": "https://www.theguardian.com/culture/2025/sep/29/ting-tings-thats-not-my-name-manchester-mark-radcliffe",
    "image": "https://media.guim.co.uk/683e2dc864dfe3fe122464a33578512e390a9d6d/260_0_3211_2570/500.jpg",
    "summary": "Two individuals collaborated to purchase 500 records and placed them illegally in a Manchester music shop. The incident received attention when radio host Mark Radcliffe played one of the records and exclaimed, “Strike a light!” This highlights a unique blend of music promotion and legal controversy.",
    "published": "2025-09-29T14:05:35Z"
  }
]