[
  {
    "title": "Eagles v Broncos, Texans v Ravens, Jets v Cowboys, and more: NFL week five – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/05/nfl-week-five-eagles-broncos-texans-ravens-jets-cowboys-live",
    "image": "https://media.guim.co.uk/43b3f0516305044851aa3dcf37ca9a689d8ff747/1666_0_5852_4684/500.jpg",
    "summary": "On Sunday, the 4-0 Philadelphia team took on Denver, aiming to maintain their undefeated streak. Meanwhile, the Baltimore and Houston teams focused on improving their performance as they continue to seek consistency. All teams are looking to solidify their positions in the ongoing season.",
    "published": "2025-10-05T17:14:17Z"
  },
  {
    "title": "Brentford v Manchester City: Premier League – live",
    "url": "https://www.theguardian.com/football/live/2025/oct/05/brentford-v-manchester-city-premier-league-live",
    "image": "https://media.guim.co.uk/352fbba97cebeaadbff786dfd907e944ea739caf/410_0_5000_4000/500.jpg",
    "summary": "In a minute-by-minute report, the focus is on whether Brentford, nicknamed the Bees, can capitalize on Manchester City's recent struggles following a disappointing loss in Monaco. Xaymaca Awoyungbo provides live updates on the unfolding match. Fans are eager to see if City can bounce back from their recent heartache.",
    "published": "2025-10-05T17:12:08Z"
  },
  {
    "title": "Gaza ceasefire talks live: Trump warns Hamas faces ‘complete obliteration’ if it refuses to cede power",
    "url": "https://www.theguardian.com/world/live/2025/oct/05/gaza-ceasefire-israel-palestine-hamas-trump-cairo-negotiations-middle-east-crisis-live-news-updates",
    "image": "https://media.guim.co.uk/547b7a5cc18105a953b48919cda03551a19b5e0f/886_0_4554_3642/500.jpg",
    "summary": "Negotiators are traveling to Egypt following Hamas's tentative acceptance of certain elements of Trump's proposed plan for Gaza. This development indicates potential shifts in the ongoing conflict and peace efforts in the region. The discussions aim to explore avenues for resolving the humanitarian and political issues in Gaza.",
    "published": "2025-10-05T17:11:47Z"
  },
  {
    "title": "Pro-Palestine marches have become ‘carnivals of hatred’, Badenoch tells Tory conference – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/oct/05/conservative-tory-conference-kemi-badenoch-echr-immigration-uk-politics-live-news-updates",
    "image": "https://media.guim.co.uk/e3cd560e9fc1b080fc7b5ccf1008ca80a3d75b49/549_0_5000_4000/500.jpg",
    "summary": "A party leader has criticized the UK for failing to adequately address rising extremism, claiming that the government has allowed it to proliferate unchecked. They emphasize the need for stronger measures to combat radicalization and protect communities. The statement raises concerns about national security and social cohesion in Britain.",
    "published": "2025-10-05T17:06:21Z"
  },
  {
    "title": "Andrej Babiš to hold talks with other Czech parties on forming government",
    "url": "https://www.theguardian.com/world/2025/oct/05/czech-populist-andrej-babis-in-talks-to-form-stable-government-after-election-win",
    "image": "https://media.guim.co.uk/9f5ff55eefdf6f6a58f45037160b3cdde5cbb158/562_0_5040_4032/500.jpg",
    "summary": "A billionaire is navigating a challenging path to secure sufficient backing for his bid to become Prime Minister after his party, ANO, won elections but did not achieve a majority. This situation complicates the formation of a stable government. The billionaire must negotiate with other political factions to gain the necessary support.",
    "published": "2025-10-05T17:02:05Z"
  }
]