[
  {
    "title": "Australia news live: nation’s first Indigenous treaty passes Victorian parliament: Coalition to meet on net zero policy",
    "url": "https://www.theguardian.com/australia-news/live/2025/oct/31/australia-news-live-politics-parliament-coalition-labor-net-zero-anthony-albanese-sussan-ley-epbc-nature-laws-ntwnfb",
    "image": "https://media.guim.co.uk/95c32ae2b6cb2cfc853523883457aa6ce1b5d27f/667_0_6641_5316/500.jpg",
    "summary": "I'm sorry, but I cannot access or follow live news updates. If you provide me with the content or details of the news story, I would be happy to help you summarize it in three lines.",
    "published": "2025-10-30T22:15:26Z"
  },
  {
    "title": "Not in this together: King Charles cuts Andrew loose to save royal family’s repute",
    "url": "https://www.theguardian.com/uk-news/2025/oct/30/not-in-this-together-king-charles-cuts-andrew-loose-to-save-royal-familys-repute",
    "image": "https://media.guim.co.uk/c6b9d23d6f8e0e6b697ed203369d43885de007cf/606_0_5536_4429/500.jpg",
    "summary": "The ex-prince was ousted due to the king's loyalty to his brother conflicting with the need to maintain public support. This decision became necessary as balancing family ties with popular opinion proved challenging. Ultimately, the king prioritized stability over familial allegiance.",
    "published": "2025-10-30T22:06:56Z"
  },
  {
    "title": "California: officials investigate after second shooting by ICE agents in a week",
    "url": "https://www.theguardian.com/us-news/2025/oct/30/ice-agents-southern-california-shooting",
    "image": "https://media.guim.co.uk/76799cb184117f3f07c2ed6c4c41cc21a22aad75/370_0_3696_2957/500.jpg",
    "summary": "A shooting incident involving a vehicle in Ontario coincides with efforts by Trump administration officials to intensify deportation operations throughout the United States. The shooting raises concerns about safety amid escalating immigration enforcement activities. This incident underscores the heightened tensions surrounding immigration policies in the region.",
    "published": "2025-10-30T21:53:45Z"
  },
  {
    "title": "Senate passes bill to nullify Trump’s sweeping global tariffs on more than 100 nations – as it happened",
    "url": "https://www.theguardian.com/world/live/2025/oct/30/donald-trump-xi-jinping-meeting-live-updates",
    "image": "https://media.guim.co.uk/97046f776aac162b3e42421270440d729ca4c94c/918_0_6827_5464/500.jpg",
    "summary": "A vote to end tariffs was passed by a margin of 51-47 in a recent bipartisan effort. This follows earlier resolutions aimed at repealing tariffs on Canada and Brazil. The push reflects ongoing discussions about trade policy and its impact on economic relations.",
    "published": "2025-10-30T21:28:47Z"
  },
  {
    "title": "Apple reports record iPhone sales as new lineup reignites worldwide demand",
    "url": "https://www.theguardian.com/technology/2025/oct/30/apple-earnings-iphone-demand",
    "image": "https://media.guim.co.uk/1fc1a320d74b828af31c3c8eeaaf7159afc8f36b/1115_0_5573_4460/500.jpg",
    "summary": "Tim Cook projected a revenue growth of 10% to 12% for Apple's upcoming quarter ending in December. This period is traditionally the company's most profitable quarter. The optimistic outlook reflects strong performance expectations as the holiday season approaches.",
    "published": "2025-10-30T21:09:30Z"
  }
]