[
  {
    "title": "Australia politics live: Ley says extremist movement’s ‘sickness has to be removed’; Labor under pressure over FoI changes",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/03/australia-politics-live-labor-coalition-greens-anthony-albanese-sussan-ley-question-time-nauru-immigration-asylum-ntwnfb",
    "image": "https://media.guim.co.uk/6ec92cfaaddd17b57b6f359749c40c192032c413/316_0_4407_3526/500.jpg",
    "summary": "I apologize, but I need more context or information about the news you want summarized. Please provide the details so I can assist you!",
    "published": "2025-09-02T23:16:47Z"
  },
  {
    "title": "US House committee releases batch of Epstein records as White House fights release of all files – live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/02/congress-returns-government-shutdown-funding-trump-announcement-us-politics-live-latest-updates",
    "image": "https://media.guim.co.uk/37dd38e8ca0e0fcabf8e02a039a62a031d60968c/694_509_4364_3491/500.jpg",
    "summary": "A Republican-led oversight committee has released more than 33,000 pages of documents regarding their investigation into a late sex offender. The files are part of a broader inquiry into the individual's background and activities. This release aims to shed light on the case and any potential implications for public policy.",
    "published": "2025-09-02T23:15:13Z"
  },
  {
    "title": "Born With Teeth review – Ncuti Gatwa simmers in Elizabethan battle of the playwrights",
    "url": "https://www.theguardian.com/stage/2025/sep/03/born-with-teeth-review-ncuti-gatwa-wyndhams-theatre-marlowe-shakespeare-edward-bluemel",
    "image": "https://media.guim.co.uk/4e7f339c20e4fd662859daaf8aa29fe76c3f8cd3/39_0_4166_3334/500.jpg",
    "summary": "In Liz Duffy Adams' new chamber play, Christopher Marlowe and William Shakespeare, portrayed by Gatwa and Edward Bluemel, engage in playful flirtation and conflict. The dynamic between the two iconic playwrights is explored through witty dialogue and intense exchanges. The production presents a fresh take on their relationship and creative rivalry.",
    "published": "2025-09-02T23:01:07Z"
  },
  {
    "title": "More than 7,300 Afghans to be resettled in UK after MoD data leak, says National Audit Office",
    "url": "https://www.theguardian.com/uk-news/2025/sep/03/afghans-resettled-uk-mod-data-leak-report-national-audit-office",
    "image": "https://media.guim.co.uk/6222fa77197758a7ce62aa1b1ee7bafc91147dba/249_0_5553_4444/500.jpg",
    "summary": "A watchdog's report reveals that the government cannot accurately determine the cost of its response to a data breach, calling into question the previously estimated £850 million expense. The lack of clarity on financial implications highlights potential concerns regarding accountability and transparency. This uncertainty may impact public trust in the government's handling of data security issues.",
    "published": "2025-09-02T23:01:07Z"
  },
  {
    "title": "Women’s Super League 2025-26 previews No 10: Manchester United",
    "url": "https://www.theguardian.com/sport/2025/sep/03/womens-super-league-2025-26-previews-no-10-manchester-united",
    "image": "https://media.guim.co.uk/cc527cee3675c2b615358bca861afa1cb54a4db2/755_515_4371_3497/500.jpg",
    "summary": "A third-place finish in the Women's Super League (WSL) may be challenging to replicate, but qualifying for the Champions League group stages is attainable. Fridolina Rolfö’s impressive signing adds to the team's potential. Overall, there's optimism for the upcoming season.",
    "published": "2025-09-02T23:01:07Z"
  }
]