[
  {
    "title": "News live: Trump’s autism claims ‘cruel’ to pregnant women, Australia’s former chief medical officer says",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/23/australia-news-live-albanese-new-york-palestine-united-nations-donald-trump-mark-butler-paracetamol-pregnancy-ntwnfb",
    "image": "https://media.guim.co.uk/56cde25dceef945facb63b60dbb41b9c9117ac2f/725_0_4560_3648/500.jpg",
    "summary": "To provide a summary, I need the content of the news article you're referring to. Please share the text or main points you'd like summarized.",
    "published": "2025-09-23T04:35:44Z"
  },
  {
    "title": "Country diary: The sound of a dragonfly is a 300m-year-old whisper | Paul Evans",
    "url": "https://www.theguardian.com/environment/2025/sep/23/country-diary-the-sound-of-a-dragonfly-is-a-300m-year-old-whisper",
    "image": "https://media.guim.co.uk/06a13f0f216c17000c71b5c352af1f9527a6e27a/958_0_4271_3416/500.jpg",
    "summary": "In The Marches, Shropshire, an elusive sound creates a gentle turbulence characterized by a soft percussive clicking. Though nearly inaudible to human ears, this sound carries a sense of ancient resonance and modern electricity. It highlights the unique auditory landscape of the region.",
    "published": "2025-09-23T04:30:37Z"
  },
  {
    "title": "Australian health experts warn Trump’s unfounded autism claims about paracetamol may harm pregnant women",
    "url": "https://www.theguardian.com/australia-news/2025/sep/23/australian-health-experts-warns-trumps-unfounded-claims-about-paracetamol-may-harm-pregnant-women",
    "image": "https://media.guim.co.uk/595ec2fbf5f5d1cea70e97319e06139d7c07e698/345_0_4680_3744/500.jpg",
    "summary": "The TGA has officially deemed a drug safe for use during pregnancy, addressing concerns among doctors about misinformation from the White House. This confirmation aims to reassure both healthcare professionals and pregnant individuals regarding the drug's safety. The situation highlights the ongoing issues surrounding accurate information and public health messaging.",
    "published": "2025-09-23T04:26:31Z"
  },
  {
    "title": "EU chemical firms plan to export rising quantities of ‘toxic’ pesticides, documents show",
    "url": "https://www.theguardian.com/environment/2025/sep/23/eu-chemical-firms-export-toxic-pesticides",
    "image": "https://media.guim.co.uk/a61b12dc58bf3396f6adac11a464056efa2b08a6/766_0_4800_3840/500.jpg",
    "summary": "The Bloc is being urged to address a \"unethical double standard\" by allowing the sale of agricultural products deemed too dangerous for European farms. Critics argue this inconsistency undermines safety regulations. Calls for change emphasize the need for more consistent standards in food safety regulations.",
    "published": "2025-09-23T04:00:39Z"
  },
  {
    "title": "Hungary refuses to stop buying Russian oil despite Trump’s Nato demand",
    "url": "https://www.theguardian.com/world/2025/sep/23/hungary-refuses-to-stop-buying-russian-oil-despite-trumps-nato-demand",
    "image": "https://media.guim.co.uk/77be3831b881746f80b0f6366f330b148c8c1ea5/2306_120_2262_1810/500.jpg",
    "summary": "The foreign minister expressed skepticism about the feasibility of sourcing energy supplies from alternative locations, calling it a \"nice dream.\" He criticized Western European officials, labeling them as \"fanatics\" for their energy policies. The remarks highlight tensions over energy dependencies and geopolitical strategies.",
    "published": "2025-09-23T04:00:39Z"
  }
]