[
  {
    "title": "News live: Albanese urges UAE supermarket chain to challenge Australia’s duopoly; teens charged after Melbourne CBD police pursuit",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/30/australia-news-live-albanese-supermarket-united-arab-emirates-uae-coalition-sussan-ley-andrew-hastie-reserve-bank-rba-chalmers-interest-rates-decision-ntwnfb",
    "image": "https://media.guim.co.uk/b04cde3f729d013ff87842fe29cdc0616d5bd019/0_0_6326_5064/500.jpg",
    "summary": "Could you please provide more details or the specific news article you would like summarized?",
    "published": "2025-09-29T23:06:24Z"
  },
  {
    "title": "YouTube agrees to pay Trump $24.5m to settle lawsuit over account suspension",
    "url": "https://www.theguardian.com/technology/2025/sep/29/youtube-trump-lawsuit-settlement",
    "image": "https://media.guim.co.uk/3d2a5cae8803cb694f5896383f1937a8addd6e2c/293_0_2915_2333/500.jpg",
    "summary": "YouTube suspended the US president's channel in 2021 following the January 6 Capitol riot. The suspension was part of the platform's policy to prevent further misinformation and violence. The channel had been barred from posting new content due to these concerns.",
    "published": "2025-09-29T23:04:02Z"
  },
  {
    "title": "‘I think we’re headed to a shutdown,’ says JD Vance as Mike Johnson calls for more time for negotiations – live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/29/donald-trump-benjamin-netanyahu-gaza-white-house-us-politics-live",
    "image": "https://media.guim.co.uk/5bc5eabe43ed2cd3d8a36d9d12291101b773ef0a/0_0_4757_3806/500.jpg",
    "summary": "Congressional leaders held discussions with Trump regarding the impending government shutdown. Reports indicate that the vice president suggested Democrats are unwilling to cooperate. The meeting aimed to negotiate solutions and avert a shutdown crisis.",
    "published": "2025-09-29T23:01:43Z"
  },
  {
    "title": "Retailers say tax rises could further fuel inflation as shop prices jump",
    "url": "https://www.theguardian.com/business/2025/sep/30/retailers-tax-rises-further-fuel-inflation-shop-prices-jump",
    "image": "https://media.guim.co.uk/d143b87e20fad07e2944ea93de54fb4ed6acf358/362_375_3771_3017/500.jpg",
    "summary": "The British Retail Consortium (BRC) reports that households are facing higher shopping costs as annual shop price inflation has increased to 1.4%. This rise in prices is making it more challenging for consumers to manage their grocery budgets. The trend highlights growing concerns over affordability in the current economic climate.",
    "published": "2025-09-29T23:01:41Z"
  },
  {
    "title": "Cryptic crossword No 29,813",
    "url": "https://www.theguardian.com/crosswords/cryptic/29813",
    "summary": "I'm sorry, but I can't provide a summary of the specific crossword as I don't have access to real-time news or specific puzzles. However, if you provide the details or clues from the crossword, I can help summarize or discuss them!",
    "published": "2025-09-29T23:00:41Z"
  }
]