[
  {
    "title": "US treasury secretary accuses Beijing of trying to damage global economy, as US and China roll out tit-for-tat port fees – business live",
    "url": "https://www.theguardian.com/business/live/2025/oct/14/us-treasury-secretary-beijing-rare-earths-us-china-port-fees-imf-tariffs-business-live-news",
    "image": "https://media.guim.co.uk/cff322cf52c19005da82b58a1d3f3740392f6326/301_0_2500_2000/500.jpg",
    "summary": "Stay updated with ongoing developments in the economy and financial markets. Key updates include shifts in economic indicators, market trends, and policy changes. Analysis highlights potential impacts on investments and consumer behavior.",
    "published": "2025-10-14T07:19:00Z"
  },
  {
    "title": "Right to protest under ‘sustained attack’ across the west, report finds",
    "url": "https://www.theguardian.com/world/2025/oct/14/right-to-protest-criminalisation-west-fidh-report-palestine",
    "image": "https://media.guim.co.uk/62b4e77bef4cd36e59a7e82ae71a55770cc2eb14/797_0_6233_4989/500.jpg",
    "summary": "The International Federation for Human Rights (FIDH) has stated that counter-terrorism laws are being misused against pro-Palestine groups in the UK, US, France, and Germany. This alleged \"weaponization\" of such laws raises concerns about the suppression of free speech and activism. FIDH calls for a reconsideration of these legal measures to avoid targeting specific political movements.",
    "published": "2025-10-14T07:17:28Z"
  },
  {
    "title": "Ley calls for parliament to investigate Thorpe over ‘incendiary behaviour’ at protest – as it happened",
    "url": "https://www.theguardian.com/australia-news/live/2025/oct/14/australia-news-live-jim-chalmers-superannuation-concession-tax-cybercrime-anthony-albanese-sussan-ley-coalition-penny-wong-israel-gaza-ntwnfb",
    "image": "https://media.guim.co.uk/c8da3acbe01126ac9d2694aa9d7aaf3ca797a86f/404_0_5019_4016/500.jpg",
    "summary": "The blog has officially ended its updates and activities. Readers are no longer able to access new content or postings. Thank you for your support during its operation.",
    "published": "2025-10-14T07:06:10Z"
  },
  {
    "title": "UK labour market shows signs of stabilising after job losses",
    "url": "https://www.theguardian.com/business/2025/oct/14/uk-labour-market-job-losses-unemployment-ons",
    "image": "https://media.guim.co.uk/e520561c60460c71ddda524b7974625243c0f926/292_0_4113_3291/500.jpg",
    "summary": "The unemployment rate has increased slightly to 4.8%, according to the Office for National Statistics (ONS). Despite this rise, the ONS reports that there are declines in payroll numbers and that job vacancies are stabilizing. The overall labor market appears to be reaching a plateau amid these trends.",
    "published": "2025-10-14T07:03:20Z"
  },
  {
    "title": "Conflating criticism of Israel with hatred of Jews ‘quite audacious’, lawyer for Sydney academics tells court",
    "url": "https://www.theguardian.com/australia-news/2025/oct/14/criticism-of-israel-not-hatred-of-jews-lawyer-sydney-academics-ntwnfb",
    "image": "https://media.guim.co.uk/dc478e053171d963d06fa5ba0ac9d40c6a3cb61b/740_0_7857_6286/500.jpg",
    "summary": "The University of Sydney and two of its academics are involved in a racial discrimination case brought forward by colleagues. The allegations include claims of racist hate speech attributed to the academics. The situation has raised serious concerns about workplace diversity and conduct within the institution.",
    "published": "2025-10-14T07:02:47Z"
  }
]