[
  {
    "title": "Any Ukraine peace plan needs Kyiv and Europe ‘on board’, says EU – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/nov/20/ukraine-russia-peace-plan-european-union-donald-trump-vladimir-putin-kaja-kallas-europe-live-news-updates",
    "image": "https://media.guim.co.uk/4511cac94105cf022e2569f5db6db82676cf8612/523_0_2658_2126/500.jpg",
    "summary": "EU foreign policy chief Kaja Kallas responds to reports of a covert agreement between Moscow and Washington aimed at resolving the ongoing conflict. She emphasized the importance of transparency in any negotiations. The situation raises concerns about the implications for EU security and diplomatic efforts.",
    "published": "2025-11-20T10:18:50Z"
  },
  {
    "title": "Markets rally after Nvidia’s strong results calm AI bubble fears, and investors await US jobs report – business live",
    "url": "https://www.theguardian.com/business/live/2025/nov/20/markets-rally-nvidia-results-ai-bubble-us-jobs-report-ftse-pound-dollar-business-live-news",
    "image": "https://media.guim.co.uk/24cdfdb66bee1881b7fbca7cc39c1b8a13b2edff/120_0_3388_2710/500.jpg",
    "summary": "Investors responded positively to better-than-expected earnings from a chipmaker, boosting market confidence. The focus now shifts to a postponed US employment report, which may influence economic outlooks. Analysts are keenly awaiting further insights into the labor market's performance.",
    "published": "2025-11-20T10:18:29Z"
  },
  {
    "title": "Tell us which TV programme you’d love to see return",
    "url": "https://www.theguardian.com/tv-and-radio/2025/nov/20/tell-us-which-tv-programme-youd-love-to-see-return",
    "image": "https://media.guim.co.uk/99d76898628e231f0051296016327da9bf738a7b/1098_0_4896_3920/500.jpg",
    "summary": "With the return of popular series Line of Duty and Doctor Foster, fans are invited to share their wishes for other shows they would like to see revived. The announcement has sparked excitement and speculation about potential comebacks. Viewers are encouraged to voice their preferences for nostalgic favorites.",
    "published": "2025-11-20T10:12:10Z"
  },
  {
    "title": "Justice department has 30 days to release all Epstein files after Trump signs bill – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/nov/20/donald-trump-jeffrey-epstein-justice-department-zohran-mamdani-news-updates-us-politics-live",
    "image": "https://media.guim.co.uk/460a2faeeb7cd06a361c8b8256c2d0bfeb055895/1081_0_5421_4337/500.jpg",
    "summary": "Donald Trump is denouncing Democrats in response to inquiries about his connections to the late sex offender Jeffrey Epstein. He aims to control the narrative surrounding these allegations, framing them as politically motivated attacks. Trump's comments highlight ongoing tensions as he navigates the controversy.",
    "published": "2025-11-20T10:05:00Z"
  },
  {
    "title": "‘A different vibe’: New York welcomes the luxury private cinema experience",
    "url": "https://www.theguardian.com/film/2025/nov/20/new-york-luxury-movie-theater-private-cinema",
    "image": "https://media.guim.co.uk/83dfbbaa7b99a25dd6c2ab886505f86cc75dd7a7/167_0_1666_1333/500.jpg",
    "summary": "Metro Private Cinema offers exclusive private screenings with gourmet meals and drinks for $200 per person. The high-end experience raises the question of whether consumers are willing to pay such a premium for luxury outings. The success of this model will depend on demand for upscale entertainment options.",
    "published": "2025-11-20T10:02:03Z"
  }
]