[
  {
    "title": "Two bodies found in Victorian high country by hikers",
    "url": "https://www.theguardian.com/australia-news/2025/oct/04/two-bodies-found-in-victorian-high-country-by-hikers",
    "image": "https://media.guim.co.uk/8f74427f996aefde56bd4ecb44878dad183bc56f/111_0_3725_2980/500.jpg",
    "summary": "Tasmanian police reported a woman's death following a drowning incident in the Franklin River. Additionally, authorities rescued 11 hikers who had become stranded. The incidents highlight the region's ongoing safety challenges.",
    "published": "2025-10-04T02:08:15Z"
  },
  {
    "title": "Trump says Hamas response to peace plan means ‘peace in the Middle East’ is ‘very close’ – as it happened",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/03/shutdown-congress-trump-senate-latest-updates",
    "image": "https://media.guim.co.uk/9b4205aea3f4fabc735b6ffe16d553a37b6532ec/580_0_5802_4644/500.jpg",
    "summary": "The US president has welcomed Hamas's response to his Gaza plan, signaling a positive reception despite Hamas requesting further negotiations on specific details. The blog providing coverage of the situation has now concluded its updates. Overall, the development reflects ongoing dialogue surrounding the Gaza plan.",
    "published": "2025-10-04T02:05:28Z"
  },
  {
    "title": "Donald Trump orders Israel to ‘immediately’ stop bombing Gaza as Hamas agrees to free hostages",
    "url": "https://www.theguardian.com/world/2025/oct/03/hamas-agrees-to-release-all-israeli-hostages",
    "image": "https://media.guim.co.uk/21a5a6d3ece081378a0436e0594a541e6cb40bf0/720_0_7200_5760/500.jpg",
    "summary": "The Palestinian militant group has agreed to certain aspects of the U.S. president's proposed plan. However, they are calling for additional negotiations to address various terms. This indicates a willingness to engage but highlights ongoing tensions and the need for further dialogue.",
    "published": "2025-10-04T02:02:49Z"
  },
  {
    "title": "Dfat officials supporting five Australians in Israeli prison after they were detained on pro-Palestinian flotilla",
    "url": "https://www.theguardian.com/australia-news/2025/oct/03/australians-gaza-flotilla-detained-government-pushing-israel-for-information",
    "image": "https://media.guim.co.uk/13979036b07825efe92a98cd77b6cf3345cbf424/168_0_1695_1356/500.jpg",
    "summary": "The Global Movement to Gaza group has expressed worries regarding the conditions faced by Australians detained in Gaza. They highlight humanitarian issues stemming from the ongoing conflict. Calls for better treatment and support for those affected are being emphasized.",
    "published": "2025-10-04T01:30:23Z"
  },
  {
    "title": "Trump news at a glance: Hamas says it has approved parts of Donald Trump’s ultimatum to end war in Gaza",
    "url": "https://www.theguardian.com/us-news/2025/oct/04/trump-news-at-a-glance-hamas-says-it-has-approved-parts-of-donald-trumps-ultimatum-to-end-war-in-gaza",
    "image": "https://media.guim.co.uk/2471218054af851ea58b7807f028216b848dfa2f/302_0_3202_2563/500.jpg",
    "summary": "President calls for an end to the bombing in Gaza, urging Israel to halt military actions. Meanwhile, a Palestinian group expresses interest in continuing negotiations regarding a plan. These events highlight ongoing tensions and diplomatic efforts in the region.",
    "published": "2025-10-04T00:26:15Z"
  }
]