[
  {
    "title": "Strictly Come Dancing: week three – live",
    "url": "https://www.theguardian.com/tv-and-radio/live/2025/oct/11/strictly-come-dancing-week-three-live",
    "image": "https://media.guim.co.uk/5198635ca891f533d9859319ab0c788b0a365df7/367_0_3953_3162/500.jpg",
    "summary": "Movie Week features performances inspired by popular films like Miss Congeniality, James Bond, K-Pop Demon Hunters, and Mary Poppins. Stars will showcase their dancing skills, but it remains uncertain who will shine or stumble in the competition. Audience reactions may determine which performances achieve box office success.",
    "published": "2025-10-11T19:13:11Z"
  },
  {
    "title": "Hull KR 24-6 Wigan Warriors: Super League Grand Final – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/11/rugby-league-hull-kr-wigan-warriors-super-league-grand-final-live",
    "image": "https://media.guim.co.uk/0103a7b193ff785f7e0fb95fbf8f30e119a3a2aa/19_0_4925_3940/500.jpg",
    "summary": "League leaders face off against the reigning champions in a highly anticipated match as both teams pursue historical achievements. The game is being covered with a minute-by-minute report by Luke McLaughlin. Excitement builds as fans look forward to this critical showdown.",
    "published": "2025-10-11T19:13:10Z"
  },
  {
    "title": "Portugal v Republic of Ireland, Spain v Georgia: World Cup 2026 qualifying – live",
    "url": "https://www.theguardian.com/football/live/2025/oct/11/portugal-v-republic-of-ireland-spain-v-georgia-world-cup-2026-qualifying-live",
    "image": "https://media.guim.co.uk/ec7ad6b5077d725451e7c962470c4d09fe8bd5c4/566_0_3713_2970/500.jpg",
    "summary": "John Brewin will provide live goal updates from matches across Europe as teams compete for qualification in next year's tournament. Fans can follow the excitement as teams strive to secure their spots. Stay tuned for real-time information on key goals and developments.",
    "published": "2025-10-11T19:12:28Z"
  },
  {
    "title": "Hull KR secure treble with dominant display against Wigan in Super League Grand Final",
    "url": "https://www.theguardian.com/sport/2025/oct/11/hull-kr-wigan-super-league-grand-final-rugby-league-match-report",
    "image": "https://media.guim.co.uk/5d5de265c56d046d0fb928a6409c8b796380176d/871_0_4295_3436/500.jpg",
    "summary": "Hull KR secured a historic treble by defeating Wigan 24-6 in the Super League Grand Final at Old Trafford. This victory marks a significant achievement for the team, solidifying their dominance in the league. The match showcased Hull KR's outstanding performance throughout the season.",
    "published": "2025-10-11T19:04:38Z"
  },
  {
    "title": "More than 500,000 people return to Gaza City amid ceasefire, as Steve Witkoff addresses Tel Aviv crowd – live",
    "url": "https://www.theguardian.com/world/live/2025/oct/11/israel-gaza-ceasefire-hamas-hostages-netanyahu-trump-middle-east-latest-news-updates",
    "image": "https://media.guim.co.uk/373bb91e694a157d575f69e59bb39001116b511f/704_0_6250_5000/500.jpg",
    "summary": "Palestinians are confronted with destruction as they return to their homes amidst ongoing conflict. The US special envoy visited Hostages Square in Israel, accompanied by Jared Kushner and Ivanka Trump. The visit highlights increased U.S. involvement in the region amid escalating tensions.",
    "published": "2025-10-11T19:04:14Z"
  }
]