[
  {
    "title": "Judge strikes down Trump’s $15bn lawsuit against the New York Times",
    "url": "https://www.theguardian.com/us-news/2025/sep/19/trump-nyt-lawsuit-judge-ruling",
    "image": "https://media.guim.co.uk/885d01cc28a6e7c62a85e3660a037cf383214372/166_0_4297_3437/500.jpg",
    "summary": "A judge ruled that President Biden's complaint against a newspaper for \"spreading false content\" about him is in violation of federal rules. The decision highlights the limitations on legal action regarding media coverage. The ruling underscores the complexities of balancing free speech and political accountability.",
    "published": "2025-09-19T17:27:33Z"
  },
  {
    "title": "Trump touts ‘productive’ call with Xi and says he plans to go to China next year – live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/19/donald-trump-jimmy-kimmel-suspension-abc-federal-reserve-lisa-cook-us-politics-live-news",
    "image": "https://media.guim.co.uk/77718a09de57f5dc7e1067fe58f9dfef96fd6e39/244_0_3164_2532/500.jpg",
    "summary": "Trump announced that he and the Chinese president have made headway on discussions regarding TikTok and trade relations. The two leaders are scheduled to meet at a summit in South Korea next month. This meeting is expected to further address ongoing trade issues.",
    "published": "2025-09-19T17:23:07Z"
  },
  {
    "title": "Poland says Russian jets violated oil platform safety zone in Baltic Sea as Nato confirms it intercepted MiG-31s over Estonia – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/sep/19/eu-sanctions-russia-oil-ukraine-vladimir-putin-volodymyr-zelenskyy-donald-trump-france-macron-europe-live-news",
    "image": "https://media.guim.co.uk/2b9a3bdac6c1558afbf9445cff2c5644686bbd7f/242_0_2049_1639/500.jpg",
    "summary": "NATO condemned the \"reckless Russian behaviour\" after three MiG-31 fighters briefly entered Estonian airspace for 12 minutes. The incident raised concerns about airspace violations and regional security. NATO emphasized the importance of maintaining airspace integrity and stability in the region.",
    "published": "2025-09-19T17:18:04Z"
  },
  {
    "title": "Body found in Tesla reportedly owned by singer d4vd that of missing teenager",
    "url": "https://www.theguardian.com/us-news/2025/sep/18/tesla-car-body-los-angeles",
    "image": "https://media.guim.co.uk/06756b6dd2dcd44433e867e6b1d55cf9bc4de431/688_0_6880_5504/500.jpg",
    "summary": "Los Angeles officials have identified the body found inside a vehicle in a Hollywood tow lot as 15-year-old Celeste Rivas. The discovery has raised concerns and prompted an investigation into the circumstances surrounding her death. Authorities are working to gather more information about the incident.",
    "published": "2025-09-19T17:12:57Z"
  },
  {
    "title": "Villa lick wounds after goalless start and costly flouting of spending rules",
    "url": "https://www.theguardian.com/football/2025/sep/19/aston-villa-goalless-start-costly-flouting-spending-rules",
    "image": "https://media.guim.co.uk/ccb51294b408a43a65eded45bce3f39e02aa7291/409_0_3215_2573/500.jpg",
    "summary": "Following a challenging transfer window, the team faces a difficult start to the season. This has increased pressure as they prepare for their upcoming match against Sunderland. The situation demands urgent improvement to avoid further complications.",
    "published": "2025-09-19T17:00:50Z"
  }
]