[
  {
    "title": "Most of Trump’s tariffs are illegal, federal court rules ",
    "url": "https://www.theguardian.com/us-news/2025/aug/29/trump-tariffs-illegal-appeal-court-ruling",
    "image": "https://media.guim.co.uk/5f6de30e8ecd826706e5f0681ba5d3b5f04b46ac/310_0_5001_4000/500.jpg",
    "summary": "The Supreme Court is set to decide whether the president exceeded his powers in changing trade policy. This ruling will address the conflict between executive authority and established trade agreements. The outcome could significantly impact future trade decisions and presidential powers.",
    "published": "2025-08-29T22:32:37Z"
  },
  {
    "title": "US appeals court rules most of Trump’s sweeping global tariffs illegal – live",
    "url": "https://www.theguardian.com/us-news/live/2025/aug/29/cdc-robert-f-kennedy-jr-donald-trump-federal-reserve-lisa-cook-latest-us-politics-news-live-updates",
    "image": "https://media.guim.co.uk/6bce69080a23d3223d079aa0d8e609bfdd276535/0_1463_3174_2537/500.jpg",
    "summary": "A ruling has upheld a decision from a trade court, prompting the president to criticize the \"Highly Partisan Appeals Court.\" He expressed confidence that he will prevail in the ongoing tariff dispute. The situation reflects ongoing tensions between the administration and judicial decisions affecting trade policies.",
    "published": "2025-08-29T22:28:02Z"
  },
  {
    "title": "Police warn protesters not to travel to Epping after asylum hotel ruling – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/aug/29/latest-live-uk-politics-news-updates-asylum-hotels-labour-conservatives-reform",
    "image": "https://media.guim.co.uk/69db6f531143c0c52f448704b7123eb50758b45e/396_137_3832_3066/500.jpg",
    "summary": "The Home Office and the owner of the Bell hotel are contesting an injunction issued by the local council aimed at preventing the accommodation of numerous asylum seekers in the hotel. The council sought the injunction citing various concerns. The case highlights ongoing tensions between local authorities and the government's use of temporary housing for asylum seekers.",
    "published": "2025-08-29T22:21:32Z"
  },
  {
    "title": "Deadly reporting, Netflix algorithms and a bullish food critic",
    "url": "https://www.theguardian.com/australia-news/2025/aug/30/five-great-reads-deadly-reporting-netflix-algorithms-and-a-bullish-food-critic",
    "image": "https://media.guim.co.uk/35462b138a68d1017da65f022d45d9e6dbbded50/388_0_3878_3103/500.jpg",
    "summary": "Guardian Australia's weekend wrap, curated by Claire Keenan, highlights key readings from the past week. The selection covers significant news stories and insights across various topics. It offers a concise summary of essential updates for readers.",
    "published": "2025-08-29T22:00:43Z"
  },
  {
    "title": "Mikel Arteta backs Eberechi Eze to make impact on Arsenal debut at Liverpool",
    "url": "https://www.theguardian.com/football/2025/aug/29/mikel-arteta-eberechi-eze-debut-arsenal-liverpool-premier-league",
    "image": "https://media.guim.co.uk/1cd6de58d7616d1d327fd32d1cff1c16f65ff8d2/294_0_3116_2494/500.jpg",
    "summary": "Arsenal's manager praised his new £67.5 million signing, highlighting his ability to thrive in high-pressure situations. He emphasized that the player enjoys critical moments on the field. This positive assessment reflects the manager's confidence in the new addition's potential impact.",
    "published": "2025-08-29T21:56:06Z"
  }
]