[
  {
    "title": "Middlesbrough stand Edwards down from game; Spurs v Manchester United Q&A – matchday live ",
    "url": "https://www.theguardian.com/football/live/2025/nov/08/tottenham-v-manchester-united-buildup-premier-league-and-wsl-news-matchday-live",
    "image": "https://media.guim.co.uk/6f585c6242d77e674da680e862e85ceaeb96de9d/262_118_3352_2681/500.jpg",
    "summary": "Join us for insightful news updates, engaging discussions, and previews ahead of the day's events. Stay informed and prepared as the action unfolds. Don't miss out on the latest happenings!",
    "published": "2025-11-08T11:12:36Z"
  },
  {
    "title": "BBC ‘100% fake news’, says Donald Trump’s press secretary",
    "url": "https://www.theguardian.com/media/2025/nov/08/bbc-100-fake-news-says-donald-trumps-press-secretary",
    "image": "https://media.guim.co.uk/0ca6dcb956f1c815a1ad329c4b31d3802da1bfeb/567_0_2825_2261/500.jpg",
    "summary": "Karoline Leavitt criticized a Panorama documentary, claiming it misled viewers through selective editing of a Trump speech. Her remarks follow growing scrutiny over the documentary's portrayal of the former president's comments. The controversy highlights ongoing debates about media representation and objectivity.",
    "published": "2025-11-08T11:12:09Z"
  },
  {
    "title": "Where is the Gaza ‘peace process’ really going? | Ahmad Ibsais",
    "url": "https://www.theguardian.com/commentisfree/2025/nov/08/where-is-gaza-peace-process-going",
    "image": "https://media.guim.co.uk/9c857ce6d1d50947220d99730fc9f7f9ba62bc9a/938_0_5000_4000/500.jpg",
    "summary": "Israel exercises control over violence in Gaza and the West Bank, manipulating it according to its needs. Each halt in hostilities is presented by Israel as a generous \"ceasefire.\" This strategy highlights the ongoing tension and power dynamics in the region.",
    "published": "2025-11-08T11:00:02Z"
  },
  {
    "title": "The LA Dodgers won the World Series but for Latino fans, it’s complicated ",
    "url": "https://www.theguardian.com/sport/2025/nov/08/la-dodgers-latino-fans-world-series",
    "image": "https://media.guim.co.uk/39354b019518819b279731ea078b3d6370054a77/430_0_2365_1892/500.jpg",
    "summary": "Latino stars played a key role in the victory over the Toronto Blue Jays, highlighting their contributions to the team. This success contrasts with the club's lack of comment on the ongoing immigration raids affecting the community. The situation raises questions about the club’s engagement with pressing social issues.",
    "published": "2025-11-08T11:00:02Z"
  },
  {
    "title": "Plant importers say border delays in Kent could drive up prices and stop deliveries from EU",
    "url": "https://www.theguardian.com/politics/2025/nov/08/plant-importers-say-border-delays-kent-could-drive-up-prices-stop-deliveries-from-eu",
    "image": "https://media.guim.co.uk/5a5a9de878759c351d68ef34133f2beb7375589b/0_203_900_720/500.jpg",
    "summary": "Traders are experiencing significant delays at the Sevington inspection post, leading to frustration. They report that the prolonged waits are causing recurrent damage to trees and shrubs in the area. Concerns are rising over the impact of these disruptions on local vegetation.",
    "published": "2025-11-08T11:00:02Z"
  }
]