[
  {
    "title": "Lincoln v Chelsea, Liverpool v Southampton, and more: Carabao Cup – live",
    "url": "https://www.theguardian.com/football/live/2025/sep/23/lincoln-v-chelsea-liverpool-v-southampton-and-more-carabao-cup-live",
    "image": "https://media.guim.co.uk/297d9d53e90cdb48717afdda4b228b42eb3f03bf/515_0_3945_3157/500.jpg",
    "summary": "Rob Smyth covers the latest developments in round three of the League Cup, where more Premier League teams join the competition. Fans can expect an exciting lineup and thrilling matches as clubs vie for advancement. Tune in for all the action and updates!",
    "published": "2025-09-23T18:49:00Z"
  },
  {
    "title": "‘Loud and proud’: UK summit kicks off new conversation for working dads",
    "url": "https://www.theguardian.com/society/2025/sep/23/uk-summit-kicks-off-new-conversation-for-working-dads",
    "image": "https://media.guim.co.uk/3d29ecbcdadf4c6a1cc442c91ccef6f49ca902a9/749_0_4640_3712/500.jpg",
    "summary": "Event organizers are calling on fathers to advocate for more equitable parental rights in the UK, highlighting the nation's inadequate current provisions. They emphasize the need for systemic changes to ensure fair treatment for fathers in parental responsibilities. The initiative seeks to raise awareness and promote discussions on this pressing issue.",
    "published": "2025-09-23T18:48:09Z"
  },
  {
    "title": "Trump says Nato countries should shoot down Russian aircraft entering their airspace – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/23/donald-trump-unga-autism-tylenol-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/a25b42e2be033e6f69d3a2acfe088ab740d153fb/1361_323_5481_4385/500.jpg",
    "summary": "The US president criticized Russian fighter jets for recent drone incursions. Additionally, Trump called out European countries for their handling of migration issues. His comments highlight ongoing tensions with Russia and challenges in addressing migration in Europe.",
    "published": "2025-09-23T18:43:50Z"
  },
  {
    "title": "Ryan Routh found guilty of 2024 attempted assassination of Trump in Florida",
    "url": "https://www.theguardian.com/us-news/2025/sep/23/ryan-routh-verdict-trump-assassination-attempt",
    "image": "https://media.guim.co.uk/75645feb31a36626bdd941333dbf2401bf34f6f4/421_0_2104_1683/500.jpg",
    "summary": "Routh represented himself in court regarding his failed assassination attempt on Donald Trump at a West Palm Beach golf course. The trial focused on the circumstances of the incident and Routh's defense strategy. The case garnered significant media attention due to its high-profile nature.",
    "published": "2025-09-23T18:39:22Z"
  },
  {
    "title": "Is Copenhagen drone incursion further evidence of Russian interest in allied airspace?",
    "url": "https://www.theguardian.com/world/2025/sep/23/is-copenhagen-drone-incursion-further-evidence-of-russian-interest-in-allied-airspace",
    "image": "https://media.guim.co.uk/9d54101e715e3f3bf93f7b7bb7b7a11fd75625f7/321_0_3643_2915/500.jpg",
    "summary": "The Kremlin's recent assertiveness is prompting NATO to adapt to new challenges. In response, NATO is strengthening its air policing in Eastern Europe by deploying additional fighter jets. This marks a significant shift in the alliance's strategy to address security concerns in the region.",
    "published": "2025-09-23T18:36:14Z"
  }
]