[
  {
    "title": "News live: UNSW signs Australia’s biggest education deal to roll out ChatGPT to staff",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/16/australia-news-live-sydney-airport-social-media-ban-anthony-albanese-chris-bowen-climate-crisis-carbon-emissions-png-treaty-ntwnfb",
    "image": "https://media.guim.co.uk/70f8c41c8d4b7c2abc871536bad195e71c4ec6ce/559_0_3863_3092/500.jpg",
    "summary": "Could you please provide the news article or details that you would like me to summarize?",
    "published": "2025-09-16T04:34:06Z"
  },
  {
    "title": "Country diary: Sometimes only the most rotten fruit will do | Mark Cocker",
    "url": "https://www.theguardian.com/environment/2025/sep/16/country-diary-sometimes-only-the-most-rotten-fruit-will-do",
    "image": "https://media.guim.co.uk/618d71bc34a375342857b31f1638b85e9a5a21b7/342_0_3081_2465/500.jpg",
    "summary": "In Buxton, Derbyshire, most of the discovered apples have been consumed by jackdaws and crows. However, a group of a dozen red admirals has arrived, indicating their interest in the apples. The presence of these butterflies highlights the diverse interactions within the local ecosystem.",
    "published": "2025-09-16T04:30:26Z"
  },
  {
    "title": "Golden George Beamish delivers kick for New Zealand athletics at world championships | Jack Snape",
    "url": "https://www.theguardian.com/sport/2025/sep/16/golden-george-beamish-delivers-kick-for-new-zealand-athletics-at-world-championships",
    "image": "https://media.guim.co.uk/acf192cdef02cbea771cb4690b10ba7ee8dc943b/201_0_2706_2165/500.jpg",
    "summary": "A Kiwi steeplechaser reflects on a near-fatal fall during the heats, viewing it as a possible blessing in disguise. This incident may have motivated him to perform exceptionally well. Ultimately, he went on to achieve historic success in Tokyo.",
    "published": "2025-09-16T04:12:21Z"
  },
  {
    "title": "Rebel Royals: An Unlikely Love Story review – the one about the princess and the ‘soul-sexual’ shaman",
    "url": "https://www.theguardian.com/tv-and-radio/2025/sep/16/rebel-royals-an-unlikely-love-story-review-the-one-about-the-princess-and-the-soul-sexual-shaman",
    "image": "https://media.guim.co.uk/6ed9a2c4dbf9d42295558da5afe3c5d7bea4456c/460_42_2647_2118/500.jpg",
    "summary": "A new documentary explores the surprising marriage between Norwegian royalty and Gwyneth Paltrow’s healer, portraying it in a light and superficial manner. The film highlights their unconventional love story and even features a nod of approval from Prince Harry. The narrative raises eyebrows but ultimately lacks depth.",
    "published": "2025-09-16T04:00:29Z"
  },
  {
    "title": "‘Cricket gave me everything’: South African sports star brings township children into the game",
    "url": "https://www.theguardian.com/global-development/2025/sep/16/gary-kirsten-cricket-south-africa-catch-trust-cape-town-khayelitsha-township",
    "image": "https://media.guim.co.uk/ba6d0d7cc768eb5035018dce52e19d3a4fe8e578/115_0_5600_4480/500.jpg",
    "summary": "Gary Kirsten, a renowned international cricketer and coach, considers his involvement in Khayelitsha, Cape Town, as one of the pinnacle experiences of his cricketing journey. His work there highlights his commitment to community development through sports. Kirsten's efforts in the area emphasize the positive impact of cricket beyond just the game.",
    "published": "2025-09-16T04:00:28Z"
  }
]