[
  {
    "title": "Rangers v Celtic: Scottish Premiership updates – live",
    "url": "https://www.theguardian.com/football/live/2025/aug/31/rangers-v-celtic-scottish-premiership-updates-live",
    "image": "https://media.guim.co.uk/742910d67d1075ee1eecbdf3635c328a029e7274/103_0_2366_1892/500.jpg",
    "summary": "Daniel Harris will provide live minute-by-minute coverage of the highly anticipated Old Firm match between Rangers and Celtic at Ibrox. Fans can expect real-time updates and insights throughout the game. Stay tuned for the latest action and developments as the rivalry unfolds.",
    "published": "2025-08-31T13:05:02Z"
  },
  {
    "title": "F1: Dutch Grand Prix updates – live",
    "url": "https://www.theguardian.com/sport/live/2025/aug/31/f1-formula-one-dutch-grand-prix-updates-live",
    "image": "https://media.guim.co.uk/22d04a673607918adbb0959738f7e9c80f7c5b62/500_0_5000_4000/500.jpg",
    "summary": "Dominic Booth will provide detailed lap-by-lap coverage of the Dutch Grand Prix at Zandvoort. Fans can follow along for insights and updates throughout the race. Stay tuned for live commentary and analysis.",
    "published": "2025-08-31T13:04:57Z"
  },
  {
    "title": "Brighton v Manchester City: Premier League updates – live",
    "url": "https://www.theguardian.com/football/live/2025/aug/31/brighton-v-manchester-city-premier-league-updates-live",
    "image": "https://media.guim.co.uk/6f0a821bcb3e61545e57f4b1eb0fb3f3ce63d3b7/110_117_3869_3094/500.jpg",
    "summary": "Tim de Lisle will provide live minute-by-minute updates of the Premier League match between Brighton and Manchester City. Fans can follow along for real-time coverage and insights. Stay tuned for analysis and highlights as the game unfolds.",
    "published": "2025-08-31T13:03:04Z"
  },
  {
    "title": "Putin, Modi and Erdoğan among leaders in China for talks with Xi",
    "url": "https://www.theguardian.com/world/2025/aug/31/putin-modi-erdogan-xi-china-talks",
    "image": "https://media.guim.co.uk/19e906af07f6662bacc1afaee9b204a6e7d1538a/215_0_1814_1452/500.jpg",
    "summary": "Chinese President Xi Jinping conducted bilateral meetings during the Shanghai Cooperation Organisation summit held in Tianjin. These discussions aimed to strengthen partnerships and cooperation among member nations. The summit highlighted China's strategic role in regional and international diplomacy.",
    "published": "2025-08-31T13:02:25Z"
  },
  {
    "title": "Why do sports trophies look so hideous?",
    "url": "https://www.theguardian.com/lifeandstyle/2025/aug/31/why-do-sports-trophies-look-so-hideous",
    "image": "https://media.guim.co.uk/8e01631ada0fd98a55d57d82937f5c412735edce/317_0_2851_2281/500.jpg",
    "summary": "A popular series invites readers to engage by answering questions from fellow readers, covering a wide range of topics from light-hearted curiosities to deep scientific and philosophical inquiries. This interactive format fosters community participation and exploration of diverse ideas. The series has been a staple for those seeking insights and perspectives on various subjects.",
    "published": "2025-08-31T13:01:30Z"
  }
]