[
  {
    "title": "Trump demands senators stay in Washington to solve shutdown as he heads to Florida – live",
    "url": "https://www.theguardian.com/us-news/live/2025/nov/07/donald-trump-government-shutdown-air-traffic-flights-snap-viktor-orban-hungary-ukraine-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/3e4de00b63eaba3ef8c10dd9f6b8f478f1d682d7/352_0_3018_2415/500.jpg",
    "summary": "The US president is traveling to his Florida resort while urging senators to remain in Washington, D.C. to address the ongoing government shutdown. He emphasizes the importance of reaching a resolution quickly. The call for action comes as the partial shutdown continues to impact government operations.",
    "published": "2025-11-07T23:14:06Z"
  },
  {
    "title": "Mother of transgender teen accuses Queensland government of privacy breach that could have ‘outed’ her child",
    "url": "https://www.theguardian.com/australia-news/2025/nov/08/mother-accuses-queensland-government-privacy-breach-sharing-medical-details-outing-transgender-child-ntwnfb",
    "image": "https://media.guim.co.uk/bce7668920b9c135e1bc96cd50d86e4b4a49fe0a/688_0_6880_5504/500.jpg",
    "summary": "The LNP has faced allegations of \"intimidation\" after requesting sensitive medical information from the parents of transgender children. This demand has raised concerns about privacy and the treatment of transgender individuals. Critics are calling for accountability regarding the party's approach to sensitive issues affecting vulnerable communities.",
    "published": "2025-11-07T23:12:15Z"
  },
  {
    "title": "The Victorian government is cracking down on underquoting property agents. What is being proposed and will it work?",
    "url": "https://www.theguardian.com/australia-news/2025/nov/08/victoria-government-cracking-down-on-underquoting-property-agents",
    "image": "https://media.guim.co.uk/6a4e2465ac6286a2d5263f2e67acd4e8f1bf1ea4/0_0_3333_2667/500.jpg",
    "summary": "New guidelines have been introduced to help real estate agents select the most comparable properties for home price estimation. However, experts believe that broader reforms are necessary to improve the overall accuracy and fairness of home valuations. Addressing these issues could enhance transparency in the housing market.",
    "published": "2025-11-07T23:00:47Z"
  },
  {
    "title": "Will Labor’s environment laws actually address Australia’s biodiversity crisis? Five reasons to be concerned",
    "url": "https://www.theguardian.com/australia-news/2025/nov/08/labor-environment-laws-australia-biodiversity-crisis-five-reasons-concerned",
    "image": "https://media.guim.co.uk/1c08a5b7419dc77b4852786cfa2cad68885f85b1/87_0_4787_3830/500.jpg",
    "summary": "Experts warn that the proposed legislation is flawed due to excessive ministerial discretion and lenient comparison rules for offsets. They argue that these issues might undermine the intended effectiveness of the laws. Concerns have been raised about the potential negative impact on accountability and environmental standards.",
    "published": "2025-11-07T23:00:47Z"
  },
  {
    "title": "In a world with democracy in decline, we have much to learn from those who rallied against Whitlam’s dismissal | Frank Bongiorno and James Watson",
    "url": "https://www.theguardian.com/commentisfree/2025/nov/07/in-a-world-with-democracy-in-decline-we-have-much-to-learn-from-those-who-rallied-against-whitlams-dismissal",
    "image": "https://media.guim.co.uk/ff614c5c54c0c54de115d9263e0b1ae45796cddd/0_702_5152_4118/500.jpg",
    "summary": "In 1975, the dismissal of Australia's democratically elected government shocked many citizens. Most people viewed the event as an unprecedented political upheaval rather than a routine occurrence. The incident marked a significant moment in the country's political history.",
    "published": "2025-11-07T23:00:47Z"
  }
]