[
  {
    "title": "Australia news live: Melbourne stabbing deaths have ‘hallmarks’ of a youth gang crime, police say; Palestine supporters met by counter protesters at Bondi beach",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/07/australia-news-live-melbourne-stabbing-nsw-koala-national-park-logging-anthony-albanese-sussan-ley-immigration-ntwnfb",
    "image": "https://media.guim.co.uk/a4b3dcce3fabe688e19f1272d501dd0bb9593560/554_0_4875_3900/500.jpg",
    "summary": "I apologize, but I don't have access to live news feeds or current events. If you can provide the details or content you would like summarized, I'd be happy to help!",
    "published": "2025-09-07T03:05:42Z"
  },
  {
    "title": "Mexican festivals in Chicago canceled amid Trump plans to deploy troops",
    "url": "https://www.theguardian.com/us-news/2025/sep/06/chicago-mexican-independence-day-trump",
    "image": "https://media.guim.co.uk/482b77e6fc7a9135dbb93d47e522e0ccfbd3acd1/293_0_2915_2333/500.jpg",
    "summary": "Cities and suburbs have canceled local events related to Mexican Independence Day on September 16 due to concerns over safety and potential unrest. The decision reflects ongoing tensions in the community and a desire to prioritize public safety. Organizers are exploring alternatives to celebrate the holiday in a secure manner.",
    "published": "2025-09-07T02:37:01Z"
  },
  {
    "title": "Trump news at a glance: Anxiety in Chicago as Trump plans to send troops; postal traffic into US drops 80% ",
    "url": "https://www.theguardian.com/us-news/2025/sep/07/trump-administration-news-updates-today",
    "image": "https://media.guim.co.uk/8940caf0f1316668d1d47f8a291785dd38b76503/509_0_5031_4024/500.jpg",
    "summary": "Mexican festivals have been canceled due to concerns about possible targeting, reflecting heightened security fears. Additionally, the end of tariff exemptions has led to a significant decrease in parcels sent to the United States. These developments highlight ongoing tensions and challenges affecting US-Mexico relations.",
    "published": "2025-09-07T02:06:31Z"
  },
  {
    "title": "Winter of the Crow review – Lesley Manville commands cold war thriller",
    "url": "https://www.theguardian.com/film/2025/sep/06/winter-of-the-crow-review-lesley-manville",
    "image": "https://media.guim.co.uk/2c6228eae10edc123fd11cebecaee9e45128c227/0_0_3871_3096/500.jpg",
    "summary": "The Oscar nominee delivers a captivating performance as a heroine in a gripping story. The film follows a professor ensnared in a nightmarish situation. It combines solid storytelling with moments of suspense, keeping viewers engaged.",
    "published": "2025-09-07T01:00:06Z"
  },
  {
    "title": "The division exposed by the March for Australia was a test for our politicians. They failed it – and put the nation last | Zoe Daniel",
    "url": "https://www.theguardian.com/commentisfree/2025/sep/07/division-exposed-by-march-for-australia-test-for-politicians-they-failed-it-put-nation-last-ntwnfb",
    "image": "https://media.guim.co.uk/bdd4567c98af065c0163524b673503f18ba3357b/1_832_5551_4443/500.jpg",
    "summary": "Parliamentary sessions often devolve into personal attacks among politicians, lacking meaningful and constructive debate. This confrontational atmosphere highlights the challenges of fostering productive dialogue in governance. Critics are concerned that such behavior undermines the legislative process and public trust.",
    "published": "2025-09-07T00:00:05Z"
  }
]