[
  {
    "title": "Australia news live: 13-year-old boy among five teenagers charged with murder over alleged stabbing near Wollongong",
    "url": "https://www.theguardian.com/australia-news/live/2025/oct/15/australia-news-live-liberals-infighting-james-paterson-sussan-ley-andrew-hastie-superannuation-jim-chalmers-ntwnfb",
    "image": "https://media.guim.co.uk/ff164658512fbf593a7b520a45e3c8cf21a577e0/247_0_2471_1977/500.jpg",
    "summary": "I'm sorry, but I need the specific news content you would like me to summarize. Please provide the details or text, and I'll be happy to help!",
    "published": "2025-10-15T04:22:43Z"
  },
  {
    "title": "EU executive to propose short-term rental rules to tackle ‘social crisis’ in housing",
    "url": "https://www.theguardian.com/world/2025/oct/15/eu-executive-short-term-rental-rules-affordable-housing-plan",
    "image": "https://media.guim.co.uk/ae7f85b3fd95b5ec4082f11a93d15a74cf1ef32b/1025_0_5127_4101/500.jpg",
    "summary": "The Bloc has unveiled its first affordable housing plan, which addresses key issues including tenants' rights, property speculation, and the regulation of tourist rentals. The initiative aims to improve housing accessibility and affordability for residents. This comprehensive approach seeks to tackle the diverse challenges facing the housing market.",
    "published": "2025-10-15T04:01:13Z"
  },
  {
    "title": "Digital ID: Danes and Estonians find it ‘pretty uncontroversial’",
    "url": "https://www.theguardian.com/politics/2025/oct/15/digital-id-denmark-estonia-uncontroversial-concerns-security-privacy",
    "image": "https://media.guim.co.uk/4035e7b7eff3d81c9e1f6c60ed048be1af0ed7c4/74_0_1927_1541/500.jpg",
    "summary": "Citizens in the UK have enrolled in a new system without much resistance, although there are notable concerns regarding security and privacy. The move aims to streamline processes for individuals. Despite enrollment enthusiasm, the apprehensions highlight the need for addressing important issues related to data protection.",
    "published": "2025-10-15T04:01:12Z"
  },
  {
    "title": "Pupils fear AI is eroding their ability to study, research finds",
    "url": "https://www.theguardian.com/technology/2025/oct/15/pupils-fear-ai-eroding-study-ability-research",
    "image": "https://media.guim.co.uk/60642396442850806f62b0f907723a563983398b/376_0_4467_3574/500.jpg",
    "summary": "A recent survey reveals that one in four students believe AI tools make it too easy to obtain answers to their questions. This raises concerns about the impact of AI on learning and critical thinking skills. Educators may need to address these challenges to maintain academic integrity.",
    "published": "2025-10-15T04:00:13Z"
  },
  {
    "title": "UK must prepare buildings for 2C rise in global temperature, government told",
    "url": "https://www.theguardian.com/environment/2025/oct/15/uk-prepare-buildings-2c-rise-temperature",
    "image": "https://media.guim.co.uk/9466106d51a09d55d3e21aae218454b06aed4fb8/688_0_6880_5504/500.jpg",
    "summary": "Climate advisers have highlighted that existing strategies to safeguard against extreme weather events are insufficient. They emphasize the need for more robust and comprehensive measures to address the growing threats posed by climate change. Immediate action is essential to enhance resilience and protect vulnerable communities.",
    "published": "2025-10-15T04:00:13Z"
  }
]