[
  {
    "title": "World Cup 2026 draw: updates as the teams await fate in Washington DC – live",
    "url": "https://www.theguardian.com/football/live/2025/dec/05/world-cup-2026-draw-updates-usa-mexico-canada",
    "image": "https://media.guim.co.uk/9aea9c8d7b159915e55ac3e7699bec4167b71a9b/680_0_4456_3566/500.jpg",
    "summary": "Writers will provide live updates from the draw in Washington, D.C. for the upcoming 48-team tournament scheduled for next summer. Stay tuned for details on team matchups and event highlights. Don't miss the excitement of this significant sports event!",
    "published": "2025-12-05T16:27:10Z"
  },
  {
    "title": "Mejbri banned for spitting at Leeds fans, Merino may keep place as Arsenal striker – football live",
    "url": "https://www.theguardian.com/football/live/2025/dec/05/world-cup-draw-buildup-premier-league-news-and-more-football-live",
    "image": "https://media.guim.co.uk/016d13596c995009be0e40c74c9304c86f67b058/239_0_3031_2426/500.jpg",
    "summary": "England and Scotland will find out their World Cup prospects as they head into a busy weekend. The latest updates and news will be shared by our writers. Stay tuned for important developments in the teams' futures.",
    "published": "2025-12-05T16:24:36Z"
  },
  {
    "title": "Cloudflare admits ‘we have let the Internet down again’ after outage hits major web services – business live",
    "url": "https://www.theguardian.com/business/live/2025/dec/05/uk-house-prices-affordability-stock-markets-us-inflation-ftse-pound-business-live-news-updates",
    "image": "https://media.guim.co.uk/f11c500caeb6f5871ee44741e6a134786df63b97/500_0_5000_4000/500.jpg",
    "summary": "Cloudflare is currently investigating problems affecting the Cloudflare Dashboard and its associated APIs. Users may experience disruptions as the company works to resolve these issues. Further updates will be provided as the situation develops.",
    "published": "2025-12-05T16:18:14Z"
  },
  {
    "title": "CDC advisory panel votes to limit hepatitis B vaccines for newborns",
    "url": "https://www.theguardian.com/us-news/2025/dec/05/cdc-panel-rfk-hepatitis-b-vaccine",
    "image": "https://media.guim.co.uk/f04215caa9c9291951e251021a8018f843520940/333_0_3333_2667/500.jpg",
    "summary": "Advisers to Robert F. Kennedy Jr. are adopting strategies similar to those of former President Donald Trump's team regarding vaccine guidance. This shift indicates a push towards undermining established health policies. The trend reflects a broader movement among certain political figures to challenge conventional vaccine recommendations.",
    "published": "2025-12-05T16:13:36Z"
  },
  {
    "title": "Saracens hatch plan to put dent in French dominance against Clermont",
    "url": "https://www.theguardian.com/sport/2025/dec/05/saracens-hatch-plan-to-put-dent-in-french-dominance-against-clermont",
    "image": "https://media.guim.co.uk/6b5e7bcd69bbae2cc385fd0ea2e154f5bdb8561e/287_0_3968_3175/500.jpg",
    "summary": "Despite the absence of key players Maro Itoje, Ben Earl, and Jamie George, the English club is prepared to field a strong team. They are gearing up to face a weakened rival. The matchup promises to showcase the club's depth and resilience.",
    "published": "2025-12-05T16:11:47Z"
  }
]