[
  {
    "title": "Dip in UK inflation to 3.6% lifts hopes for December rate cut – business live",
    "url": "https://www.theguardian.com/business/live/2025/nov/19/uk-inflation-cpi-budget-sterling-pound-stocks-bonds-bank-of-england-interest-rates-business-live",
    "image": "https://media.guim.co.uk/2da76c80ecea91918577b15fd1576eca5cf95eca/417_0_4167_3333/500.jpg",
    "summary": "Chancellor Rachel Reeves is closely monitoring inflation data in preparation for her autumn budget. The budget is scheduled to be presented next Wednesday. It comes amid ongoing concerns about inflation levels.",
    "published": "2025-11-19T09:19:15Z"
  },
  {
    "title": "‘Probably won’t have to work at IGA ever again’: Amyl and the Sniffers dominate 2025 Arias with four wins",
    "url": "https://www.theguardian.com/music/2025/nov/19/probably-wont-have-to-work-at-iga-ever-again-amyl-and-the-sniffers-dominate-2025-arias-with-four-wins",
    "image": "https://media.guim.co.uk/d95b6b3fc313c8b9d8d44b797cd9bc22d63a88eb/1000_0_5000_4000/500.jpg",
    "summary": "The rock band won the Album of the Year award, highlighting their significant achievement. Meanwhile, electronic artist Ninajirachi, who received eight nominations, was recognized as Best Solo Artist. Both accolades showcase the diverse talents in the music industry.",
    "published": "2025-11-19T09:16:23Z"
  },
  {
    "title": "Poland rail sabotage blasts ‘act of state terrorism’ by Russia, says Polish foreign minister – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/nov/19/russia-ukraine-poland-zelenskyy-germany-sweden-turkey-europe-live-latest-news-updates",
    "image": "https://media.guim.co.uk/905ae3cd6a787867e47c7b7b709777d7dff350f8/388_0_3880_3104/500.jpg",
    "summary": "Poland's Radosław Sikorski announced that the country will respond to recent incidents with actions beyond diplomacy. He also confirmed the withdrawal of consent for the last Russian consulate operating in Poland. This move marks a significant escalation in Poland's stance toward Russia.",
    "published": "2025-11-19T09:11:47Z"
  },
  {
    "title": "UK lacks defence strategy, MPs say, as plan unveiled for more weapons factories – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/nov/19/pmqs-uk-politics-latest-news-john-healey-rachel-reeves-keir-starmer-labour",
    "image": "https://media.guim.co.uk/79a811cf3d284bf5cdbda12214ac0530210f9e94/638_0_4492_3593/500.jpg",
    "summary": "In a recent speech, the Defence Secretary pledged to invest in establishing advanced manufacturing facilities in the UK. This initiative aims to enhance the country's defense capabilities and support the economy. The commitment reflects a broader strategy to modernize Britain's industrial base.",
    "published": "2025-11-19T09:10:39Z"
  },
  {
    "title": "WH Smith chief steps down after accounting error slashes profits",
    "url": "https://www.theguardian.com/business/2025/nov/19/wh-smith-ceo-accounting-error-profits-carl-cowling",
    "image": "https://media.guim.co.uk/f564b0abccd6495c78d7db6d3a1243c19129a1a9/3_155_4081_3266/500.jpg",
    "summary": "A significant error was found in a company in August, leading to a nearly £600 million decline in its market value. This blunder had a substantial financial impact, prompting concerns among investors. The revelation of the mistake impacted the company's reputation and stock performance.",
    "published": "2025-11-19T09:10:05Z"
  }
]