[
  {
    "title": "Trump says ‘for the most part, there is consensus’ on next stages of Gaza ceasefire plan – live",
    "url": "https://www.theguardian.com/world/live/2025/oct/11/israel-gaza-ceasefire-hamas-hostages-netanyahu-trump-middle-east-latest-news-updates",
    "image": "https://media.guim.co.uk/286e2b42409fca55e1390fbf503b01077dfa1bcb/252_0_3780_3024/500.jpg",
    "summary": "US President stated that Hamas is currently gathering hostages as displaced Palestinians begin returning to northern Gaza. This indicates ongoing tensions in the region amid humanitarian concerns. The situation remains fluid as efforts to address both security and humanitarian needs continue.",
    "published": "2025-10-11T12:34:34Z"
  },
  {
    "title": "England v Sri Lanka: Women’s Cricket World Cup – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/11/england-v-sri-lanka-womens-cricket-world-cup-live",
    "image": "https://media.guim.co.uk/fda74251e186dfb2397a21560c219c9121d058a9/318_0_2661_2129/500.jpg",
    "summary": "Nat Sciver-Brunt's team is currently competing against Sri Lanka in a cricket match. Writers are providing live, over-by-over updates on the game. Fans can follow along for real-time insights and action.",
    "published": "2025-10-11T12:33:09Z"
  },
  {
    "title": "‘Hits the nose like wasabi’: the best (and worst) supermarket English mustard, tasted and rated",
    "url": "https://www.theguardian.com/thefilter/2025/oct/11/best-supermarket-english-mustard-taste-test",
    "image": "https://media.guim.co.uk/99bb9503d4a602a1ff2a1bc7105a6eabd3293554/24_0_5854_4684/500.jpg",
    "summary": "Mustard is a popular condiment known for its complex flavors while being easy to prepare. The article explores the best mustard brands and flavors to try. It aims to guide readers in selecting must-try jars that enhance their culinary experiences.",
    "published": "2025-10-11T12:00:23Z"
  },
  {
    "title": "‘Page one of the authoritarian playbook’: how Trump and allies are exploiting Kirk’s killing",
    "url": "https://www.theguardian.com/us-news/2025/oct/11/charlie-kirk-trump-maga-allies",
    "image": "https://media.guim.co.uk/89ccb2c1b4596f77f797756bfd965c44886e7ebe/687_0_6882_5504/500.jpg",
    "summary": "President and his MAGA allies are leveraging the killing of a right-wing influencer to launch attacks on their critics. Experts caution that this tactic seeks to discredit opposition voices. The situation highlights ongoing tensions within the political landscape.",
    "published": "2025-10-11T12:00:23Z"
  },
  {
    "title": "‘It’s a question of humanity’: how a small Spanish town made headlines over its immigration stance",
    "url": "https://www.theguardian.com/world/2025/oct/11/small-spanish-town-headlines-immigration-villamalea",
    "image": "https://media.guim.co.uk/50a7b541e661df9ac8a0a7f1ed23aee3509bd4d5/0_0_5000_4000/500.jpg",
    "summary": "The mayor of Villamalea highlighted the town's unanimous decision to support the regularization of undocumented migrants, emphasizing a collective commitment to community welfare. The initiative transcended party lines, showcasing a shared recognition of the contributions migrants make to society. This move aims to create a more inclusive environment for all residents.",
    "published": "2025-10-11T12:00:22Z"
  }
]