[
  {
    "title": "Trump-Orbán meeting: US gives Hungary exemption from sanctions on Russian oil and gas",
    "url": "https://www.theguardian.com/us-news/2025/nov/07/trump-orban-hungary-russian-oil",
    "image": "https://media.guim.co.uk/9bb51742b8e3abb37daa2dd2615059cf2b7a2062/422_0_2796_2236/500.jpg",
    "summary": "During a recent summit at the White House, U.S. President praised Hungarian Prime Minister Viktor Orbán for his strict immigration policies. The meeting highlighted the friendly ties between the two leaders and their shared views on immigration issues. The discussion further emphasized the strengthening of relations between the U.S. and Hungary.",
    "published": "2025-11-08T04:02:44Z"
  },
  {
    "title": "Graham ‘Richo’ Richardson, former Labor party powerbroker, dies aged 76",
    "url": "https://www.theguardian.com/australia-news/2025/nov/08/graham-richardson-dies-richo-former-labor-party-powerbroker-dead-at-76",
    "image": "https://media.guim.co.uk/b599927f6e85f329178d022b125deb2bff94b3e3/531_334_2428_1942/500.jpg",
    "summary": "Former NSW senator and factional enforcer has passed away at the age of 76 following a prolonged illness. His contributions to the political landscape were significant during his tenure. Tributes are expected to honor his legacy and influence in Australian politics.",
    "published": "2025-11-08T03:58:06Z"
  },
  {
    "title": "Federal judge issues permanent ban on deployment of national guard troops in Portland – as it happened",
    "url": "https://www.theguardian.com/us-news/live/2025/nov/07/donald-trump-government-shutdown-air-traffic-flights-snap-viktor-orban-hungary-ukraine-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/6558cde3d21ccc0d3d79e16264b91d78a8c3ea96/0_0_5417_4334/500.jpg",
    "summary": "The live blog has officially concluded, and no further updates will be provided. Readers can refer to previous entries for the latest information. Thank you for following along.",
    "published": "2025-11-08T03:03:36Z"
  },
  {
    "title": "Ukraine war briefing: Russia unleashes attack on energy infrastructure, triggering power cuts",
    "url": "https://www.theguardian.com/world/2025/nov/08/ukraine-war-briefing-russia-unleashes-attack-on-energy-infrastructure-triggering-power-cuts",
    "image": "https://media.guim.co.uk/aab3bcd9c98a6a4aa9c07965fb51658896be98a1/103_0_4558_3648/500.jpg",
    "summary": "Ukrainian officials report a significant escalation in attacks on its power grid by Moscow, as President Volodymyr Zelenskyy warns of Russian troop concentrations near the northeastern city. This situation unfolds on the 1,354th day of the ongoing conflict. Concerns grow over potential threats to the nation's energy infrastructure and security.",
    "published": "2025-11-08T02:38:00Z"
  },
  {
    "title": "‘Huge victory’ in Portland as judge’s final order bars Trump from sending national guard",
    "url": "https://www.theguardian.com/us-news/2025/nov/07/final-order-trump-national-guard-portland",
    "image": "https://media.guim.co.uk/11040e12783ee2e7e8776a458837e1f4aef25cb2/6_0_4583_3667/500.jpg",
    "summary": "Karin Immergut stated that she did not find any credible evidence suggesting that the protests in the Oregon city were out of control. Her remarks come amidst ongoing discussions about the nature and impact of the protests. This statement potentially addresses concerns raised by the public and officials regarding the protests' escalation.",
    "published": "2025-11-08T02:35:03Z"
  }
]