[
  {
    "title": "British leftwingers elated by Zohran Mamdani’s victory in New York, with some saying election has lessons for Labour – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/nov/05/david-lammy-pmqs-rachel-reeves-tax-system-news-updates-uk-politics-live",
    "image": "https://media.guim.co.uk/a37d81a317bc872fdc2b9693af57296786e4ff9d/750_0_3750_3000/500.jpg",
    "summary": "Sadiq Khan, Zack Polanski, and Zarah Sultana are among left-leaning figures who are praising the recently elected mayor. They view the mayor's election as a potential blueprint for future elections in the UK. This reflects a strategic interest in reinforcing progressive policies and leadership.",
    "published": "2025-11-05T11:18:05Z"
  },
  {
    "title": "New York mayor-elect Zohran Mamdani challenges Donald Trump in victory speech as Democrats win key US election races – live",
    "url": "https://www.theguardian.com/us-news/live/2025/nov/04/nyc-mayor-election-zohran-mamdani-andrew-cuomo-results-latest",
    "image": "https://media.guim.co.uk/a8a175efb88ab9a3e3fab71c8a0ee2e6bf4486ed/349_0_2972_2379/500.jpg",
    "summary": "Mamdani criticized the rise of oligarchy and authoritarianism, addressing Trump directly in his speech. His comments followed significant victories for Democrats in California's redistricting vote, as well as in the gubernatorial elections in New Jersey and Virginia. These wins reflect a broader rejection of Republican influence in key states.",
    "published": "2025-11-05T11:17:20Z"
  },
  {
    "title": "Multiple people reported injured after car driven into pedestrians in southwestern France – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/nov/05/latest-europe-live-news-updates-brussels-drones-eu",
    "image": "https://media.guim.co.uk/e0e3c0f6323ab0946359190156af9cbaa6026e28/0_0_2995_2396/500.jpg",
    "summary": "The interior minister announced that a suspect is in custody following an incident where a car deliberately crashed into pedestrians and cyclists. Authorities are investigating the situation. No further details about the motive or extent of injuries have been released yet.",
    "published": "2025-11-05T11:09:05Z"
  },
  {
    "title": "European markets down and Asian chipmakers tumble in global stock sell-off amid worries over AI bubble – business live",
    "url": "https://www.theguardian.com/business/live/2025/nov/05/china-ends-tariffs-us-imports-soy-bean-levies-ms-profits-cyber-attack-business-live",
    "image": "https://media.guim.co.uk/ef313969412c0efbaaf739ff575ab84507d5bf13/407_0_4400_3521/500.jpg",
    "summary": "Deutsche Bank expresses concerns that an equity correction may be imminent, highlighting growing market apprehensions. Meanwhile, China has announced the removal of tariffs on U.S. imports, including agricultural products, although soybean levies remain in place. This development could impact trade relations between the two countries.",
    "published": "2025-11-05T11:06:43Z"
  },
  {
    "title": "Bibi Rukiya’s Restless Daughter review – Lorca’s matriarch sparks tragic dance of desire",
    "url": "https://www.theguardian.com/stage/2025/nov/05/bibi-rukiyas-restless-daughter-review-dance-the-place-london",
    "image": "https://media.guim.co.uk/1958f11e7f052481be280d85cb3a1233867360f5/545_382_3139_2512/500.jpg",
    "summary": "Choreographer Amina Khayyam draws inspiration from \"The House of Bernarda Alba\" to delve into the complex interplay of tradition, freedom, fear, and love. Her work reflects on the emotional and societal tensions that arise from these themes. The performance aims to resonate with contemporary audiences while paying homage to the original narrative.",
    "published": "2025-11-05T11:01:18Z"
  }
]