[
  {
    "title": "Australia news live: failed Liberal candidate for Kooyong to make tilt for state seat",
    "url": "https://www.theguardian.com/australia-news/live/2025/oct/17/australia-news-live-sussan-ley-anthony-albanese-trump-meeting-foi-climate-laws-ntwnfb",
    "image": "https://media.guim.co.uk/451fff2c8a382eccac3d99535a79629c7b56d072/1281_0_3926_3141/500.jpg",
    "summary": "I'm sorry, but I need more context or the content of the news article you want summarized. Please provide the information, and I'll assist you!",
    "published": "2025-10-17T06:13:06Z"
  },
  {
    "title": "Rumours of My Demise by Evan Dando review – eye-popping tales of drugs and unpredictability",
    "url": "https://www.theguardian.com/books/2025/oct/17/rumours-of-my-demise-by-evan-dando-review-eye-popping-tales-of-drugs-and-unpredictability",
    "image": "https://media.guim.co.uk/f52a51fd787a8462964fbdc393e9d2449dda414d/229_0_2542_2033/500.jpg",
    "summary": "An indie-pop artist candidly shares his journey to fame, highlighting both his success and the public humiliations he faced along the way. His honest storytelling resonates with fans and offers a glimpse into the complexities of celebrity life. The artist's transparency fosters a deeper connection with his audience, making his experiences relatable.",
    "published": "2025-10-17T06:01:03Z"
  },
  {
    "title": "Nobody Wants This to Harlan Coben’s Lazarus: the seven best shows to stream this week",
    "url": "https://www.theguardian.com/tv-and-radio/2025/oct/17/nobody-wants-this-to-harlan-cobens-lazarus-the-seven-best-shows-to-stream-this-week",
    "image": "https://media.guim.co.uk/47d42fc0d3bbad6f8c4a7e14da363647cf87c30d/425_18_2875_2300/500.jpg",
    "summary": "Kristen Bell and Adam Brody reunite as a podcasting couple in a vibrant romcom showcasing their strong chemistry. Meanwhile, Sam Claflin and Bill Nighy feature in the author's latest whimsically absurd mystery. Both projects promise engaging performances and entertaining narratives.",
    "published": "2025-10-17T06:00:04Z"
  },
  {
    "title": "What the datacenter boom means for America’s environment – and electricity bills",
    "url": "https://www.theguardian.com/environment/2025/oct/16/what-the-data-center-boom-means-for-americas-environment-and-electricity-bills",
    "image": "https://media.guim.co.uk/17cee654604e2de48077356d619ea231b9abb2e0/1301_875_2683_2147/500.jpg",
    "summary": "This week's newsletter highlights the increasing economic and environmental impact of datacenters operated by major tech companies like Google, Amazon, and OpenAI. The rising costs associated with energy consumption and climate change repercussions are becoming more prominent. Attention to sustainable practices in the tech industry is crucial as these challenges escalate.",
    "published": "2025-10-17T06:00:04Z"
  },
  {
    "title": "‘A fashion and art moment’: how mediums mix at Frieze art fair",
    "url": "https://www.theguardian.com/artanddesign/2025/oct/17/a-fashion-and-art-moment-how-mediums-mix-at-frieze-art-fair",
    "image": "https://media.guim.co.uk/50d6a93126f4ca8f8d9d42b51ddc2614b92107ca/0_0_6438_5152/500.jpg",
    "summary": "The relationship between fashion and art has deepened over the past decade, with fashion gaining increased relevance at London’s contemporary art showcase. This growing intersection highlights how fashion influences and enhances artistic expression. As a result, the event has become a significant platform for showcasing this evolving collaboration.",
    "published": "2025-10-17T06:00:04Z"
  }
]