[
  {
    "title": "England v South Africa: first men’s T20 international – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/10/england-v-south-africa-first-mens-t20-international-live",
    "image": "https://media.guim.co.uk/6e864a3093ae553bbdf9b640cd4ed57b2261752a/224_0_2500_2000/500.jpg",
    "summary": "Tim de Lisle will provide live over-by-over commentary for the first men's T20 match between England and South Africa taking place in Cardiff. The coverage is set to engage fans with real-time updates and insights. Tune in to follow the action as both teams compete.",
    "published": "2025-09-10T21:20:55Z"
  },
  {
    "title": "Donald Trump says Charlie Kirk has died after being shot at university event – latest updates",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/10/donald-trump-jeffrey-epstein-tariffs-immigration-crime-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/2673fb19ee0d09b38b7c9c4de993bd283a9eb6e7/313_215_3046_2437/500.jpg",
    "summary": "A rightwing activist was shot at midday local time, prompting an investigation. The university involved has confirmed that the suspect is not currently in custody. Authorities are working to find out more details about the incident.",
    "published": "2025-09-10T21:15:06Z"
  },
  {
    "title": "Charlie Kirk shooting – what we know so far",
    "url": "https://www.theguardian.com/us-news/2025/sep/10/charlie-kirk-shooting-what-we-know",
    "image": "https://media.guim.co.uk/6178eba4d5c366b81f6a9fc45730fcd80313ef28/55_0_3333_2667/500.jpg",
    "summary": "Turning Point USA's executive director was shot during an event at Utah Valley University and has died, according to former President Donald Trump. The incident has raised concerns about safety at political gatherings. Further details regarding the shooting and the investigation are still emerging.",
    "published": "2025-09-10T20:59:16Z"
  },
  {
    "title": "Morning Mail: who is funding our thinktanks, Donald Trump ally shot in US, Tim Wilson’s costly sharemarket bet",
    "url": "https://www.theguardian.com/australia-news/2025/sep/11/morning-mail-thursday-ntwnfb",
    "image": "https://media.guim.co.uk/a4b80705010e33260d210fcfd085b942a53be097/0_0_5000_4000/500.jpg",
    "summary": "Australian think tanks are experiencing a divide regarding the issue of funding transparency, with differing views on how openly they should disclose their financial backing. In unrelated news, Charlie Kirk, a prominent rightwing figure from the United States, was shot in Utah, prompting investigations into the incident. The circumstances surrounding both stories highlight ongoing discussions about transparency and safety in political environments.",
    "published": "2025-09-10T20:57:27Z"
  },
  {
    "title": "‘A lot of blood’: local reporters describe moment when Charlie Kirk was shot",
    "url": "https://www.theguardian.com/us-news/2025/sep/10/charlie-kirk-shooting-utah-reporters",
    "image": "https://media.guim.co.uk/63596f034ed058329fdcf3e9e6ccd91d22cd2271/333_0_3333_2667/500.jpg",
    "summary": "Emma Pitts and Eva Terry from Deseret News reported on an event featuring the executive director of Turning Point USA (TPUSA). The coverage focused on key themes and messages conveyed during the speech. The event highlighted relevant political and social issues resonating with the audience.",
    "published": "2025-09-10T20:51:02Z"
  }
]