[
  {
    "title": "Aston Villa v Bologna, Rangers v Genk, and more: Europa League – live",
    "url": "https://www.theguardian.com/football/live/2025/sep/25/aston-villa-v-bologna-rangers-v-genk-and-more-europa-league-live",
    "image": "https://media.guim.co.uk/32b68e3a4b8322caab76ac675c3ca38c6d7695c5/746_0_6799_5439/500.jpg",
    "summary": "Daniel Harris will provide updates on Thursday's Europa League matches as Unai Emery's team begins their campaign. Fans can expect insights and coverage of the team's performance. Stay tuned for the latest developments throughout the matches.",
    "published": "2025-09-25T18:27:04Z"
  },
  {
    "title": "Billy Vigar, Chichester and former Arsenal player, dies after sustaining brain injury",
    "url": "https://www.theguardian.com/football/2025/sep/25/billy-vigar-chichester-and-former-arsenal-player-dies-after-sustaining-brain-injury",
    "image": "https://media.guim.co.uk/e4ca5484b187ee5a1e00db9e0f131bd2f6754fd4/275_171_2254_1802/500.jpg",
    "summary": "Billy Vigar, a forward for Chichester City, has tragically passed away at the age of 21 following a significant brain injury sustained during a match last Saturday. His death has deeply impacted the football community. Tributes are pouring in for the young athlete.",
    "published": "2025-09-25T18:23:02Z"
  },
  {
    "title": "US authorities remove Trump-Epstein statue from National Mall",
    "url": "https://www.theguardian.com/us-news/2025/sep/25/trump-epstein-statue-dc-removed",
    "image": "https://media.guim.co.uk/45de344fab883b08e16a11dbf7e84ef83b39787e/495_0_4948_3959/500.jpg",
    "summary": "The Interior Department announced that the National Park Service removed a statue of a pair holding hands due to an incorrect permit for its installation. The decision highlights the importance of adhering to regulations for public art. The statue's removal has raised discussions on permitting processes in national parks.",
    "published": "2025-09-25T18:22:19Z"
  },
  {
    "title": "Trump claims rise in political violence is ‘radical left causing this problem, not the right’ – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/25/donald-trump-james-comey-fbi-ice-texas-latest-us-politics-news-updates-live",
    "image": "https://media.guim.co.uk/f83c833ce0272b0c0ac36e4737fae25fc01fdf60/455_0_6020_4819/500.jpg",
    "summary": "President blamed political opponents for an incident where three detainees were shot during an attack on an immigration facility. He suggested that their actions contributed to the violence. The statement reflects ongoing tensions surrounding immigration policy and political accountability.",
    "published": "2025-09-25T18:21:52Z"
  },
  {
    "title": "Disney investors demand details into company’s Jimmy Kimmel suspension",
    "url": "https://www.theguardian.com/film/2025/sep/25/disney-investors-jimmy-kimmel-suspension-abc",
    "image": "https://media.guim.co.uk/d4b2041b272b131a7b9b8a2565e022f09bbbef6e/0_0_2887_2310/500.jpg",
    "summary": "Shareholders of ABC are demanding that the network's owner provide documents concerning the decision to temporarily suspend a late-night show. They believe this information is crucial for transparency and accountability. The request highlights ongoing concerns about management decisions and their impact on programming.",
    "published": "2025-09-25T18:18:43Z"
  }
]