[
  {
    "title": "Labour Together reportedly canvassing party members on leadership candidates – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/dec/08/labour-leadership-keir-starmer-conservatives-live-updates",
    "image": "https://media.guim.co.uk/b9cb0730fdafe4613d3c89394c56679a6726a2f5/1000_0_5000_4000/500.jpg",
    "summary": "Labour leader Keir Starmer is facing scrutiny following reports that local party groups have been asked to identify potential successors to lead the party in the next election. This inquiry has raised concerns about his leadership amid ongoing challenges within the party. Critics are questioning the implications of such a request for the party's unity and direction.",
    "published": "2025-12-08T11:13:27Z"
  },
  {
    "title": "Last Days review – Leith’s opera imagining the final moments of Kurt Cobain is truly disturbing",
    "url": "https://www.theguardian.com/music/2025/dec/08/last-days-review-leith-opera-kurt-cobain-linbury-london",
    "image": "https://media.guim.co.uk/0ab1864c22403909742abc78a0a0b4c13bf4ef0d/636_0_5508_4409/500.jpg",
    "summary": "An alter ego of Nirvana frontman Kurt Cobain is facing constant attention from fans, friends, Jehovah's Witnesses, and delivery personnel. The situation has escalated to the point where a private investigator has also become involved. This relentless pursuit has turned their life into a chaotic experience.",
    "published": "2025-12-08T11:08:47Z"
  },
  {
    "title": "Sprawling defense bill will ‘restore warrior ethos’, House speaker says – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/dec/08/donald-trump-pete-hegseth-defense-security-indiana-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/c146a79abb28b95cb40e0832fb51f05174c5fc57/1062_0_5338_4272/500.jpg",
    "summary": "Lawmakers have introduced a policy bill that would allocate a historic $901 billion for national security in the upcoming fiscal year. This funding marks the largest investment in national security to date. The bill is part of ongoing efforts to bolster defense and security initiatives.",
    "published": "2025-12-08T11:06:37Z"
  },
  {
    "title": "My dream of jet set glamour has died – in a pleather chair full of other people's crumbs | Emma Beddington",
    "url": "https://www.theguardian.com/commentisfree/2025/dec/08/airport-lounges-dream-jet-set-glamour-died-pleather-chair-other-peoples-crumbs",
    "image": "https://media.guim.co.uk/90d86eaf76fe36312f10ad5d1fad9441c97290ab/432_0_4320_3456/500.jpg",
    "summary": "Airport lounge usage is increasing as travelers seek a touch of luxury and comfort amid their journeys. However, the author, Emma Beddington, highlights the irony of this desire, pointing out that ultimately everyone will still face the uncomfortable experience of flying in crowded, environmentally harmful planes. The juxtaposition underscores the fleeting nature of airport lounge benefits against the realities of air travel.",
    "published": "2025-12-08T11:00:39Z"
  },
  {
    "title": "Does Pete Hegseth even believe that war crimes exist? | Sidney Blumenthal",
    "url": "https://www.theguardian.com/commentisfree/2025/dec/08/does-pete-hegseth-even-believe-that-war-crimes-exist",
    "image": "https://media.guim.co.uk/c034bd1e8a295b96aa0ef4cac92e34e4914022d1/223_0_2218_1775/500.jpg",
    "summary": "The US defense secretary believes that military accountability should be limited, a perspective that has significantly shaped his career. This stance has drawn attention and sparked debate regarding the responsibilities of military leadership. Critics argue that accountability is essential for maintaining trust and integrity within the armed forces.",
    "published": "2025-12-08T11:00:38Z"
  }
]