[
  {
    "title": "Newcastle v Arsenal buildup, Barcelona in action, WSL and more – matchday live",
    "url": "https://www.theguardian.com/football/live/2025/sep/28/newcastle-v-arsenal-buildup-barcelona-in-action-wsl-and-more-matchday-live",
    "image": "https://media.guim.co.uk/b6d3fa4a2eaa9fc15a3722ae8f8004fbdd325e57/0_0_5000_4000/500.jpg",
    "summary": "Today's football action features a significant match at St James' Park, alongside a packed schedule in the Women's Super League. Barcelona aims to maintain their competitiveness in La Liga. Join us for a discussion on the highlights and outcomes of these games.",
    "published": "2025-09-28T08:21:31Z"
  },
  {
    "title": "Starmer says change takes time when asked how much political trouble he is in – Labour conference live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/28/labour-conference-keir-starmer-latest-uk-politics-news-live-updates",
    "image": "https://media.guim.co.uk/2315d78495d8e60c31191af6ee91420d7c8ab258/522_0_6830_5464/500.jpg",
    "summary": "The Prime Minister emphasized his commitment to delivering results, asserting that the government has accomplished significant progress. This statement comes in response to concerns over unfavorable polling for the Labour Party. He remains confident in his administration's achievements amidst the political challenges.",
    "published": "2025-09-28T08:16:54Z"
  },
  {
    "title": "Zelenskyy says Russia launched 500 drones and 40 missiles in ‘vile attack’ on Ukraine – Ukraine war live",
    "url": "https://www.theguardian.com/world/live/2025/sep/28/ukraine-russia-war-volodymyr-zelenskyy-vladimir-putin-nato-europe-latest-live-news-updates",
    "image": "https://media.guim.co.uk/e68cf9bc3dcc5937c2a7120ff544d888f723da7b/712_330_1503_1202/500.jpg",
    "summary": "A twelve-year-old girl was among the casualties in Kyiv due to recent Russian strikes, which have been condemned by Ukraine's president as \"brutal.\" The attacks have heightened concerns over civilian safety in the ongoing conflict. Ukrainian officials continue to urge international support in response to this escalating violence.",
    "published": "2025-09-28T08:16:00Z"
  },
  {
    "title": "Populist threat to rule of law a danger to UK working class, says attorney general",
    "url": "https://www.theguardian.com/politics/2025/sep/28/labour-richard-hermer-attorney-general-populist-danger-rule-of-law-uk-working-class",
    "image": "https://media.guim.co.uk/5b7c206020ffb7f17b01ea48a0faa1176019eb4e/616_88_3603_2883/500.jpg",
    "summary": "Richard Hermer plans to criticize Nigel Farage and Robert Jenrick during a Labour conference event. His remarks are anticipated to address their political actions and policies. The event aims to highlight contrasting views within the political landscape.",
    "published": "2025-09-28T08:00:06Z"
  },
  {
    "title": "‘I don’t like Kendrick Lamar going after my close friend Drake’: Hugo Chegwin’s honest playlist",
    "url": "https://www.theguardian.com/music/2025/sep/28/hugo-chegwin-honest-playlist-people-just-do-nothing-shark-tooth-necklace",
    "image": "https://media.guim.co.uk/1f9449d4159cfa961ffcdd2be2873e0857898750/0_458_1171_936/500.jpg",
    "summary": "The music producer and \"People Just Do Nothing\" actor reveals that his first rap idols were PJ and Duncan. He shares that he has a particular song that makes him secretly dance in front of the mirror. However, he does not disclose the song title in the news piece.",
    "published": "2025-09-28T08:00:05Z"
  }
]