[
  {
    "title": "Collingwood v Brisbane: AFL 2025 first preliminary final – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/20/afl-2025-first-preliminary-final-collingwood-magpies-v-brisbane-lions-live",
    "image": "https://media.guim.co.uk/6c2092b7c58b7ca312f1b936aadbb3e81b17c482/234_0_3091_2472/500.jpg",
    "summary": "Collingwood and Brisbane face off at the MCG for a chance to compete in the grand final against Geelong. The match is pivotal, with both teams vying for victory. Martin Pegan will provide live updates on the game.",
    "published": "2025-09-20T06:43:02Z"
  },
  {
    "title": "When did sabre-tooth cats diverge from domestic cats? The kids’ quiz",
    "url": "https://www.theguardian.com/lifeandstyle/2025/sep/20/when-did-sabre-tooth-cats-diverge-from-domestic-cats-the-kids-quiz",
    "image": "https://media.guim.co.uk/0d128d45a9c07c01ba2c54800bf4f897bafbde59/0_0_1500_1200/500.jpg",
    "summary": "Children have created five multiple-choice questions to challenge your knowledge. There is also an opportunity for you to submit your own brainteasers for upcoming quizzes. Join in the fun and test your skills!",
    "published": "2025-09-20T06:00:08Z"
  },
  {
    "title": "Coldplay preaching peace and love to Charlie Kirk is all well and good. But would it hurt artists to take a stand? | Elle Hunt",
    "url": "https://www.theguardian.com/commentisfree/2025/sep/20/coldplay-charlie-kirk-chris-martin-wembley",
    "image": "https://media.guim.co.uk/320bd2218ccf6b75eb9a8e94253e9470a75886bb/981_0_5703_4562/500.jpg",
    "summary": "Freelance journalist Elle Hunt criticizes Chris Martin's vague call for love at Wembley, suggesting that superficial gestures won't combat the growing presence of hate in society. She argues that more concrete actions are necessary to address the issue rather than empty rhetoric. The commentary highlights a disconnect between inspirational messages and the reality of rising intolerance.",
    "published": "2025-09-20T06:00:07Z"
  },
  {
    "title": "My cultural awakening: Faith by George Michael gave me permission to go to my first sex party",
    "url": "https://www.theguardian.com/culture/2025/sep/20/my-cultural-awakening-faith-george-michael-sex-party",
    "image": "https://media.guim.co.uk/72f18f3f7eedacd8c6076e82dea401eded1b2959/157_171_4681_3745/500.jpg",
    "summary": "The album provided a profound sense of relief and empowerment, transforming a negative experience into a positive awakening. It helped the listener overcome shame related to their sexuality. Overall, the music served as a liberating force, facilitating personal growth and acceptance.",
    "published": "2025-09-20T06:00:07Z"
  },
  {
    "title": "In 2009, who crashed his Cadillac Escalade into a fire hydrant? The Saturday quiz",
    "url": "https://www.theguardian.com/lifeandstyle/2025/sep/20/in-2009-who-crashed-his-cadillac-escalade-into-a-fire-hydrant-the-saturday-quiz",
    "image": "https://media.guim.co.uk/cef65401cccbaa8270530f3da50ff23fdff84ce5/466_0_4658_3726/500.jpg",
    "summary": "The Saturday quiz challenges participants with questions related to various topics, including concepts like Doublethink and Newspeak from George Orwell's work, as well as cultural references such as American Flyers and The Flying Scotsman. It's an engaging way to test one's knowledge across diverse areas. Participants can enjoy a mix of literary and cultural trivia in this quiz format.",
    "published": "2025-09-20T06:00:07Z"
  }
]