[
  {
    "title": "Hundreds of senior diplomats call for EU to take urgent action over Gaza crisis – Middle East crisis live",
    "url": "https://www.theguardian.com/world/live/2025/aug/26/israel-gaza-protest-hostage-war-hospital-benjamin-netanyahu-latest-live-news-updates",
    "image": "https://media.guim.co.uk/2fd2fbaeced4fb68307e556f9280705f495c3fe2/457_0_4583_3667/500.jpg",
    "summary": "An open letter has garnered support from 209 former EU ambassadors and senior diplomatic officials, expressing a unified stance on a significant issue. The signatories include ambassadors from various EU member states. Their call aims to influence EU policy and diplomatic actions.",
    "published": "2025-08-26T15:33:43Z"
  },
  {
    "title": "US Open tennis day three: Jannik Sinner and Iga Swiatek in action – live",
    "url": "https://www.theguardian.com/sport/live/2025/aug/26/us-open-tennis-day-three-jannik-sinner-and-iga-swiatek-in-action-live",
    "image": "https://media.guim.co.uk/f5f676ce7da1b0b222ff8ad3e36bbd1626a57de3/424_0_3852_3082/500.jpg",
    "summary": "Taha Hashim will provide updates on the opening matches of the two favorites. Fans are eager to see how these teams will perform as the competition kicks off. Stay tuned for live coverage and insights.",
    "published": "2025-08-26T15:30:56Z"
  },
  {
    "title": "Top Democrats fire back against Trump’s plan to remove Federal Reserve governor as Lisa Cook vows to not resign – live",
    "url": "https://www.theguardian.com/us-news/live/2025/aug/26/trump-federal-reserve-lisa-cook-news-updates-us-politics-live",
    "image": "https://media.guim.co.uk/bb80bf6325afd21c5ae02bce7d87dc97c1a4eea9/0_0_3000_2400/500.jpg",
    "summary": "Lisa Cook asserts that there is no legal basis for Trump to remove her from her position. She claims the president is fabricating mortgage fraud allegations against her. Cook's defense emphasizes the lack of evidence supporting Trump's accusations.",
    "published": "2025-08-26T15:28:58Z"
  },
  {
    "title": "Summer 2025 will ‘almost certainly’ be UK’s warmest on record, Met Office says",
    "url": "https://www.theguardian.com/uk-news/2025/aug/26/summer-2025-almost-certainly-uk-warmest-record-met-office",
    "image": "https://media.guim.co.uk/5be973de93605d6e80449cd1c264dbabb7ac3239/474_0_3950_3159/500.jpg",
    "summary": "Current mean temperature is at 16.13°C, following four heatwaves. This figure is notably higher than the previous record of 15.76°C. The unusual warmth highlights ongoing climate trends and potential impacts.",
    "published": "2025-08-26T15:20:47Z"
  },
  {
    "title": "Straight outta Stirling: the musical giving William Wallace the Hamilton treatment",
    "url": "https://www.theguardian.com/stage/2025/aug/26/straight-outta-stirling-the-musical-giving-william-wallace-the-hamilton-treatment",
    "image": "https://media.guim.co.uk/8749b7204b4a82a2c2b9ef4e1b7791e875a81306/0_0_3390_2712/500.jpg",
    "summary": "The creators of \"Wallace\" discuss their choice to incorporate hip-hop elements into the storytelling of Scotland's national hero. They believe that the genre's rhythm and expression resonate with the themes of rebellion and identity. This innovative approach aims to engage a contemporary audience while honoring historical significance.",
    "published": "2025-08-26T15:16:46Z"
  }
]