[
  {
    "title": "ONS crisis deepens as it admits retail sales data issue; UK house prices ‘at record’ high – business live",
    "url": "https://www.theguardian.com/business/live/2025/sep/05/ons-crisis-retail-sales-error-uk-house-prices-record-high-us-jobs-report-business-live-news-updates",
    "image": "https://media.guim.co.uk/872bd01f8bd76b53ac892baa18336b58ef57bce1/444_0_4426_3543/500.jpg",
    "summary": "The Office for National Statistics announced a miscalculation in its seasonally adjusted retail sales data. This error may impact economic assessments and analysis. Corrected data will be provided, ensuring accurate information moving forward.",
    "published": "2025-09-05T06:49:16Z"
  },
  {
    "title": "Australia news live: police continue search for men who allegedly sprayed mystery substance on Sydney’s Anzac memorial",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/05/australia-news-live-albanese-trump-tariffs-meeting-porepunkah-police-officer-funerals-ntwnfb",
    "image": "https://media.guim.co.uk/ab89ef917fd52f20a6a8c0992ce202ec523820ef/569_0_6827_5464/500.jpg",
    "summary": "I apologize, but I cannot access live news updates. If you provide me with a specific news article or details, I can help summarize that information for you.",
    "published": "2025-09-05T06:48:09Z"
  },
  {
    "title": "Rayner’s future in balance as firm used to buy flat in stamp duty row says it did not offer tax advice",
    "url": "https://www.theguardian.com/politics/2025/sep/04/angela-rayner-used-family-conveyancing-firm-to-buy-tax-row-flat",
    "image": "https://media.guim.co.uk/2b500e5c1c3a45ab87dfe4d9723b15fcfe65b161/204_0_2035_1629/500.jpg",
    "summary": "A report from Laurie Magnus, the Prime Minister's standards adviser, is set to be released today. This report is anticipated to address issues related to government transparency and ethics. Key findings may influence ongoing discussions regarding standards in public office.",
    "published": "2025-09-05T06:37:47Z"
  },
  {
    "title": "Ray taught Dezi Freeman about the bush. Later, he watched in dismay as his friend became ‘radicalised’",
    "url": "https://www.theguardian.com/australia-news/2025/sep/05/accused-porepunkah-killer-dezi-freeman-taught-about-bush-ray-watched-dismay-as-he-became-radicalised-ntwnfb",
    "image": "https://media.guim.co.uk/b31183128ec4f6c085b4c5002dfb79a6076d0ca7/610_0_6827_5464/500.jpg",
    "summary": "A former bushwalking companion of the accused Porepunkah killer has shared insights, highlighting the suspect's survival skills. Meanwhile, survival experts are indicating that the chances of the accused evading capture are diminishing. Authorities continue to intensify their search efforts to locate the suspect.",
    "published": "2025-09-05T06:07:05Z"
  },
  {
    "title": "RMT strikes expected to bring London tube to a halt for four days",
    "url": "https://www.theguardian.com/uk-news/2025/sep/05/strikes-expected-london-tube-halt-four-days",
    "image": "https://media.guim.co.uk/5c76cf19c98ba2588554008132295c66a933b23a/647_0_6798_5439/500.jpg",
    "summary": "Union members are planning to strike, which is expected to lead to overcrowded buses and trains due to a dispute over pay and the introduction of a 32-hour work week. The action may disrupt public transport services, affecting commuters. Authorities are advising travelers to prepare for crowded conditions and potential delays.",
    "published": "2025-09-05T06:03:22Z"
  }
]