[
  {
    "title": "Israeli hostage release: all living captives now freed, says Hamas – latest updates",
    "url": "https://www.theguardian.com/world/live/2025/oct/13/gaza-ceasefire-live-updates-israel-hostages-release-hamas-trump-middle-east",
    "image": "https://media.guim.co.uk/f0268d0ba5266f799a332bb5bc9caf5c3252e4a6/101_0_1333_1066/500.jpg",
    "summary": "Donald Trump has arrived in Israel amidst the release of hostages, with their initial images circulating. His visit underscores significant developments in the region. The situation is closely watched as it unfolds.",
    "published": "2025-10-13T08:28:04Z"
  },
  {
    "title": "Asian stocks tumble on fresh US-China trade spat; Chinese exports beat forecasts – business live",
    "url": "https://www.theguardian.com/business/live/2025/oct/13/asian-stocks-tumble-fresh-us-china-trade-spat-chinese-exports-top-forecasts-business-live",
    "image": "https://media.guim.co.uk/15429d443a0ee3b7848f5029e64c0d4a137dc14d/333_0_3325_2660/500.jpg",
    "summary": "European shares and US stock futures rose following Donald Trump's recent social media post that conveyed a more conciliatory tone. This shift in rhetoric has boosted market sentiment regarding trade relations. Investors reacted positively to the potential for easing tensions, leading to an uptick in stock markets.",
    "published": "2025-10-13T08:17:32Z"
  },
  {
    "title": "French political crisis continues as Lecornu unveils new government – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/oct/13/france-political-crisis-lecornu-macron-sarkozy-ukraine-russia-gaza-europe-news-latest-updates",
    "image": "https://media.guim.co.uk/40fda9c4fcc0ddae98a6037c30580e54954c3faf/947_0_6172_4938/500.jpg",
    "summary": "Marine Le Pen has announced her intention to propose a no-confidence motion against the French government. She is calling on President Macron to dissolve the National Assembly in response to the current political situation. Le Pen's actions reflect ongoing tensions within the French political landscape.",
    "published": "2025-10-13T08:09:58Z"
  },
  {
    "title": "Lloyds puts aside extra £800m for car finance compensation claims",
    "url": "https://www.theguardian.com/business/2025/oct/13/lloyds-puts-aside-extra-800m-car-finance-compensation-historical-claims",
    "image": "https://media.guim.co.uk/3d1107534512f13f20dd1973b414673e219d791f/511_0_3570_2857/500.jpg",
    "summary": "A banking group has increased its total provision to nearly £2 billion due to expectations of more historical cases qualifying for payouts. This adjustment reflects the group's assessment of potential claims being made. The move underscores ongoing financial risks related to past issues in the banking sector.",
    "published": "2025-10-13T08:08:02Z"
  },
  {
    "title": "Hamas releases first seven of 20 Israeli hostages after two years in Gaza",
    "url": "https://www.theguardian.com/world/2025/oct/13/israeli-hostage-release-hamas-gaza-last-living",
    "image": "https://media.guim.co.uk/dceef55ad47f8e4fcc30acbf9cac33d1e6b31995/418_0_4164_3333/500.jpg",
    "summary": "Israeli ministers have approved the release of over 1,700 Palestinians, with a group of these individuals being handed over to the Red Cross. This decision marks a significant move in Israel's policy regarding Palestinian prisoners. The release is part of ongoing negotiations and diplomatic efforts in the region.",
    "published": "2025-10-13T08:04:24Z"
  }
]