[
  {
    "title": "US government shutdown live: ‘erratic’ and ‘unhinged’ Trump to blame for shutdown, say senior Democrats",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/01/us-government-shutdown-update-2025-shutting-funding-trump-democrats-republicans-live-updates-latest-news",
    "image": "https://media.guim.co.uk/685443f5ce0b4b296a6b29873ed1b20e4a02d776/327_0_4844_3876/500.jpg",
    "summary": "Senate Democratic leader Chuck Schumer and House Democratic leader Hakeem Jeffries accuse Republicans of initiating a government shutdown due to their refusal to safeguard Americans' healthcare. They emphasize the impact on public health and well-being as a critical issue in the shutdown. The Democratic leaders assert the Republicans' actions undermine necessary health protections for citizens.",
    "published": "2025-10-01T13:27:38Z"
  },
  {
    "title": "Israeli minister says ‘last opportunity’ for Gaza City residents to flee – Middle East crisis live",
    "url": "https://www.theguardian.com/world/live/2025/oct/01/israel-gaza-offensive-benjamin-netanyahu-hamas-donald-trump-middle-east-crisis-live-news",
    "image": "https://media.guim.co.uk/5c74d93af9a3b45d92f3212627f646a7721700d4/325_0_4914_3933/500.jpg",
    "summary": "Israeli military actions are escalating as tensions rise in the region. Meanwhile, Hamas is reportedly looking to modify former President Trump's Gaza plan. The situation remains fluid as both sides react to ongoing developments.",
    "published": "2025-10-01T13:26:47Z"
  },
  {
    "title": "Europe ‘in most difficult and dangerous situation since second world war,’ Danish PM warns – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/oct/01/mette-frederiksen-denmark-europe-russia-vladimir-putin-volodymyr-zelenskyy-ukraine-hybrid-war-security-europe-live-news",
    "image": "https://media.guim.co.uk/e2203d0e9eb1fee0167cfb663bf6eb9a6c5b5af7/348_0_4680_3744/500.jpg",
    "summary": "Danish Prime Minister Mette Frederiksen supports the European Commission's initiative to provide a reparation loan to Ukraine. This loan would be backed by frozen Russian assets, aimed at aiding Ukraine’s recovery. Frederiksen's endorsement highlights a collaborative effort among European nations to support Ukraine amid ongoing conflict.",
    "published": "2025-10-01T13:23:33Z"
  },
  {
    "title": "Women’s Cricket World Cup: Australia v New Zealand – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/01/womens-cricket-world-cup-live-australia-v-new-zealand",
    "image": "https://media.guim.co.uk/f993f506eb3ad280fd3e0d3e62a7c5b6201b83ab/170_0_981_785/500.jpg",
    "summary": "Australia begins their title defense in the 50-over tournament at Holkar Stadium in Indore. Megan Maurice will provide live updates throughout the match. Fans can follow the action as the game unfolds.",
    "published": "2025-10-01T13:23:30Z"
  },
  {
    "title": "Which one of these young footballers do you identify with? Amit Lennon’s best photograph ",
    "url": "https://www.theguardian.com/artanddesign/2025/oct/01/young-footballers-amit-lennons-best-photograph",
    "image": "https://media.guim.co.uk/8ed84e82952ddb727a9a5fb7be13c363d0bb7ad3/578_0_6152_4922/500.jpg",
    "summary": "The news highlights a portrayal of adolescent awkwardness that resonates with viewers, prompting them to reflect on which character resembles their younger selves. The commentary suggests a humorous observation about masculinity, particularly the act of \"manspreading.\" Overall, it emphasizes the relatability and enjoyment of the character dynamics in the narrative.",
    "published": "2025-10-01T13:22:31Z"
  }
]