[
  {
    "title": "Australia v Argentina: Rugby Championship 2025 – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/13/rugby-championship-australia-wallabies-v-argentina-pumas-live",
    "image": "https://media.guim.co.uk/cf0b4e62e1dbaad5514857885f71458614f1e694/528_0_4722_3777/500.jpg",
    "summary": "The Wallabies are seeking their second victory against the Pumas in Sydney, who are motivated for revenge. Jonathan Howcroft provides minute-by-minute updates on the match. Stay tuned for all the action as the teams face off.",
    "published": "2025-09-13T05:30:59Z"
  },
  {
    "title": "Australia race walkers impress on world stage as adopted Canadian Evan Dunfee wins gold",
    "url": "https://www.theguardian.com/sport/2025/sep/13/world-athletics-championships-australia-day-one-jessica-hull-torrie-lewis-rohan-browning-kurtis-marschall-rebecca-henderson-rhydian-cowley",
    "image": "https://media.guim.co.uk/bbc38a92cb5c83a0cd4eb7d0a502604271ca8b2f/3600_1583_3910_3128/500.jpg",
    "summary": "Rebecca Henderson finished ninth in the women's 35 km race walk, while Rhydian Cowley secured 11th place in the men's division on the first day of the World Athletics Championships. Both athletes showcased strong performances in a competitive field. The championships highlight their endurance and skill on an international stage.",
    "published": "2025-09-13T05:12:31Z"
  },
  {
    "title": "Victorian Liberals must unite or face ‘crisis’, president warns as moderates swat away challenge for power",
    "url": "https://www.theguardian.com/australia-news/2025/sep/13/victorian-liberals-must-unite-or-face-crisis-president-warns-as-moderates-swat-away-challenge-for-power",
    "image": "https://media.guim.co.uk/aa526ea46cd9d20180465680d8031694e3c2caa2/250_0_2238_1790/500.jpg",
    "summary": "Philip Davis urges rival factions to reconcile following a contentious campaign aimed at his replacement. He emphasizes the importance of unity and collaboration within the party. Davis's call for peace comes amid tensions that have surfaced during the election process.",
    "published": "2025-09-13T05:03:35Z"
  },
  {
    "title": "‘Like walking through time’: as glaciers retreat, new worlds are being created in their wake",
    "url": "https://www.theguardian.com/environment/2025/sep/13/switzerland-alps-fiesch-aletsch-glaciers-retreat-ecosystems-mountains-culture-aoe",
    "image": "https://media.guim.co.uk/d71f43482dcb3ed89237377dedaaaaefd91aeb6d/94_0_2813_2250/500.jpg",
    "summary": "As Swiss glaciers rapidly melt due to climate change, new species are adapting and thriving in the changing environment. However, this transformation poses a threat to existing ecosystems and the traditional alpine culture. The accelerated melting highlights the complex interplay between ecological change and cultural heritage.",
    "published": "2025-09-13T05:00:59Z"
  },
  {
    "title": "Can Keir survive? Inside the plot to bring down the prime minister",
    "url": "https://www.theguardian.com/news/ng-interactive/2025/sep/13/can-keir-survive-inside-the-plot-to-bring-down-the-prime-minister",
    "image": "https://media.guim.co.uk/5cca595cc2b0791512b5cd115389e2384e0dd227/0_0_5000_4000/500.jpg",
    "summary": "Amid ongoing scandals facing his administration, a movement is gaining momentum to unseat Labour leader Keir Starmer. Dissatisfaction within the party is fueling efforts to challenge his leadership. The situation reflects growing unrest and divisions among party members.",
    "published": "2025-09-13T05:00:58Z"
  }
]