[
  {
    "title": "Starmer urged to apologise to Epstein victims as MPs debate Mandelson appointment — UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/16/starmer-cabinet-resignation-paul-ovenden-news-updates-uk-politics-live",
    "image": "https://media.guim.co.uk/fe7b2e213d3debf842a0d82ea4f21e113ba99507/631_0_6310_5048/500.jpg",
    "summary": "Kemi Badenoch and Ed Davey criticized the Prime Minister's record regarding the US ambassador issue. In response, a minister defended Keir Starmer's absence from a debate, asserting that the Prime Minister had more pressing matters to attend to. The exchange highlights ongoing political tensions in the UK.",
    "published": "2025-09-16T14:39:28Z"
  },
  {
    "title": "Donald Trump files $15bn lawsuit against the New York Times",
    "url": "https://www.theguardian.com/us-news/2025/sep/16/donald-trump-says-he-is-suing-new-york-times-15bn-lawsuit-against-newspaper-ntwnfb",
    "image": "https://media.guim.co.uk/7ed4477bbb05b2dcac390b8d3a325f815617cfb7/751_94_4459_3569/500.jpg",
    "summary": "The organization stated it will remain resolute and undeterred by intimidation tactics in response to the latest legal actions announced by the US president. They emphasize their commitment to their mission despite these challenges. The statement reflects their determination to confront adversity head-on.",
    "published": "2025-09-16T14:38:25Z"
  },
  {
    "title": "FBI director Kash Patel sparked ‘mass confusion’ over Charlie Kirk shooting suspect, top Democrat says – live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/16/donald-trump-new-york-times-defamation-charlie-kirk-vance-miller-news-updates-us-politics-live",
    "image": "https://media.guim.co.uk/d34fd528cac2ac0a4dbc7fd60a7d04689d1fca5f/424_0_4243_3394/500.jpg",
    "summary": "FBI Director Christopher Wray faced intense questioning from the Senate Judiciary Committee amid scrutiny over his actions and social media comments related to the Kirk shooting investigation. Critics raised concerns about the agency's response and transparency during the case. The hearing highlighted ongoing tensions between law enforcement and legislative oversight.",
    "published": "2025-09-16T14:38:18Z"
  },
  {
    "title": "Robert Redford dies: Meryl Streep leads tributes to giant of American cinema, saying ‘one of the lions has passed’ – latest updates",
    "url": "https://www.theguardian.com/film/live/2025/sep/16/robert-redford-dies-tributes-cinema-hollywood-legend-latest-news-updates",
    "image": "https://media.guim.co.uk/da81d5e0a015b734c7919cef2f5880509d2ca6af/798_0_10585_8470/500.jpg",
    "summary": "Hollywood legend known for iconic films such as *Butch Cassidy and the Sundance Kid*, *The Sting*, and *All the President’s Men* has passed away at the age of 89. His contributions to cinema left an indelible mark on the film industry. Fans and colleagues mourn the loss of a talented actor and celebrated star.",
    "published": "2025-09-16T14:36:03Z"
  },
  {
    "title": "Surrey v Nottinghamshire, Sussex v Yorkshire, and more: county cricket, day two – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/16/surrey-v-nottinghamshire-sussex-v-yorkshire-and-more-county-cricket-day-two-live",
    "image": "https://media.guim.co.uk/2f17c2e7f5aeeb89077071e376ee9bcac13c95e3/117_0_1375_1100/500.jpg",
    "summary": "Tanya Aldred will provide updates on the most recent County Championship matches. Fans can expect insights and highlights from the fixtures. Stay tuned for comprehensive coverage of the tournament.",
    "published": "2025-09-16T14:35:11Z"
  }
]