[
  {
    "title": "WSL clockwatch: Spurs v Brighton, London City Lionesses v Liverpool and more – live",
    "url": "https://www.theguardian.com/football/live/2025/oct/05/postecoglou-nottingham-forest-wsl-ipswich-norwich-matchday-live",
    "image": "https://media.guim.co.uk/e29f22bfe2c19727105b78e04545984b28715dda/0_173_3443_2753/500.jpg",
    "summary": "Join our writers for in-depth news and lively discussions as another exciting day of football unfolds, featuring key matches and standout performances. Stay updated on all the latest developments in the sport. Don't miss out on the action!",
    "published": "2025-10-05T11:08:44Z"
  },
  {
    "title": "Singapore Grand Prix 2025: F1 – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/05/singapore-grand-prix-2025-f1-live",
    "image": "https://media.guim.co.uk/d7618a735a256a75d8856bcd94a61bc1499fa5f3/1169_0_4408_3526/500.jpg",
    "summary": "Dominic Booth provides a lap-by-lap report on the Marina Bay race, focusing on pole-sitter George Russell's efforts to maintain his lead. The event features several title contenders aiming to challenge him. Fans are eager to see if Russell can withstand the pressure throughout the race.",
    "published": "2025-10-05T11:06:14Z"
  },
  {
    "title": "Badenoch says her migration plan ‘credible’, but won’t say where 150,000 people a year being removed will go – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/oct/05/conservative-tory-conference-kemi-badenoch-echr-immigration-uk-politics-live-news-updates",
    "image": "https://media.guim.co.uk/00662208f0f1523415b8edeb215074d7ea6440c0/431_0_5000_4000/500.jpg",
    "summary": "The Conservative leader faced intense questioning regarding her proposal to remove certain policies ahead of the party conference. Critics expressed concerns about the potential impact of these removals on party unity and public perception. The conference is set to open later today, highlighting the urgency of the issue.",
    "published": "2025-10-05T11:06:03Z"
  },
  {
    "title": "NRL 2025 grand final: Brisbane Broncos beat Melbourne Storm – as it happened",
    "url": "https://www.theguardian.com/sport/live/2025/oct/05/nrl-2025-grand-final-melbourne-storm-v-brisbane-broncos-rugby-league-live",
    "image": "https://media.guim.co.uk/14a6ac522b2c5b7f3e99fc425cd3225f5102230d/394_0_2500_2000/500.jpg",
    "summary": "The Broncos triumphed over the Storm with a 26-22 victory, securing their premiership title. Reece Walsh was honored with the Clive Churchill Medal for his outstanding performance during the match. The final took place at Accor Stadium.",
    "published": "2025-10-05T11:05:33Z"
  },
  {
    "title": "Gaza ceasefire talks live: Hamas keen to reach a deal, says official, as Israeli attacks continue",
    "url": "https://www.theguardian.com/world/live/2025/oct/05/gaza-ceasefire-israel-palestine-hamas-trump-cairo-negotiations-middle-east-crisis-live-news-updates",
    "image": "https://media.guim.co.uk/547b7a5cc18105a953b48919cda03551a19b5e0f/886_0_4554_3642/500.jpg",
    "summary": "Reports of fatal attacks in Gaza persist even after former President Trump urged Israel to cease its bombing campaign. The ongoing violence highlights the humanitarian crisis in the region. Calls for a ceasefire grow amid escalating tensions.",
    "published": "2025-10-05T11:04:15Z"
  }
]