[
  {
    "title": "Donald Trump speaks after Xi Jinping meeting in South Korea – live updates ",
    "url": "https://www.theguardian.com/world/live/2025/oct/30/donald-trump-xi-jinping-meeting-live-updates",
    "image": "https://media.guim.co.uk/bd1c513361c5ea2ab97bd963b56b8b81e60cde38/0_1161_5159_4127/500.jpg",
    "summary": "The recent summit on the sidelines of APEC marked the first meeting between US and Chinese leaders since 2019. This dialogue is significant as it occurs amid ongoing tensions exacerbated by former President Trump's trade war. Both sides are seeking to address and manage their strained relationship.",
    "published": "2025-10-30T05:18:10Z"
  },
  {
    "title": "‘Bats out for Benny’: Teenager killed by cricket ball honoured with #batsoutforben campaign ",
    "url": "https://www.theguardian.com/sport/2025/oct/30/teenager-killed-by-cricket-ball-remembered-as-classic-australian-child-amid-debate-over-neck-guards",
    "image": "https://media.guim.co.uk/4a6c5e6d6986edf24408089224cbe94f6d4991ea/331_0_5915_4732/500.jpg",
    "summary": "A 17-year-old was tragically killed during practice after being hit in the neck by a ball, having not worn a neck guard. Officials are prioritizing support for both the victim’s family and the boy who threw the ball. The incident raises concerns about safety measures in sports.",
    "published": "2025-10-30T05:17:33Z"
  },
  {
    "title": "Trump-Xi meeting: US president says rare earths deal and tariff reductions agreed in crunch trade talks",
    "url": "https://www.theguardian.com/us-news/2025/oct/30/trump-and-xi-meet-in-south-korea-for-crunch-talks-on-trade",
    "image": "https://media.guim.co.uk/214a6bd816efe5193d1b5c7c06cae0fd5f1bfb78/524_0_4164_3333/500.jpg",
    "summary": "Donald Trump described his recent meeting with his Chinese counterpart as \"amazing.\" He shared his thoughts with the media after the talks. The meeting has generated interest regarding U.S.-China relations.",
    "published": "2025-10-30T05:16:59Z"
  },
  {
    "title": "Australia politics live: insults fly in extended Senate question time as Watt gives short responses to extra questions",
    "url": "https://www.theguardian.com/australia-news/live/2025/oct/30/anthony-albanese-donald-trump-meeting-murray-watt-epbc-nature-laws-press-club-parliament-labor-coalition-sussan-ley-ntwnfb",
    "image": "https://media.guim.co.uk/4a8d985e4f3437ac2731b3f336ab5254880d4113/490_0_6245_4999/500.jpg",
    "summary": "I'm sorry, but I would need more context or specific information about the news to provide an accurate summary. Could you please provide the details or topic of the news?",
    "published": "2025-10-30T05:16:16Z"
  },
  {
    "title": "The truth behind the disappearance of Charlene Downes: ‘She was reduced to this salacious, shocking story’",
    "url": "https://www.theguardian.com/uk-news/2025/oct/30/the-truth-behind-the-disappearance-of-charlene-downes-she-was-reduced-to-this-salacious-shocking-story",
    "image": "https://media.guim.co.uk/2eb51271df70ff49c607a5dd1e56a3dce292935b/0_0_5000_4000/500.jpg",
    "summary": "Nicola Thorp, reflecting on her childhood in Blackpool, recalls the cautionary tale of a missing girl known as the 'kebab girl' who disappeared at 14 nearby. Over the past three years, Thorp has been investigating the true story behind the girl's disappearance. Her quest aims to uncover the realities and implications of this tragic case.",
    "published": "2025-10-30T05:00:54Z"
  }
]