[
  {
    "title": "‘Don’t pay any attention to what Trump says about medicine’, Wes Streeting tells Britons – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/23/lib-dem-ed-davey-conference-donald-trump-keir-starmer-labour-reform-tory-latest-politics-live-news-updates",
    "image": "https://media.guim.co.uk/25e0913ad4c81562d1691a358106709674775546/246_0_3960_3168/500.jpg",
    "summary": "Medical experts have raised concerns after President Biden advised pregnant women to avoid Tylenol, a warning that contradicts existing research on the medication's safety. The guidance has sparked debate among healthcare professionals about the implications for pregnant women managing pain. Experts emphasize the importance of evidence-based recommendations in maternal health.",
    "published": "2025-09-23T11:24:57Z"
  },
  {
    "title": "Nato ready to ‘defend every inch of allied territory’, says Rutte after Russian incursions – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/sep/23/copenhagen-oslo-airport-drones-denmark-norway-russia-nato-estonia-europe-live-latest-news-updates",
    "image": "https://media.guim.co.uk/6a74fbf25428da308a6e69160da2966a77ae22a0/955_0_4545_3636/500.jpg",
    "summary": "NATO's chief addressed a recent violation of Estonian airspace, emphasizing the seriousness of aerial security. This statement coincides with drone incidents that occurred at Copenhagen and Oslo airports, raising concerns about airspace safety in the region. The events highlight the growing risks associated with unauthorized drone activity in European airspace.",
    "published": "2025-09-23T11:23:49Z"
  },
  {
    "title": "Trump to address UN general assembly as Israeli attacks on Gaza City continue – Middle East crisis live",
    "url": "https://www.theguardian.com/world/live/2025/sep/23/gaza-israel-palestinian-state-recognition-donald-trump-un-unga-latest-news-live-updates",
    "image": "https://media.guim.co.uk/0a53750903b79f83688de3607e10debccbe459d7/211_0_4680_3744/500.jpg",
    "summary": "The US president is set to address the UN General Assembly in New York following the recognition of a Palestinian state by the UK, France, Belgium, Canada, Australia, and Portugal. This development highlights a potential shift in international support for Palestinian statehood. The president's address may outline the US's stance on this evolving situation.",
    "published": "2025-09-23T11:16:17Z"
  },
  {
    "title": "Medical and autism experts decry Trump’s Tylenol claims – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/23/donald-trump-unga-autism-tylenol-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/b0d1a06a117a17789a37b812533a3421027b82b1/338_0_3647_2917/500.jpg",
    "summary": "The Coalition of Autism Scientists criticized the president's statements regarding autism, stating that they only contribute to public fear and misunderstanding. They emphasize the need for accurate information and support for affected individuals and families. The coalition advocates for a more informed and compassionate dialogue about autism.",
    "published": "2025-09-23T11:10:06Z"
  },
  {
    "title": "Asylum seeker at centre of Essex hotel protests jailed for 12 months",
    "url": "https://www.theguardian.com/uk-news/2025/sep/23/asylum-seeker-at-centre-of-essex-hotel-protests-jailed-for-12-months",
    "image": "https://media.guim.co.uk/a2236e8615e47bf90c50589b17ef9b05aa329219/99_96_2262_1809/500.jpg",
    "summary": "Hadush Gerberslasie Kebatu, 38, was convicted for assaulting a 14-year-old girl and a woman. His conviction took place last month, highlighting serious criminal behavior. The case reflects ongoing concerns about violence and safety in the community.",
    "published": "2025-09-23T11:08:31Z"
  }
]