[
  {
    "title": "Australia news live: Allegra Spender and Sophie Scamps quit parliamentary sports club after Pocock ban; more police join Porepunkah manhunt",
    "url": "https://www.theguardian.com/australia-news/live/2025/oct/10/australia-politics-live-senate-estimates-anthony-albanese-sussan-ley-andrew-hastie-migration-aukus-trump-gaza-ntwnfb",
    "image": "https://media.guim.co.uk/b51b0aa752b372cce840d3476461d2e3bb00139c/237_189_2936_2349/500.jpg",
    "summary": "Sure! Please provide the news article or details you'd like me to summarize.",
    "published": "2025-10-10T06:25:38Z"
  },
  {
    "title": "Beethoven 5 Vol 4: Salvatore di Sciarrino album review – classical weight, contemporary subtlety",
    "url": "https://www.theguardian.com/music/2025/oct/10/beethoven-5-vol-4-salvatore-di-sciarrino-review-jonathan-biss",
    "image": "https://media.guim.co.uk/4ef441b28da0304e13b486bd9915320e556bca11/133_0_1163_931/500.jpg",
    "summary": "Jonathan Biss presents a concert featuring Beethoven's Fourth Piano Concerto alongside Sciarrino's contemporary miniature. The program is designed to be both reflective and emotionally rich. This combination showcases Biss's skill in blending classic and modern musical styles.",
    "published": "2025-10-10T06:00:48Z"
  },
  {
    "title": "Raise Your Soul by Yanis Varoufakis review – an intimate history of Greece",
    "url": "https://www.theguardian.com/books/2025/oct/10/raise-your-soul-by-yanis-varoufakis-review-an-intimate-history-of-greece",
    "image": "https://media.guim.co.uk/ce70cfba4cf20a68ede283d8f65ec6a386ddc0a4/480_0_4800_3840/500.jpg",
    "summary": "A colorful former minister narrates the tale of postwar Greek politics through the experiences of five female relatives. Their lives serve as a reflection of the broader political and social changes in Greece. This personal perspective highlights the intersection of family and national history.",
    "published": "2025-10-10T06:00:48Z"
  },
  {
    "title": "Foreign Office chief to visit China after collapse of high-profile espionage case",
    "url": "https://www.theguardian.com/politics/2025/oct/10/foreign-office-chief-to-visit-china-after-collapse-of-high-profile-espionage-case",
    "image": "https://media.guim.co.uk/640bb4f8ada39f2ae1518be76705f3bca1b8677a/8_0_2233_1786/500.jpg",
    "summary": "Oliver Robbins is set to visit China next week for a previously scheduled government engagement, following the recent collapse of a trial involving two individuals charged with espionage. The visit underscores ongoing diplomatic relations despite recent tensions. Robbins' trip aims to further UK-China dialogue and cooperation.",
    "published": "2025-10-10T06:00:47Z"
  },
  {
    "title": "‘£20 a night for one of the most peaceful locations in the world’: readers’ favourite remote stays",
    "url": "https://www.theguardian.com/travel/2025/oct/10/holidays-remote-places-europe-readers-travel-tips",
    "image": "https://media.guim.co.uk/64e20618851020576525c2699a8774140941c0e6/20_0_1001_801/500.jpg",
    "summary": "Tipsters share their experiences of breathtaking silence, stunning beauty, and diverse wildlife in lesser-known spots across Europe, from the Scottish Highlands to a Greek island. Their journeys highlight the serene and unspoiled nature found in these hidden corners. These destinations offer a peaceful escape from the busier tourist spots.",
    "published": "2025-10-10T06:00:47Z"
  }
]