[
  {
    "title": "Strictly Come Dancing: week 11 results – live",
    "url": "https://www.theguardian.com/tv-and-radio/live/2025/dec/06/strictly-come-dancing-week-11-live",
    "image": "https://media.guim.co.uk/9bab40376a04a3e3fc2f9aa5a51fe92512210ac6/353_0_3535_2828/500.jpg",
    "summary": "Musicals Week featured the new Dance Relay and concluded with Paddington's ballroom debut. Amber Davies emerged as the top performer, while Karen Carney landed at the bottom. The stage is set for the penultimate dance-off showdown.",
    "published": "2025-12-07T20:21:05Z"
  },
  {
    "title": "Ravens v Steelers, Jaguars v Colts and Bills v Bengals: NFL week 14 – live",
    "url": "https://www.theguardian.com/sport/live/2025/dec/07/ravens-v-steelers-jaguars-v-colts-and-bills-v-bengals-nfl-week-14-live",
    "image": "https://media.guim.co.uk/f257611b88401f038743e1d3a9cfd9980813373c/19_0_6409_5128/500.jpg",
    "summary": "Graham Searles will provide live updates on the NFL games happening this evening. Notably, the Baltimore Ravens will face off against the Pittsburgh Steelers at M&T Bank Stadium. Fans can tune in for the latest developments during the matches.",
    "published": "2025-12-07T20:18:49Z"
  },
  {
    "title": "My toy-destroying dog tested these eco-friendly toys. These eight survived – and make great gifts",
    "url": "https://www.theguardian.com/thefilter-us/2025/dec/07/best-gifts-ideas-for-dogs",
    "image": "https://media.guim.co.uk/9161a30b12a06060b66e1cd6a82a3b524e85ea88/1_0_2999_2400/500.jpg",
    "summary": "A variety of toys, including plush tacos and coconut fiber ropes, are available to keep pets entertained during the holiday season. These selections cater to even the most discerning dogs. The focus is on promoting both happiness and health for pets this festive time.",
    "published": "2025-12-07T20:15:30Z"
  },
  {
    "title": "Democrats urge Pentagon to release video of strike on alleged drug boat",
    "url": "https://www.theguardian.com/us-news/2025/dec/07/democrats-trump-caribbean-drug-boat-strike-video",
    "image": "https://media.guim.co.uk/5551cff599fb67a8c420d5fbb9d4dd2cc23b47ba/640_0_7200_5760/500.jpg",
    "summary": "Members of Congress are intensifying pressure on Donald Trump's team, alleging that the deadly attack in question was unlawful. This scrutiny comes amid ongoing investigations into the events surrounding the incident. The situation raises significant legal and political challenges for Trump and his associates.",
    "published": "2025-12-07T20:08:00Z"
  },
  {
    "title": "Lando Norris ‘proud’ of winning first F1 drivers’ championship ‘my way’",
    "url": "https://www.theguardian.com/sport/2025/dec/07/lando-norris-proud-of-winning-first-f1-drivers-championship-my-way",
    "image": "https://media.guim.co.uk/52efb7ae356c6335ac5821ed00cbfc160f3fa807/462_0_3824_3060/500.jpg",
    "summary": "Lando Norris made adjustments in the autumn to enhance his performance, aiming to unlock more of his potential. Oscar Piastri expressed that he gained valuable insights about himself during the season. Both drivers emphasized personal growth and development as key takeaways from their experiences.",
    "published": "2025-12-07T20:06:26Z"
  }
]