[
  {
    "title": " Rampant Las Vegas Aces complete sweep of Mercury to win third WNBA in four years",
    "url": "https://www.theguardian.com/sport/2025/oct/10/aces-win-third-wnba-title-sweep-phoenix-mercury",
    "image": "https://media.guim.co.uk/b5729f89980e942ca08e4e805208974a5f913a37/284_0_2825_2261/500.jpg",
    "summary": "A’ja Wilson led the Las Vegas Aces to victory over the Phoenix Mercury with 31 points, securing a 97–86 win. This triumph completed a four-game sweep in the WNBA Finals. With this win, the Aces claimed their third championship in four years.",
    "published": "2025-10-11T02:41:22Z"
  },
  {
    "title": "The Shiralee review – love grows in the harshest place in bountiful adaption of outback epic",
    "url": "https://www.theguardian.com/stage/2025/oct/11/the-shiralee-love-grows-in-the-harshest-place-in-bountiful-adaption-of-outback-epic",
    "image": "https://media.guim.co.uk/3f1f0b60cbc8bdef41ef3f7c46ceb37d0a74efc7/59_0_1600_1280/500.jpg",
    "summary": "The Sydney Opera House presents a new production inspired by D'arcy Niland's classic novel, showcasing the expansive journey of a swagman and his daughter. This adaptation transcends the original story, offering a fresh perspective on their adventures. The performance aims to resonate with contemporary audiences while honoring the novel's themes.",
    "published": "2025-10-11T02:40:38Z"
  },
  {
    "title": "Canada 0-1 Australia: international men’s football friendly – as it happened",
    "url": "https://www.theguardian.com/football/live/2025/oct/11/canada-vs-australia-socceroos-live-updates-international-football-friendly-latest",
    "image": "https://media.guim.co.uk/e22b4d47f0e483eacbe42a409e2f2320ee0e0998/443_0_4433_3546/500.jpg",
    "summary": "The Socceroos triumphed over Les Rouges with a 1-0 victory at Stade Saputo in Montreal. Nestory Irankunda scored the only goal of the match from the visitors' single shot on target. This decisive moment secured the win for the Australian team.",
    "published": "2025-10-11T02:08:54Z"
  },
  {
    "title": "After uproar, Pete Hegseth clarifies Qatari air force facility in Idaho is not a foreign base – as it happened",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/10/letitia-james-donald-trump-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/43672fb93245ee90ef775f04f22e4ef176a2f23d/374_0_6399_5119/500.jpg",
    "summary": "The Pentagon chief announced that a location will host a contingent of Qatari F-15s and pilots. Further details are not yet available. This blog is now closed.",
    "published": "2025-10-11T02:03:11Z"
  },
  {
    "title": "White House announces federal worker layoffs as shutdown nears third week",
    "url": "https://www.theguardian.com/us-news/2025/oct/10/federal-workers-pay-government-shutdown",
    "image": "https://media.guim.co.uk/2620816aff4ce6cb34fd3139188a567f1c07b9ed/397_0_5001_4000/500.jpg",
    "summary": "The AFL-CIO is taking legal action to address concerns over potential negative impacts on American workers. Union leaders caution that the outcomes could have \"devastating effects.\" The issue at hand highlights ongoing tensions surrounding labor rights and protections.",
    "published": "2025-10-11T01:44:14Z"
  }
]