[
  {
    "title": "Canada 13-33 England: Women’s Rugby World Cup final – live reaction",
    "url": "https://www.theguardian.com/sport/live/2025/sep/27/england-v-canada-womens-rugby-world-cup-final-live",
    "image": "https://media.guim.co.uk/91a61d5a6591781b39be027371addfee75652892/154_91_1346_1076/500.jpg",
    "summary": "The Red Roses face Canada in a highly anticipated match for the championship title at Twickenham, which is sold out. The game promises excitement as fans gather to witness the showdown. Luke McLaughlin provides live updates throughout the event.",
    "published": "2025-09-27T17:13:55Z"
  },
  {
    "title": "Ryder Cup: USA 3½-8½ Europe – visitors extend lead after foursomes",
    "url": "https://www.theguardian.com/sport/live/2025/sep/27/ryder-cup-2025-day-two-live",
    "image": "https://media.guim.co.uk/e059ea76366f1394fb6056c9bb2a4d002021d518/0_0_5000_4000/500.jpg",
    "summary": "Live coverage of day two at Bethpage Black highlights Europe's efforts to solidify their lead. Updates are provided hole-by-hole as the competition unfolds. Join our writers for the latest developments in this pivotal event.",
    "published": "2025-09-27T17:05:17Z"
  },
  {
    "title": "England outclass Canada to capture glorious Women’s Rugby World Cup triumph",
    "url": "https://www.theguardian.com/sport/2025/sep/27/england-outclass-canada-to-capture-glorious-womens-rugby-world-cup-triumph",
    "image": "https://media.guim.co.uk/2ca56057b97827363a19cba36345135b9c1cf28d/0_12_5901_4721/500.jpg",
    "summary": "England claimed their third Women's Rugby World Cup title by defeating Canada 33-13. The match was witnessed by a record crowd at Twickenham. This victory solidifies England's position as a dominant force in women's rugby.",
    "published": "2025-09-27T17:01:37Z"
  },
  {
    "title": "‘Men seem to make life for women worse’: single US women share the woes of dating in 2025",
    "url": "https://www.theguardian.com/lifeandstyle/2025/sep/27/us-women-single-dating",
    "image": "https://media.guim.co.uk/c58e11947f14992c83c359b44faea1c4f7cce342/0_0_2500_2000/500.jpg",
    "summary": "Many women express a sense of despair regarding the current dating landscape, citing challenges in finding compatible partners. Factors such as negative experiences, unrealistic expectations, and changing social dynamics contribute to this feeling. As a result, some women question the viability of dating in today’s environment.",
    "published": "2025-09-27T17:00:47Z"
  },
  {
    "title": "Police identify suspect in 1991 murders of four girls at Texas yogurt shop ",
    "url": "https://www.theguardian.com/us-news/2025/sep/27/yogurt-shop-murders-austin-texas",
    "image": "https://media.guim.co.uk/55d94b2f2bca251474b0d7134768a06ccce27e16/39_0_1202_961/500.jpg",
    "summary": "Officials have identified Robert Eugene Brashers as the suspect in the murders of four women: Amy Ayers, Eliza Thomas, and sisters Jennifer and Sarah Harbison. The victims were brutally killed, prompting a thorough investigation. Authorities are focusing on gathering evidence to build a solid case against Brashers.",
    "published": "2025-09-27T16:53:32Z"
  }
]