[
  {
    "title": "Graham Richardson, hard-nosed former Labor minister and numbers man – obituary",
    "url": "https://www.theguardian.com/australia-news/2025/nov/08/graham-richardson-hard-nosed-former-labor-minister-and-numbers-man-obituary",
    "image": "https://media.guim.co.uk/3c0e7f402ba9c273d3e749c6bb8d95df1ee585b9/0_139_4256_2554/500.jpg",
    "summary": "A prominent political figure, known for uniting various factions during the Hawke government and serving as a successful environment minister, adopted the mantra of \"whatever it takes\" in his approach. His effectiveness in navigating complex political landscapes has left a significant impact. His legacy underscores the importance of determination and adaptability in leadership.",
    "published": "2025-11-08T01:26:06Z"
  },
  {
    "title": "Tributes from across the political divide as Graham ‘Richo’ Richardson, former Labor party powerbroker, dies aged 76",
    "url": "https://www.theguardian.com/australia-news/2025/nov/08/graham-richardson-dies-richo-former-labor-party-powerbroker-dead-at-76",
    "image": "https://media.guim.co.uk/b599927f6e85f329178d022b125deb2bff94b3e3/531_334_2428_1942/500.jpg",
    "summary": "The death of a former NSW senator was announced on Saturday morning. The senator had been experiencing a long period of ill health prior to their passing. Tributes are likely to follow in honor of their contributions to politics.",
    "published": "2025-11-08T01:25:09Z"
  },
  {
    "title": "Trump demands senators stay in Washington to solve shutdown as he heads to Florida – live",
    "url": "https://www.theguardian.com/us-news/live/2025/nov/07/donald-trump-government-shutdown-air-traffic-flights-snap-viktor-orban-hungary-ukraine-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/3e4de00b63eaba3ef8c10dd9f6b8f478f1d682d7/352_0_3018_2415/500.jpg",
    "summary": "The US president visits his Florida resort while urging senators to remain in Washington, D.C. He emphasizes the need for lawmakers to collaborate on resolving the ongoing government shutdown. The push underscores the urgency of addressing the financial stalemate affecting the government.",
    "published": "2025-11-08T01:22:23Z"
  },
  {
    "title": "Judge’s final order bars Trump from sending national guard to Portland ",
    "url": "https://www.theguardian.com/us-news/2025/nov/07/final-order-trump-national-guard-portland",
    "image": "https://media.guim.co.uk/11040e12783ee2e7e8776a458837e1f4aef25cb2/6_0_4583_3667/500.jpg",
    "summary": "Karin Immergut stated that she found no credible evidence suggesting that the protests in an Oregon city were out of control. Her remarks come amid concerns about the nature of the demonstrations. This assessment contradicts some public perceptions of the events taking place.",
    "published": "2025-11-08T01:21:25Z"
  },
  {
    "title": "Severe storms forecast for parts of NSW as Victoria and Queensland face wet weather",
    "url": "https://www.theguardian.com/environment/2025/nov/08/weather-australia-severe-storms-forecast-nsw-victoria-queensland-wind-hail-thunder",
    "image": "https://media.guim.co.uk/d2914b85d2b75be299efe6751e04a6bec082ea90/286_0_4595_3677/500.jpg",
    "summary": "The Bureau of Meteorology (BoM) has warned of destructive winds and \"very dangerous thunderstorms\" expected to affect the Hunter region, mid-north coast of New South Wales, and northern tablelands. Residents in these areas are advised to prepare for severe weather conditions. The warning emphasizes the potential for significant impacts from the storms.",
    "published": "2025-11-08T01:10:44Z"
  }
]