[
  {
    "title": "Poland’s PM warns prospect of military conflict ‘closer than at any time since second world war’ amid Russian drone incursion – follow live",
    "url": "https://www.theguardian.com/world/live/2025/sep/10/poland-pm-condemns-repeated-violation-of-airspace-amid-russian-attack-on-ukraine-follow-live",
    "image": "https://media.guim.co.uk/360b3ad8d55e8b5a97690e31b6bdfdcad58e5388/45_0_4348_3478/500.jpg",
    "summary": "Polish opposition leader Donald Tusk reported 19 violations of Polish airspace overnight, raising security concerns. He stated that four drones were most likely shot down during the incidents. The situation highlights ongoing tensions in the region and the need for enhanced defense measures.",
    "published": "2025-09-10T09:30:13Z"
  },
  {
    "title": "Surrey v Warwickshire, Somerset v Yorkshire and more: county cricket – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/10/surrey-v-warwickshire-somerset-v-yorkshire-and-more-county-cricket-live",
    "image": "https://media.guim.co.uk/cba3bcd2dc09f5523bd3e20b1ca14be01d5b70f5/621_0_5160_4128/500.jpg",
    "summary": "Tanya Alfred provides key updates from day three of the County Championship, featuring matches at Lord’s and the Oval. Highlights include pivotal moments and player performances. Fans can stay informed on the latest developments in the tournament.",
    "published": "2025-09-10T09:29:15Z"
  },
  {
    "title": "Trump reportedly asks EU to levy 100% tariffs on India and China; Ozempic maker Novo to cut 9,000 jobs – business live",
    "url": "https://www.theguardian.com/business/live/2025/sep/10/trade-tariffs-eu-trump-ozempic-novo-jobs-markets-business-live-news",
    "image": "https://media.guim.co.uk/a22500b598bb72689541af622cd81fac33541b21/345_0_3452_2761/500.jpg",
    "summary": "The US president is seeking to increase pressure on Russia to halt its ongoing war in Ukraine. This push aims to strengthen diplomatic efforts and support for Ukraine. The administration is exploring additional measures to hold Russia accountable for its actions.",
    "published": "2025-09-10T09:28:23Z"
  },
  {
    "title": "New French PM to take office with ‘Block Everything’ protests already under way – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/sep/10/france-block-everything-protests-macron-lecornu-europe-live-news-updates",
    "image": "https://media.guim.co.uk/745c6099dec93820915edd28fdf4dec2f1151d98/958_0_6880_5504/500.jpg",
    "summary": "Sebastien Lecornu has been appointed as France's new Minister for Ecological Transition. His appointment coincides with upcoming protests and strikes against anticipated government spending cuts. The situation highlights rising tensions over the potential impact of austerity measures on public services.",
    "published": "2025-09-10T09:21:48Z"
  },
  {
    "title": "The Spin | ‘Afghan women dream of freedom and cricket",
    "url": "https://www.theguardian.com/sport/2025/sep/10/afghan-women-dream-of-freedom-the-spin-cricket",
    "image": "https://media.guim.co.uk/338a03ed8d03acb3f519274506b7e5c43f423a14/165_0_1789_1431/500.jpg",
    "summary": "Women’s rights in Afghanistan have significantly deteriorated since the Taliban's rise to power. There is an urgent need for increased support for athletes who have fled the country due to the regime's oppressive policies. Efforts to assist these athletes in exile are crucial for their well-being and for the future of women's sports.",
    "published": "2025-09-10T09:17:25Z"
  }
]