[
  {
    "title": "Tottenham latest, Russo’s new Arsenal deal, WSL season begins: football news – live",
    "url": "https://www.theguardian.com/football/live/2025/sep/05/tottenham-latest-russo-new-arsenal-deal-internationals-world-cup-qualifiers-wsl-football-news-live",
    "image": "https://media.guim.co.uk/ca621375f93307b4ac208a2c24bac73492a4744a/1027_274_2371_1896/500.jpg",
    "summary": "Denmark and Scotland are set to clash in an upcoming football match as part of the World Cup qualifying rounds. The anticipation builds as teams prepare for a weekend filled with crucial qualifiers. Fans and analysts are closely following the latest developments in the lead-up to the games.",
    "published": "2025-09-05T08:43:26Z"
  },
  {
    "title": "Angela Rayner’s political future in balance with rule breach report due – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/05/angela-rayner-stamp-duty-labour-starmer-reform-nigel-farage-uk-politics-live-news-updates",
    "image": "https://media.guim.co.uk/548c85e07b6173161b515e9503fe83ca2eac0715/581_0_5122_4098/500.jpg",
    "summary": "A verdict is anticipated today regarding whether a minister breached standards by purchasing a flat in Hove. The case examines compliance with established ministerial rules. The outcome could have implications for her political career.",
    "published": "2025-09-05T08:42:56Z"
  },
  {
    "title": "Australia news live: Penny Wong responds to photo of Daniel Andrews in China; proposed Sydney Harbour Bridge march headed to NSW supreme court",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/05/australia-news-live-albanese-trump-tariffs-meeting-porepunkah-police-officer-funerals-ntwnfb",
    "image": "https://media.guim.co.uk/a846efa35aa33f8fa191d054c04f5089731c4ec5/531_0_5695_4556/500.jpg",
    "summary": "I'm sorry, but I can't summarize the news without knowing the specific details or content you're referring to. Please provide the news article or main points you'd like me to summarize.",
    "published": "2025-09-05T08:41:38Z"
  },
  {
    "title": "Average UK house price rises to record £299,331, says Halifax",
    "url": "https://www.theguardian.com/business/2025/sep/05/average-uk-house-price-reaches-record-says-halifax",
    "image": "https://media.guim.co.uk/0b757d196ab2d9002e9c70d1342e88126aeb4f53/15_0_4660_3732/500.jpg",
    "summary": "In August, there was a 0.3% increase, marking the third consecutive month of growth. This rise exceeded market expectations. Analysts are taking note of this positive trend in economic activity.",
    "published": "2025-09-05T08:36:13Z"
  },
  {
    "title": "Putin says western troops in Ukraine would be ‘legitimate targets’ as European countries pledge security support – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/sep/05/volodymyr-zelenskyy-ukraine-robert-fico-slovakia-vladimir-putin-russia-energy-europe-live-news-updates",
    "summary": "French President Macron announced that 26 nations have provided support to Ukraine as President Zelenskyy meets with Slovakia's Prime Minister Fico. This meeting comes amid ongoing tensions regarding Russian energy supplies to the region. The collaborative efforts highlight international backing for Ukraine in light of its challenges.",
    "published": "2025-09-05T08:34:56Z"
  }
]