[
  {
    "title": "US Open 2025: Pegula and Alcaraz in quarter-final action on day 10 – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/02/us-open-tennis-2025-pegula-alcaraz-quarter-finals-day-ten-live",
    "image": "https://media.guim.co.uk/fe0cd6ec7cd5f1b5a768168ded167374725b094b/0_446_3292_2634/500.jpg",
    "summary": "Carlos Alcaraz competes against Jiri Lehecka, while Jessica Pegula faces Barbora Krejcikova in the tenth day of matches at Flushing Meadows. Live updates will be provided by Daniel Harris. Fans can follow the action as the tournament progresses.",
    "published": "2025-09-02T16:47:36Z"
  },
  {
    "title": "Asylum seekers could be housed in ‘modular buildings on industrial sites’ when hotels close, No 10 says – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/02/cooper-reeves-starmer-green-party-leader-badenoch-devolution-latest-updates",
    "image": "https://media.guim.co.uk/cc899723709724898bda36f423afeb4001c60d52/465_43_2005_1604/500.jpg",
    "summary": "A government spokesperson has announced that migrants may be accommodated in industrial sites as part of their housing strategy. This approach aims to address the ongoing challenges related to migrant housing. The decision reflects efforts to utilize available resources effectively.",
    "published": "2025-09-02T16:46:14Z"
  },
  {
    "title": "Outcry as Swedish ‘cultural canon’ snubs Abba and anything since 1975",
    "url": "https://www.theguardian.com/world/2025/sep/02/outcry-as-swedish-cultural-canon-snubs-abba-and-anything-since-1975",
    "image": "https://media.guim.co.uk/6d45491119b8daffb6bf8b6edab345792fa0acfa/465_0_5303_4243/500.jpg",
    "summary": "Critics describe a new 'shared map' of Swedish culture, which excludes developments since 1975, as a 'nationalist education project'. They argue that this approach overlooks significant cultural evolution and diversity in modern Sweden. The initiative has sparked controversy over its implications for national identity and historical representation.",
    "published": "2025-09-02T16:45:54Z"
  },
  {
    "title": "Margaret Atwood releases short story critiquing book bans in Canada",
    "url": "https://www.theguardian.com/world/2025/sep/02/margaret-atwood-alberta-canada-book-ban",
    "image": "https://media.guim.co.uk/1115c9f027eb6ac3eb550f059031f5961032b101/489_0_5001_4000/500.jpg",
    "summary": "Author Margaret Atwood humorously remarked that her novel \"The Handmaid's Tale\" was deemed 'suitable' after being banned in an Alberta school. The ban sparked discussions about censorship and the novel's relevance. Atwood's response highlights ongoing debates around literature in educational settings.",
    "published": "2025-09-02T16:44:53Z"
  },
  {
    "title": "England thrashed by South Africa with 175 balls to spare: first men’s one-day international – as it happened",
    "url": "https://www.theguardian.com/sport/live/2025/sep/02/england-south-africa-first-mens-odi-cricket-live",
    "image": "https://media.guim.co.uk/e238a1a500679e61e074d4708abc9fb9c3eebcfd/1259_909_3267_2613/500.jpg",
    "summary": "England struggled with their batting performance at Headingley, facing significant setbacks. Aiden Markram capitalized on the situation, delivering a strong performance against debutant Sonny Baker. The match showcased England's difficulties and Markram's dominance.",
    "published": "2025-09-02T16:44:39Z"
  }
]