[
  {
    "title": "‘She never got help’: mother says daughter who died on motorway was failed by care system",
    "url": "https://www.theguardian.com/society/2025/sep/21/she-never-got-help-mother-says-daughter-who-died-on-motorway-was-failed-by-care-system",
    "image": "https://media.guim.co.uk/7ed3bd69ab2861bddbcd6cddb32ae65f583748f1/101_0_738_590/500.jpg",
    "summary": "Tamzin Hall, a 17-year-old, was hit by a vehicle on the M5 motorway in Somerset after exiting a police car. She had recently been arrested at a children's home. The incident highlights concerns about the safety and handling of vulnerable youth in police custody.",
    "published": "2025-09-21T06:00:36Z"
  },
  {
    "title": "Owner of Georgian broadcaster called country’s ‘propaganda megaphone’ is based in London",
    "url": "https://www.theguardian.com/world/2025/sep/21/owner-of-georgian-broadcaster-called-countrys-propaganda-megaphone-is-based-in-london",
    "image": "https://media.guim.co.uk/d0f9bc4b698b6f948873458e1c303eb75b3a5838/122_0_2512_2010/500.jpg",
    "summary": "The owner of Imedi TV has rejected criticism from the EU's disinformation monitor regarding the channel's reporting. He asserts that the station operates with full editorial independence. The statement comes amid ongoing concerns about media integrity in the region.",
    "published": "2025-09-21T06:00:36Z"
  },
  {
    "title": "‘We must change’: how drought and overextraction of water has run Iran dry",
    "url": "https://www.theguardian.com/environment/2025/sep/21/we-must-change-how-drought-and-overextraction-of-water-has-run-iran-dry",
    "image": "https://media.guim.co.uk/e95683e47777ac1921fe2ac90b00b8f93e415f1c/625_0_3750_3000/500.png",
    "summary": "Iranians attribute their current challenges to a combination of climate change, international sanctions, government missteps, and neglect. In response, Iran's vice-president is prioritizing efforts to address these interconnected issues. The government aims to implement sustainable solutions to improve the situation for its citizens.",
    "published": "2025-09-21T06:00:36Z"
  },
  {
    "title": "Red flags: how to avoid falling victim to a ‘money mule’ scam",
    "url": "https://www.theguardian.com/money/2025/sep/21/how-to-avoid-falling-victim-to-a-money-mule-scam",
    "image": "https://media.guim.co.uk/25d7c0fbbeb85f6b2e9949d7011b9afe9fff50c5/0_0_3840_3072/500.jpg",
    "summary": "Receiving illicit funds in your account, even unintentionally, can lead to serious legal consequences. Passing on these funds may result in hefty fines, legal fees, or criminal charges. It’s crucial to stay vigilant and report any suspicious transactions to avoid these repercussions.",
    "published": "2025-09-21T06:00:35Z"
  },
  {
    "title": "From the Gobi to Ghana: 10 of the best community tourism trips around the world",
    "url": "https://www.theguardian.com/travel/2025/sep/21/community-tourism-trips-holiday-traditional-customs",
    "image": "https://media.guim.co.uk/4889eb09eb91fdffce2729d6ec4e884f09802d7a/993_0_3394_2717/500.jpg",
    "summary": "Enhance your next vacation by choosing an itinerary that prioritizes local welfare initiatives and women's empowerment. Engage with communities to experience and support traditional customs. This approach promotes ethical travel while enriching your holiday experience.",
    "published": "2025-09-21T06:00:35Z"
  }
]