[
  {
    "title": "‘It shaped his identity’: did Éamon de Valera’s ‘Spanish father’ ever exist?",
    "url": "https://www.theguardian.com/world/2025/sep/03/did-eamon-de-valera-spanish-father-ever-exist",
    "image": "https://media.guim.co.uk/0263e59a6f116490a723fc57316a2bf99f854d40/0_97_2577_2061/500.jpg",
    "summary": "A documentary commemorating the 50th anniversary of former Irish Prime Minister Sean Lemass's death explores the unresolved questions surrounding his paternity. The film aims to delve into the historical context and implications of these mysteries. It highlights Lemass's significant impact on Irish politics and society.",
    "published": "2025-09-03T05:30:14Z"
  },
  {
    "title": "TV tonight: an optimistic new dating show for Married at First Sight fans ",
    "url": "https://www.theguardian.com/tv-and-radio/2025/sep/03/tv-tonight-an-optimistic-new-dating-show-for-married-at-first-sight-fans",
    "image": "https://media.guim.co.uk/b2dc77cfb1192d0e2d9057c1fd51eaf4e73e320d/996_0_5020_4016/500.jpg",
    "summary": "A new show features strangers who marry and embark on an extended honeymoon on a tropical island, raising questions about the potential challenges they might face. The episode also includes an engaging history lesson. Tune in tonight for a blend of romance and education.",
    "published": "2025-09-03T05:20:14Z"
  },
  {
    "title": "Australia politics live: PM sidesteps questions about Andrews at Xi military parade; Ley turns up heat on aged care minister",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/03/australia-politics-live-labor-coalition-greens-anthony-albanese-sussan-ley-question-time-nauru-immigration-asylum-ntwnfb",
    "image": "https://media.guim.co.uk/b4c7905326a7b75d25ec4772575a01c05fd68201/415_0_5161_4131/500.jpg",
    "summary": "I'm sorry, but I need the specific news content you'd like summarized. Please provide the details or main points of the news article you're referring to.",
    "published": "2025-09-03T05:13:06Z"
  },
  {
    "title": "From the Pocket: Charlie Curnow and Carlton give insight into how deals are made. It’s not pretty",
    "url": "https://www.theguardian.com/sport/2025/sep/03/from-the-pocket-charlie-curnow-and-carlton-give-insight-into-how-deals-are-made-its-not-pretty",
    "image": "https://media.guim.co.uk/06ed67c3988bfbad93426187ad07a253c3bc8fa3/0_0_5126_4103/500.jpg",
    "summary": "Tensions are rising as challenges strain the friendship between involved parties, but the club maintains a strong position. Despite the pressures, they possess significant advantages in the situation. Ultimately, they are likely to control the outcome moving forward.",
    "published": "2025-09-03T05:00:16Z"
  },
  {
    "title": "Labour has succeeded only in strengthening Farage. The way is now open for Zack Polanski’s Greens | George Monbiot",
    "url": "https://www.theguardian.com/commentisfree/2025/sep/03/green-party-zack-polanski-labour-reform",
    "image": "https://media.guim.co.uk/1b0f3ac870ed9dc8c43c503b6deeefd513675f9e/0_0_5000_4000/500.jpg",
    "summary": "Guardian columnist George Monbiot argues that Labour's concessions to the hard right and corporate interests have created a significant opportunity for the Green party. He suggests that the new Green party leader is well-positioned to capitalize on this gap. Monbiot's commentary highlights the shifting political landscape in the UK.",
    "published": "2025-09-03T05:00:16Z"
  }
]