[
  {
    "title": "England v Australia: rugby league Ashes second Test – live",
    "url": "https://www.theguardian.com/sport/live/2025/nov/01/england-v-australia-rugby-league-ashes-second-test-live",
    "image": "https://media.guim.co.uk/60202a33499bb2747ef19636a48370c54335f46c/181_20_2500_2000/500.jpg",
    "summary": "The Kangaroos aim for series victory in Merseyside as they face England. Stuart Goodwin provides a minute-by-minute report on the match. Fans are eager to see if England can make a comeback.",
    "published": "2025-11-01T15:16:05Z"
  },
  {
    "title": "England v Australia: Autumn Nations Series rugby union – live",
    "url": "https://www.theguardian.com/sport/live/2025/nov/01/england-v-australia-autumn-nations-series-rugby-union-live",
    "image": "https://media.guim.co.uk/3a3bd560325e89228f60a3fff110fb190ccfaf5c/1167_125_3787_3030/500.jpg",
    "summary": "The report provides a live update on a match taking place at Twickenham, where teams are kicking off their November campaigns. Sarah Rendell is delivering minute-by-minute coverage of the game. Fans await to see which team will secure a victory.",
    "published": "2025-11-01T15:15:09Z"
  },
  {
    "title": "Burnley v Arsenal, Nottingham Forest v Manchester United, and more: football – live",
    "url": "https://www.theguardian.com/football/live/2025/nov/01/burnley-v-arsenal-nottingham-forest-v-manchester-united-and-more-football-live",
    "image": "https://media.guim.co.uk/f6d34c9c3263c8c78a3401b68072455e8e8125b8/152_0_3002_2402/500.jpg",
    "summary": "Billy Munday will provide updates on team news and goals during a busy day of league and cup football. Fans can expect live coverage and highlights from the matches. Stay tuned for all the action and insights.",
    "published": "2025-11-01T15:14:58Z"
  },
  {
    "title": "Trump’s immigration raids continue through Halloween in Chicago and Los Angeles",
    "url": "https://www.theguardian.com/us-news/2025/nov/01/trump-immigration-chicago-los-angeles-halloween",
    "image": "https://media.guim.co.uk/1f44100d4acf5a25e1c3ded2fabb698608cbe4c4/442_0_5000_4000/500.jpg",
    "summary": "Protesters in a Chicago suburb confronted ICE agents, leading to accusations from Evanston’s mayor that the agents \"assaulted\" local residents. The incident reflects rising tensions between law enforcement and community activists. The confrontation highlights ongoing debates about immigration enforcement and community safety.",
    "published": "2025-11-01T15:11:16Z"
  },
  {
    "title": "Chelsea defender Wesley Fofana gets driving ban for speeding on hard shoulder",
    "url": "https://www.theguardian.com/world/2025/nov/01/chelsea-defender-wesley-fofana-gets-driving-ban-for-speeding-on-hard-shoulder",
    "image": "https://media.guim.co.uk/b613d1b900bc8323dbb524d34d64fefa2c732f5f/1485_111_2583_2067/500.jpg",
    "summary": "A footballer has pleaded guilty to a charge of dangerous driving, which was documented on video. The incident involved reckless behavior behind the wheel. The player's guilty plea underscores the serious consequences of such actions.",
    "published": "2025-11-01T14:53:45Z"
  }
]