[
  {
    "title": "Sweden v Switzerland, France v Azerbaijan: World Cup qualifying clockwatch – live",
    "url": "https://www.theguardian.com/football/live/2025/oct/10/tuchel-criticises-silent-england-fans-world-cup-qualifying-news-and-more-football-live",
    "image": "https://media.guim.co.uk/6cca3f04b8bfca36f0090b037edca62bef722ed1/357_0_2882_2307/500.jpg",
    "summary": "This rolling report covers the latest updates from World Cup qualifying matches featuring France, Germany, and Sweden. Join our writers as they provide ongoing coverage and insights into the teams' performances. Stay tuned for real-time updates and key moments from the games.",
    "published": "2025-10-10T19:14:47Z"
  },
  {
    "title": "‘Substantial’ federal layoffs begin as Congress remains deadlocked over funding to end shutdown – live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/10/letitia-james-donald-trump-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/84c7b03bccaa2922d85ef889e5129dcd2e773dba/475_0_5000_4000/500.jpg",
    "summary": "The White House budget office has not specified the exact number of layoffs, as the Treasury Department reports that job cuts have already commenced. The Department of Homeland Security announced that the Cybersecurity and Infrastructure Security Agency will be affected by these layoffs. Concerns grow over the impact on critical infrastructure and cybersecurity efforts.",
    "published": "2025-10-10T19:07:09Z"
  },
  {
    "title": "Hamas praises Trump but says Tony Blair not welcome in post-war Gaza role – live",
    "url": "https://www.theguardian.com/world/live/2025/oct/10/gaza-ceasefire-plan-israel-donald-trump-hamas-palestine-benjamin-netanyahu-middle-east-latest-news",
    "image": "https://media.guim.co.uk/715b6748a97400308c7ea16c85bbeab3a959e509/403_0_2204_1763/500.jpg",
    "summary": "A senior Hamas official credited US President Biden with facilitating a ceasefire, emphasizing that it wouldn't have occurred without his intervention. However, he noted that Palestinians hold \"bad memories\" associated with Tony Blair, suggesting skepticism about foreign involvement. The remarks highlight the complex dynamics of trust and diplomacy in the region.",
    "published": "2025-10-10T19:04:41Z"
  },
  {
    "title": "‘I expect to find a ghost city’: Gaza residents on the long, arduous journey back home",
    "url": "https://www.theguardian.com/world/2025/oct/10/i-expect-to-find-a-ghost-city-gaza-residents-on-the-long-arduous-journey-back-home",
    "image": "https://media.guim.co.uk/f98d4a0dd9cbf28e133dbd76c77dee7b7ebb5d3b/89_0_2657_2126/500.jpg",
    "summary": "As the ceasefire between Hamas and Israel approaches, returnees express anxiety about the condition of their homes after a prolonged absence. Many are worried whether their properties will still be intact or safe to inhabit. The uncertainty reflects broader concerns about the lasting impact of the conflict on communities.",
    "published": "2025-10-10T18:57:59Z"
  },
  {
    "title": "Trump’s strong-arming of Netanyahu led to a deal. He must sustain that pressure | Mohamad Bazzi",
    "url": "https://www.theguardian.com/commentisfree/2025/oct/10/trump-netanyahu-gaza-deal",
    "image": "https://media.guim.co.uk/2ccee67fb25fda15f86e0899b865019ea97baf52/272_0_6237_4990/500.jpg",
    "summary": "The US president, who previously refrained from exerting influence over the prime minister, appears to have shifted his approach. Last month marked a turning point in their interactions. This change suggests a potential for increased US involvement in the prime minister's decisions.",
    "published": "2025-10-10T18:44:27Z"
  }
]