[
  {
    "title": "Australia news live: Albanese heads to Trump reception in New York; number of regular gamblers rising",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/24/australia-news-live-anthony-albanese-new-york-united-nations-donald-trump-climate-crisis-palestine-israel-gaza-ntwnfb",
    "image": "https://media.guim.co.uk/9cbc16f6f681c618d15764d70a04cb253fd43ea3/893_0_4796_3837/500.jpg",
    "summary": "It seems like there was an error, as you haven’t provided a specific news article or content to summarize. If you share the details or key points, I'd be happy to help summarize it!",
    "published": "2025-09-23T21:28:04Z"
  },
  {
    "title": "Trump says Ukraine could regain all territory lost to Russia since 2022 invasion after meeting Zelenskyy at UN – live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/23/donald-trump-unga-autism-tylenol-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/a25b42e2be033e6f69d3a2acfe088ab740d153fb/1361_323_5481_4385/500.jpg",
    "summary": "US President's recent social media post demonstrates one of the strongest endorsements for Ukraine amidst ongoing conflict. The statement reinforces the United States' commitment to support Kyiv and its efforts. This move signals a continued partnership between the US and Ukraine in addressing current challenges.",
    "published": "2025-09-23T21:27:29Z"
  },
  {
    "title": "Lincoln 1-2 Chelsea, Liverpool 2-1 Southampton, and more: Carabao Cup – as it happened",
    "url": "https://www.theguardian.com/football/live/2025/sep/23/lincoln-v-chelsea-liverpool-v-southampton-and-more-carabao-cup-live",
    "image": "https://media.guim.co.uk/1ff54e509a60903e21dc7cc1a97fb90f639531f5/496_0_4617_3694/500.jpg",
    "summary": "Alexander Isak scored his first goal for Liverpool, contributing to the team's success. However, Hugo Ekitike received a red card for his exuberant celebration following the late winning goal. The incident overshadowed Isak's achievement, highlighting the emotions of the match.",
    "published": "2025-09-23T21:13:58Z"
  },
  {
    "title": "Ekitiké sees red after Liverpool winner as Isak opens account against Saints",
    "url": "https://www.theguardian.com/football/2025/sep/23/liverpool-southampton-carabao-cup-match-report",
    "image": "https://media.guim.co.uk/7fca315799d1275986511ee128b71a4d456b9eb3/355_355_4157_3327/500.jpg",
    "summary": "Hugo Ekitiké received a second yellow card for his celebration after scoring the decisive goal in Liverpool's fourth-round victory against Southampton. The controversial decision impacted the match despite Ekitiké's contribution. Liverpool progressed in the tournament with the win.",
    "published": "2025-09-23T21:11:14Z"
  },
  {
    "title": "Buonanotte caps Chelsea comeback to end Lincoln’s Carabao Cup dream",
    "url": "https://www.theguardian.com/football/2025/sep/23/lincoln-chelsea-carabao-cup-match-report",
    "image": "https://media.guim.co.uk/28d8397145f94692f24cdcce7d7625a325e0fdfd/145_0_2442_1954/500.jpg",
    "summary": "Chelsea won 2-1 against Lincoln in the Carabao Cup third round. Rob Street initially put Lincoln ahead, but Chelsea responded with goals from Tyrique George and Facundo Buonanotte. The victory secured Chelsea's advancement in the tournament.",
    "published": "2025-09-23T21:08:23Z"
  }
]