[
  {
    "title": "Buildup to Liverpool v Arsenal and Celtic v Rangers – matchday live",
    "url": "https://www.theguardian.com/football/live/2025/aug/31/buildup-to-liverpool-v-arsenal-and-celtic-v-rangers-matchday-live",
    "image": "https://media.guim.co.uk/b9e257357d79ff4b22c1fc79b1ce02d231f0bf38/0_0_5000_4000/500.jpg",
    "summary": "Join our writers for live updates and reactions leading up to this afternoon's thrilling Premier League matches. Stay informed with the latest developments as the games unfold. Don't miss out on the action!",
    "published": "2025-08-31T10:32:16Z"
  },
  {
    "title": "Rangers v Celtic: Scottish Premiership updates – live",
    "url": "https://www.theguardian.com/football/live/2025/aug/31/rangers-v-celtic-scottish-premiership-updates-live",
    "image": "https://media.guim.co.uk/60bb6c941babb62e5885c082a7ff09662f39efb7/273_0_5000_4000/500.jpg",
    "summary": "Daniel Harris will provide live, minute-by-minute coverage of the first Old Firm match of the season, featuring Rangers and Celtic. The match takes place at Ibrox Stadium. Fans can expect detailed updates throughout the event.",
    "published": "2025-08-31T10:31:15Z"
  },
  {
    "title": "Rachel Reeves is under immense pressure. She must not waste her chance to ‘go big’",
    "url": "https://www.theguardian.com/business/2025/aug/31/rachel-reeves-is-under-immense-pressure-she-must-not-waste-her-chance-to-go-big",
    "image": "https://media.guim.co.uk/966fb619e293e0aabf50ac947921c3580ca7d586/811_0_6680_5344/500.jpg",
    "summary": "The Chancellor faces the challenge of reforming the uneven tax system while maintaining voter support and ensuring stability in financial markets. Balancing necessary changes without causing public discontent or market anxiety is essential. Effective communication and strategic planning will be crucial for successful implementation.",
    "published": "2025-08-31T10:30:11Z"
  },
  {
    "title": "Richard Tice hits back at C of E criticism of Reform immigration policy",
    "url": "https://www.theguardian.com/politics/2025/aug/31/richard-tice-church-archbishop-criticism-reform-immigration-policy",
    "image": "https://media.guim.co.uk/621038b229ce3f974db381d7b70cc9ae6d411d7b/0_0_1996_1597/500.jpg",
    "summary": "The deputy leader has urged the archbishop to refrain from commenting on the issue after Stephen Cottrell criticized the policy as isolationist and reactive. The call for restraint reflects tensions between church leaders and political figures over the policy's implications. The situation highlights ongoing debates about the intersection of religion and politics.",
    "published": "2025-08-31T10:28:36Z"
  },
  {
    "title": "Vladimir Putin arrives in China for security summit – Ukraine war live",
    "url": "https://www.theguardian.com/world/live/2025/aug/31/russia-ukraine-war-control-major-ukrainian-city-latest-updates-news-live",
    "image": "https://media.guim.co.uk/544de0f374aa00a9bf9f9df3cc80afaf27bdb9ee/438_0_3683_2946/500.jpg",
    "summary": "Russian President Vladimir Putin and Indian Prime Minister Narendra Modi are among over 20 world leaders gathering at the Shanghai Cooperation Organisation summit in Tianjin. This meeting aims to enhance cooperation and address regional security issues. The summit highlights the role of the SCO in fostering international collaboration among its member states.",
    "published": "2025-08-31T10:26:23Z"
  }
]