[
  {
    "title": "Australia politics live: Labor spruiks affordable home build; Joyce’s anti-net zero bill debate to continue in parliament",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/01/australia-politics-live-labor-coalition-housing-net-zero-anthony-albanese-sussan-ley-question-time-ntwnfb",
    "image": "https://media.guim.co.uk/46894d815d599e937a45021afe625a5239d4066b/630_0_5409_4329/500.jpg",
    "summary": "I'm sorry, but I need more context or the specific news content you would like summarized. Please provide the details you'd like me to summarize.",
    "published": "2025-08-31T21:26:26Z"
  },
  {
    "title": "US Open tennis 2025: Alcaraz through, Krejcikova saves eight match points against Townsend – live",
    "url": "https://www.theguardian.com/sport/live/2025/aug/31/us-open-tennis-2025-carlos-alcaraz-aryna-sabalenka-pegula-fritz-townsend-day-eight-live",
    "image": "https://media.guim.co.uk/3be8601df513c0f83c0b28d70f5f29c568e02379/1790_250_4332_3465/500.jpg",
    "summary": "The fourth round of singles matches is starting at the U.S. Open in Flushing Meadows. Fans and players alike are gearing up for an exciting tournament as the competition intensifies. Stay updated on all the latest developments and match highlights.",
    "published": "2025-08-31T21:24:24Z"
  },
  {
    "title": "Police officer ‘punched in face’ as four arrested at London anti-asylum protest",
    "url": "https://www.theguardian.com/uk-news/2025/aug/31/police-officer-allegedly-punched-in-face-and-four-arrests-made-at-london-anti-asylum-protest",
    "image": "https://media.guim.co.uk/80b30a2cf83e95515abfdd944efe7d85c01c5fbc/433_0_5000_4000/500.jpg",
    "summary": "The Metropolitan Police reported that a small group of aggressive masked protesters emerged at a previously peaceful demonstration in the Isle of Dogs. Authorities noted the contrast between the earlier calm atmosphere and the later aggressive behavior. No specific incidents were detailed, but the police are monitoring the situation.",
    "published": "2025-08-31T21:20:38Z"
  },
  {
    "title": "Angela Rayner ‘clear she followed rules’ when buying Hove flat, says Bridget Phillipson",
    "url": "https://www.theguardian.com/politics/2025/aug/31/angela-rayner-clear-followed-rules-when-buying-hove-flat-bridget-phillipson",
    "image": "https://media.guim.co.uk/3b93b4f523c59c9257b82237c86df0e9abf848be/168_77_1698_1358/500.jpg",
    "summary": "The Education Secretary has publicly supported her cabinet colleague, who is facing allegations of evading stamp duty during a property purchase. She argues that the claims are unfounded and that her colleague followed the appropriate legal processes. The controversy has sparked discussions about accountability among government officials.",
    "published": "2025-08-31T21:07:31Z"
  },
  {
    "title": "The Inheritance review – even host Rob Rinder looks bored by this tedious mess of a reality show",
    "url": "https://www.theguardian.com/tv-and-radio/2025/aug/31/the-inheritance-review-rob-rinder-reality-show-channel-4",
    "image": "https://media.guim.co.uk/47ac4575704b5d88c18c98509c4aaf7bd57ead72/598_0_7314_5856/500.jpg",
    "summary": "The new series starring Elizabeth Hurley aspires to capture the essence of \"The Traitors\" but falls short. It is described as a confusing and overcomplicated show that leaves viewers disengaged. Overall, it fails to generate the intrigue or care that similar series evoke.",
    "published": "2025-08-31T21:05:39Z"
  }
]