[
  {
    "title": "Australia v England: Ashes second Test, day three – live",
    "url": "https://www.theguardian.com/sport/live/2025/dec/06/australia-vs-england-live-ashes-second-2nd-test-day-three-aus-v-eng-cricket-scores-updates-gabba-brisbane",
    "image": "https://media.guim.co.uk/8f8b59aa14d81e328d2f31e8a18a10cdb0effac2/1260_225_4615_3692/500.jpg",
    "summary": "The hosts aim to extend their 44-run first-innings lead as play resumes at the Gabba. An over-by-over report offers live updates on the match. Join the writers for continuous coverage and insights.",
    "published": "2025-12-06T03:06:29Z"
  },
  {
    "title": "Suspected smuggling boat struck twice by military was reportedly moving drugs to South American country, not US –as it happened",
    "url": "https://www.theguardian.com/us-news/live/2025/dec/05/trump-pete-hegseth-signal-politics-updates",
    "image": "https://media.guim.co.uk/4665e3169400d6beac0d92a65967133d1496f625/490_0_2635_2110/500.jpg",
    "summary": "The live blog has concluded, indicating that updates and coverage have officially ended. Any ongoing discussions or news will no longer be provided. Viewers are encouraged to check back later for future updates.",
    "published": "2025-12-06T02:58:27Z"
  },
  {
    "title": "Ukraine war briefing: Progress depends on Russia taking peace talks seriously, say Washington and Kyiv",
    "url": "https://www.theguardian.com/world/2025/dec/06/ukraine-war-briefing-progress-depends-on-russian-taking-peace-talks-seriously-say-washington-and-kyiv",
    "image": "https://media.guim.co.uk/158f19f3e2973536665ee4b1e2fc24df423cd772/731_0_3653_2923/500.jpg",
    "summary": "The US and Ukraine are conducting a three-day discussion in Florida to strengthen cooperation. French President Emmanuel Macron assures that there is \"no mistrust\" between Europe and the Biden administration. The talks aim to address ongoing issues and bolster support for Ukraine amid current geopolitical tensions.",
    "published": "2025-12-06T02:42:59Z"
  },
  {
    "title": "Socceroos should not be overawed by 2026 World Cup group that plays to their strengths | Joey Lynch",
    "url": "https://www.theguardian.com/football/blog/2025/dec/06/australia-socceroos-2026-world-cup-group-strengths",
    "image": "https://media.guim.co.uk/740ce4deb6ae7c49fe89bd710c0fb3917cbc5a4e/9_18_3027_2422/500.jpg",
    "summary": "Australia is preparing for a challenging match-up against the USA, Paraguay, and a European qualifier in upcoming tournaments. Despite being considered underdogs, the team has developed a tournament-optimized style of play. Their strategy is poised to leverage their strengths in high-stakes competition.",
    "published": "2025-12-06T02:24:16Z"
  },
  {
    "title": "Trump news at a glance: list of countries under US travel ban set to grow",
    "url": "https://www.theguardian.com/us-news/2025/dec/05/trump-administration-news-update-today",
    "image": "https://media.guim.co.uk/8a56fbd26a22bd0adece95d9b8b420a7cbdb8361/0_0_4377_3501/500.jpg",
    "summary": "US Department of Homeland Security Secretary Kristi Noem announced plans to expand the travel list to over 30 countries. This expansion aims to enhance security measures and streamline travel processes. Specific details on the countries included in the expanded list have yet to be revealed.",
    "published": "2025-12-06T02:08:58Z"
  }
]