[
  {
    "title": "Saracens’ McCall says welfare guidelines leaves players unprepared for new season",
    "url": "https://www.theguardian.com/sport/2025/sep/29/saracens-mccall-welfare-guidelines-players-unprepared-rugby",
    "image": "https://media.guim.co.uk/08848d4583952139a4b6353d9f86b90b16afd944/29_0_4588_3670/500.jpg",
    "summary": "Saracens' Mark McCall expressed concerns that the requirement for international players to take 10 weeks off can leave them unprepared for the rigorous demands of the game upon their return. He believes this extended break may hinder athletes' readiness for competitive play. McCall's comments highlight the challenges of balancing rest and preparation in professional rugby.",
    "published": "2025-09-29T17:15:19Z"
  },
  {
    "title": "Donald Trump ‘very confident’ ceasefire deal can be reached as he meets Benjamin Netanyahu – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/29/donald-trump-benjamin-netanyahu-gaza-white-house-us-politics-live",
    "image": "https://media.guim.co.uk/a8b6c8649e35b49d2fe7de99634765c3b1a3f0e7/1351_0_2223_1779/500.jpg",
    "summary": "US President Biden is set to urge Israeli Prime Minister Netanyahu to establish a new framework aimed at ending the conflict in Gaza. The discussions will also focus on securing the release of hostages held by Hamas. This initiative comes amid ongoing violence and humanitarian concerns in the region.",
    "published": "2025-09-29T17:15:19Z"
  },
  {
    "title": "Jack Spence obituary",
    "url": "https://www.theguardian.com/world/2025/sep/29/jack-spence-obituary",
    "image": "https://media.guim.co.uk/202203050086062fd0170322290d65281ac8887a/0_31_1100_880/500.png",
    "summary": "A prominent political authority in South Africa, whose insights were instrumental in navigating the transition from apartheid to democracy, has passed away. Their contributions significantly shaped the nation's political landscape. The legacy of their guidance will be remembered in the ongoing pursuit of democracy and equality.",
    "published": "2025-09-29T17:07:24Z"
  },
  {
    "title": "Andy Burnham calls for UK to rejoin EU within his lifetime and rejects claim he is fiscally irresponsible – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/29/rachel-reeves-labour-party-conference-youth-guarantee-unemployment-uk-politics-live-latest-news",
    "image": "https://media.guim.co.uk/4d545c94f4024f1c5c49ee15f0b236d5448cfc1a/329_0_2500_2000/500.jpg",
    "summary": "The Mayor of Greater Manchester expressed strong attachment to the city, stating he would have to be \"wrenched\" out to leave. He also advocated for the UK to rejoin the European Union. His comments highlight ongoing discussions about the implications of Brexit.",
    "published": "2025-09-29T17:00:57Z"
  },
  {
    "title": "Andy Burnham, the Schrödinger’s cat of the Labour party conference | John Crace",
    "url": "https://www.theguardian.com/politics/2025/sep/29/andy-burnham-the-schrodingers-cat-of-the-labour-party-conference",
    "image": "https://media.guim.co.uk/75489d611b5c2b16842269b7bb3c2f00626a91a3/60_0_5000_4000/500.jpg",
    "summary": "A prominent figure remains a topic of silent acknowledgment among ministers, as they avoid directly mentioning his name. His presence looms large in discussions, influencing thoughts and actions. Despite the absence of overt references, his impact is unmistakable in the political landscape.",
    "published": "2025-09-29T16:54:40Z"
  }
]