[
  {
    "title": "Buildup to Chelsea v Fulham, Bayern agree Jackson loan, and more – matchday live",
    "url": "https://www.theguardian.com/football/live/2025/aug/30/buildup-to-chelsea-v-fulham-in-the-premier-league-transfer-latest-and-more-matchday-live",
    "image": "https://media.guim.co.uk/36ff84da35fa7135de5e4fa0c389b73ce973f8b6/0_0_5000_4000/500.jpg",
    "summary": "Rob Smyth provides a live update on the latest happenings in the Premier League as a busy afternoon unfolds. Fans can stay tuned for ongoing coverage and insights. Don't miss out on the action and key developments.",
    "published": "2025-08-30T08:37:29Z"
  },
  {
    "title": "Children among dozens injured after Russian attack on Zaporizhzhia – Ukraine war live",
    "url": "https://www.theguardian.com/world/live/2025/aug/30/russia-ukraine-war-live-news-updates-zaporizhzhia",
    "image": "https://media.guim.co.uk/30390121f92efe33dc9b1434dbdc35e1ac6bf668/427_111_1126_901/500.jpg",
    "summary": "Ukrainian President Volodymyr Zelenskyy reported that a five-story residential building was attacked, resulting in one death and many injuries. The incident highlights the ongoing violence in the region. Emergency services are responding to the situation.",
    "published": "2025-08-30T08:35:30Z"
  },
  {
    "title": "A desperate, opportunist press and vicious politicians: no wonder the debate on refugees is so awful | Jane Martinson",
    "url": "https://www.theguardian.com/commentisfree/2025/aug/30/press-politicians-debate-refugees-migration-uk",
    "image": "https://media.guim.co.uk/24f3226e31f9f9eb6d4da2a7a5d8205f234c7865/833_0_4167_3333/500.jpg",
    "summary": "Guardian columnist Jane Martinson emphasizes the critical importance of migration as a contemporary issue that deserves serious attention. She contends that much of the UK media has failed to adequately address it. This oversight may result in a negative historical judgment on the media's handling of the topic.",
    "published": "2025-08-30T08:00:55Z"
  },
  {
    "title": "‘Literature can be a form of resistance’: Lea Ypi talks to Elif Shafak about writing in the age of demagogues",
    "url": "https://www.theguardian.com/books/2025/aug/30/literature-can-be-a-form-of-resistance-lea-ypi-talks-to-elif-shafak-about-writing-in-the-age-of-demagogues",
    "image": "https://media.guim.co.uk/bc9397126270ec7b03efcc091df6c3aa940884df/957_1831_5155_4123/500.jpg",
    "summary": "An Albanian author and a Turkish novelist engage in a dialogue about the rise of populism and censorship, emphasizing how contemporary conflicts are linked to unresolved historical traumas. They explore the impact of these issues on society and literature. Their discussion highlights the importance of addressing past grievances to understand current challenges.",
    "published": "2025-08-30T08:00:55Z"
  },
  {
    "title": "Suspected Porepunkah gunman Dezi Freeman had deteriorating mental health and a black belt in karate, former friend says",
    "url": "https://www.theguardian.com/australia-news/2025/aug/30/porepunkah-shooting-dezi-freeman-victoria-police-deteriorating-mental-health-black-belt-karate-ntwnfb",
    "image": "https://media.guim.co.uk/7bfa1dc97e7fddde4b5195df4d88a0ffadd42a8e/166_0_3858_3086/500.jpg",
    "summary": "A longtime acquaintance of 56-year-old Freeman believes that dispatching 10 Victoria police officers to execute a warrant was the \"worst thing\" that could have happened to him. The individual, who has known Freeman since the 1990s, expresses concern about the heavy-handed approach. The incident raises questions about the appropriateness of such police actions.",
    "published": "2025-08-30T07:45:33Z"
  }
]