[
  {
    "title": "Barcelona v PSG, Monaco v Manchester City and more: Champions League and Championship – live",
    "url": "https://www.theguardian.com/football/live/2025/oct/01/barcelona-v-psg-monaco-v-manchester-city-and-more-champions-league-and-championship-live",
    "image": "https://media.guim.co.uk/ee9d2f6156c200dfd46b31c33d8d61c014d4b827/561_236_2363_1890/500.jpg",
    "summary": "Michael Butler will provide live updates on Wednesday's Champions League and Championship matches in a football clockwatch. Fans can catch all the latest scores and developments throughout the games. Stay tuned for real-time commentary and insights.",
    "published": "2025-10-01T20:20:41Z"
  },
  {
    "title": "Arsenal v Olympiakos: Champions League – live",
    "url": "https://www.theguardian.com/football/live/2025/oct/01/arsenal-v-olympiakos-champions-league-live",
    "image": "https://media.guim.co.uk/93382fa0bb343a170542c02077204ce43725542d/35_302_3574_2859/500.jpg",
    "summary": "Mikel Arteta's team aims for their second consecutive league win. A minute-by-minute report by John Brewin will cover the match. Stay updated on the game's progress.",
    "published": "2025-10-01T20:20:25Z"
  },
  {
    "title": "Israeli military boards Global Sumud aid flotilla headed for Gaza – Middle East crisis live",
    "url": "https://www.theguardian.com/world/live/2025/oct/01/israel-gaza-aid-global-sumud-flotilla-middle-east-crisis-latest-updates",
    "image": "https://media.guim.co.uk/1dc8eff7cd550ab162294c9a1525393e9bf0e162/107_0_705_564/500.jpg",
    "summary": "Vessels transporting around 500 activists, including Greta Thunberg, were intercepted approximately 75 miles off the coast of a conflict-affected region. The activists were likely involved in a mission related to climate action. Details about the interception's cause or implications remain unclear.",
    "published": "2025-10-01T20:08:55Z"
  },
  {
    "title": "Trump administration suggests ‘imminent’ layoffs as bipartisan group of senators seek way out of government shutdown – live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/01/us-government-shutdown-update-2025-shutting-funding-trump-democrats-republicans-live-updates-latest-news",
    "image": "https://media.guim.co.uk/c3c341192462c427995c443709fedd57ab223dd0/450_0_4655_3724/500.jpg",
    "summary": "Lawmakers are showing promising bipartisan collaboration to address the funding lapse. However, JD Vance has made a false claim that Democrats aim to fund healthcare for undocumented immigrants. This highlights ongoing tensions and misunderstandings in the political discourse surrounding funding issues.",
    "published": "2025-10-01T20:01:07Z"
  },
  {
    "title": "Corrections and clarifications",
    "url": "https://www.theguardian.com/news/2025/oct/01/corrections-and-clarifications",
    "summary": "In Coulsdon, a new candidate has emerged in the local elections, aiming to address key community issues. The candidate has outlined plans to improve infrastructure and public services. Local residents are encouraged to engage with the candidate's proposals ahead of the election.",
    "published": "2025-10-01T20:00:28Z"
  }
]