[
  {
    "title": "Tottenham v Villarreal: Champions League – live",
    "url": "https://www.theguardian.com/football/live/2025/sep/16/tottenham-v-villarreal-champions-league-live",
    "image": "https://media.guim.co.uk/61a587ca21d74609cde59a0a9df7ec77f3d4c8ff/500_0_5000_4000/500.jpg",
    "summary": "The Europa League holders made their comeback in a match held in north London. Fans can follow the action through a minute-by-minute report. Scott Murray is providing live updates on the game.",
    "published": "2025-09-16T19:22:11Z"
  },
  {
    "title": "Real Madrid v Marseille, Juventus v Dortmund, and more: Champions League – live",
    "url": "https://www.theguardian.com/football/live/2025/sep/16/real-madrid-v-marseille-juventus-v-dortmund-and-more-champions-league-live",
    "image": "https://media.guim.co.uk/ab37131b08b5ac3a088fc645827ccc3ec118520a/416_0_4158_3326/500.jpg",
    "summary": "Rob Smyth covers the opening night of the league stage, highlighting key goals and news. Fans can stay updated on the latest developments and match highlights. Tune in for comprehensive coverage and analysis of the action.",
    "published": "2025-09-16T19:20:33Z"
  },
  {
    "title": "Athletic Bilbao v Arsenal: Champions League – as it happened",
    "url": "https://www.theguardian.com/football/live/2025/sep/16/athletic-bilbao-v-arsenal-champions-league-live-score-updates",
    "image": "https://media.guim.co.uk/26a167141e3c5e625870e4e64a03f4088060fc79/345_0_4140_3313/500.jpg",
    "summary": "Arsenal began their campaign with a successful start, as substitutes Gabriel Martinelli and Leandro Trossard contributed to the victory at San Mames. The match was characterized by a lack of quality play. Overall, the win marked a positive opening for Arsenal.",
    "published": "2025-09-16T19:19:20Z"
  },
  {
    "title": "Charlie Kirk shooting suspect charged with aggravated murder; prosecutors will seek death penalty – live updates",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/16/donald-trump-new-york-times-defamation-charlie-kirk-vance-miller-news-updates-us-politics-live",
    "image": "https://media.guim.co.uk/4a1d60dc3de5d421f2ea9e52fd25edb30c6915b9/1142_0_5345_4276/500.jpg",
    "summary": "Tyler Robinson is facing charges for the fatal shooting of Charlie Kirk, as detailed by a Utah attorney. The suspect will be held without bail while the prosecution pursues the death penalty. The case highlights severe implications for Robinson given the nature of the allegations.",
    "published": "2025-09-16T19:16:47Z"
  },
  {
    "title": "Charlie Kirk killing suspect charged with aggravated murder by Utah prosecutors",
    "url": "https://www.theguardian.com/us-news/2025/sep/16/charlie-kirk-shooter-charged",
    "image": "https://media.guim.co.uk/bbf7566da5de1b6f92d27020ca364083921c9782/566_0_5417_4335/500.jpg",
    "summary": "Tyler Robinson has been charged with aggravated murder, felony discharge of a firearm, and witness tampering. He faces serious legal repercussions, including the possibility of the death penalty. The case underscores the severity of the alleged offenses.",
    "published": "2025-09-16T19:16:04Z"
  }
]