[
  {
    "title": "World Series 2025 Game 1: Los Angeles Dodgers v Toronto Blue Jays – live updates",
    "url": "https://www.theguardian.com/sport/live/2025/oct/24/world-series-2025-game-1-los-angeles-dodgers-v-toronto-blue-jays-live-updates",
    "image": "https://media.guim.co.uk/d24cd7eb4bf0ebd3d759de54703bfd40f791e4ab/454_0_4519_3617/500.jpg",
    "summary": "The World Series kicks off with Game 1 featuring the LA Dodgers facing off against the Toronto Blue Jays. Fans can follow the live coverage and updates provided by David Lengel. Stay tuned for all the action throughout the game.",
    "published": "2025-10-25T01:24:20Z"
  },
  {
    "title": "Trump adviser Stephen Miller insists East Wing of White House ‘is not part of the White House’ – live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/24/donald-trump-trade-negotiations-canada-mark-carney-terminated-tariff-letitia-james-new-york-us-politics-live-news",
    "image": "https://media.guim.co.uk/29732c27862e88d1171e657752fb01cbf8d15aa0/38_0_2805_2244/500.jpg",
    "summary": "Miller appeared on Fox News to assert that an extension built almost 125 years ago does not constitute part of the residence. His claim sparked discussion and skepticism regarding the historical and architectural significance of the extension. Critics argue that such statements downplay the importance of preserving historical structures.",
    "published": "2025-10-25T01:16:24Z"
  },
  {
    "title": "At least four people shot near Howard University, Washington DC police say",
    "url": "https://www.theguardian.com/us-news/2025/oct/24/howard-university-shooting-police",
    "image": "https://media.guim.co.uk/cefaf5df99536726fc111c329dd6cf6d627806bc/720_0_7200_5760/500.jpg",
    "summary": "Police have not provided details regarding injuries or potential suspects in a recent incident. Early reports indicate that one individual is in critical condition. Further information is expected as the investigation unfolds.",
    "published": "2025-10-25T01:13:02Z"
  },
  {
    "title": "Ex-60 Minutes producer Bill Owens says bosses discouraged him from covering Gaza and Trump",
    "url": "https://www.theguardian.com/us-news/2025/oct/24/60-minutes-bill-owens",
    "image": "https://media.guim.co.uk/fca23607e3ce71888457cce2a5bd15118fbdcae4/361_0_4640_3712/500.jpg",
    "summary": "The leader of a show who resigned in April has revealed he faced pressure to apologize for edits made to a Kamala Harris interview. His resignation comes amid controversy surrounding the show’s handling of the interview content. The incident highlights challenges in media integrity and editorial decisions.",
    "published": "2025-10-25T00:50:32Z"
  },
  {
    "title": "Portland judge rejects Trump request to allow national guard deployment",
    "url": "https://www.theguardian.com/us-news/2025/oct/24/portland-judge-rejects-trump-ice",
    "image": "https://media.guim.co.uk/e833f1319943c9c8934756a44b237b27937dc77d/653_0_6528_5222/500.jpg",
    "summary": "Karin Immergut is set to make a decision by Monday on whether to lift her order that currently prevents federalized troops from patrolling the city. The ruling will impact the presence of federal forces in the area. This decision comes amid ongoing discussions about security measures in the city.",
    "published": "2025-10-25T00:48:32Z"
  }
]