[
  {
    "title": "White House says Netanyahu ‘expressed deep regret’ that Israeli strike on Doha killed Qatari serviceman – live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/29/donald-trump-benjamin-netanyahu-gaza-white-house-us-politics-live",
    "image": "https://media.guim.co.uk/a8b6c8649e35b49d2fe7de99634765c3b1a3f0e7/1351_0_2223_1779/500.jpg",
    "summary": "Former President Trump facilitated a phone call involving the United States, Israel, and Qatar. This occurred prior to a press conference he held with Israeli Prime Minister Benjamin Netanyahu at the White House. The discussions likely focused on regional issues and diplomatic relations.",
    "published": "2025-09-29T18:27:37Z"
  },
  {
    "title": "Cannabis stocks soar after Trump shares video promoting drug’s use for seniors",
    "url": "https://www.theguardian.com/society/2025/sep/29/cannabis-stocks-trump-cbd-medicaid",
    "image": "https://media.guim.co.uk/7e00e0a1866a58ecf4bc9518dc08945e0f02f6c5/379_0_3794_3035/500.jpg",
    "summary": "A video on Truth Social highlights CBD as a revolutionary product, claiming it offers significant benefits. The clip also advocates for Medicaid to cover CBD products, suggesting increased accessibility for those in need. This promotion aligns with a growing interest in the medicinal uses of CBD.",
    "published": "2025-09-29T18:26:04Z"
  },
  {
    "title": "Everton v West Ham: Premier League – live",
    "url": "https://www.theguardian.com/football/live/2025/sep/29/everton-v-west-ham-premier-league-live",
    "image": "https://media.guim.co.uk/c5ef91625e4635011bfb5ce83674795ec781bc67/439_186_4028_3223/500.jpg",
    "summary": "Nuno Espírito Santo debuts as West Ham's manager in a match against David Moyes' team at Hill Dickinson Stadium. The event is being covered with a minute-by-minute report by Daniel Harris. Fans can follow along for updates on the match.",
    "published": "2025-09-29T18:25:39Z"
  },
  {
    "title": "Trump administration spending $625m to revive dying coal industry",
    "url": "https://www.theguardian.com/us-news/2025/sep/29/trump-spending-coal-industry",
    "image": "https://media.guim.co.uk/c1f934de542e17385f302979c86a4da32c89c421/618_646_3597_2877/500.jpg",
    "summary": "The White House has designated 13.1 million acres of public land for coal mining, despite a significant decline in the industry over the past 30 years. This move raises concerns about the potential environmental impact and the future of coal as an energy source. The decision comes amid ongoing debates about energy transition and federal land use policies.",
    "published": "2025-09-29T18:18:46Z"
  },
  {
    "title": "Covid school closures in UK damaged ‘very fabric of childhood’",
    "url": "https://www.theguardian.com/uk-news/2025/sep/29/covid-school-closures-in-uk-damaged-very-fabric-of-childhood",
    "image": "https://media.guim.co.uk/75a91e7c16ec6917d709c710bfd19a383f9f01cc/337_0_3158_2526/500.jpg",
    "summary": "An inquiry revealed that children have been exposed to pornography and experienced significant harm while lacking protection from schools. The investigation highlighted serious gaps in safeguarding measures within educational institutions. The findings call for urgent action to improve the protection and well-being of students.",
    "published": "2025-09-29T18:15:37Z"
  }
]