[
  {
    "title": "Mike Johnson claimed Trump was anti-Epstein informant, then retreated amid criticism",
    "url": "https://www.theguardian.com/us-news/2025/sep/08/mike-johnson-trump-epstein-fbi-informant",
    "image": "https://media.guim.co.uk/69b8e5f0e307b44cd5380b8758d3aa0ee301ccde/750_0_4680_3744/500.jpg",
    "summary": "The House Speaker controversially suggested that President Biden collaborated with the FBI to dismantle Jeffrey Epstein's operations. This statement sparked confusion and backlash. The Speaker later retracted or clarified the claim, distancing from the assertion.",
    "published": "2025-09-08T13:34:39Z"
  },
  {
    "title": "Trump tells foreign firms to ‘respect’ immigration laws after Hyundai raid – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/08/donald-trump-immigration-hyundai-tariffs-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/206b6a050c7692b19e2a312a1b21419be68db1c9/224_0_2045_1636/500.jpg",
    "summary": "The President expresses support for foreign investments in the U.S., emphasizing the importance of hiring and training American workers. He encourages overseas companies to contribute to the domestic workforce. This approach aims to enhance job opportunities for Americans while attracting global capital.",
    "published": "2025-09-08T13:33:15Z"
  },
  {
    "title": "Man charged with murder of one woman and violent attack on another in north London",
    "url": "https://www.theguardian.com/uk-news/2025/sep/08/man-charged-with-murder-of-one-woman-and-violent-attack-on-another-north-london-tottenham",
    "image": "https://media.guim.co.uk/a578ec3162986137ac2c32f6cb71be486aec7b97/252_0_3780_3024/500.jpg",
    "summary": "Simon Levy, 40, has been charged with the murder of Sheryl Wilkins, 39. He faces additional allegations of rape and grievous bodily harm. The case highlights serious concerns regarding violent crimes.",
    "published": "2025-09-08T13:29:21Z"
  },
  {
    "title": "Europe live: François Bayrou says lawmakers face ‘not a political, but historical question’ on France’s future, ahead of confidence vote",
    "url": "https://www.theguardian.com/world/live/2025/sep/08/europe-live-macron-france-prime-minister-francois-bayrou-confidence-vote-latest-news",
    "image": "https://media.guim.co.uk/27d25520fffb3884efcb6e72485f947141dc0929/132_0_5380_4304/500.jpg",
    "summary": "Bayrou is set to become the third prime minister to depart within a year, creating challenges for President Macron. This ongoing turnover complicates the political landscape in France. The situation intensifies the difficulty of finding a suitable replacement.",
    "published": "2025-09-08T13:28:34Z"
  },
  {
    "title": "Lightning stops play at Somerset v Yorkshire: county cricket day one – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/08/county-championship-cricket-surrey-warwickshire-somerset-yorkshire-live",
    "image": "https://media.guim.co.uk/5bd8314df1c4395889e9e74ef0ec0907bcb1fce0/0_0_4978_3981/500.jpg",
    "summary": "Tanya Aldred provides live updates on the County Championship as it resumes after a month-long hiatus. Fans can expect coverage of the day's events and highlights from various matches. Stay tuned for insights and key moments in the cricket tournament.",
    "published": "2025-09-08T13:23:42Z"
  }
]