[
  {
    "title": "Australia news live: severe weekend storms forecast for east coast; Bondi Sands recalls two sunscreens due to formulation concerns",
    "url": "https://www.theguardian.com/australia-news/live/2025/nov/14/australia-news-live-net-zero-coalition-sussan-ley-liberals-climate-change-anthony-albanese-labor-hobart-stadium-ntwnfb",
    "image": "https://media.guim.co.uk/b0655a87d9ef2aaf86cffec0301c857e2f642003/0_0_4566_3655/500.jpg",
    "summary": "Sure! Please provide the news content you'd like me to summarize.",
    "published": "2025-11-14T06:31:07Z"
  },
  {
    "title": "TV tonight: David Olusoga’s epic series about the British empire",
    "url": "https://www.theguardian.com/tv-and-radio/2025/nov/14/tv-tonight-david-olusogas-epic-series-about-the-british-empire",
    "image": "https://media.guim.co.uk/d597f38dcd0e8415c1fb27d8cca968b04d734741/1068_0_3277_2623/500.jpg",
    "summary": "A historian is traveling to Australia to explore the impacts of the American Revolution. Additionally, a feature on notable medieval battles is highlighted. Viewers are encouraged to tune in for tonight's programming.",
    "published": "2025-11-14T06:20:20Z"
  },
  {
    "title": "‘Eat out to help out’ scheme added to air pollution in London, study finds",
    "url": "https://www.theguardian.com/environment/2025/nov/14/eat-out-to-help-out-scheme-air-pollution-london-study-covid",
    "image": "https://media.guim.co.uk/5f647841de45e271b8692d741f0857e797a776f7/103_0_3150_2521/500.jpg",
    "summary": "During the autumn of 2020, unusual peaks in COVID-19 cases were linked to commercial cooking activities, as indicated by research conducted while pandemic policies were in effect. This finding underscores the impact of food preparation environments on virus transmission. The results emphasize the need for targeted health measures in such settings.",
    "published": "2025-11-14T06:00:21Z"
  },
  {
    "title": "Benjamina Ebuehi’s recipe for apple, brown butter and oat loaf | The sweet spot",
    "url": "https://www.theguardian.com/food/2025/nov/14/apple-brown-butter-and-oat-loaf-recipe-benjamina-ebuehi",
    "image": "https://media.guim.co.uk/bbb9f534619f3e7bd8041e44d234ee778fd98505/0_517_3392_2711/500.jpg",
    "summary": "A versatile cake ideal for colder months can be enjoyed at breakfast or as a dessert. Its wholesome ingredients make it a comforting choice for various occasions. Perfect for warming up during chilly days!",
    "published": "2025-11-14T06:00:21Z"
  },
  {
    "title": "Call of Duty: Black Ops 7 review – hallucinogenic romp through dystopia is stupidly pleasurable",
    "url": "https://www.theguardian.com/games/2025/nov/14/call-of-duty-black-ops-7-review-playstation-xbox-pc",
    "image": "https://media.guim.co.uk/2cb94e8288310f13e3b6da89f678409768cb9b8a/0_54_1028_822/500.jpg",
    "summary": "The latest installment of the game delivers exhilarating shootout sequences in stunning locations, along with an engaging campaign mode and impressive multiplayer features. Its maximalist approach to action offers a thrilling experience. Overall, it promises a fun-filled adventure packed with chaos and excitement.",
    "published": "2025-11-14T06:00:20Z"
  }
]