[
  {
    "title": "Trump says he was ‘still friends’ with Erdoğan while in US ‘exile’ and demands Turkey stop buying Russian oil – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/25/donald-trump-james-comey-fbi-ice-texas-latest-us-politics-news-updates-live",
    "image": "https://media.guim.co.uk/f83c833ce0272b0c0ac36e4737fae25fc01fdf60/455_0_6020_4819/500.jpg",
    "summary": "During a visit to the White House, President Biden reflected on the four years since the 2020 election loss while hosting Turkish President Recep Tayyip Erdoğan. The meeting highlights ongoing diplomatic relations and discussions between the U.S. and Turkey. Biden's remarks underscore the contrasting political landscape since the last election.",
    "published": "2025-09-25T16:22:07Z"
  },
  {
    "title": "ID cards ‘will make Britons’ everyday lives easier and build trust’, claims Blair thinktank - UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/25/andy-burnham-steve-reed-keir-starmer-labour-news-updates-uk-politics-live",
    "image": "https://media.guim.co.uk/c53b08140f6d0024e3945a9fe299a17f1af576c2/2039_0_3252_2601/500.jpg",
    "summary": "Thinktank representative Alexander Iosad asserts that new identification cards will address illegal migration issues and facilitate access to government services for individuals. The initiative aims to streamline service delivery while enhancing security measures. This approach is expected to benefit both citizens and authorities.",
    "published": "2025-09-25T16:21:04Z"
  },
  {
    "title": "Nottinghamshire crowned county cricket champions for the seventh time – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/25/nottinghamshire-close-on-title-against-warwickshire-county-cricket-final-round-live",
    "image": "https://media.guim.co.uk/c3e6c3a731ad0186bb7a888e1265b9380b6fb396/995_0_3818_3056/500.jpg",
    "summary": "Tanya Aldred will provide live updates from the final round of County Championship matches this season. Cricket fans can expect insights and highlights as the action unfolds. Stay tuned for the latest developments in the matches.",
    "published": "2025-09-25T16:20:01Z"
  },
  {
    "title": "Amazon to pay $2.5bn to settle FTC lawsuit over Prime ‘subscription traps’",
    "url": "https://www.theguardian.com/technology/2025/sep/25/amazon-prime-ftc-settlement",
    "image": "https://media.guim.co.uk/e38b7a553c4b00e17c11ec59160e739d2a2c6499/666_0_3334_2667/500.jpg",
    "summary": "A US regulator has accused a company of enrolling millions of customers in a service without their consent and creating obstacles for them to cancel their subscriptions. This practice raises concerns about consumer protection and transparency. The regulator is taking action to address these issues and ensure compliance.",
    "published": "2025-09-25T16:16:44Z"
  },
  {
    "title": "Damning results show how much work there is still to do for women and ethnic minorities in football | Suzanne Wrack",
    "url": "https://www.theguardian.com/football/2025/sep/25/damning-results-show-much-work-to-do-for-women-ethnic-minorities-football",
    "image": "https://media.guim.co.uk/1c94f278cc868ea89e06ab82a893fb73c0d7c6c4/159_0_4179_3344/500.jpg",
    "summary": "A recent Women in Football survey reveals troubling statistics, with 80% of women experiencing sexism in the sport. Additionally, only 29% of respondents from underrepresented ethnic backgrounds believe they can succeed in football. This highlights ongoing challenges regarding inclusivity and equality in the industry.",
    "published": "2025-09-25T16:16:17Z"
  }
]