[
  {
    "title": "Australia news live: Alan Joyce secures final $3.8m bonus; man caught riding motorbike at 218km/hr on Queensland highway",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/05/australia-news-live-albanese-trump-tariffs-meeting-porepunkah-police-officer-funerals-ntwnfb",
    "summary": "Please provide the specific news article or details you would like me to summarize in three lines.",
    "published": "2025-09-05T05:28:53Z"
  },
  {
    "title": "TV tonight: Domhnall Gleeson tries to save a failing newspaper in new mockumentary",
    "url": "https://www.theguardian.com/tv-and-radio/2025/sep/05/tv-tonight-domhnall-gleeson-tries-to-save-a-failing-newspaper-in-new-mockumentary",
    "image": "https://media.guim.co.uk/3907673ef0017fd98f5eb222bb09345741ca5d4e/76_0_2500_2000/500.jpg",
    "summary": "The comedy \"The Paper,\" produced by Gervais and Merchant, humorously critiques US journalism. Additionally, the popular duo Mitchell and Webb come together again for a new sketch show. These are highlights of what to watch this evening.",
    "published": "2025-09-05T05:20:15Z"
  },
  {
    "title": "US Open tennis 2025 women’s semi-finals: Anisimova beats Osaka to set up Sabalenka final – as it happened",
    "url": "https://www.theguardian.com/sport/live/2025/sep/04/us-open-tennis-womens-semi-finals-sabalenka-pegula-osaka-anisimova-live",
    "image": "https://media.guim.co.uk/47439c90ae81c1a82a38908dce58e6f941bae82c/72_0_3675_2940/500.jpg",
    "summary": "Amanda Anisimova rallied from a set down to secure her spot in the finals. She will face the world No. 1 in the championship match on Saturday. The victory marks a significant achievement for Anisimova in the tournament.",
    "published": "2025-09-05T05:16:08Z"
  },
  {
    "title": "Nigel Farage uses private company to pay less tax on GB News earnings",
    "url": "https://www.theguardian.com/politics/2025/sep/05/nigel-farage-uses-private-company-to-pay-less-tax-on-gb-news-earnings",
    "image": "https://media.guim.co.uk/cc389c732b547b132b32978aa108a10a908e1689/100_0_1000_800/500.jpg",
    "summary": "A reform leader is facing criticism for utilizing a personal services firm, a practice that has drawn negative attention from various political factions. This controversy highlights broader concerns about transparency and accountability in political financing. The situation underscores the need for clearer regulations regarding the use of such firms in political contexts.",
    "published": "2025-09-05T05:00:18Z"
  },
  {
    "title": "UK exit from ECHR ‘would remove foundations of Good Friday agreement’",
    "url": "https://www.theguardian.com/world/2025/sep/05/uk-exit-from-echr-would-remove-foundations-of-good-friday-agreement",
    "image": "https://media.guim.co.uk/51558f7ba786363f255fd488b47591edd9397a74/0_224_2052_1641/500.jpg",
    "summary": "Irish Deputy Prime Minister emphasizes that the peace deal in Northern Ireland cannot be compromised by British politicians seeking to leave the European Convention on Human Rights (ECHR). He highlights the importance of upholding commitments to ensure stability and peace in the region. The statement underscores the interconnectedness of the peace agreement and human rights protections.",
    "published": "2025-09-05T05:00:17Z"
  }
]