[
  {
    "title": "‘Iconic, heroic, trailblazing’: Democrats praise Pelosi’s work after she announces plan to retire – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/nov/06/donald-trump-government-shutdown-venezuela-senate-vote-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/9305a5fb4cacc6e0ced5395b6e23371ab27f961d/262_0_1611_1289/500.jpg",
    "summary": "House Minority Leader Hakeem Jeffries praised Nancy Pelosi as the \"greatest Speaker of all time\" following her announcement that she intends to step down in 2027. Pelosi's decision marks a significant transition in leadership as she reflects on her impactful career. Her tenure has been notable for significant legislative achievements and navigating party challenges.",
    "published": "2025-11-06T18:30:25Z"
  },
  {
    "title": "Marcus Smith urged to kickstart England attack against Fiji after setbacks",
    "url": "https://www.theguardian.com/sport/2025/nov/06/marcus-and-fin-smith-return-with-itoje-on-the-bench-for-england-v-fiji-clash",
    "image": "https://media.guim.co.uk/cec12cdf0c1eae0fe99bb9ec04bddf686f087d87/469_0_3850_3080/500.jpg",
    "summary": "Steve Borthwick has recognized that Marcus Smith's involvement with the England team has decreased. Despite this, he has encouraged Smith to revitalize the team's attack in their upcoming match against Fiji. Borthwick believes Smith's contributions are crucial for enhancing their performance.",
    "published": "2025-11-06T18:23:27Z"
  },
  {
    "title": "Bolivia’s ex-president who oversaw bloody crackdown on protesters freed from prison",
    "url": "https://www.theguardian.com/world/2025/nov/06/bolivia-ex-president-freed-prison",
    "image": "https://media.guim.co.uk/678b0f74760f04348e083cc6d89e60dbab0a600a/139_0_1916_1532/500.jpg",
    "summary": "A court released former Bolivian President Jeanine Áñez after the Supreme Court overturned her conviction for allegedly orchestrating a coup to take power. The ruling criticized the legal proceedings against her as politically motivated. Áñez's release marks a significant shift in the ongoing political tensions in Bolivia.",
    "published": "2025-11-06T18:12:42Z"
  },
  {
    "title": "Man jailed for murder of ‘good Samaritan’ helping injured woman in Sheffield",
    "url": "https://www.theguardian.com/uk-news/2025/nov/06/hassan-jhangur-jailed-murder-man-helping-injured-woman-in-street-chris-marriott",
    "image": "https://media.guim.co.uk/9f64ee5922b5a2e323359b1b7184182846fbe5b8/0_290_1000_800/500.jpg",
    "summary": "Hassan Jhangur has been sentenced to life in prison for the fatal killing of Chris Marriott. The incident occurred when Jhangur drove his car into a crowd during a wedding brawl. The court deemed his actions deliberate and reckless, leading to the severe punishment.",
    "published": "2025-11-06T18:10:08Z"
  },
  {
    "title": "Southport inquiry: killer’s parents must be ‘held to account’, say victims’ families",
    "url": "https://www.theguardian.com/uk-news/2025/nov/06/southport-inquiry-father-says-son-turned-out-to-be-a-monster",
    "image": "https://media.guim.co.uk/63769c31e20c797a37a053493156edf23cc4cfe6/0_0_5906_4724/500.jpg",
    "summary": "Alphonse Rudakubana tearfully apologized for not notifying police about the threat his son posed. His admission has sparked calls for responsibility and awareness regarding familial accountability. The incident highlights the need for better communication and intervention in potentially dangerous situations.",
    "published": "2025-11-06T18:01:19Z"
  }
]