[
  {
    "title": "EU to hold talks on Ukraine peace plan; US to send officials to Moscow and Kyiv – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/nov/26/russia-ukraine-war-peace-plan-europe-latest-news-updates",
    "image": "https://media.guim.co.uk/5e8cb749d8f50161a3d089c9b00ce1c7b01fc343/280_0_3065_2452/500.jpg",
    "summary": "European Commission President Ursula von der Leyen is set to provide a debrief to EU lawmakers regarding recent negotiations. The update aims to inform legislators about the outcomes and implications of the talks. This briefing reflects the Commission's commitment to transparency and collaboration with EU member states.",
    "published": "2025-11-26T08:26:06Z"
  },
  {
    "title": "Rachel Reeves looks to reassure bond markets with tax-heavy budget – business live",
    "url": "https://www.theguardian.com/business/live/2025/nov/26/rachel-reeves-budget-uk-tax-rises-cash-isa-bond-markets-gilts-pound-stock-markets-latest-news-updates",
    "image": "https://media.guim.co.uk/79fab6ce4e05e26f2624f47e96d0e8468d64eade/520_0_3716_2972/500.jpg",
    "summary": "The latest economic and financial news highlights growing anticipation in the City as stakeholders prepare for the upcoming budget announcement. Analysts are closely monitoring potential implications for various sectors. Market reactions are expected as details emerge, influencing investment decisions.",
    "published": "2025-11-26T08:17:30Z"
  },
  {
    "title": "Jingle Bell Heist review – Netflix comedy is slight cut above standard festive filler",
    "url": "https://www.theguardian.com/film/2025/nov/26/jingle-bell-heist-review-netflix-comedy",
    "image": "https://media.guim.co.uk/1717d4f92d624ca3905679a6f8927ce3432fe01e/560_0_5033_4024/500.jpg",
    "summary": "A Christmas-themed film set in London features a heist at a department store, bolstered by a strong cast and engaging plot twists. While the story is moderately entertaining, it ultimately delivers a familiar holiday narrative. The combination of charm and intrigue makes it a worthwhile seasonal watch.",
    "published": "2025-11-26T08:01:44Z"
  },
  {
    "title": "Labor’s nature laws risk collapse with deal yet to be struck on eve of parliament’s final sitting day ",
    "url": "https://www.theguardian.com/australia-news/2025/nov/26/labor-nature-laws-greens-parliament-final-sitting-day",
    "image": "https://media.guim.co.uk/344d1c10729cc232cab06f9fd0489d2df6b8ecc2/208_0_4012_3210/500.jpg",
    "summary": "If Labor fails to reach a deal on Thursday, it will be the second instance in a year where they have not secured the proposed reforms to the EPBC Act. This ongoing challenge highlights difficulties in achieving consensus on environmental policy. The government's ability to implement impactful changes remains in question.",
    "published": "2025-11-26T07:29:54Z"
  },
  {
    "title": "Goodbye Chinese Noodle House, hello ... Chinese Noodle Houses? Sydney favourite to become two identically named – and competing – diners",
    "url": "https://www.theguardian.com/australia-news/2025/nov/26/chinese-noodle-house-closes-identically-named-competing-diners-haymarket",
    "image": "https://media.guim.co.uk/1bfb7e7703ee0a1cc709be52c2681043194d717d/45_0_5460_4368/500.jpg",
    "summary": "The Haymarket restaurant has drawn large crowds following news that its lease will not be renewed. However, it is part of a larger trend, as there are a dozen spinoffs of Chinese noodle restaurants throughout the city. This situation highlights the popularity and transformation of the dining scene in the area.",
    "published": "2025-11-26T07:23:16Z"
  }
]