[
  {
    "title": "Liverpool v Nottingham Forest, Fulham v Sunderland, and more: Premier League – live",
    "url": "https://www.theguardian.com/football/live/2025/nov/22/liverpool-v-nottingham-forest-fulham-v-sunderland-premier-league-live-clockwatch",
    "image": "https://media.guim.co.uk/d1f2aab877a167b7e015e895e1dfb22a1f9b5207/719_0_4745_3797/500.jpg",
    "summary": "Tim de Lisle will provide live updates on goals and other key moments from the afternoon matches in the Premier League and other leagues. Stay tuned for the latest developments as the action unfolds. Don’t miss out on any important scores or highlights!",
    "published": "2025-11-22T15:18:07Z"
  },
  {
    "title": "Wales v New Zealand: Autumn Nations Series rugby union – live",
    "url": "https://www.theguardian.com/sport/live/2025/nov/22/wales-v-new-zealand-autumn-nations-series-rugby-union-live",
    "image": "https://media.guim.co.uk/b4ac2e9b50aa901574e93e3747cb71fb1b67aa98/854_0_4270_3416/500.jpg",
    "summary": "Wales, coming off their first victory under coach Steve Tandy, prepare to face a formidable New Zealand team in Cardiff. The match promises to be a significant test for the Welsh squad. Follow along with Daniel Gallan for minute-by-minute updates.",
    "published": "2025-11-22T15:17:19Z"
  },
  {
    "title": "Brazilian police arrest Bolsonaro amid suspicions he was about to flee",
    "url": "https://www.theguardian.com/world/2025/nov/22/far-right-former-president-jair-bolsonaro-arrested-in-brazil",
    "image": "https://media.guim.co.uk/28299cd26cb005726bef0fc856481cef483cd627/124_0_2434_1947/500.jpg",
    "summary": "Former Brazilian President Jair Bolsonaro was placed under house arrest for allegedly orchestrating a coup to prevent Luiz Inácio Lula da Silva from assuming the presidency after his 2022 election victory. Bolsonaro's actions have raised significant concerns about democracy in Brazil. The situation underscores ongoing political tensions in the country following the election.",
    "published": "2025-11-22T15:16:54Z"
  },
  {
    "title": "Cop30 live: rumours of deal as delegates prepare for final plenary",
    "url": "https://www.theguardian.com/environment/live/2025/nov/22/cop30-climate-talks-deal-overtime-live-news",
    "image": "https://media.guim.co.uk/410e6c1216e81f2d331e156e15d1703df652b560/346_0_3449_2761/500.jpg",
    "summary": "After extensive all-night negotiations, the Brazilian presidency is optimistic about reaching a deal with various political parties. The discussions aimed to address key issues that have been contentious. Continued cooperation among parties seems promising following these meetings.",
    "published": "2025-11-22T15:08:29Z"
  },
  {
    "title": "‘The ad libs had us shaking behind the camera’: Corbyn and McKellen cameos raise panto’s profile",
    "url": "https://www.theguardian.com/stage/2025/nov/22/jeremy-corbyn-ian-mckellen-pantomine-wizard-oz-islington",
    "image": "https://media.guim.co.uk/671e699cb7730b4d881a354a4b9bf334f48d6cc0/0_334_1544_1234/500.jpg",
    "summary": "Star performances are driving increased ticket sales this season, highlighted by a captivating Islington production of \"The Wizard of Oz.\" The show features an MP in a leading role and an Olivier Award-winning actor portraying Toto. This surge in star power is attracting more audiences to theaters.",
    "published": "2025-11-22T15:00:42Z"
  }
]