[
  {
    "title": "Wales v Belgium: World Cup 2026 qualifying – live",
    "url": "https://www.theguardian.com/football/live/2025/oct/13/wales-v-belgium-world-cup-2026-qualifying-live",
    "image": "https://media.guim.co.uk/09690204461501eae61eb0a5067e218b17531e32/538_216_3519_2816/500.jpg",
    "summary": "Craig Bellamy's team aims for a crucial win against Belgium to boost their chances of qualifying for next summer's finals. The match presents an important opportunity for the squad. Michael Butler will provide coverage of the event.",
    "published": "2025-10-13T19:12:44Z"
  },
  {
    "title": "All living Israeli hostages freed and hundreds of Palestinian detainees and prisoners released as Trump leads Egypt summit – live",
    "url": "https://www.theguardian.com/world/live/2025/oct/13/gaza-ceasefire-live-updates-israel-hostages-release-hamas-trump-middle-east",
    "image": "https://media.guim.co.uk/3335e41e059e1c25b39bc7c74536ee353f73ad85/1689_1054_2699_2160/500.jpg",
    "summary": "US President Biden attended an international summit in Egypt, joining global leaders to discuss regional stability. This event followed the joyous reunions of Israeli families with released hostages and the release of Palestinian detainees. The developments highlight ongoing tensions and efforts for peace in the region.",
    "published": "2025-10-13T19:10:07Z"
  },
  {
    "title": "Muddle over semantics or pressure from China? Collapsed spying case remains baffling",
    "url": "https://www.theguardian.com/politics/2025/oct/13/muddle-over-semantics-or-pressure-from-china-collapsed-spying-case-remains-baffling",
    "image": "https://media.guim.co.uk/ee066fc4e3dd3dbb4e6362791aaffbf989d4408e/139_0_860_688/500.jpg",
    "summary": "Labour accused the Tory government of neglecting to classify China as a threat despite significant evidence pointing to its potential dangers. The party argues this oversight has serious implications for national security. Critics emphasize the importance of accurately assessing global threats in policy-making.",
    "published": "2025-10-13T18:51:50Z"
  },
  {
    "title": "Trump sets sights on peace with Iran as he hails ‘end of Gaza war’",
    "url": "https://www.theguardian.com/world/2025/oct/13/donald-trump-sets-sights-peace-iran-hails-end-war-israel-hamas",
    "image": "https://media.guim.co.uk/f5944880d1d17c4519b334a49d033127067fc20b/617_250_3713_2970/500.jpg",
    "summary": "In a speech to the Israeli Knesset following the release of hostages, US President highlighted a \"historic dawn of a new Middle East.\" He emphasized the potential for peace and cooperation in the region. The remarks come amidst ongoing efforts to stabilize relations between Israel and its neighbors.",
    "published": "2025-10-13T18:47:42Z"
  },
  {
    "title": "Farage criticises ‘disgraceful’ rhetoric after alleged attack on Reform council leader",
    "url": "https://www.theguardian.com/politics/2025/oct/13/farage-criticises-disgraceful-rhetoric-after-alleged-attack-on-reform-council-leader",
    "image": "https://media.guim.co.uk/4a138e0c6067b23330a8d1669c877152eb428d8d/0_0_5710_4570/500.jpg",
    "summary": "Nineteen-year-old George Finch reported being labeled a \"racist\" and \"fascist\" during an incident in Warwickshire on Friday. The comments were made during a confrontation, although details of the event remain unclear. Finch's experience has sparked discussions about rising tensions and accusations of racism in similar incidents.",
    "published": "2025-10-13T18:33:26Z"
  }
]