[
  {
    "title": "Ferrari cuts number of cars it sends to UK after tax changes",
    "url": "https://www.theguardian.com/business/2025/oct/17/ferrari-cuts-number-of-cars-it-sends-to-uk-after-tax-changes",
    "image": "https://media.guim.co.uk/7328ee84251f34521de54751d5b91d588994058a/17_274_4087_3272/500.jpg",
    "summary": "The non-domicile tax regime was abolished in April, prompting concerns among businesses. A carmaker has reported that some individuals are leaving the country as a result of this change. This shift may impact the overall economic landscape and attract further scrutiny.",
    "published": "2025-10-17T07:15:37Z"
  },
  {
    "title": "Stock markets hit by US regional bank worries and trade tensions – business live",
    "url": "https://www.theguardian.com/business/live/2025/oct/17/us-dollar-worst-week-since-august-trade-tensions-stock-markets-bonds-business-live-news",
    "image": "https://media.guim.co.uk/e377b16e9d60276db23a73b8447d47e7d5b2dcec/500_0_5000_4000/500.jpg",
    "summary": "Stay updated with the latest developments in the economy and financial markets as key events unfold. Insights into trends, stock performances, and economic indicators will be provided. This coverage aims to keep readers informed about the dynamic financial landscape.",
    "published": "2025-10-17T07:12:54Z"
  },
  {
    "title": "Chess: Ukraine soldier grandmaster wins gold medal at European team championships",
    "url": "https://www.theguardian.com/sport/2025/oct/17/chess-ukraine-soldier-grandmaster-wins-gold-medal-at-european-team-championships",
    "image": "https://media.guim.co.uk/cda2013bf442e7bab980b2b4a2c2a5027844bc00/664_0_6827_5464/500.jpg",
    "summary": "Igor Kovalenko, a 36-year-old chess player ranked world No. 48 with a FIDE rating of 2669, has returned to competitive play after a hiatus of three years. During this time, he served as a frontline soldier. He resumed playing chess just a month ago.",
    "published": "2025-10-17T07:00:05Z"
  },
  {
    "title": "WSL considers borrowing tens of millions to accelerate growth plans",
    "url": "https://www.theguardian.com/football/2025/oct/17/wsl-considers-borrowing-tens-of-millions-to-accelerate-growth-plans",
    "image": "https://media.guim.co.uk/96d592acf0c5829a8996dbe9397529946e05fee8/303_173_3010_2408/500.jpg",
    "summary": "The Women's Super League is considering borrowing a significant amount of money, potentially tens of millions of pounds. This strategy aims to fast-track the league's growth and development. The move reflects a commitment to expanding women's football and increasing its competitiveness.",
    "published": "2025-10-17T07:00:05Z"
  },
  {
    "title": "Sports quiz of the week: World Cup heroics, shock defeats and sumo",
    "url": "https://www.theguardian.com/sport/2025/oct/17/sports-quiz-week-world-cup-football-darts-tennis-rugby-sumo-snooker-cycling-nfl",
    "image": "https://media.guim.co.uk/0e7ef3554447d3ee3de38d29c090d0ad6932dfc7/0_0_5000_4000/500.jpg",
    "summary": "The latest sports news covers various events in football, darts, tennis, rugby, sumo wrestling, snooker, cycling, and the NFL. Key highlights include major matches, player performances, and upcoming tournaments across these sports. Fans can expect exciting developments as the seasons progress.",
    "published": "2025-10-17T07:00:05Z"
  }
]