[
  {
    "title": "WTA Finals tennis: Aryna Sabalenka beats Coco Gauff; Pegula breezes past Paolini – live",
    "url": "https://www.theguardian.com/sport/live/2025/nov/06/wta-finals-tennis-aryna-sabalenka-v-coco-gauff-jessica-pegula-v-jasmine-paolini-live",
    "image": "https://media.guim.co.uk/1537c50029234a3bbd378f94a18ad5b934dd259e/216_0_2157_1726/500.jpg",
    "summary": "Coco Gauff, ranked World No. 3, is set to face World No. 1 Aryna Sabalenka in the WTA Finals on Thursday. This matchup follows a match between Jessica Pegula and Jasmine Paolini. The tournament features top-ranked players competing for the championship title.",
    "published": "2025-11-06T17:19:20Z"
  },
  {
    "title": "Dolphin seen near St Mark’s Square inspires Venetian rescue effort",
    "url": "https://www.theguardian.com/world/2025/nov/06/mimmo-bottlenose-dolphin-seen-near-st-marks-square-inspires-venice-rescue-effort",
    "image": "https://media.guim.co.uk/4cdfdd406138c11f329e5371363c65fab5ee6131/450_0_4500_3600/500.jpg",
    "summary": "Concerns grow for the safety of a daring bottlenose dolphin named Mimmo, who performs acrobatic feats that charm onlookers. His popularity has led to increased tourist activity, including selfie tours, raising questions about the impact on his habitat and well-being. Wildlife advocates worry that the attention could pose risks to both Mimmo and the marine environment.",
    "published": "2025-11-06T17:14:24Z"
  },
  {
    "title": "Share your zero-star cultural disasters",
    "url": "https://www.theguardian.com/tv-and-radio/2025/nov/06/share-your-zero-star-cultural-disasters",
    "image": "https://media.guim.co.uk/1ac0c42cafa0c1a544eaaa957189017cc06aa671/0_0_4178_3343/500.jpg",
    "summary": "The Guardian invites readers to contribute their own zero-star reviews, a rare accolade previously reserved for just 18 publications. This call for submissions aims to highlight particularly disappointing experiences or works. Participants have the opportunity to share their harsh critiques with a wider audience.",
    "published": "2025-11-06T17:13:01Z"
  },
  {
    "title": "Lammy says he was not ‘equipped with the details’ when facing questions on mistaken prisoner release at PMQs – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/nov/06/prisoner-release-david-lammy-latest-live-politics-news-updates",
    "image": "https://media.guim.co.uk/086692197ffdfd266b3234027242a830d0873bb1/225_0_2498_1999/500.jpg",
    "summary": "Tory MPs have criticized the Deputy Prime Minister for being \"dishonest\" during a recent Prime Minister's Questions session. They labeled his performance as \"a disgrace,\" reflecting growing discontent within the party. The backlash highlights increasing tensions among Conservative lawmakers.",
    "published": "2025-11-06T17:08:47Z"
  },
  {
    "title": "Young people in the UK: share your experiences of living in a coastal town",
    "url": "https://www.theguardian.com/society/2025/jul/01/young-people-in-the-uk-share-your-experiences-of-living-in-a-coastal-town",
    "image": "https://media.guim.co.uk/b7d14da649bad7d181376f9078404871df92db4c/446_0_4438_3553/500.jpg",
    "summary": "A request is being made for young individuals aged 18 to 25 to share their experiences of living in coastal towns across the UK. The aim is to gather insights into their lives and perspectives. Feedback from this age group is crucial for understanding the unique challenges and opportunities in these areas.",
    "published": "2025-11-06T17:06:00Z"
  }
]