[
  {
    "title": "England v Australia: Women’s Rugby World Cup – rugby union live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/06/england-v-australia-womens-rugby-world-cup-rugby-union-live",
    "image": "https://media.guim.co.uk/63f03ebb4348dd75e056dfff2a374b8396592669/11_205_2291_1833/500.jpg",
    "summary": "Daniel Gallan provides live updates on England's Women's Rugby World Cup group match against Australia. Fans can follow the minute-by-minute coverage for detailed insights and developments. Stay tuned for key moments and highlights from the game.",
    "published": "2025-09-06T17:25:48Z"
  },
  {
    "title": "England v Andorra: World Cup 2026 qualifying – live",
    "url": "https://www.theguardian.com/football/live/2025/sep/06/england-v-andorra-world-cup-2026-qualifying-live",
    "image": "https://media.guim.co.uk/aafe77d926d2b681f62f2496bd6a19e2a99b75cc/660_0_4690_3752/500.jpg",
    "summary": "Thomas Tuchel's team aims to secure a significant victory at Villa Park. The match is expected to uplift their morale. Barry Glendenning will provide coverage of the game.",
    "published": "2025-09-06T17:25:24Z"
  },
  {
    "title": "Alcaraz and Sinner in a world of their own as US Open final completes slam trilogy",
    "url": "https://www.theguardian.com/sport/2025/sep/06/alcaraz-and-sinner-in-a-world-of-their-own-as-us-open-final-completes-slam-trilogy",
    "image": "https://media.guim.co.uk/26d1e6a182f2a444933ab98195b816468d8ef1ca/1685_1095_4960_3968/500.jpg",
    "summary": "Carlos Alcaraz won the title in Paris, while Jannik Sinner claimed victory at Wimbledon. Their ongoing rivalry has created excitement for a potential showdown in New York. Fans are looking forward to another classic encounter between the two young tennis stars.",
    "published": "2025-09-06T17:13:52Z"
  },
  {
    "title": "Keir Starmer confirms first batch of junior ministers in post-Rayner reshuffle – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/06/no-early-election-angela-rayner-resignation-nigel-farage-reform-uk-politics-live-news-latest",
    "image": "https://media.guim.co.uk/ef89e6d973b2d1173f1dff0d29de38013d336ef3/393_0_3928_3143/500.jpg",
    "summary": "Chief Secretary Darren Jones stated that Angela Rayner's resignation prompted an earlier-than-expected reshuffle within the Labour party. He emphasized that, despite the leadership changes, there is no division within the party. The reshuffle aims to strengthen Labour's position ahead of upcoming challenges.",
    "published": "2025-09-06T17:11:22Z"
  },
  {
    "title": "Doctor uses Reform conference speech to link king’s cancer to Covid vaccine",
    "url": "https://www.theguardian.com/politics/2025/sep/06/doctor-aseem-malhotra-reform-conference-speech-royal-family-cancer-covid-vaccine",
    "image": "https://media.guim.co.uk/aeeaebe47e47809654689eebcd0c3ef91664f4c6/767_0_4520_3616/500.jpg",
    "summary": "Aseem Malhotra alleged that an \"eminent oncologist\" suggested the COVID-19 vaccine played a significant role in the cancer cases among members of the royal family. This claim raises questions and concerns regarding the vaccine's safety and potential side effects. The statement has garnered attention and sparked controversy surrounding vaccine discussions.",
    "published": "2025-09-06T16:57:35Z"
  }
]