[
  {
    "title": "Trump says Hamas must disarm ‘or we will disarm them’ as Netanyahu says news on remaining hostages expected ‘within hours’ – live",
    "url": "https://www.theguardian.com/world/live/2025/oct/14/gaza-ceasefire-israel-hamas-palestine-hostages-detainees-truce-live-news-updates",
    "image": "https://media.guim.co.uk/4485c433f0abc3593206f7f2ed92f476d7ca8b07/278_0_2580_2065/500.jpg",
    "summary": "US President warns that disarming could occur rapidly and potentially through violent means. Meanwhile, Israel continues to keep the Rafah crossing closed as more deceased hostages are anticipated to be returned. Tensions remain high amid the evolving situation.",
    "published": "2025-10-14T19:15:15Z"
  },
  {
    "title": "Latvia v England: World Cup 2026 qualifier – live",
    "url": "https://www.theguardian.com/football/live/2025/oct/14/latvia-v-england-world-cup-2026-qualifier-live",
    "image": "https://media.guim.co.uk/815689875d6f91d71475caf6396033abe5cb5807/193_0_1925_1540/500.jpg",
    "summary": "England is aiming for a crucial victory to secure their qualification for the World Cup. Scott Murray will provide live updates on the match. Fans can follow along minute-by-minute for all the action.",
    "published": "2025-10-14T19:14:30Z"
  },
  {
    "title": "House speaker defends White House using research funding to pay military during government shutdown – live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/14/donald-trump-government-shutdown-national-guard-javier-milei-charlie-kirk-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/71f9f04ad27b7d129dea2a5442081efa2fdd331e/616_0_4167_3335/500.jpg",
    "summary": "Mike Johnson stated that the Trump administration has the authority to reallocate funds approved by Congress to the Department of Defense. He emphasized that this action is within the rights of the administration. The comments reflect ongoing discussions about budget management and defense funding.",
    "published": "2025-10-14T19:11:56Z"
  },
  {
    "title": "Johnson says ‘I don’t have anything to negotiate’ as US shutdown drags on",
    "url": "https://www.theguardian.com/us-news/2025/oct/14/house-speaker-mike-johnson-shutdown",
    "image": "https://media.guim.co.uk/3f302002f4f926daa55eda1f625dfa88504f0033/818_0_5000_4000/500.jpg",
    "summary": "The Republican House speaker has stated that he will not engage in negotiations with Senate Democrats prior to the upcoming eighth funding vote. This position reflects ongoing tensions between the two parties regarding funding issues. The move may impact the progress of federal funding and government operations.",
    "published": "2025-10-14T19:01:32Z"
  },
  {
    "title": "Trump says six were killed in US strike on another boat allegedly carrying drugs near Venezuela",
    "url": "https://www.theguardian.com/us-news/2025/oct/14/trump-six-killed-us-strike-boat-venezuela",
    "image": "https://media.guim.co.uk/1407017906cb067ba7e1cac5e20368a93adabc6b/225_0_2248_1798/500.jpg",
    "summary": "The UN has condemned recent US strikes on small boats suspected of drug trafficking, labeling them as extrajudicial executions. This criticism highlights concerns over the legality and morality of the US's military actions. The UN calls for adherence to international legal standards in addressing drug trafficking.",
    "published": "2025-10-14T18:46:37Z"
  }
]