[
  {
    "title": "Donald Trump and Benjamin Netanyahu to discuss Gaza peace plan at the White House – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/29/donald-trump-benjamin-netanyahu-gaza-white-house-us-politics-live",
    "image": "https://media.guim.co.uk/dcac1da0ca83af83dab779b453431861fe887c0b/296_0_3770_3016/500.jpg",
    "summary": "The US president plans to urge the Israeli prime minister to establish a new framework aimed at ending the ongoing conflict in Gaza. The proposal also includes a focus on securing the release of remaining hostages held by Hamas. This diplomatic effort underscores the US's involvement in seeking a resolution to the crisis.",
    "published": "2025-09-29T10:13:39Z"
  },
  {
    "title": "JLR to resume some manufacturing in coming days after hack: GSK shares rise 3% after surprise CEO change – business live",
    "url": "https://www.theguardian.com/business/live/2025/sep/29/moral-hazard-fears-jlr-jaguar-land-rover-government-loan-gsk-ceo-astrazeneca-listing-dollar-shutdown-business-live-news",
    "image": "https://media.guim.co.uk/f91f5a390fb4912042b9770554a8e23b7261cd22/994_0_5511_4409/500.jpg",
    "summary": "Jaguar Land Rover (JLR) is progressing with a \"controlled, phased restart\" of its operations. Meanwhile, GlaxoSmithKline (GSK) has appointed a new leader to take over from Dame Emma Walmsley. These developments highlight shifts in leadership and operational strategies within the automotive and pharmaceutical sectors.",
    "published": "2025-09-29T10:10:12Z"
  },
  {
    "title": "Supporting Reform’s ‘racist policy’ does not make voters racist, says Rachel Reeves – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/29/rachel-reeves-labour-party-conference-youth-guarantee-unemployment-uk-politics-live-latest-news",
    "image": "https://media.guim.co.uk/5a59b30e3b68e5aec9de018f01b3c08b8c6f5bad/505_0_4910_3930/500.jpg",
    "summary": "Chancellor supports Keir Starmer's assertion that the policy to end indefinite leave to remain is racist. He acknowledges that many supporters of the Reform party would find this statement shocking. The comments highlight ongoing tensions in the debate over immigration policy in the UK.",
    "published": "2025-09-29T10:09:55Z"
  },
  {
    "title": "Cash is still king across Africa. Can a new payment platform transform business?",
    "url": "https://www.theguardian.com/world/2025/sep/29/cash-still-king-africa-can-new-payment-platform-transform-business",
    "image": "https://media.guim.co.uk/36fa5218488c8aa900f4b71360f8d1beb50e48c1/230_0_4099_3280/500.jpg",
    "summary": "A new digital system enabling instant money transfers is being hailed as a transformative innovation for cross-border trade. This technology aims to streamline transactions and improve the efficiency of international commerce. Experts believe it could significantly reduce costs and enhance speed for businesses operating internationally.",
    "published": "2025-09-29T10:09:47Z"
  },
  {
    "title": "Scurry review – crawlspace nightmare thriller turns into apocalyptic insect horror",
    "url": "https://www.theguardian.com/film/2025/sep/29/scurry-review-crawlspace-nightmare-thriller-gets-caught-in-apocalyptic-insect-horror",
    "image": "https://media.guim.co.uk/dffcc8595b88a32f86cfd77a02d98ad9d161cb8a/1730_306_6379_5104/500.jpg",
    "summary": "Two survivors of a city massacre navigate a critter-infested tunnel in a new film. Despite impressive cinematography, the premise offers limited narrative flexibility. The storyline heavily relies on the survivors' struggle against both their environment and their traumatic past.",
    "published": "2025-09-29T10:00:40Z"
  }
]