[
  {
    "title": "Australia v Argentina: Rugby Championship 2025 – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/13/rugby-championship-australia-wallabies-v-argentina-pumas-live",
    "image": "https://media.guim.co.uk/25ce00aabe3f3d14be5f3a972445f9f7268880ff/294_289_4546_3637/500.jpg",
    "summary": "The Wallabies are seeking a second win against the Pumas in Sydney, with the Argentine team eager for revenge. Jonathan Howcroft will provide minute-by-minute updates on the match. Fans can expect an exciting showdown between the two teams.",
    "published": "2025-09-13T03:31:45Z"
  },
  {
    "title": "‘No idea what you’ve unleashed’: Erika Kirk, Charlie Kirk’s widow, gives statement after husband’s shooting – follow live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/12/charlie-kirk-shooter-suspect-latest-news-updates-donald-trump-utah",
    "image": "https://media.guim.co.uk/5ee7d8e9869b8a0948450a4c2b516b301baa8e06/310_0_1190_952/500.jpg",
    "summary": "Tyler Robinson, 22, is expected to face charges on Tuesday after a family friend alerted authorities about an alleged shooting involving a right-wing activist. The incident has raised concerns within the community regarding political violence. Further details about the motives and circumstances of the shooting are still emerging.",
    "published": "2025-09-13T02:53:09Z"
  },
  {
    "title": "Trump news at a glance: president urges death penalty in Charlie Kirk killing, as widow says: ‘we’ll never surrender’ ",
    "url": "https://www.theguardian.com/us-news/2025/sep/13/trump-administration-charlie-kirk-news-updates-latest",
    "image": "https://media.guim.co.uk/5ee7d8e9869b8a0948450a4c2b516b301baa8e06/295_0_1190_952/500.jpg",
    "summary": "On September 12, the President aimed to portray left-leaning individuals as the primary issue in U.S. politics. Meanwhile, the widow of Charlie Kirk expressed that her emotional appeals would resonate globally, framing them as a powerful rallying call. These events highlighted the ongoing deep political divides in the country.",
    "published": "2025-09-13T02:43:32Z"
  },
  {
    "title": "Widow of Charlie Kirk says her ‘cries will echo around the world like a battle cry’",
    "url": "https://www.theguardian.com/us-news/2025/sep/12/erika-kirk-charlie-kirk",
    "image": "https://media.guim.co.uk/2dc02185cc0adf3f6ae7569de6ed9207aeed1b00/270_0_1180_944/500.jpg",
    "summary": "Erika Kirk expressed her anguish in a statement on Friday, addressing the assassination of her husband. She emphasized that those responsible for the act are unaware of the impact of their actions. Her words highlight the deep emotional turmoil caused by the tragedy.",
    "published": "2025-09-13T02:18:40Z"
  },
  {
    "title": "As a dark chapter closes, NZ reckons with fugitive father Tom Phillips’ four years on the run",
    "url": "https://www.theguardian.com/world/2025/sep/13/as-a-dark-chapter-closes-nz-reckons-with-fugitive-father-tom-phillips-four-years-on-the-run-ntwnfb",
    "image": "https://media.guim.co.uk/3ff1c8c4209c21ffa3bf6a73cad11db774e1af88/155_0_1548_1238/500.jpg",
    "summary": "Phillips' three children were successfully rescued from the wilderness this week, prompting a complex case that has sparked emotional responses. Concerns and questions have emerged regarding the circumstances surrounding the incident. The event continues to unfold, drawing significant attention.",
    "published": "2025-09-13T01:28:58Z"
  }
]