[
  {
    "title": "Leak exposes Washington Post boss Will Lewis’s role as secret adviser to Boris Johnson while PM",
    "url": "https://www.theguardian.com/uk-news/2025/sep/10/washington-post-boss-will-lewis-secret-adviser-boris-johnson-leak",
    "image": "https://media.guim.co.uk/cdc2814b7f7902731bd4b3554d4dec750fa6aaa4/0_0_3750_3000/500.jpg",
    "summary": "Meetings held in 2022 between Lewis, the former vice-chair of the AP, and Johnson were not reported in transparency records. This raises questions about accountability and compliance with disclosure standards. The omission has drawn attention to the importance of transparent communication within organizations.",
    "published": "2025-09-10T10:37:10Z"
  },
  {
    "title": "New French PM to take office as ‘Block Everything’ protests rock country – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/sep/10/france-block-everything-protests-macron-lecornu-europe-live-news-updates",
    "image": "https://media.guim.co.uk/49aa09c6389391c30114a68ffa44f289fbb77b90/258_0_2778_2223/500.jpg",
    "summary": "Sebastien Lecornu has been appointed amidst ongoing protests across France. Demonstrators, numbering around 1,000, attempted to storm the Gare du Nord station in Paris. The unrest highlights rising tensions in the country.",
    "published": "2025-09-10T10:34:11Z"
  },
  {
    "title": "White House says it would back forensic analysis of signature on Epstein letter – US politics live blog",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/10/donald-trump-jeffrey-epstein-tariffs-immigration-crime-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/0c0b861dffbed2c5f5b6b925a323c63c5fe26fa6/1549_0_3267_2613/500.jpg",
    "summary": "Trump officials maintain that a suggestive note and drawing recently reported are not the creations of former President Donald Trump. They continue to assert that these items do not reflect Trump's handwriting or artistic style. The controversy surrounding the materials remains a topic of discussion.",
    "published": "2025-09-10T10:33:53Z"
  },
  {
    "title": "Four dead, including two children, attempting to cross Channel to UK in last 24 hours",
    "url": "https://www.theguardian.com/uk-news/2025/sep/10/four-dead-including-two-children-attempting-to-cross-channel-to-uk-in-last-24-hours",
    "image": "https://media.guim.co.uk/c2c569c058d637a6eeeae95727e1abb8bdbe46ff/471_0_4040_3232/500.jpg",
    "summary": "French authorities report a significant increase in attempts by migrants to cross the Channel from France to the UK in recent days. This surge highlights ongoing challenges related to illegal crossings. The situation reflects broader concerns about migration and border management in the region.",
    "published": "2025-09-10T10:32:11Z"
  },
  {
    "title": "Poland shoots down drones over its territory amid Russian attack on Ukraine | First Thing",
    "url": "https://www.theguardian.com/us-news/2025/sep/10/first-thing-poland-shoots-down-drones-over-its-territory-amid-russian-attack-on-ukraine",
    "image": "https://media.guim.co.uk/98c5fd8fa47e64df62bc6d1a58b3bbd268be9c25/302_0_3250_2601/500.jpg",
    "summary": "Prime Minister Donald Tusk announced a military operation in response to persistent violations of Polish airspace. In a separate development, New Mexico will be the first state in the U.S. to provide free universal childcare. Both announcements reflect significant policy decisions in their respective regions.",
    "published": "2025-09-10T10:28:47Z"
  }
]