[
  {
    "title": "Keir Starmer set to announce UK recognition of Palestine later today - UK politics live ",
    "url": "https://www.theguardian.com/politics/live/2025/sep/21/keir-starmer-palestine-recognition-announcement-gaza-uk-politics-live",
    "image": "https://media.guim.co.uk/4b97cc6b081483fb8c46eaac32defe55d8031476/0_0_4164_3333/500.jpg",
    "summary": "An announcement from the Prime Minister is anticipated this afternoon, even amidst strong opposition from Israeli officials. The announcement comes at a time of heightened tensions regarding policy decisions. The details of the announcement and its implications remain to be seen.",
    "published": "2025-09-21T08:32:10Z"
  },
  {
    "title": "Arsenal v Manchester City buildup, Rome derby and WSL action – matchday live",
    "url": "https://www.theguardian.com/football/live/2025/sep/21/arsenal-v-manchester-city-buildup-rome-derby-and-wsl-action-matchday-live",
    "image": "https://media.guim.co.uk/6ed0e6c3245ac8d0e3151f2e5bf90bc39b7743ad/0_0_5000_4000/500.jpg",
    "summary": "Our team of writers is eager to cover an exciting day of football action ahead. Expect in-depth analysis, game previews, and player insights. Stay tuned for the latest updates and highlights!",
    "published": "2025-09-21T08:29:01Z"
  },
  {
    "title": "‘I can’t listen to music during sex - I start to wonder what mic they used on the snare’: Mark Ronson’s honest playlist",
    "url": "https://www.theguardian.com/music/2025/sep/21/mark-ronson-honest-playlist-night-people-uptown-funk",
    "image": "https://media.guim.co.uk/2349681c285eb6e53f962bd63cd1a0049a0ccd00/682_897_4087_3268/500.jpg",
    "summary": "A superstar DJ and producer enjoys partying to Candi Staton and has a secret admiration for the band Pantera. He also reveals a surprising choice for romantic moments: a unique epic by Brian Eno. This combination highlights his diverse musical tastes and unexpected influences.",
    "published": "2025-09-21T08:00:37Z"
  },
  {
    "title": "Optus admits process not followed after it missed at least five warnings of triple zero outage",
    "url": "https://www.theguardian.com/business/2025/sep/21/abhorrent-behaviour-call-for-optus-to-face-stiff-penalties-after-triple-zero-outage-deaths",
    "image": "https://media.guim.co.uk/6a6acb5a1bb3a224452cdca6fd2229ce02bc2b89/539_0_4931_3945/500.jpg",
    "summary": "The Albanese government faces mounting criticism to enforce strict penalties on a telecommunications company. Emergency Management Minister has characterized the company's actions as \"absolutely disgraceful.\" This response comes amid broader concerns about emergency management practices.",
    "published": "2025-09-21T07:38:32Z"
  },
  {
    "title": "Mouldy plates, burning pans, clouds of vape smoke: how to survive the horrors of the shared kitchen",
    "url": "https://www.theguardian.com/lifeandstyle/2025/sep/21/mouldy-plates-burning-pans-vape-smoke-how-to-survive-horrors-shared-kitchen",
    "image": "https://media.guim.co.uk/eb24786b7d53dc501d7d612daf4aabcb0bad07d6/0_0_5000_4000/500.jpg",
    "summary": "Navigating communal kitchens, whether new to university or experienced in flatsharing, presents unique challenges. Tips are provided for cooking and dining while maintaining cleanliness and safety. The focus is on minimizing mess and maximizing enjoyment in shared spaces.",
    "published": "2025-09-21T07:15:35Z"
  }
]