[
  {
    "title": "News live: Melbourne’s final Metro Tunnel station complete; Australian wins prize at global porridge championship",
    "url": "https://www.theguardian.com/australia-news/live/2025/oct/06/australia-news-live-queensland-bushfire-danger-warnings-moreton-island-croydon-park-shooting-sydney-anthony-albanese-sussan-ley-andrew-hastie-labor-liberal-ntwnfb",
    "image": "https://media.guim.co.uk/f4b4e612e845bb7f7fc4ef18da4cb4c5b00b62ee/0_3155_5266_4213/500.jpg",
    "summary": "Please provide the news article or details you would like me to summarize, and I'll be happy to help!",
    "published": "2025-10-05T23:15:00Z"
  },
  {
    "title": "One in four UK people fear a loved one drinks too much, survey finds",
    "url": "https://www.theguardian.com/society/2025/oct/06/one-in-four-uk-people-fear-a-loved-one-drinks-too-much-survey-finds",
    "image": "https://media.guim.co.uk/a859b633790bc8805cfd1c9fa2c9cf44ebdacb20/0_0_4074_3261/500.jpg",
    "summary": "A recent poll of 2,000 individuals highlights experts' worries about a rising \"epidemic\" of addiction to alcohol and drugs. The survey reflects increasing prevalence and concern over substance abuse in society. Experts are urging greater awareness and intervention strategies to combat this growing issue.",
    "published": "2025-10-05T23:00:03Z"
  },
  {
    "title": "Gary Neville says he took down union flag being ‘used in a negative fashion’",
    "url": "https://www.theguardian.com/football/2025/oct/05/gary-neville-says-he-took-down-a-union-flag-being-used-in-a-negative-fashion",
    "image": "https://media.guim.co.uk/11e893cd5b523008164c1bd6daa3cca1277d2e03/1952_0_4761_3809/500.jpg",
    "summary": "A former footballer now turned developer has raised concerns over the increasing number of flag raisings, suggesting they contribute to division among communities. He argues that this trend is fostering an environment where people are pitted against one another. The remarks highlight the broader implications of identity politics on societal cohesion.",
    "published": "2025-10-05T22:27:59Z"
  },
  {
    "title": "US struck another boat illegally carrying drugs off Venezuela coast, Trump says",
    "url": "https://www.theguardian.com/us-news/2025/oct/05/trump-drug-boat-strike-venezuela",
    "image": "https://media.guim.co.uk/74ddd22c3ac4e136ab8e8a5ec5201a352482f616/219_0_4141_3313/500.jpg",
    "summary": "During a speech at a navy ceremony, the President announced that the United States would shift its focus to addressing drug trafficking occurring on land. This initiative aims to combat the growing issue of illegal drug trade. The emphasis highlights the administration's commitment to enhancing domestic security efforts.",
    "published": "2025-10-05T22:12:18Z"
  },
  {
    "title": "Swaggering Reece Walsh reaches NRL summit with ascendant grand final display | Jack Snape",
    "url": "https://www.theguardian.com/sport/blog/2025/oct/06/brisbane-broncos-reece-walsh-nrl-summit-grand-final-performance",
    "image": "https://media.guim.co.uk/1999f9c0d84c8f6c37f956b12e09b81aebc89723/1636_585_3590_2872/500.jpg",
    "summary": "Sunday's performance showcased the Brisbane Broncos fullback's talent, countering criticism of his behavior as immature. His skills on the field demonstrated maturity and capability, silencing doubters. This display highlights his importance to the team's success.",
    "published": "2025-10-05T21:54:21Z"
  }
]