[
  {
    "title": "Gaza ceasefire plan live: Israel says it is preparing to pull back troops; living hostages could be released within days",
    "url": "https://www.theguardian.com/world/live/2025/oct/09/gaza-ceasefire-live-trump-says-hostages-probably-released-monday-idf-says-gaza-city-still-extremely-dangerous",
    "image": "https://media.guim.co.uk/42684000f384b5ad0960cdd629b40a3720859fa0/342_0_2700_2160/500.jpg",
    "summary": "US President Donald Trump announced that Israel and Hamas have reached a \"first phase\" agreement to pause hostilities. The plan includes provisions for the release of certain hostages and prisoners. This development marks a potential step towards easing the ongoing conflict.",
    "published": "2025-10-09T08:25:22Z"
  },
  {
    "title": "Russia attacks Ukraine’s energy and railway infrastructure in deadly overnight strikes – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/oct/09/russia-attacks-ukraine-energy-france-germany-europe-live-news-updates",
    "image": "https://media.guim.co.uk/5415c8af8b57b80fca0233089bf1980fb504252a/74_0_1918_1534/500.jpg",
    "summary": "Ukrainian President Volodymyr Zelenskyy has accused Russia of attempting to create chaos as it revisits tactics reminiscent of previous winters, which resulted in millions of Ukrainians facing energy and heating shortages. He highlights the ongoing threat to national stability amidst the conflict. The accusation underscores the continued strife and humanitarian challenges in Ukraine.",
    "published": "2025-10-09T08:22:04Z"
  },
  {
    "title": "NHS hospital group’s facilities staff vote to strike over £30m pay discrimination claim",
    "url": "https://www.theguardian.com/society/2025/oct/09/nhs-staff-vote-strike-institutional-racism-pay-gap-claims",
    "image": "https://media.guim.co.uk/3a4c5cc819d952abaca635364e5025e3164400b1/475_0_4750_3800/500.jpg",
    "summary": "A union has accused St George’s, Epsom, and St Helier hospitals of \"institutional racism\" due to disparities in pay. Cleaners, caterers, and porters reportedly receive lower wages compared to their colleagues in other roles. The union's claims highlight ongoing issues of inequality within the healthcare facilities.",
    "published": "2025-10-09T08:21:19Z"
  },
  {
    "title": "Entry-level workers face ‘job-pocalypse’ as firms turn to AI; risk of winter blackouts falls – business live",
    "url": "https://www.theguardian.com/business/live/2025/oct/09/water-customers-bill-hike-winter-blackouts-risk-falls-stock-markets-pound-ftse-business-live-news",
    "image": "https://media.guim.co.uk/71e8f4e87476fe967048ac31ed7765cdc6f9a9cf/458_0_4583_3667/500.jpg",
    "summary": "A recent survey reveals that business leaders are increasingly focusing on automation via AI to address skills shortages instead of investing in training for junior employees. This shift indicates a preference for technology-driven solutions to meet workforce demands. The trend reflects a broader movement towards efficiency and cost-effectiveness in organizational operations.",
    "published": "2025-10-09T08:21:17Z"
  },
  {
    "title": "Iron Ladies review – inspiring account of the women on the miners’ strike picket lines",
    "url": "https://www.theguardian.com/film/2025/oct/09/iron-ladies-review-inspiring-account-of-the-women-on-the-miners-strike-picket-lines",
    "image": "https://media.guim.co.uk/4fba8414ee814176d5d206d57f3c98efa98bf7c8/99_0_1350_1080/500.jpg",
    "summary": "The article examines how the Margaret Thatcher era, marked by union suppression, galvanized women to rise up in activism. It highlights the unique challenges they faced and the strategies they employed to advocate for their rights. Through their efforts, these women played a pivotal role in shaping social and political movements of the time.",
    "published": "2025-10-09T08:00:19Z"
  }
]