[
  {
    "title": "Albania v England: World Cup 2026 qualifying – live",
    "url": "https://www.theguardian.com/football/live/2025/nov/16/albania-v-england-world-cup-2026-qualifying-live",
    "image": "https://media.guim.co.uk/3b7a37d6b20aabf52f3bb44af253e9da0c3dbf11/241_0_3444_2755/500.jpg",
    "summary": "Thomas Tuchel's team, having secured qualification for next year's tournament, is set for their next match. Billy Munday will provide a minute-by-minute report on the game's progress. Fans are keen to see how the team performs under these circumstances.",
    "published": "2025-11-16T18:26:30Z"
  },
  {
    "title": "Steelers v Bengals, Bills v Buccaneers and more: NFL week 11 – live",
    "url": "https://www.theguardian.com/sport/live/2025/nov/16/steelers-v-bengals-bills-v-buccaneers-and-more-nfl-week-10-live",
    "image": "https://media.guim.co.uk/0b4e4b529319cf8687fe3c834b2364f47485472d/265_0_2652_2121/500.jpg",
    "summary": "Graham Searles will provide live updates on seven NFL games starting at 6pm GMT. This follows the Dolphins' narrow victory over the Commanders, winning 16-13 in overtime with a decisive field goal. Fans can look forward to real-time coverage of the evening's matchups.",
    "published": "2025-11-16T18:25:25Z"
  },
  {
    "title": "ATP Finals tennis: Carlos Alcaraz v Jannik Sinner in the final – live",
    "url": "https://www.theguardian.com/sport/live/2025/nov/16/atp-finals-tennis-carlos-alcaraz-v-jannik-sinner-in-the-final-live",
    "image": "https://media.guim.co.uk/29f813f2f95be6282070679af3f4404974ad18a7/586_0_5858_4687/500.jpg",
    "summary": "Join Daniel Harris for live updates from Turin as the ATP Finals culminate in a thrilling match to determine the champion. Stay tuned for the latest results and highlights. Don't miss out on this exciting finale in the ATP tour!",
    "published": "2025-11-16T18:24:38Z"
  },
  {
    "title": "The six best US jigsaw puzzles for adults and kids to sooth your screen-addled brain",
    "url": "https://www.theguardian.com/thefilter-us/2025/nov/16/best-jigsaw-puzzles-adults-children-us",
    "image": "https://media.guim.co.uk/dce1b6884a5295296bacc5619f79bb8d66247232/1_0_4398_3520/500.jpg",
    "summary": "A selection of top puzzles for both adults and kids has been identified, making them perfect gifts or activities for the winter season. These puzzles cater to various skill levels and interests. Whether for fun or challenge, these options are sure to engage users of all ages.",
    "published": "2025-11-16T18:15:38Z"
  },
  {
    "title": "Asylum system in UK ‘out of control’ and dividing country, home secretary says",
    "url": "https://www.theguardian.com/uk-news/2025/nov/16/refugees-established-in-uk-may-have-to-return-if-home-countries-become-safe",
    "image": "https://media.guim.co.uk/29478fa84633fc6585e6bb1f95808ba5022d2f94/261_15_1401_1121/500.jpg",
    "summary": "Shabana Mahmood plans to introduce new proposals influenced by Denmark's contentious social and economic policies. The initiative aims to address various issues, although specifics remain to be disclosed. The approach has sparked debate regarding its potential implications and effectiveness.",
    "published": "2025-11-16T18:10:09Z"
  }
]