[
  {
    "title": "St Pölten 0-6 Chelsea: Women’s Champions League – as it happened",
    "url": "https://www.theguardian.com/football/live/2025/nov/11/st-polten-v-chelsea-womens-champions-league-live",
    "image": "https://media.guim.co.uk/346be09405d6d6b4028227981e0de476489b0835/324_0_3946_3156/500.jpg",
    "summary": "Catarina Macario and Sam Kerr both scored two goals as Chelsea achieved a dominant victory over St Pölten. The team's performance showcased their attacking prowess. Chelsea's win highlights their strong position in the competition.",
    "published": "2025-11-11T22:14:34Z"
  },
  {
    "title": "Webb defends VAR ruling out Liverpool equaliser against Manchester City",
    "url": "https://www.theguardian.com/football/2025/nov/11/howard-webb-defends-var-ruling-out-liverpool-virgil-van-dijk-equaliser-against-manchester-city",
    "image": "https://media.guim.co.uk/7841c587be0dde9e03c0b3247d4acfaa87d20499/1610_198_6582_5266/500.jpg",
    "summary": "The referee's chief stated that the disallowed header by Van Dijk was a reasonable decision. Webb rejected comparisons between this incident and a similar one that favored Manchester City. The comments highlight ongoing debates about officiating decisions in matches.",
    "published": "2025-11-11T22:07:22Z"
  },
  {
    "title": "Fetterman defends decision to break with Democrats to end government shutdown: ‘My party crossed a line’ – live",
    "url": "https://www.theguardian.com/us-news/live/2025/nov/11/donald-trump-us-government-shutdown-senate-democrats-republicans-politics-live-news-updates",
    "image": "https://media.guim.co.uk/ab98aee8adba144dd81396e5dce1efdfe2be7b80/535_0_5000_4000/500.jpg",
    "summary": "A Democratic senator from Pennsylvania criticized the recent government shutdown, stating it was \"wrong.\" He also mentioned he did not receive any communication from Senate Majority Leader Chuck Schumer during this process. The remarks were made during an interview with Fox News.",
    "published": "2025-11-11T22:06:30Z"
  },
  {
    "title": "The Eubanks: Like Father, Like Son review – a family boxing tale so unexpectedly moving it’ll leave you in tears",
    "url": "https://www.theguardian.com/tv-and-radio/2025/nov/11/the-eubanks-like-father-like-son-review-family-boxing-tale-unexpectedly-moving",
    "image": "https://media.guim.co.uk/e4ab979cb791d7346badc9d9f75bb4ae7ba446a2/325_0_2700_2160/500.jpg",
    "summary": "Chris Eubank Jnr has reconciled with his father after four years in a documentary about his anticipated fight with Conor Benn, the son of his father's longtime rival. The film captures their emotional reunion and the complexities of their relationship. It offers a deeply moving exploration of family and legacy in the boxing world.",
    "published": "2025-11-11T22:00:06Z"
  },
  {
    "title": "Sam Kerr marks first Chelsea start in nearly two years with double in rout of St Pölten",
    "url": "https://www.theguardian.com/football/2025/nov/11/st-polten-chelsea-womens-champions-league-match-report",
    "image": "https://media.guim.co.uk/4fe69f39d499ce51f6075fafb908aeb3baf59903/400_0_4735_3788/500.jpg",
    "summary": "Sam Kerr made a triumphant return to the starting lineup for Chelsea after nearly two years, scoring two goals in their 6-0 win over St Pölten in the Women’s Champions League. Her impressive performance contributed significantly to the team's dominant display. The victory underscores Chelsea's strong position in the tournament.",
    "published": "2025-11-11T21:59:18Z"
  }
]