[
  {
    "title": "News live: Marles says ADF tracking Chinese navy flotilla amid concerns it may be heading towards Australian waters",
    "url": "https://www.theguardian.com/australia-news/live/2025/dec/01/australia-news-live-greens-gas-export-tax-cost-of-living-house-prices-interest-rates-reserve-bank-inflation-newcastle-rising-tide-coal-labor-coalition-ntwnfb",
    "image": "https://media.guim.co.uk/595b461b9dec12a90a5631ad399f2f005f8c4114/0_0_6061_4849/500.jpg",
    "summary": "Please provide the news content you'd like summarized, and I'll be happy to help!",
    "published": "2025-12-01T03:52:09Z"
  },
  {
    "title": "Division and derision: how plans for an AFL stadium left Tasmania in pieces | Jack Snape",
    "url": "https://www.theguardian.com/sport/2025/dec/01/tasmania-afl-stadium-plan-in-pieces",
    "image": "https://media.guim.co.uk/9c278b1177d46520a16f22cf91ba7518cff4190a/0_0_2500_2000/500.jpg",
    "summary": "The intense debate surrounding the Macquarie Point plan in Hobart has caused significant controversy among parliamentarians. Regardless of their decision this week, the discussions have already negatively impacted the project. The contentious nature of the discourse reflects deep divisions over the proposed development.",
    "published": "2025-12-01T03:20:30Z"
  },
  {
    "title": "Trump news at a glance: president says freeze on asylum decisions will last ’a long time’",
    "url": "https://www.theguardian.com/us-news/2025/dec/01/trump-administration-news-updates-today",
    "image": "https://media.guim.co.uk/57194d22518f12a3acd6ccc8c6e10fb62dfd3519/315_0_2994_2396/500.jpg",
    "summary": "The response to the National Guard shooting is ongoing and lacks a clear timeline for resolution. Additionally, proposed cuts to the Department of Homeland Security's oversight functions raise concerns about potential abuses of power. These developments highlight significant issues in U.S. politics as of November 30.",
    "published": "2025-12-01T00:30:48Z"
  },
  {
    "title": "Paddington: The Musical review – they’ve looked after this bear quite splendiferously",
    "url": "https://www.theguardian.com/stage/2025/dec/01/paddington-the-musical-review-savoy-theatre",
    "image": "https://media.guim.co.uk/bd9acce82523497f778c1e9c3e98f30a4b20c8bc/0_0_2341_1873/500.jpg",
    "summary": "The latest performance features cutting-edge animatronics, creative staging, and stellar performances. Audiences can expect delightful songs about marmalade that enhance the experience. Overall, it's an enchanting evening designed to uplift and warm the heart.",
    "published": "2025-12-01T00:01:19Z"
  },
  {
    "title": "Genius crossword No 270",
    "url": "https://www.theguardian.com/crosswords/2025/dec/01/genius-crossword-no-270",
    "summary": "Entries for the online competition must be submitted by 23:59 GMT on Saturday, January 3. Participants need to register once and then sign in to theguardian.com to enter. The competition offers a monthly prize of £100.",
    "published": "2025-12-01T00:01:19Z"
  }
]