[
  {
    "title": "Enjoying the implosion of the Tories? That’s understandable – but completely wrong | Zoe Williams",
    "url": "https://www.theguardian.com/commentisfree/2025/oct/06/enjoying-implosion-tories-understandable-but-completely-wrong",
    "image": "https://media.guim.co.uk/6105aa047583eb90dfb09063c15cad5c060a2f37/535_0_3978_3184/500.jpg",
    "summary": "Zoe Williams argues that the world's most successful democratic party is facing a self-destructive decline, exacerbating the divide between moderate and extreme right factions. The absence of a centrist force is heightening political polarization. This situation poses significant challenges for the future of democracy.",
    "published": "2025-10-06T15:18:08Z"
  },
  {
    "title": "US government shutdown: Democrats and Republicans trade barbs as no compromise in sight – live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/06/donald-trump-national-guard-ice-government-shutdown-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/586f307379c4939cd28cdd77466b602f26db7893/340_0_5000_4000/500.jpg",
    "summary": "Democratic minority leader Hakeem Jeffries has invited House Speaker Mike Johnson to participate in a 'primetime' debate. Johnson dismissed the invitation, labeling it as mere 'theatrics.' The exchange highlights ongoing tensions between the Democratic and Republican leadership in the House.",
    "published": "2025-10-06T15:16:58Z"
  },
  {
    "title": "Lecornu bemoans lack of compromise across political spectrum as he resigns as French PM – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/oct/06/france-pm-resigns-lecornu-macron-europe-live-news-updates",
    "image": "https://media.guim.co.uk/4d8af5f1370c2a742772a6054812c2fbd671885c/903_0_4489_3592/500.jpg",
    "summary": "A cabinet member has resigned less than a month after taking office due to intense criticism of President Macron's new government. The departure highlights ongoing tensions within the administration. This move raises concerns about stability in Macron's leadership and future policy direction.",
    "published": "2025-10-06T15:14:51Z"
  },
  {
    "title": "Firearms officer used excessive force in fatal shooting of unarmed man in London, misconduct hearing told",
    "url": "https://www.theguardian.com/uk-news/2025/oct/06/firearms-officer-used-excessive-force-in-fatal-shooting-of-unarmed-man-jermaine-baker-london-misconduct-hearing-told",
    "image": "https://media.guim.co.uk/ded5b6ea2e59170812c0efe1631c3229f71a82c4/31_0_929_743/500.jpg",
    "summary": "Jermaine Baker, a man from Tottenham, was killed during a police operation aimed at preventing a plot to free a gang leader from prison in 2015. His death raised questions about the use of lethal force by law enforcement. The incident remains a topic of discussion regarding policing tactics and accountability.",
    "published": "2025-10-06T15:06:04Z"
  },
  {
    "title": "Liverpool’s struggles show that Trent Alexander-Arnold is not easily replaced",
    "url": "https://www.theguardian.com/football/2025/oct/06/liverpools-struggles-show-that-trent-alexander-arnold-is-not-easily-replaced",
    "image": "https://media.guim.co.uk/94fda8fa6a430514a2acdb85347c5593ce6b5b7d/8_6_4992_3994/500.jpg",
    "summary": "Arne Slot's offseason changes have come under scrutiny following three consecutive defeats. The losses have highlighted persistent issues within the team. One particular player’s impending departure is raising concerns about the team's stability.",
    "published": "2025-10-06T15:05:16Z"
  }
]