[
  {
    "title": "Israel turning Gaza City into mass graveyard, Palestinian foreign ministry says, as IDF launches ground offensive - latest updates",
    "url": "https://www.theguardian.com/world/live/2025/sep/16/israel-gaza-war-israels-defence-minister-says-gaza-is-burning-amid-escalation-in-bombardment-latest-updates",
    "image": "https://media.guim.co.uk/a4d7a85267e7d155742b505afdbeac4f69642df7/836_0_5600_4480/500.jpg",
    "summary": "The Palestinian foreign ministry has accused the Israeli Defense Forces (IDF) of intentionally targeting civilians during recent operations. This allegation follows escalating violence in the region, raising concerns over human rights violations. The ministry calls for international intervention to address the situation and protect civilians.",
    "published": "2025-09-16T15:33:43Z"
  },
  {
    "title": "FBI director Kash Patel sparked ‘mass confusion’ over Charlie Kirk shooting suspect, top Democrat says – live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/16/donald-trump-new-york-times-defamation-charlie-kirk-vance-miller-news-updates-us-politics-live",
    "image": "https://media.guim.co.uk/d34fd528cac2ac0a4dbc7fd60a7d04689d1fca5f/424_0_4243_3394/500.jpg",
    "summary": "FBI Director faced tough questioning from the Senate Judiciary Committee amid criticism of his actions and social media posts related to the Kirk shooting investigation. Lawmakers scrutinized his responses and the agency's handling of the case. The session highlighted ongoing concerns about transparency and accountability within the FBI.",
    "published": "2025-09-16T15:31:15Z"
  },
  {
    "title": "Starmer urged to apologise to Epstein victims over Mandelson appointment — UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/16/starmer-cabinet-resignation-paul-ovenden-news-updates-uk-politics-live",
    "image": "https://media.guim.co.uk/fe7b2e213d3debf842a0d82ea4f21e113ba99507/631_0_6310_5048/500.jpg",
    "summary": "During a Commons debate, Kemi Badenoch and Ed Davey criticized the Prime Minister's record regarding the US ambassador appointment. Their criticisms came as Labour leader Keir Starmer chose to skip the session. The debate highlighted ongoing political tensions surrounding foreign diplomatic relations.",
    "published": "2025-09-16T15:31:12Z"
  },
  {
    "title": "Robert Redford dies: Meryl Streep leads tributes to giant of American cinema, saying ‘one of the lions has passed’ – latest updates",
    "url": "https://www.theguardian.com/film/live/2025/sep/16/robert-redford-dies-tributes-cinema-hollywood-legend-latest-news-updates",
    "image": "https://media.guim.co.uk/da81d5e0a015b734c7919cef2f5880509d2ca6af/798_0_10585_8470/500.jpg",
    "summary": "Legendary actor known for his roles in Hollywood classics like \"Butch Cassidy and the Sundance Kid,\" \"The Sting,\" and \"All the President’s Men\" has passed away at the age of 89. His influential career spanned decades, leaving a lasting impact on the film industry. Fans and colleagues remember him for his remarkable talent and memorable performances.",
    "published": "2025-09-16T15:30:57Z"
  },
  {
    "title": "Surrey v Nottinghamshire, Sussex v Yorkshire, and more: county cricket, day two – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/16/surrey-v-nottinghamshire-sussex-v-yorkshire-and-more-county-cricket-day-two-live",
    "image": "https://media.guim.co.uk/2f17c2e7f5aeeb89077071e376ee9bcac13c95e3/117_0_1375_1100/500.jpg",
    "summary": "Tanya Aldred provides updates on the latest County Championship fixtures. The news covers key matches and performances from the ongoing tournament. Stay informed about team standings and player highlights.",
    "published": "2025-09-16T15:30:35Z"
  }
]