[
  {
    "title": "Stephen Colbert condemns Jimmy Kimmel suspension as ‘blatant assault on freedom of speech’ – live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/18/jimmy-kimmel-charlie-kirk-comments-show-cancelled-suspended-monologue-trump-us-politics-live",
    "image": "https://media.guim.co.uk/e749903785cd658944f7f7191220e08193aff733/449_0_4493_3594/500.jpg",
    "summary": "A late-night host criticized Disney executives for yielding to pressure from FCC chair Brendan Carr. The host condemned the decision, arguing that it showcases a troubling trend of corporate leaders bowing to external threats. This situation highlights ongoing tensions between media companies and regulatory figures in the entertainment industry.",
    "published": "2025-09-19T03:06:45Z"
  },
  {
    "title": "Seven teenagers arrested over stabbing deaths of two boys in Melbourne",
    "url": "https://www.theguardian.com/australia-news/2025/sep/19/seven-teenagers-arrested-over-stabbing-deaths-of-two-teenagers-in-melbourne-ntwnfb",
    "image": "https://media.guim.co.uk/da1c41a5aaaa12b02c4b1897de6f0128d0778b24/0_0_5000_4000/500.jpg",
    "summary": "Police are investigating the deaths of two young boys, Dau Akueng, 15, and Chol Achiek, 12. As part of the investigation, authorities have conducted raids on homes in the north-west area of the city. The circumstances surrounding the boys' deaths remain unclear as the investigation continues.",
    "published": "2025-09-19T03:01:11Z"
  },
  {
    "title": "Australia news live: fifth whale caught in Sunshine Coast shark nets; Ley calls emissions target modelling ‘a cruel hoax’",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/19/australia-news-live-cheaper-energy-chris-bowen-climate-bush-search-crashed-plane-pilot-julie-bishop-ntwnfb",
    "image": "https://media.guim.co.uk/1bcc64a2e53f0de4ed7f49f66696251dd823fb27/237_0_1330_1064/500.jpg",
    "summary": "I apologize, but I need more context or content in order to summarize the news. Please provide additional details or the main points you'd like summarized!",
    "published": "2025-09-19T03:00:11Z"
  },
  {
    "title": "‘Japanese first’: the mini-Trump on the rise as population crisis bites",
    "url": "https://www.theguardian.com/world/2025/sep/19/japanese-first-sohei-kamiya-sanseito-party-nationalist-mini-trump-population-crisis-bites",
    "image": "https://media.guim.co.uk/7db9be62fb23667db7e2c5a96cb2b06a90686d35/352_0_4425_3538/500.jpg",
    "summary": "Sohei Kamiya’s nationalist party, Sanseito, is attracting a diverse coalition of supporters, including young voters, disillusioned conservatives, and conspiracy theorists. The party's policies resonate with those seeking a strong nationalist agenda. This trend reflects a growing polarization within the political landscape.",
    "published": "2025-09-19T02:27:08Z"
  },
  {
    "title": "Late-night show hosts decry suspension of Kimmel’s show: ‘Blatant assault on freedom of speech’",
    "url": "https://www.theguardian.com/us-news/2025/sep/18/late-night-show-host-kimmel-cancel-colbert-letterman",
    "image": "https://media.guim.co.uk/ffd835d8f5c3d1cb69a9dc45c76730674ed85bca/438_0_2743_2194/500.jpg",
    "summary": "Stephen Colbert, Seth Meyers, and David Letterman expressed their criticisms of Disney, the parent company of ABC, and FCC chair Brendan Carr during a recent discussion. They highlighted concerns regarding media censorship and content control. Their comments reflect broader industry anxieties about corporate influence on free speech and entertainment.",
    "published": "2025-09-19T02:18:47Z"
  }
]