[
  {
    "title": "Sudan’s RSF accused of ‘PR stunt’ after arresting fighters behind civilian killings",
    "url": "https://www.theguardian.com/world/2025/oct/31/sudan-rsf-accused-pr-stunt-after-arresting-fighters-behind-civilian-killings",
    "image": "https://media.guim.co.uk/039d9879f3dbcafd21e3f9614a63181d255feb8b/297_23_2479_1982/500.jpg",
    "summary": "Reports of indiscriminate violence and ethnic targeting in El Fasher have sparked significant international condemnation. The escalating situation has raised concerns about human rights abuses and the safety of affected communities. Global leaders are calling for immediate action to address the violence and protect vulnerable populations.",
    "published": "2025-10-31T17:17:23Z"
  },
  {
    "title": "Premier League’s festive fixture lineup confirmed: football news – live",
    "url": "https://www.theguardian.com/football/live/2025/oct/31/weekend-team-news-and-previews-football-live",
    "image": "https://media.guim.co.uk/562b9e68c46a600c16cdde16fbf0834327846440/408_250_6568_5254/500.jpg",
    "summary": "Join our writers for a comprehensive preview of this weekend's football matches, featuring insights and analysis. Stay updated on the latest news and developments as teams prepare to clash on the pitch. Don't miss out on essential information before the games kick off!",
    "published": "2025-10-31T17:15:54Z"
  },
  {
    "title": "UK man who murdered pregnant girlfriend after release from prison jailed for 42 years",
    "url": "https://www.theguardian.com/uk-news/2025/oct/31/uk-man-who-murdered-pregnant-girlfriend-after-release-from-prison-jailed-for-42-years",
    "image": "https://media.guim.co.uk/6f14e5cfc13b0179d8e5f68dadd1e5cec3df4fde/0_120_880_704/500.jpg",
    "summary": "Alana Odysseos, 32, was fatally attacked by Shaine March while she was pregnant with her third child in July of the previous year. The incident has drawn significant attention due to its tragic circumstances. Details regarding the aftermath and legal proceedings are still unfolding.",
    "published": "2025-10-31T17:11:43Z"
  },
  {
    "title": "Judges could rule on Snap food aid as top Trump official rejects call to use emergency funding to keep benefits going – live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/31/donald-trump-filibuster-shutdown-snap-food-refugees-drug-boats-latest-news-updates",
    "image": "https://media.guim.co.uk/07b229d1eac114f30d6758b19b617cbe5a13903d/421_0_6569_5254/500.jpg",
    "summary": "Starting Saturday, over 40 million Americans may lose their food stamp benefits due to budget cuts. The Agriculture Secretary stated that finding alternative funding sources for the program would be legally unfeasible. This potential loss of assistance could significantly impact many low-income households.",
    "published": "2025-10-31T17:05:12Z"
  },
  {
    "title": "Worries about immigration are ‘manufactured panic’ says charity as poll shows issue not a local concern – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/oct/31/uk-politics-prince-andrew-latest-news-updates-labour-conservatives-keir-starmer-rachel-reeves",
    "image": "https://media.guim.co.uk/abe5bd8a7bcdd3079bc7bd44272705d3e30e7a88/818_0_4565_3652/500.jpg",
    "summary": "A YouGov poll reveals that only 26% of respondents view immigration as a local issue, while over half consider it a national concern. This disparity highlights differing perceptions of immigration's relevance at local versus national levels. The findings suggest that while immigration may not be a pressing issue in local contexts, it remains a significant topic of debate nationally.",
    "published": "2025-10-31T17:01:25Z"
  }
]