[
  {
    "title": "Bolsonaro sentenced to 27 years for plotting military coup in Brazil",
    "url": "https://www.theguardian.com/world/2025/sep/11/brazil-supreme-court-bolsonaro-guilty-coup",
    "image": "https://media.guim.co.uk/08aea7c1f84d4169ef1d69dcacab213830351347/953_0_4305_3444/500.jpg",
    "summary": "Former President aimed to \"annihilate\" democracy following his defeat in the 2022 election. His actions reportedly involved attempts to undermine electoral integrity and incite unrest. This revelation has raised significant concerns about the health of democracy in the country.",
    "published": "2025-09-11T22:21:20Z"
  },
  {
    "title": "Australia news live: ‘unedifying week’ for Coalition, says Hume; Trump reportedly calls Albanese ‘a good man’",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/12/anthony-albanese-pacific-islands-forum-woodside-north-west-shelf-decision-sussan-ley-labor-coalition-ntwnfb",
    "image": "https://media.guim.co.uk/a8d1a6cb1155d3e909177605fee1c500ee13edad/465_0_6393_5114/500.jpg",
    "summary": "I'm unable to access live news updates. However, you can provide specific news content or topics, and I'd be happy to summarize that for you in three lines!",
    "published": "2025-09-11T22:19:00Z"
  },
  {
    "title": "Charlie Kirk shooting latest: Trump encourages nonviolent response as search continues for shooting suspect",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/11/charlie-kirk-shot-latest-news-updates-utah-university-donald-trump",
    "image": "https://media.guim.co.uk/9a38893e62f086205c21f83902cafdb2120e4a81/1006_0_6827_5464/500.jpg",
    "summary": "Trump praised Kirk as a proponent of nonviolence, suggesting that such a response is preferable in challenging situations. Meanwhile, the FBI has released images of a shooting suspect and is offering a $100,000 reward for any information leading to their capture. This follows a recent incident that has heightened public concern for safety and justice.",
    "published": "2025-09-11T22:13:57Z"
  },
  {
    "title": "Oxford Union condemns president-elect’s reported comments on Charlie Kirk shooting",
    "url": "https://www.theguardian.com/education/2025/sep/11/oxford-union-condemns-president-elects-reported-comments-on-charlie-kirk-shooting",
    "image": "https://media.guim.co.uk/f499367d07db6c6df071619caf142c922a8e3163/318_101_1091_874/500.jpg",
    "summary": "The current leadership strongly condemns George Abaraonye's comments, stating that they unequivocally reject his views. They emphasize their stance against political violence. The leadership reaffirms their commitment to peaceful political discourse.",
    "published": "2025-09-11T21:18:30Z"
  },
  {
    "title": "The Newsreader review – if this powerful Aussie drama were a US show, it’d be a smash hit",
    "url": "https://www.theguardian.com/tv-and-radio/2025/sep/11/the-newsreader-review-if-this-powerful-aussie-drama-were-a-us-show-itd-be-a-smash-hit",
    "image": "https://media.guim.co.uk/457503e237718acbc5a9d0f56b16a98b64877fef/649_0_3571_2857/500.jpg",
    "summary": "The Australian series set in the 80s features rival newscasters and delivers a captivating blend of soapiness and high drama. Its campy tone enhances the nostalgic period drama experience. Overall, it stands out as a delightful portrayal of competition in the news world.",
    "published": "2025-09-11T20:55:16Z"
  }
]