[
  {
    "title": "Qatar hosts Arab summit over Israeli strike on Hamas leaders in Doha – Middle East crisis live",
    "url": "https://www.theguardian.com/world/live/2025/sep/15/israel-gaza-hamas-qatar-marco-rubio-netanyahu-middle-east-crisis-live-news-updates",
    "image": "https://media.guim.co.uk/094354c86ae6abc4bd62c434f20d8105423655f8/14_0_2300_1840/500.jpg",
    "summary": "The country has announced its commitment to remain a crucial mediator in ongoing efforts to achieve a ceasefire. It aims to facilitate dialogue and negotiations between conflicting parties. This role underscores its dedication to promoting peace and stability in the region.",
    "published": "2025-09-15T10:37:51Z"
  },
  {
    "title": "First annual drop in UK house asking prices since January 2024",
    "url": "https://www.theguardian.com/business/live/2025/sep/15/uk-house-prices-drop-tax-budget-rents-financial-markets-business-live-news-updates",
    "image": "https://media.guim.co.uk/b87c1709752e74dfedbeafd95d09476194ffe5ab/681_0_4320_3456/500.jpg",
    "summary": "Beijing has intensified its investigation into Nvidia regarding its acquisition of Mellanox. This move comes amid broader scrutiny of foreign investments in China. The situation highlights rising tensions in technology and trade relations between the U.S. and China.",
    "published": "2025-09-15T10:37:28Z"
  },
  {
    "title": "World Athletics Championships 2025: Duplantis goes for pole vault gold, hurdles finals and more – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/15/world-athletics-championships-2025-armand-duplantis-goes-for-pole-vault-gold-hurdles-finals-and-more-live",
    "image": "https://media.guim.co.uk/3e56e38af970661024aea8dd4e83f1a97fb12a58/433_0_3449_2759/500.jpg",
    "summary": "On the third day of events in Tokyo, Yara El-Shaboury reports on the latest updates and happenings. Details on key performances and highlights from various competitions are shared. The excitement grows as athletes continue to showcase their skills and compete at a high level.",
    "published": "2025-09-15T10:37:26Z"
  },
  {
    "title": "Conservative MP Danny Kruger defects to Reform – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/15/keir-starmer-peter-mandelson-labour-reform-tories-uk-politics-live-news-updates",
    "image": "https://media.guim.co.uk/74251c8ba432b9c2b47165dcc24ba476970fab0b/1055_0_6235_4988/500.jpg",
    "summary": "Nigel Farage announced the defection of an MP from East Wiltshire to his party, bolstering its ranks. He has appointed the MP to lead efforts in preparing the party for a potential government role. This move signals a strategic push as the party positions itself for future elections.",
    "published": "2025-09-15T10:37:05Z"
  },
  {
    "title": "Russia tries to blame Ukraine for drone incursion into Romania – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/sep/15/russia-ukraine-romania-poland-drone-trump-tariffs-europe-live-news-updates",
    "image": "https://media.guim.co.uk/1dadcafc9621b128b32add2b876e5b27f5f0a7f9/412_0_4349_3479/500.jpg",
    "summary": "Moscow has accused Kyiv of staging a provocation related to an incident that occurred on Saturday. However, Russian officials have not provided any evidence to support their claims. The situation adds to ongoing tensions between the two countries.",
    "published": "2025-09-15T10:35:23Z"
  }
]