[
  {
    "title": "Australia news live: crime scene established after Tony Burke’s Sydney office vandalised; two rescues as flooding sweeps NSW",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/10/australia-news-live-nampijinpa-price-littleproud-pacific-albanese-indian-immigration-sussan-ley-coalition-liberal-labor-koala-park-nsw-ntwnfb",
    "image": "https://media.guim.co.uk/631fd0359f4cf8df6757e01dedd2a1fadd0e9b2e/934_406_4132_3305/500.jpg",
    "summary": "Please provide the news article or details you'd like summarized, and I'll help you with that!",
    "published": "2025-09-10T07:29:15Z"
  },
  {
    "title": "‘Huge number of Russian drones’ violated our airspace, says Poland’s PM – follow live",
    "url": "https://www.theguardian.com/world/live/2025/sep/10/poland-pm-condemns-repeated-violation-of-airspace-amid-russian-attack-on-ukraine-follow-live",
    "image": "https://media.guim.co.uk/360b3ad8d55e8b5a97690e31b6bdfdcad58e5388/45_0_4348_3478/500.jpg",
    "summary": "Tusk stated that threats were neutralized by shooting them down, while Zelenskyy warned that the incursion establishes an \"extremely dangerous precedent for Europe.\" Both leaders emphasize the serious implications of the situation for regional security. The comments reflect growing concerns about escalating tensions in Europe.",
    "published": "2025-09-10T07:28:07Z"
  },
  {
    "title": "Ozempic maker Novo Nordisk to cut 9,000 jobs amid increased competition",
    "url": "https://www.theguardian.com/business/2025/sep/10/ozempic-maker-novo-nordisk-to-cut-9000-jobs-amid-increased-competition",
    "image": "https://media.guim.co.uk/871026e1047e6bb138abd78e0e7655858053b878/598_0_4762_3812/500.jpg",
    "summary": "A Danish company specializing in weight-loss and diabetes medications is facing increased competition from US-based Eli Lilly. The pressure stems from Eli Lilly's growing market presence and innovative treatments. This rivalry is prompting the Danish manufacturer to adapt its strategies in the pharmaceutical landscape.",
    "published": "2025-09-10T07:19:36Z"
  },
  {
    "title": "Trump reportedly asks EU to levy 100% tariffs on India and China; Ozempic maker Novo to cut 9,000 jobs – business live",
    "url": "https://www.theguardian.com/business/live/2025/sep/10/trade-tariffs-eu-trump-ozempic-novo-jobs-markets-business-live-news",
    "image": "https://media.guim.co.uk/a22500b598bb72689541af622cd81fac33541b21/345_0_3452_2761/500.jpg",
    "summary": "The US president is seeking to increase pressure on Russia to bring an end to the ongoing war in Ukraine. This includes potential diplomatic and economic measures aimed at compelling Russia to change its course. The administration emphasizes the importance of international unity in addressing the conflict.",
    "published": "2025-09-10T07:17:59Z"
  },
  {
    "title": "Afternoon Update: Poland shoots down Russian drones; unrepentant Nampijinpa Price won’t back Ley; and an Australian take on the Iliad",
    "url": "https://www.theguardian.com/australia-news/2025/sep/10/afternoon-update-wednesday-ntwnfb",
    "image": "https://media.guim.co.uk/98c5fd8fa47e64df62bc6d1a58b3bbd268be9c25/495_0_3250_2601/500.jpg",
    "summary": "Poland's Prime Minister announced ongoing operations due to repeated violations of Polish airspace amid the Russia-Ukraine conflict. This marks Poland's first direct involvement in the situation. The Prime Minister emphasized the need to protect national security and respond decisively.",
    "published": "2025-09-10T07:05:14Z"
  }
]