[
  {
    "title": "Mounjaro maker pauses shipments of weight loss drug to UK",
    "url": "https://www.theguardian.com/business/2025/aug/28/weight-loss-drug-mounjaro-uk-price-rise-eli-lilly-pauses-shipments",
    "image": "https://media.guim.co.uk/dd8b5a330c676f676bb7bf9dfe06cf06d589eb8f/480_0_4410_3527/500.jpg",
    "summary": "Eli Lilly, a US pharmaceutical company, has instructed British wholesalers to halt orders due to a surge in demand ahead of a planned price increase in September. This decision comes as consumers rush to secure their medications before the anticipated hike. The move has raised concerns about access to essential drugs during this period of heightened demand.",
    "published": "2025-08-28T14:37:04Z"
  },
  {
    "title": "Liz Truss warns there is ‘a reckoning coming’ for central banks, and backs Trump in Fed battle; US growth revised higher amid AI boom – as it happened",
    "url": "https://www.theguardian.com/business/live/2025/aug/28/tesla-sales-fall-across-europe-byd-bond-market-shares-ftse-business-live-news-updates",
    "image": "https://media.guim.co.uk/cfdb5cc7bda6dc4d6aea2245075bdbf20e3d9fad/484_0_4840_3872/500.jpg",
    "summary": "Former Prime Minister criticizes the Bank of England, claiming the UK is trapped in an \"economic doom loop.\" This statement comes amid ongoing coverage of the latest economic and financial developments. The criticism highlights concerns over the country's economic stability and future outlook.",
    "published": "2025-08-28T14:32:43Z"
  },
  {
    "title": "Bernie Sanders condemns ousting of CDC chief Susan Monarez as ‘outrageous’ – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/aug/28/cdc-susan-monarez-trump-news-updates-us-politics-live",
    "image": "https://media.guim.co.uk/71cc986f78ba5915acef8f1ed4b2365e7c0288cc/399_0_3333_2667/500.jpg",
    "summary": "Vermont Senator has commented on the turmoil following Monarez's refusal to resign from his position. This decision has created significant disruption within the state's public health agency. The senator's remarks highlight growing concerns about the agency's leadership and stability.",
    "published": "2025-08-28T14:32:33Z"
  },
  {
    "title": "Home Office says injunction against Epping hotel would have ‘serious impact’ on UK’s ability to house asylum seekers - UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/aug/28/latest-uk-politics-news-keir-starmer-rachel-reeves-labour-live-updates",
    "image": "https://media.guim.co.uk/ce98a439324cf0ec721f78c26607e0cdcd8d57b5/137_0_2501_2001/500.jpg",
    "summary": "The Director of Asylum Support testified in a court of appeal hearing regarding the closure of the Bell Hotel, warning that it could set a negative precedent. This decision might also lead to increased public disorder in other areas. The testimony underscores the potential broader implications of the hotel's closure on asylum support and community stability.",
    "published": "2025-08-28T14:30:28Z"
  },
  {
    "title": "Taylor Swift: engaged, mummy-tracked and doomed to tradwifedom? You really haven’t been listening | Gaby Hinsliff",
    "url": "https://www.theguardian.com/commentisfree/2025/aug/28/taylor-swift-engaged-married-women-music",
    "image": "https://media.guim.co.uk/4e492fb2c7ccd9107405fd35cf976ff18ca6452c/245_0_2518_2015/500.jpg",
    "summary": "Critics argue that marriage may hinder the creativity of an artist known for empowering women through her music. However, columnist Gaby Hinsliff in the Guardian believes that this concern is unfounded. The artist has already proven her ability to thrive creatively, having made billions from her work.",
    "published": "2025-08-28T14:13:16Z"
  }
]