[
  {
    "title": "England v South Africa: third men’s one-day international – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/07/england-v-south-africa-third-mens-one-day-international-live",
    "image": "https://media.guim.co.uk/21101378a7fb42cca61ce6f4772272ae0bc01ebf/285_0_3738_2990/500.jpg",
    "summary": "South Africa has secured victory in the three-match ODI series against England. The final match will take place at the Utilita Bowl. England now aims to salvage pride in this concluding game.",
    "published": "2025-09-07T11:21:25Z"
  },
  {
    "title": "Liverpool v Everton, Spurs v West Ham, Manchester United v Leicester and more: WSL – live",
    "url": "https://www.theguardian.com/football/live/2025/sep/07/liverpool-v-everton-spurs-v-west-ham-manchester-united-v-leicester-and-more-wsl-live",
    "image": "https://media.guim.co.uk/f8c4662c992ae8a1443312348a9e10ded8052a57/499_35_3215_2572/500.jpg",
    "summary": "The Women's Super League features matchups including Tottenham vs. West Ham, Liverpool vs. Everton, and Manchester United vs. Leicester. Fans can follow the action with Billy Munday providing coverage. Excitement builds as top teams compete for crucial points.",
    "published": "2025-09-07T11:21:09Z"
  },
  {
    "title": "Lewis Capaldi review – an emotional return to the spotlight for pop’s most heart-on-sleeve star",
    "url": "https://www.theguardian.com/music/2025/sep/07/lewis-capaldi-review-utilita-arena",
    "image": "https://media.guim.co.uk/6d898fdf6fcae13daeff12de89afd41f1391b72f/577_141_2953_2364/500.jpg",
    "summary": "The singer expresses excitement about launching his first tour after a hiatus for mental health reasons. However, he shows visible nerves during the announcement, leading to an emotional moment where he breaks down in tears. This highlights the challenges he's faced and his commitment to returning to the stage.",
    "published": "2025-09-07T11:13:47Z"
  },
  {
    "title": "Farage rows back on promise to stop small boats within two weeks if he becomes PM – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/07/latest-live-uk-politics-news-updates-keir-starmer-labour-nigel-farage-kemi-badenoch-angela-rayner-updates",
    "image": "https://media.guim.co.uk/87aa2ffd9527b50a4f6a72e23911ca3be1e77d82/273_0_6880_5504/500.jpg",
    "summary": "Reform UK leader states that any potential election victory would not immediately enable expedited deportations. He acknowledges that new legislation would be necessary for quicker deportation processes. The passage of this law could take several months.",
    "published": "2025-09-07T11:05:50Z"
  },
  {
    "title": "Bunny author Mona Awad: ‘I’m a dark-minded soul’",
    "url": "https://www.theguardian.com/books/2025/sep/07/bunny-author-mona-awad-im-a-dark-minded-soul",
    "image": "https://media.guim.co.uk/d05217f3dbb951b49a820393bd81dfd79c4550c3/153_145_2818_2255/500.jpg",
    "summary": "The author of a critically acclaimed surreal and satirical novel discusses her journey as an outsider while launching a follow-up. She reflects on the immense support from her fans and the accolades she has received. Additionally, she shares valuable advice she learned from the esteemed writer Margaret Atwood.",
    "published": "2025-09-07T11:00:20Z"
  }
]