[
  {
    "title": "NFL week nine: Colts v Steelers, Falcons v Patriots, Texans v Broncos and more – live",
    "url": "https://www.theguardian.com/sport/live/2025/nov/02/nfl-week-nine-colts-v-steelers-falcons-v-patriots-chiefs-bills-live",
    "image": "https://media.guim.co.uk/6ad93b9b392d770d5643f7104955826418a5f077/279_0_3429_2743/500.jpg",
    "summary": "Graham Searles reports on an exciting day filled with sports action, highlighting key updates. The day culminates with the highly anticipated matchup between the Chiefs and Bills. Fans can expect thrilling moments as these two teams face off.",
    "published": "2025-11-02T21:15:38Z"
  },
  {
    "title": "FBI fires top official amid Kash Patel’s outrage over reports of agency jet use",
    "url": "https://www.theguardian.com/us-news/2025/nov/02/fbi-fires-top-official-kash-patel-jet-use",
    "image": "https://media.guim.co.uk/e504121e7f92a514c0b72041a88c2c1fbb571065/369_0_5000_4000/500.jpg",
    "summary": "Patel expressed anger upon learning that he had traveled to see his girlfriend. This incident coincided with the firing of an official responsible for the agency's fleet. The situation has sparked controversy and scrutiny surrounding the agency's operations.",
    "published": "2025-11-02T21:12:16Z"
  },
  {
    "title": "Australia politics live: Liberal frontbencher admits Coalition ‘down in the dumps’ but backs Ley; Littleproud rejects ‘puerile’ net zero argument ",
    "url": "https://www.theguardian.com/australia-news/live/2025/nov/03/australia-politics-live-nationals-net-zero-liberals-labor-bulk-billing-optus-sussan-ley-anthony-albanese-question-time",
    "image": "https://media.guim.co.uk/60892b8c1f1d67a790ad18b280c04db1234cfcf0/688_0_6880_5504/500.jpg",
    "summary": "Please provide the news article or details you'd like me to summarize, and I'll be happy to help!",
    "published": "2025-11-02T21:11:28Z"
  },
  {
    "title": "Game of Wool: Britain’s Best Knitter review – Tom Daley is a twinkling, passionate joy of a presenter",
    "url": "https://www.theguardian.com/tv-and-radio/2025/nov/02/game-of-wool-britains-best-knitter-tom-daley-review-channel-4",
    "image": "https://media.guim.co.uk/ca3f05cff7285b2d8f07b83f0aca45541f7e22f3/171_0_2659_2128/500.jpg",
    "summary": "The ex-diver has become an impressive standout on the show, significantly enhancing its appeal. His needle-based Bake Off skills are captivating, making him an interesting contender. Overall, his presence elevates the show's quality by 80% whenever he appears.",
    "published": "2025-11-02T21:00:13Z"
  },
  {
    "title": "Corrections and clarifications",
    "url": "https://www.theguardian.com/news/2025/nov/02/corrections-and-clarifications2",
    "summary": "Locomotion No 1, a historic steam locomotive, has undergone a restoration where it was meticulously silthered and slivered. This innovative technique highlighted the locomotive's intricate details while preserving its heritage. The restoration aims to enhance public appreciation for railway history.",
    "published": "2025-11-02T21:00:12Z"
  }
]