[
  {
    "title": "Tottenham v Arsenal: Women’s Super League – live",
    "url": "https://www.theguardian.com/football/live/2025/nov/16/tottenham-v-arsenal-womens-super-league-live",
    "image": "https://media.guim.co.uk/1e112d77f16f98215cc3e72e50180cef0cf893c8/0_0_4783_3826/500.jpg",
    "summary": "John Brewin provides live updates on the north London derby in his minute-by-minute report. Fans can follow the action closely as the match unfolds. Stay tuned for real-time commentary and analysis.",
    "published": "2025-11-16T14:15:04Z"
  },
  {
    "title": "Lorde review – viscerally kinetic theatrics and euphoric abandon",
    "url": "https://www.theguardian.com/music/2025/nov/16/lorde-review-viscerally-kinetic-theatrics-and-euphoric-abandon",
    "image": "https://media.guim.co.uk/6155e529ca22ac0950461caf8449ca7aaa3c3d55/453_0_4521_3617/500.jpg",
    "summary": "The New Zealand alt-pop diva's performance blends elements from Talking Heads' \"Stop Making Sense\" with energetic digital glitches. The show features a mix of theatrical visuals and engaging, intimate moments with the audience. It creates a captivating experience that showcases her unique style and artistry.",
    "published": "2025-11-16T14:11:12Z"
  },
  {
    "title": "Chelsea held by Liverpool in WSL, World Cup qualifying latest and more: matchday live",
    "url": "https://www.theguardian.com/football/live/2025/nov/16/world-cup-qualifying-latest-wsl-updates-and-more-matchday-live",
    "image": "https://media.guim.co.uk/28fb0c44984620ecb3bfddf221287d99801a3590/604_0_4825_3860/500.jpg",
    "summary": "Writers cover recent updates and discussions surrounding the Women's Super League (WSL) and World Cup qualifiers. The focus is on the latest developments and preparations for upcoming matches. Fans can expect insights and analysis as the events unfold.",
    "published": "2025-11-16T14:07:15Z"
  },
  {
    "title": "Hannah Clarke murders: Queensland police made potentially critical mistakes, new evidence reveals",
    "url": "https://www.theguardian.com/australia-news/2025/nov/16/hannah-clarke-children-murder-qld-queensland-police",
    "image": "https://media.guim.co.uk/5e4d60c296463aa1e6f785991ac51e5f029ee17e/0_0_2500_2000/500.jpg",
    "summary": "Detectives in Brisbane scrutinized the credibility and intent behind a woman's allegations of domestic violence and coercive control, despite the tragic incident that resulted in her and her children's deaths. The investigation raised questions about the adequacy of responses to her claims. The situation highlights broader concerns regarding domestic violence awareness and support.",
    "published": "2025-11-16T14:00:39Z"
  },
  {
    "title": "Climate crisis or a warning from God? Iranians desperate for answers as water dries up",
    "url": "https://www.theguardian.com/world/2025/nov/16/climate-crisis-or-a-warning-from-god-iranians-desperate-for-answers-as-water-dries-up",
    "image": "https://media.guim.co.uk/4e4c44db8b2074885970c09f0dbb9321954f148b/3_0_2303_1842/500.jpg",
    "summary": "With the rainy season not providing adequate relief, authorities are turning to cloud seeding in hopes of generating more precipitation. Meanwhile, many citizens across the country are resorting to prayer, seeking a miracle to alleviate the drought conditions. The situation highlights the urgent need for effective solutions to combat ongoing water scarcity.",
    "published": "2025-11-16T14:00:39Z"
  }
]