[
  {
    "title": "Australia politics live: Ley launches extraordinary attack on PM for ‘profound failure of judgment’ over Joy Division T-shirt",
    "url": "https://www.theguardian.com/australia-news/live/2025/oct/28/federal-parliament-algae-report-senate-social-media-age-assurance-labor-coalition-anthony-albanese-sussan-ley-barnaby-joyce-telco-penalties-ntwnfb",
    "image": "https://media.guim.co.uk/79b4b78ddbf6e799670f704263954a9202d6313a/5_0_4606_3687/500.jpg",
    "summary": "Sure! However, I will need the specific news article or topic you want summarized. Please provide the details.",
    "published": "2025-10-28T05:19:28Z"
  },
  {
    "title": "Hurricane Melissa latest updates: category 5 storm approaches landfall in Jamaica",
    "url": "https://www.theguardian.com/world/live/2025/oct/28/hurricane-melissa-live-updates-category-5-storm-jamaica-landfall-latest-news",
    "image": "https://media.guim.co.uk/4ef2d5839ddb6d1aa5d1c57ece625c7b7f249d59/250_0_2500_2000/500.jpg",
    "summary": "Jamaican officials are urging the public to seek higher ground and shelters in anticipation of an approaching hurricane. They have issued warnings regarding potential \"multiple life-threatening hazards.\" Residents are advised to take the situation seriously and prepare for severe weather conditions.",
    "published": "2025-10-28T05:14:15Z"
  },
  {
    "title": "First person arrives on Nauru triggering Australia’s $2.5bn deal with island nation",
    "url": "https://www.theguardian.com/australia-news/2025/oct/28/nauru-australia-deal-payment-as-first-man-arrives-nzyq",
    "image": "https://media.guim.co.uk/715baff02a40a7de11f69569f912670be17dcb05/89_0_1500_1200/500.jpg",
    "summary": "The federal government has reached a 30-year agreement with Nauru concerning approximately 350 individuals affected by the High Court's NZYQ ruling. This deal is expected to facilitate the management and processing of these individuals' immigration status. The arrangement highlights ongoing cooperation between Australia and Nauru in handling asylum seeker issues.",
    "published": "2025-10-28T05:06:07Z"
  },
  {
    "title": "‘Mud on our hands; blood on his’: fury lingers one year after Spain’s deadly floods",
    "url": "https://www.theguardian.com/world/2025/oct/28/spain-deadly-floods-valencia-one-year-after-survivors-carlos-mazon",
    "image": "https://media.guim.co.uk/cfba8e604c8cb7d1014a892bdaf3ba27f2c0996a/99_0_5000_4000/500.jpg",
    "summary": "Survivors of the recent natural disaster in Valencia, which is the country’s deadliest in 2023, are demanding accountability from officials, especially the regional president. They are seeking consequences for perceived failures in disaster preparedness and response. The tragedy has sparked widespread calls for reform and support for affected communities.",
    "published": "2025-10-28T05:00:21Z"
  },
  {
    "title": "Jimmy Carr’s Am I the A**hole? review – the idea for this comedy panel show is one of TV’s laziest",
    "url": "https://www.theguardian.com/tv-and-radio/2025/oct/28/jimmy-carrs-am-i-the-ahole-review-paramount",
    "image": "https://media.guim.co.uk/2a206f325079f5653db6ad450a15bdd8cbf2ff12/184_0_6734_5391/500.jpg",
    "summary": "A new show features comics judging public stories of misfortune to determine the worst tale, inspired by a subReddit. Critics describe it as confusing and outdated. Overall, the concept struggles to engage viewers effectively.",
    "published": "2025-10-28T05:00:20Z"
  }
]