[
  {
    "title": "Afghanistan earthquake live: more than 800 dead after shallow quake strikes country’s east, state media reports",
    "url": "https://www.theguardian.com/world/live/2025/sep/01/afghanistan-earthquake-live-hundreds-after-shallow-quake-strikes-countrys-east-state-media-reports",
    "image": "https://media.guim.co.uk/4a505703b0a4050ac22ad1014630c49509de5ce0/0_0_2333_1867/500.jpg",
    "summary": "Rescue operations are underway in Kunar province, where the public health ministry reports that several villages have been \"completely destroyed.\" The devastation is prompting immediate humanitarian responses. The situation highlights the urgent need for assistance and support for affected communities.",
    "published": "2025-09-01T10:43:19Z"
  },
  {
    "title": "Zelenskyy says Ukraine will ‘remind everyone’ as Trump’s semi-deadline of end to war expires – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/sep/01/volodymyr-zelenskyy-ukraine-donald-trump-semi-deadline-war-end-europe-latest-updates-news-live",
    "image": "https://media.guim.co.uk/583df19ec50e9c9a7f4fb186ca14ef8c4ef2cacb/643_0_4998_3999/500.jpg",
    "summary": "At a recent summit in Alaska, Donald Trump mentioned he is nearing a breakthrough that could facilitate a meeting between Russian President Vladimir Putin and Ukrainian President Volodymyr Zelenskyy. His comments suggest optimism regarding diplomatic efforts to address the ongoing conflict between Russia and Ukraine. The potential meeting could signify a significant step towards resolving tensions in the region.",
    "published": "2025-09-01T10:43:00Z"
  },
  {
    "title": "UK manufacturing downturn continues as new orders slide; Trump’s attack on Fed is ‘a serious danger’ – business live",
    "url": "https://www.theguardian.com/business/live/2025/sep/01/factory-activity-us-tariffs-uk-house-price-drop-mortgage-interest-rates-business-live-news-updates",
    "image": "https://media.guim.co.uk/931d11a23666de0b8a2b0e280544fbe3feee3900/215_0_3366_2692/500.jpg",
    "summary": "Factory orders have declined due to weak market conditions, the impact of US tariffs, and decreased client confidence. This downturn reflects the challenges facing manufacturers amid a sluggish economic environment. As a result, businesses may struggle to secure new orders in the coming months.",
    "published": "2025-09-01T10:39:43Z"
  },
  {
    "title": "Transfer deadline day: Isak and Wissa deals agreed; Sancho, Jackson, Donnarumma and more – live",
    "url": "https://www.theguardian.com/football/live/2025/sep/01/transfer-deadline-day-guehi-wissa-martinez-ederson-latest-and-more-live",
    "image": "https://media.guim.co.uk/704430d3f382497ffef31e0d9c92a3fdfe269ba2/611_0_4299_3440/500.jpg",
    "summary": "John Brewin is providing a rolling report on the latest developments and transfers as deadline day unfolds. Fans can expect updates on significant moves and news in an eventful day for sports. Stay tuned for live coverage of all the action.",
    "published": "2025-09-01T10:39:32Z"
  },
  {
    "title": "Hamilton ready for ‘huge pressure’ at Ferrari’s home GP after crashing out at Zandvoort",
    "url": "https://www.theguardian.com/sport/2025/sep/01/lewis-hamilton-ready-huge-pressure-ferrari-home-gp-crashing-out-zandvoort-f1",
    "image": "https://media.guim.co.uk/43e0f5859f9c26c878f04eacddaa957783ab1d05/408_0_4563_3651/500.jpg",
    "summary": "Lewis Hamilton has stated that he is mentally in a good place despite making an unforced error during the Dutch Grand Prix. As a result of this error, he will incur a five-place grid penalty for the upcoming race at Monza. Hamilton remains optimistic moving forward in the season.",
    "published": "2025-09-01T10:36:04Z"
  }
]