[
  {
    "title": "Charlie Kirk memorial: Trump tells crowd ‘I hate my opponents’ after Erika Kirk says she forgives shooting suspect – latest updates",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/21/charlie-kirk-funeral-memorial-time-updates-arizona",
    "image": "https://media.guim.co.uk/c225a64aaebfb41b91f210c3013bb402dd38ec63/402_0_4778_3824/500.jpg",
    "summary": "The US president refrained from delivering a message of unity at a recent event, following comments made by the widow of activist Tyler Robinson, who addressed the crowd of tens of thousands, stating, \"I forgive him.\" This occurred amidst discussions of healing and reconciliation. The president's silence on unity stands out in contrast to the widow’s sentiments.",
    "published": "2025-09-21T23:26:09Z"
  },
  {
    "title": "Erika Kirk, Charlie Kirk’s widow, says she forgives man accused of murder",
    "url": "https://www.theguardian.com/us-news/2025/sep/21/erika-kirk-charlie-kirk-killing",
    "image": "https://media.guim.co.uk/a78c9b150d55156d3fa00968bfd43f183bbf6777/576_0_4164_3333/500.jpg",
    "summary": "The wife of an activist killed in Utah, allegedly by 22-year-old Tyler Robinson, publicly expressed her forgiveness towards him, stating, “I forgive him because it was what Christ did.” Her statement reflects a deep sense of compassion and faith even in the face of tragedy. The incident highlights themes of loss, forgiveness, and the impact of faith in difficult circumstances.",
    "published": "2025-09-21T23:23:11Z"
  },
  {
    "title": "Australia news live: Wells warns telcos there are ‘no excuses’ for triple zero failure; Sydney trains to ban some ebikes",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/22/australia-news-live-anthony-albanese-new-york-israel-palestine-donald-trump-optus-triple-zero-ntwnfb",
    "image": "https://media.guim.co.uk/a0e1ffaa1e6daae0780f78f9557a9f6cdc3f4e17/1686_495_6261_5009/500.jpg",
    "summary": "Please provide the news article or details you would like summarized.",
    "published": "2025-09-21T23:21:30Z"
  },
  {
    "title": "Charlie Kirk funeral mixes rally and revival as mourners vow to spread Maga message",
    "url": "https://www.theguardian.com/us-news/2025/sep/21/charlie-kirk-memorial-arizona-dispatch",
    "image": "https://media.guim.co.uk/52f62dfa450bcbae5a317a8467c7827bb4b04c2d/493_0_4913_3933/500.jpg",
    "summary": "A service commenced with heartfelt Christian worship songs and concluded with a political speech by the president, highlighting the emotional atmosphere. The event blended spiritual expression with political discourse, creating a powerful experience for attendees. This combination underscored the intersection of faith and politics in the current climate.",
    "published": "2025-09-21T23:16:44Z"
  },
  {
    "title": "The Covid Contracts: Follow the Money review – a devastating picture of the biggest spending scandal ever",
    "url": "https://www.theguardian.com/tv-and-radio/2025/sep/21/the-covid-contracts-follow-the-money-review-a-devastating-picture-of-the-biggest-spending-scandal-ever",
    "image": "https://media.guim.co.uk/a3f982a07cac33e130ed19f234fa2173ec847f0e/570_0_1350_1080/500.jpg",
    "summary": "An investigation into the UK's Tory government's 'VIP lane' for PPE suppliers during the Covid pandemic reveals troubling motivations behind the process. It suggests that the prioritization of certain suppliers may have stemmed from unethical interests. The findings raise serious concerns about the integrity and transparency of governmental decisions during a crisis.",
    "published": "2025-09-21T22:40:55Z"
  }
]