[
  {
    "title": "Australia politics live: Sussan Ley takes aim at ‘part-time minister, full-time president’ Chris Bowen over Cop deal as question time returns",
    "url": "https://www.theguardian.com/australia-news/live/2025/nov/24/australia-politics-live-sussan-ley-andrew-hastie-liberal-leadership-libspill-labor-environment-nature-law-senate-greens-coalition-climate-crisis-ntwnfb",
    "image": "https://media.guim.co.uk/1422ab5f5c89740e95f257c47feeeb2fd628ccce/961_0_5136_4109/500.jpg",
    "summary": "Could you please provide the news article or details you'd like summarized?",
    "published": "2025-11-24T03:23:48Z"
  },
  {
    "title": "The best kids’ Christmas gifts in Australia: 50 great ideas for babies, toddlers, kids and tweens",
    "url": "https://www.theguardian.com/lifeandstyle/ng-interactive/2025/nov/24/best-kids-christmas-gifts-australia-guide-2025-great-present-ideas-babies-toddlers-kids-tweens",
    "image": "https://media.guim.co.uk/84763c8a3571fae5443e66779fda0515fdc137b2/250_0_2500_2000/500.jpg",
    "summary": "A curated list of top Christmas gift ideas for children aged zero to 12 has been compiled, showcasing favorites from various regions across the country. The selection includes a variety of toys and products that cater to different interests and age groups. This helpful guide aims to assist shoppers in finding the perfect presents for the children in their lives this holiday season.",
    "published": "2025-11-24T03:23:38Z"
  },
  {
    "title": "‘Beautiful to look at and wonderful to live in’: new pattern designs could be next art deco or red brick classics",
    "url": "https://www.theguardian.com/artanddesign/2025/nov/24/australia-housing-nsw-council-new-architecture-pattern-books-art-deco-red-brick-classics",
    "image": "https://media.guim.co.uk/8006a285ddf426a40613a69e9698e9884af7c956/475_0_7500_6000/500.jpg",
    "summary": "NSW councils are set to accelerate the approval process for competition-winning apartment building plans, cutting the time in half. These approved buildings will range from three to six storeys in height. The initiative aims to streamline development and enhance urban housing options.",
    "published": "2025-11-24T03:07:25Z"
  },
  {
    "title": "‘Culture cringe’: experts dismiss Coalition claims Chris Bowen cannot remain minister while leading Cop31 negotiations",
    "url": "https://www.theguardian.com/environment/2025/nov/24/experts-dismiss-coalition-claims-bowen-cannot-remain-minister-cop31-negotiations",
    "image": "https://media.guim.co.uk/a5ab2efe8b9eb46cc1167fb1bba92ed05757982c/839_76_998_799/500.jpg",
    "summary": "A coalition has asserted that if Bowen assumes a key diplomatic role at the upcoming conference in Turkey, it would limit his responsibilities, effectively making him a \"part-time minister.\" This situation arises as Australians grapple with rising energy prices. Critics argue that his divided focus could exacerbate the challenges faced by the energy sector.",
    "published": "2025-11-24T02:53:47Z"
  },
  {
    "title": "How can Australia convince the world to give up fossil fuels if Anthony Albanese is contradicting himself on gas expansion? | Bill Hare",
    "url": "https://www.theguardian.com/australia-news/commentisfree/2025/nov/24/australia-climate-fossil-fuels-anthony-albanese-gas-expansion",
    "image": "https://media.guim.co.uk/0b76d78b812ffd7e3c38050316f2f260b1d92507/323_0_6113_4891/500.jpg",
    "summary": "Achieving net zero CO₂ emissions is crucial for stopping global warming. This goal necessitates a swift and significant reduction in emissions. The urgency of this transition is backed by scientific principles.",
    "published": "2025-11-24T01:44:02Z"
  }
]