[
  {
    "title": "Worcestershire v Nottinghamshire, Surrey v Warwickshire and more: county cricket, day four – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/11/worcestershire-v-nottinghamshire-surrey-v-warwickshire-and-more-county-cricket-day-four-live",
    "image": "https://media.guim.co.uk/1581c6001aa5286f6d2745bc3bd9765be03d277b/0_157_2449_1959/500.jpg",
    "summary": "Tanya Aldred is providing real-time updates on the concluding day of the recent County Championship matches. Fans can follow her coverage for the latest scores and highlights. Stay tuned for the outcomes as the matches wrap up.",
    "published": "2025-09-11T09:31:18Z"
  },
  {
    "title": "Cow | Deer review – extraordinary sound journey into the lives of animals",
    "url": "https://www.theguardian.com/stage/2025/sep/11/cow-deer-review-extraordinary-sound-journey-into-the-lives-of-animals",
    "image": "https://media.guim.co.uk/6800cfcaa9282989d572084cb021586b817c930f/222_0_6623_5299/500.jpg",
    "summary": "Katie Mitchell, Nina Segal, and Melanie Wilson's latest work is an innovative \"experiment in performance\" that combines expressive acting with creative sound design. This performance immerses audiences in a captivating wordless narrative. The production explores the depths of human experience through its unique artistic approach.",
    "published": "2025-09-11T09:30:38Z"
  },
  {
    "title": "UN security council to hold emergency meeting as Poland plans no-fly zone after Russian drone incursion – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/sep/11/europe-live-news-updates-poland-russia-drones-ukraine-war-latest",
    "image": "https://media.guim.co.uk/3351505fa5cf93907799226bae00ea3615781a5c/338_0_3730_2984/500.jpg",
    "summary": "Poland is implementing measures to enhance its defense capabilities by restricting air traffic in the eastern region of the country. This initiative aims to bolster security amid rising tensions in the region. The move reflects Poland's proactive approach to safeguarding its airspace.",
    "published": "2025-09-11T09:29:50Z"
  },
  {
    "title": "Rising costs push John Lewis Partnership into deeper loss; London tube strike enters fourth day – business live",
    "url": "https://www.theguardian.com/business/live/2025/sep/11/john-lewis-deeper-loss-london-tube-strike-fourth-day-ecb-interest-rates-us-inflation-business-live-news-updates",
    "image": "https://media.guim.co.uk/786143db12f1911f45f9116c23f50a7aac93d90f/477_0_4426_3541/500.jpg",
    "summary": "John Lewis reports that it anticipates full-year profit growth, despite experiencing a larger loss in the first half of the year. The company is managing its financial outlook cautiously while navigating current economic challenges. Continued updates on the economic and financial landscape are being provided.",
    "published": "2025-09-11T09:27:26Z"
  },
  {
    "title": "Charlie Kirk shooting latest: search for killer under way as Trump vows crackdown on ‘political violence’",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/11/charlie-kirk-shot-latest-news-updates-utah-university-donald-trump",
    "image": "https://media.guim.co.uk/30cbf44ad88625ac7938a2f52d2706132688167c/17_66_2297_1837/500.jpg",
    "summary": "In a recent address, Donald Trump attributed the shooting of Kirk to \"the radical left,\" despite the shooter not yet being identified. His comments have sparked controversy over premature accusations. Trump's remarks reflect ongoing tensions surrounding political violence and accountability.",
    "published": "2025-09-11T09:26:12Z"
  }
]