[
  {
    "title": "The Guardian view on hospices: investment in end-of-life care is a national priority | Editorial",
    "url": "https://www.theguardian.com/commentisfree/2025/oct/29/the-guardian-view-on-hospices-investment-in-end-of-life-care-is-a-national-priority",
    "image": "https://media.guim.co.uk/50322d7df6ff2f4dc07d033cab2126c64ae8485e/1611_0_5390_4316/500.jpg",
    "summary": "A new report from the National Audit Office highlights a crisis in the care sector due to the increasing needs of an ageing population. The findings serve as a crucial wake-up call for the government to take action. Immediate attention and reforms are necessary to address these pressing challenges.",
    "published": "2025-10-29T18:26:47Z"
  },
  {
    "title": "‘We’ve got to look at the future’: Edwards to turn to next generation after World Cup exit",
    "url": "https://www.theguardian.com/sport/2025/oct/29/charlotte-edwards-next-generation-england-cricket-world-cup-exit",
    "image": "https://media.guim.co.uk/4a504615d8f17b0b50d3ae00f59390d4ecf19ab0/578_75_3880_3104/500.jpg",
    "summary": "England head coach Charlotte Edwards suggests a shift towards nurturing younger players for the upcoming World Cup cycle. She emphasized the need to focus on new talent to strengthen the team. This move reflects a strategy aimed at revitalizing England's cricket prospects for the future.",
    "published": "2025-10-29T18:26:35Z"
  },
  {
    "title": "The Guardian view on Argentina’s election: one step closer to becoming a Trumpian client state | Ediorial",
    "url": "https://www.theguardian.com/commentisfree/2025/oct/29/the-guardian-view-on-argentinas-election-one-step-closer-to-becoming-a-trumpian-client-state",
    "image": "https://media.guim.co.uk/288e0f0caa73e136236f86d62ce47be35e5c42d5/506_0_3743_2995/500.jpg",
    "summary": "Argentina's recent $40 billion rescue package has enabled Javier Milei to navigate the midterm elections, but it has increased the country's reliance on the United States. This financial support raises concerns about the implications for Argentina's democratic integrity and economic autonomy. The situation underscores the critical balancing act the nation faces in its relationship with Washington.",
    "published": "2025-10-29T18:25:10Z"
  },
  {
    "title": "Farage reclaims centre stage as Reform’s Sarah Pochin keeps the world at bay",
    "url": "https://www.theguardian.com/politics/2025/oct/29/farage-reclaims-centre-stage-as-reforms-sarah-pochin-keeps-the-world-at-bay",
    "image": "https://media.guim.co.uk/09245e6279f27cb50c4ff8a126094c43766d4d7b/608_0_1684_1348/500.jpg",
    "summary": "Nige faced a lackluster performance during Prime Minister's Questions. He shifted focus by calling for a stronger push to distance the UK from Europe. His unexpected demand managed to capture public attention amid the dull proceedings.",
    "published": "2025-10-29T18:18:14Z"
  },
  {
    "title": "Government shutdown could cost $14bn, congressional forecaster predicts - US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/29/donald-trump-south-korea-china-latest-news-updates-live",
    "image": "https://media.guim.co.uk/f2aa79ba7a8be91c15f6083de7ea1c2dc7706eeb/422_0_5171_4139/500.jpg",
    "summary": "The nonpartisan Congressional Budget Office (CBO) projects that up to $14 billion in GDP will be permanently lost if funding is reauthorized. This indicates significant economic repercussions from potential funding decisions. The report emphasizes the long-term impact of fiscal policies on economic recovery.",
    "published": "2025-10-29T18:17:04Z"
  }
]