[
  {
    "title": "Strictly Come Dancing: the launch show – as it happened",
    "url": "https://www.theguardian.com/tv-and-radio/live/2025/sep/20/strictly-come-dancing-the-launch-show-live",
    "image": "https://media.guim.co.uk/ecd49e47ddde8d0a6502de5e8d81fec77206d2c6/0_257_2400_1920/500.jpg",
    "summary": "The ballroom blockbuster returned for 2025 with 15 new celebrity contestants paired with professional partners. Viewers were treated to impressive dance moves from some, while others struggled with their footwork. This season promises a mix of talent and challenges on the dance floor.",
    "published": "2025-09-20T20:18:07Z"
  },
  {
    "title": "‘We are horrified’: proposed lead mine in NSW wine region has community living in fear for children’s health ",
    "url": "https://www.theguardian.com/australia-news/2025/sep/21/we-are-horrified-proposed-lead-mine-in-nsw-wine-region-has-community-living-in-fear-for-childrens-health",
    "image": "https://media.guim.co.uk/92b7cf8814a94ac14dca7408ae549f944446242d/759_0_6827_5464/500.jpg",
    "summary": "Parents express concern over their children's safety after the environment watchdog suppressed a report on lead mining. They question whether the interests of mining are being prioritized over public health. Trust in the watchdog's commitment to safety is being challenged.",
    "published": "2025-09-20T20:00:25Z"
  },
  {
    "title": "Andoni Iraola is a model modern manager. Could he save Manchester United? | Jonathan Wilson",
    "url": "https://www.theguardian.com/football/2025/sep/20/andoni-iraola-bournemouth-manchester-united-analysis",
    "image": "https://media.guim.co.uk/00cd23620e38ce3373dce42e275f91441c8f413f/232_47_3272_2619/500.jpg",
    "summary": "Bournemouth's smart and adaptable coach is having a standout season, attracting attention from major clubs. His effective strategies are contributing to the team's impressive performance. As a result, several high-profile teams are now monitoring his progress closely.",
    "published": "2025-09-20T20:00:24Z"
  },
  {
    "title": "Coalition denial makes Labor seem reasonable on climate – but neither is ambitious enough | Zoe Daniel",
    "url": "https://www.theguardian.com/commentisfree/2025/sep/21/coalition-denial-makes-labor-seem-reasonable-on-climate-emissions-target-neither-is-ambitious-enough",
    "image": "https://media.guim.co.uk/23814df589a13ff515f7f4e6ffa907040d9c2dc2/859_0_5376_4305/500.jpg",
    "summary": "The Treasury warns that a chaotic energy transition could shrink Australia's economy by $1.2 trillion. Both major political parties currently lack effective policies to address this issue. Urgent action is needed to ensure a smoother transition to sustainable energy.",
    "published": "2025-09-20T20:00:24Z"
  },
  {
    "title": "William Dalrymple: ‘If I ever want to show off to a nephew, I tell them about being shot at’",
    "url": "https://www.theguardian.com/books/2025/sep/21/historian-broadcaster-william-dalrymple-interview-being-shot-at-stunned-by-mick-jagger",
    "image": "https://media.guim.co.uk/64b58923c1da58c35fe870cf8259108f36898848/455_0_5000_4000/500.jpg",
    "summary": "A historian shares his admiration for Mick Jagger, expressing how the rock icon left him speechless. He also reveals his favorite sandwich filling and discusses the seventh-century Indian king he would choose to dine with. The conversation highlights his unique interests and the surprising connections he makes in his life.",
    "published": "2025-09-20T20:00:23Z"
  }
]