[
  {
    "title": "Nigel Farage accused of ‘ripping up’ human rights laws after unveiling plans for mass deportations - UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/aug/26/nigel-farage-mass-deportations-reform-migration-small-boats-uk-politics-live",
    "image": "https://media.guim.co.uk/e8b7a1ed496a920d0d07260b55fee2c2779e3160/135_0_5320_4256/500.jpg",
    "summary": "Nigel Farage has unveiled a plan to deport 600,000 asylum seekers, including women and children, if his party, Reform UK, secures victory in the upcoming election. The policy aims to significantly reduce immigration numbers. Farage's stance has sparked debate about its implications for human rights and public safety.",
    "published": "2025-08-26T13:41:37Z"
  },
  {
    "title": "A vintage year? British growers harvest their grapes early after a dry, hot summer",
    "url": "https://www.theguardian.com/business/2025/aug/26/vintage-british-vineyards-harvest-grapes-dry-hot-summer",
    "image": "https://media.guim.co.uk/7b56b441525fc469f35301308e8d6cefdfdfbabb/1034_0_7240_5792/500.jpg",
    "summary": "Recent weather conditions have enhanced fruit flavors, leading some experts to believe that the fruit is now sufficiently ripe for producing still wine. This development could influence the quality and characteristics of this year's wine production. Winemakers are optimistic about the potential impact on their offerings.",
    "published": "2025-08-26T13:41:28Z"
  },
  {
    "title": "UK retail shares fall amid fears of squeeze in consumer spending",
    "url": "https://www.theguardian.com/business/2025/aug/26/uk-retail-shares-fall-consumer-spending-primark-b-and-q",
    "image": "https://media.guim.co.uk/48ecbe75cba7cba12df065c594e3f4ca7f88894a/644_0_2845_2277/500.jpg",
    "summary": "Analysts have raised concerns that job insecurities and inflation could negatively impact sales for parent companies of Primark and B&Q. The potential for reduced consumer spending may pose challenges for these retailers. Parent groups are urged to strategize to mitigate these risks amid uncertain economic conditions.",
    "published": "2025-08-26T13:41:07Z"
  },
  {
    "title": "UN demands investigations into Gaza hospital killings",
    "url": "https://www.theguardian.com/world/2025/aug/26/un-demands-investigations-into-gaza-hospital-killings",
    "image": "https://media.guim.co.uk/94ad56cafaa98342b279df86a2993220aebd0a7c/560_0_5600_4480/500.jpg",
    "summary": "A second strike occurred at a Gaza hospital as journalists and rescue teams were arriving on the scene. The attack intensified concerns over civilian safety amid ongoing conflict. This incident highlights the dangers faced by both media and rescue workers in war zones.",
    "published": "2025-08-26T13:37:05Z"
  },
  {
    "title": "Hundreds of senior diplomats call for EU to take urgent action over Gaza crisis – Middle East crisis live",
    "url": "https://www.theguardian.com/world/live/2025/aug/26/israel-gaza-protest-hostage-war-hospital-benjamin-netanyahu-latest-live-news-updates",
    "image": "https://media.guim.co.uk/2fd2fbaeced4fb68307e556f9280705f495c3fe2/457_0_4583_3667/500.jpg",
    "summary": "An open letter has been endorsed by 209 former EU ambassadors and senior diplomatic personnel from EU member states. The communication expresses a collective stance on a pressing issue affecting the European Union. This unprecedented support highlights the importance of diplomatic unity and engagement within the EU framework.",
    "published": "2025-08-26T13:36:18Z"
  }
]