[
  {
    "title": "‘She does terrible things’: what can a Marvel director do with Ibsen’s ruthless heroine Hedda Gabler?",
    "url": "https://www.theguardian.com/film/2025/oct/15/marvel-ibsens-hedda-gabler-nia-dacosta-tessa-thompson",
    "image": "https://media.guim.co.uk/d4ca4b6d83c717fce4728eb6880005c8fbe2c728/1125_0_1567_1255/500.jpg",
    "summary": "Nia DaCosta, known for her successful horror reboot and a major Marvel film, is drawn to adapting a grim Norwegian play. The interview features DaCosta and actress Tessa Thompson, who portrays a seductive and cunning version of the character Hedda. Their collaboration highlights the creative choices behind this unique interpretation.",
    "published": "2025-10-15T16:19:26Z"
  },
  {
    "title": "Starmer only read China spy witness statements this morning, No 10 says, as Cleverly accuses PM of misquoting him – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/oct/15/keir-starmer-kemi-badenoch-pmqs-china-epping-rachel-reeves-imf-uk-politics-live-news-updates",
    "image": "https://media.guim.co.uk/a608a7b4df8b74e5e5689af8fcf6ce3ca013b47a/370_350_2283_1826/500.jpg",
    "summary": "The Prime Minister plans to release full statements regarding a specific case and attributes its failure to the previous government's actions. He emphasizes accountability in the situation. The move aims to clarify the circumstances surrounding the case.",
    "published": "2025-10-15T16:19:09Z"
  },
  {
    "title": "Conservative supreme court justices appear skeptical of key provision of Voting Rights Act – live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/15/donald-trump-federal-government-shutdown-redistricting-voting-rights-act-kash-patel-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/27fea511a7ff897118d15cf9f069bf03d3060207/308_0_4276_3420/500.jpg",
    "summary": "Conservative justices have shown sympathy towards the claim that Louisiana's newly drawn congressional maps, which include an additional majority-Black district, may violate the Constitution. The case raises questions about redistricting and racial representation. The justices' stance indicates potential legal challenges ahead for the state's districting plans.",
    "published": "2025-10-15T16:16:44Z"
  },
  {
    "title": "Trump hates this ‘super bad’ photo of him in Time magazine. I almost feel sympathy … almost | Emma Brockes",
    "url": "https://www.theguardian.com/commentisfree/2025/oct/15/donald-trump-photo-time-magazine",
    "image": "https://media.guim.co.uk/806d7ca05697d3b6fa4cd7cc869e7ab801e5a77c/0_0_3000_2400/500.jpg",
    "summary": "Guardian columnist Emma Brockes reflects on the irony of a man who previously ridiculed a disabled reporter now facing misfortune himself. She suggests finding some pleasure in his downfall due to his past behavior. The commentary highlights the complexity of empathy in the context of his past actions.",
    "published": "2025-10-15T16:15:31Z"
  },
  {
    "title": "Key witness statement in China spy row to be published, says Starmer",
    "url": "https://www.theguardian.com/world/2025/oct/15/china-spy-row-key-witness-statement-to-be-published-says-starmer",
    "image": "https://media.guim.co.uk/e7f408d3b9dd35a24abd4f9dfd809cf3bbe6c045/873_419_4742_3794/500.jpg",
    "summary": "The deputy national security adviser made a statement that played a crucial role in the Crown Prosecution Service's decision to drop spying charges against two individuals. This announcement has raised questions about the implications for national security and legal processes. The move highlights the complexities involved in cases related to espionage and national interests.",
    "published": "2025-10-15T16:14:26Z"
  }
]