[
  {
    "title": "Hurricane Melissa death toll rises as storm wreaks destruction across Caribbean – latest updates",
    "url": "https://www.theguardian.com/world/live/2025/oct/29/hurricane-melissa-live-updates-strengthens-cuba-extensive-damage-parts-of-jamaica",
    "image": "https://media.guim.co.uk/556fba4f8b291c7c54388fc5d148ebad70038534/403_0_3613_2891/500.jpg",
    "summary": "Four people have been confirmed dead in Jamaica, while dozens have lost their lives in Haiti due to severe weather conditions. A hurricane warning has been issued for regions, including Bermuda, as the storm approaches. Authorities are monitoring the situation and advising residents to prepare for potential impacts.",
    "published": "2025-10-29T23:18:00Z"
  },
  {
    "title": "Australia politics live: Senate showdown looms after Watt labels Pocock revolt against government secrecy a ‘dummy spit’",
    "url": "https://www.theguardian.com/australia-news/live/2025/oct/30/anthony-albanese-donald-trump-meeting-murray-watt-epbc-nature-laws-press-club-parliament-labor-coalition-sussan-ley-ntwnfb",
    "image": "https://media.guim.co.uk/2f37935265ed175ececa642737691624079d28a0/887_0_6631_5305/500.jpg",
    "summary": "I'm sorry, but I need specific details or the content of the news you're referring to in order to summarize it. Please provide the information you'd like summarized!",
    "published": "2025-10-29T23:17:29Z"
  },
  {
    "title": "US woman who ‘rescued’ four chickens found guilty of trespassing and conspiracy ",
    "url": "https://www.theguardian.com/us-news/2025/oct/29/zoe-rosenberg-chickens-california-guilty",
    "image": "https://media.guim.co.uk/5508a601bc1fa6ce3157538d3df8d0112ebd6af3/651_0_5227_4183/500.jpg",
    "summary": "Zoe Rosenberg, a 23-year-old from the San Francisco Bay Area, has admitted to taking animals, claiming her actions were motivated by a desire to rescue them from cruelty. The situation raises questions about the legality and ethics of her methods. Authorities are likely to assess her actions to determine the appropriate response.",
    "published": "2025-10-29T23:08:17Z"
  },
  {
    "title": "Landry says LSU athletics director won’t pick next football coach after $95m fiasco",
    "url": "https://www.theguardian.com/sport/2025/oct/29/jeff-landry-lsu-football-coach-brian-kelly-scott-woodward",
    "image": "https://media.guim.co.uk/2dcae90e08089e7f5f3bc582f0193bbd99dee629/1000_0_5000_4000/500.jpg",
    "summary": "Louisiana Governor Jeff Landry has pledged to prevent LSU Athletic Director Scott Woodward from hiring the next head coach. This statement follows the breakdown of Brian Kelly’s significant $95 million contract. The conflict highlights tensions surrounding the university's coaching decisions.",
    "published": "2025-10-29T23:01:46Z"
  },
  {
    "title": "Microsoft reports strong earnings even as Azure outage brings down Xbox and investor pages",
    "url": "https://www.theguardian.com/technology/2025/oct/29/microsoft-earnings-azure-outage-xbox",
    "image": "https://media.guim.co.uk/23963cf959193d8c0ac3d46f25923b5c19bc7f6d/0_244_3476_2780/500.jpg",
    "summary": "The tech giant reported earnings of $3.72 per share, showcasing strong financial performance. This announcement follows a significant deal with OpenAI that elevated the company's market value to over $4 trillion. The impressive earnings and partnership highlight the company's continued growth and innovation in the tech sector.",
    "published": "2025-10-29T22:56:03Z"
  }
]