[
  {
    "title": "Arteta warns that clubs could pull out of cups amid fixture congestion: football news – live",
    "url": "https://www.theguardian.com/football/live/2025/oct/31/weekend-team-news-and-previews-football-live",
    "image": "https://media.guim.co.uk/37eda24d18a567a671c31eb159ff2f2f449dbbd6/0_0_6313_5051/500.jpg",
    "summary": "Join our writers for updates and insights as the weekend's football matches approach. Stay informed about key events and player news. Don't miss out on the latest in football!",
    "published": "2025-10-31T14:15:46Z"
  },
  {
    "title": "Trump calls for Senate to scrap filibuster as Johnson again refuses to bring back the House during shutdown – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/31/donald-trump-filibuster-shutdown-snap-food-refugees-drug-boats-latest-news-updates",
    "image": "https://media.guim.co.uk/e4fa98b006ecd4a9554d3cae08825d75d3582b91/915_0_4585_3669/500.jpg",
    "summary": "Snap food benefits will expire this weekend as the government shutdown approaches a duration similar to the record set during 2018-2019. This could impact millions of individuals and families reliant on these benefits for food assistance. The ongoing shutdown raises concerns about food security and support for vulnerable populations.",
    "published": "2025-10-31T14:14:49Z"
  },
  {
    "title": "Letter: Prunella Scales obituary",
    "url": "https://www.theguardian.com/stage/2025/oct/31/letter-prunella-scales-obituary",
    "image": "https://media.guim.co.uk/45897eeeefbd1fdd0559ec4cd7703e33feaff661/266_442_2950_2359/500.jpg",
    "summary": "Quentin Falk reflects on the impact of an actress cast by David Lean in his 1954 film \"Hobson's Choice.\" The role marked a significant early achievement in her career. Her performance left a lasting impression on audiences.",
    "published": "2025-10-31T14:14:11Z"
  },
  {
    "title": "Rob Jetten celebrates ‘historic result’ as his centrist D66 party is projected to win Dutch election – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/oct/31/ukraine-russian-attacks-secret-missile-netherlands-dutch-elections-europe-live-latest-news-updates",
    "image": "https://media.guim.co.uk/ebe8712db16dec7828a10f8ea3a8903a004af11f/375_0_3003_2403/500.jpg",
    "summary": "Preliminary analysis by the Netherlands news agency ANP indicates that D66 is poised to maintain a significant lead over Geert Wilders' far-right PVV in the upcoming election. Final results have not been confirmed yet. The D66's position appears to be strong and likely unassailable.",
    "published": "2025-10-31T14:13:36Z"
  },
  {
    "title": "Worries about immigration are ‘manufactured panic’ says charity as poll shows issue not a local concern – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/oct/31/uk-politics-prince-andrew-latest-news-updates-labour-conservatives-keir-starmer-rachel-reeves",
    "image": "https://media.guim.co.uk/abe5bd8a7bcdd3079bc7bd44272705d3e30e7a88/818_0_4565_3652/500.jpg",
    "summary": "A YouGov poll reveals that only 26% of respondents view immigration as a local issue, while over half consider it a significant national concern. This indicates a disconnect between local and national perceptions of immigration. The findings highlight differing priorities and concerns among the population regarding immigration policy.",
    "published": "2025-10-31T14:08:32Z"
  }
]