[
  {
    "title": "WTA Finals tennis: Aryna Sabalenka v Coco Gauff; Pegula breezes past Paolini – live",
    "url": "https://www.theguardian.com/sport/live/2025/nov/06/wta-finals-tennis-aryna-sabalenka-v-coco-gauff-jessica-pegula-v-jasmine-paolini-live",
    "image": "https://media.guim.co.uk/31436f6e209eb03229ba54f1838954ee22e2f335/767_0_8160_6528/500.jpg",
    "summary": "World No. 3 Coco Gauff is set to face off against world No. 1 Aryna Sabalenka in the WTA Finals on Thursday. The match follows Jessica Pegula's matchup against Jasmine Paolini. This high-stakes encounter highlights the competitive field in women's tennis.",
    "published": "2025-11-06T16:27:13Z"
  },
  {
    "title": "Britain’s two-party politics is fragmenting: what unintended consequences await? | Andy Beckett",
    "url": "https://www.theguardian.com/commentisfree/2025/nov/06/britain-two-party-politics-unintended-consequences",
    "image": "https://media.guim.co.uk/96d3de68a5392bae101d1ab78f621331cb73e574/168_0_2437_1949/500.jpg",
    "summary": "Guardian columnist Andy Beckett discusses the implications of eliminating safe seats and long political careers, suggesting this could reduce complacency among politicians. However, he warns that the absence of large political parties might lead to increased corporate influence in politics. The balance between these outcomes presents a complex challenge for the political landscape.",
    "published": "2025-11-06T16:22:33Z"
  },
  {
    "title": "German police detain man suspected of painting swastikas on cars and walls with his own blood – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/nov/06/europe-latest-live-news-updates-belgium-drones",
    "image": "https://media.guim.co.uk/de294d92b5e8fa63e49b641f1ce8153b38818ebd/438_0_3988_3190/500.jpg",
    "summary": "In Germany, the public display of Nazi symbols, including swastikas, is prohibited by law. This legislation aims to combat hate speech and uphold the country's commitment to remembering and learning from its history. Violating this ban can result in legal consequences.",
    "published": "2025-11-06T16:21:19Z"
  },
  {
    "title": "US House panel requests interview with Andrew in Jeffrey Epstein investigation",
    "url": "https://www.theguardian.com/us-news/2025/nov/06/epstein-andrew-interview-house-oversight-committee",
    "image": "https://media.guim.co.uk/8cecbc77c719778e1ce8191d66e7ae7fb84465ec/534_0_4920_3937/500.jpg",
    "summary": "Robert Garcia, the leading Democrat on the House oversight panel, has officially requested action in a letter that was made public on Thursday. The details of the request have not been specified in the summary. This move highlights ongoing legislative efforts or inquiries within the House.",
    "published": "2025-11-06T16:18:19Z"
  },
  {
    "title": "Nancy Pelosi, former House speaker, says she will not seek re-election to Congress – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/nov/06/donald-trump-government-shutdown-venezuela-senate-vote-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/9305a5fb4cacc6e0ced5395b6e23371ab27f961d/262_0_1611_1289/500.jpg",
    "summary": "Nancy Pelosi, the representative for San Francisco, has announced that she will step down from her position in 2027. This decision marks a significant milestone in her political career. Pelosi's leadership has shaped key legislative priorities over the years.",
    "published": "2025-11-06T16:16:19Z"
  }
]