[
  {
    "title": "Cambridgeshire train stabbing: suspects both British and ‘nothing to suggest’ attack was terrorism, say police – latest updates",
    "url": "https://www.theguardian.com/uk-news/live/2025/nov/02/cambridgeshire-train-stabbing-life-threatening-injuries-arrests-latest-updates",
    "image": "https://media.guim.co.uk/c64113b57144b27bf5bd5799829b195ed0b3600b/0_0_3471_2777/500.jpg",
    "summary": "Two men have been arrested for suspected attempted murder following a violent incident. Two victims are critically injured and remain in life-threatening condition. The investigation is ongoing as authorities seek further details.",
    "published": "2025-11-02T13:22:35Z"
  },
  {
    "title": "Celtic v Rangers: Scottish League Cup semi-final – live",
    "url": "https://www.theguardian.com/football/live/2025/nov/02/celtic-v-rangers-scottish-league-cup-semi-final-live",
    "image": "https://media.guim.co.uk/56d3e06f56564b6a1f76e9d225cfd84e3e23af4b/543_235_4656_3725/500.jpg",
    "summary": "In a real-time report, Billy Munday covers the tense encounter between the struggling Old Firm teams as they compete for a spot in the final. Fans can follow the unfolding drama and key moments of the match. The focus is on which team will overcome their challenges and advance.",
    "published": "2025-11-02T13:21:45Z"
  },
  {
    "title": "West Ham v Newcastle: Premier League – live",
    "url": "https://www.theguardian.com/football/live/2025/nov/02/west-ham-v-newcastle-premier-league-live-updates",
    "image": "https://media.guim.co.uk/1d5a10c87d57ad3eb5825c7368eba5c7127873a8/826_0_6880_5504/500.jpg",
    "summary": "West Ham faces Newcastle in a crucial match as they look to improve their poor form. John Brewin provides real-time updates on the game. Fans eagerly anticipate how the Hammers will perform at home.",
    "published": "2025-11-02T13:21:07Z"
  },
  {
    "title": "India v South Africa: Women’s Cricket World Cup final – live",
    "url": "https://www.theguardian.com/sport/live/2025/nov/02/india-v-south-africa-womens-cricket-world-cup-final-live",
    "image": "https://media.guim.co.uk/835313a1cb12aa627d55046e87bb12a015d1c1d4/1198_333_2325_1861/500.jpg",
    "summary": "An over-by-over report is being provided on the match taking place in Navi Mumbai, with a focus on predicting which team will win the trophy. The writers are offering live updates and insights throughout the game. Stay tuned for their analysis and commentary as the match unfolds.",
    "published": "2025-11-02T13:20:14Z"
  },
  {
    "title": "Leicester v Arsenal, Brighton v Manchester United, and more: WSL – live",
    "url": "https://www.theguardian.com/football/live/2025/nov/02/leicester-v-arsenal-brighton-v-manchester-united-and-more-wsl-live",
    "image": "https://media.guim.co.uk/9f948bc69fccda0bee661fac62360ae80c2170cc/293_0_2829_2263/500.jpg",
    "summary": "Arsenal aims to narrow the gap to the top of the league as they compete in their latest match. Yara El-Shaboury provides updates on the ongoing action from various grounds. Fans are eager to see if Arsenal can capitalize on this opportunity to strengthen their position.",
    "published": "2025-11-02T13:20:09Z"
  }
]