[
  {
    "title": "Nottingham Forest v Midtjylland, Feyenoord v Aston Villa, and more: Europa League – live",
    "url": "https://www.theguardian.com/football/live/2025/oct/02/nottingham-forest-v-midtjylland-feyenoord-v-aston-villa-and-more-europa-league-live",
    "image": "https://media.guim.co.uk/26c4f4ab3325303d1ba0e3c0756e36de406fa929/138_136_3061_2449/500.jpg",
    "summary": "Niall McVeigh will provide updates on Thursday's matches featuring Aston Villa, Nottingham Forest, Celtic, and Rangers. Stay tuned for live coverage and key moments from the games. Don’t miss the latest developments in these exciting matchups!",
    "published": "2025-10-02T20:19:30Z"
  },
  {
    "title": "US government shutdown: federal layoffs ‘likely to be in the thousands’, says White House – live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/02/government-shutdown-trump-democrats-latest-updates",
    "image": "https://media.guim.co.uk/67f0cf364ead08501750764e4c7d8c49cf1252d5/200_0_6588_5271/500.jpg",
    "summary": "Karoline Leavitt criticizes Democrats for potential job losses, claiming their policies may lead to significant furloughs. She asserts that the Trump administration anticipates thousands of workers will be affected. Leavitt emphasizes the need for accountability regarding the implications of current political decisions on employment.",
    "published": "2025-10-02T20:18:01Z"
  },
  {
    "title": "Manchester synagogue attack suspect named by police – latest updates",
    "url": "https://www.theguardian.com/uk-news/live/2025/oct/02/police-reports-stabbing-synagogue-greater-manchester-live",
    "image": "https://media.guim.co.uk/09f20100fbf2630c0e0352f448c48247471f5999/386_0_3289_2632/500.jpg",
    "summary": "Greater Manchester police have identified Jihad Al-Shamie, a 35-year-old British citizen, in connection with a terrorism investigation. Three individuals have been arrested and are facing charges related to preparing acts of terrorism. Authorities continue to investigate the matter.",
    "published": "2025-10-02T20:16:59Z"
  },
  {
    "title": "Sarah Hall and Charlie Porter among writers on ‘genre-defying’ Goldsmiths prize shortlist",
    "url": "https://www.theguardian.com/books/2025/oct/02/sarah-hall-and-charlie-porter-writers-goldsmiths-prize-shortlist",
    "image": "https://media.guim.co.uk/397b500d4272b1e4fe9394d4dd2225a3e2a918e7/1024_94_4145_3316/500.jpg",
    "summary": "A £10,000 award has been launched to honor innovative fiction, with judges including notable authors Mark Haddon and Megan Nolan. The award aims to celebrate works that push literary boundaries. Submissions are now open for writers creating \"mould-breaking\" narratives.",
    "published": "2025-10-02T20:15:14Z"
  },
  {
    "title": "Corrections and clarifications",
    "url": "https://www.theguardian.com/news/2025/oct/02/corrections-and-clarifications",
    "summary": "Dale Vince, an entrepreneur known for his work in renewable energy, is advocating for government support through Contracts for Difference (CfDs) to boost green energy initiatives. He emphasizes that such contracts can provide financial stability and encourage investment in sustainable projects. Vince's push aims to accelerate the transition to a low-carbon economy.",
    "published": "2025-10-02T20:00:13Z"
  }
]