[
  {
    "title": "Reform branded ‘threat to democracy’ over Farage plan to remove thousands of migrants with leave to be in UK – politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/22/reform-labour-keir-starmer-nigel-farage-immigration-latest-uk-politics-updates",
    "image": "https://media.guim.co.uk/cb6480b92e020a06bd2a4baec6b416ebe942839b/884_0_4549_3640/500.jpg",
    "summary": "Nigel Farage announced that Reform UK aims to eliminate the primary pathway for migrants to obtain British citizenship. This move is part of the party's broader immigration policy. Farage's statement reflects ongoing discussions about immigration reform in the UK.",
    "published": "2025-09-22T08:47:12Z"
  },
  {
    "title": "European officials warn Israel not to annex parts of West Bank in response to recognition of Palestinian state – Middle East crisis live",
    "url": "https://www.theguardian.com/world/live/2025/sep/22/palestinian-state-gaza-israel-middle-east-hamas-benjamin-netanyahu-latest-live-updates",
    "image": "https://media.guim.co.uk/1c0672a7b0933d95884d80f89d0fadb88553a74f/293_0_4583_3667/500.jpg",
    "summary": "The UK, Australia, Canada, and Portugal officially recognized Palestinian statehood on Sunday. France is also expected to follow suit shortly. This move marks a significant step in international support for Palestinian sovereignty.",
    "published": "2025-09-22T08:45:33Z"
  },
  {
    "title": "UN security council to meet to discuss growing concerns over Russian provocations in eastern Europe – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/sep/22/latest-europe-news-russia-estonia-un-united-nations-security-live-latest-updates",
    "image": "https://media.guim.co.uk/bede7b5fb8e9922b7fab81bfbbbb8ccb5436a9e4/443_198_1619_1295/500.jpg",
    "summary": "Officials have issued warnings of a potential serious conflict if Russia continues its provocative actions by breaching NATO airspace in Europe. Such violations raise tensions and could lead to unintended escalation between Russia and NATO forces. The situation remains critical as diplomatic efforts are needed to prevent further provocations.",
    "published": "2025-09-22T08:38:12Z"
  },
  {
    "title": "Reeves says Gatwick second runway will boost UK; Trump’s $100,000 H-1B fee ‘will hurt US growth’ – business live",
    "url": "https://www.theguardian.com/business/live/2025/sep/22/rachel-reeves-gatwick-second-runway-growth-jobs-environmental-disaster-business-live-news",
    "image": "https://media.guim.co.uk/98d32f79f771396c5070d1197b355c9d7ee69fd2/421_0_4448_3558/500.jpg",
    "summary": "Green Party's Zack Polanski has criticized the approval of a second runway at Gatwick Airport, calling it \"a disaster.\" The news highlights ongoing debates surrounding economic development and environmental concerns related to airport expansion. The coverage continues to track the impact of this decision on financial and ecological fronts.",
    "published": "2025-09-22T08:33:08Z"
  },
  {
    "title": "Flight delays continue across Europe after weekend cyber-attack",
    "url": "https://www.theguardian.com/world/2025/sep/22/flight-delays-europe-cyber-attack-heathrow-brussels-berlin",
    "image": "https://media.guim.co.uk/667eb3aa5935cdc4ed0a81043c231cb8b530d0ac/325_0_3361_2688/500.jpg",
    "summary": "Collins Aerospace is finalizing updates to its software after significant issues at major airports, including Heathrow, Brussels, and Berlin. These problems caused disruptions and delays in airport operations. The company is working to ensure system stability and improve overall performance.",
    "published": "2025-09-22T08:03:11Z"
  }
]