[
  {
    "title": "Pam Bondi spars with Democratic senator over Epstein ‘client list’ and national guard deployments in tense hearing – live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/07/donald-trump-national-guard-pam-bondi-mark-carney-government-shutdown-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/de6426e93a01b83337d36da9b73f1b82c59486bd/447_0_4583_3667/500.jpg",
    "summary": "Illinois Senator Dick Durbin questioned former Attorney General Pam Bondi about the investigation into Jeffrey Epstein. During the exchange, Bondi mentioned that the \"national guard is on the way\" to address issues in Chicago. The discussion highlights ongoing concerns about law enforcement and safety in the city.",
    "published": "2025-10-07T16:22:20Z"
  },
  {
    "title": "Israel marks two years since 7 October Hamas attack as Gaza ceasefire talks continue – live",
    "url": "https://www.theguardian.com/world/live/2025/oct/07/gaza-ceasefire-peace-talks-israel-hamas-egypt-7-october-anniversary-middle-east-crisis-live-news-updates",
    "image": "https://media.guim.co.uk/88f96cf76ce349adfdc52cdcd4d2cb2f1eb2e7e4/1108_250_6296_5037/500.jpg",
    "summary": "Israelis commemorated the second anniversary of the Hamas-led attack that resulted in the deaths of 1,200 people. The event included memorials and reflections on the impact of the tragedy. The anniversary serves as a poignant reminder of the ongoing conflict and its human toll.",
    "published": "2025-10-07T16:22:07Z"
  },
  {
    "title": "England edge past Bangladesh by four wickets: Women’s Cricket World Cup – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/07/england-v-bangladesh-womens-cricket-world-cup-live",
    "image": "https://media.guim.co.uk/387edd06c5286392adcdefd25a1360dfb2e72589/21_0_3594_2875/500.jpg",
    "summary": "Heather Knight's performance was crucial in helping England fend off a significant upset during the Cricket World Cup. The team's resilience was highlighted in an over-by-over report of the match. Join our writers for further insights and reactions to the game.",
    "published": "2025-10-07T16:19:11Z"
  },
  {
    "title": "England’s golden generation were egotistical losers, says Steven Gerrard",
    "url": "https://www.theguardian.com/football/2025/oct/07/steven-gerrard-england-golden-generation-egotistical-losers",
    "image": "https://media.guim.co.uk/d5aa5e7f4e8c7722aa8a3071c786fdcc22b816d4/329_59_2710_2169/500.jpg",
    "summary": "Steven Gerrard criticized the 'golden generation' of England footballers, including himself, for not winning titles, attributing their lack of success to being \"egotistical losers.\" He stated that individual egos hindered the team's collective performance. Gerrard's comments reflect on the team's potential that ultimately went unfulfilled.",
    "published": "2025-10-07T16:18:13Z"
  },
  {
    "title": "Up to 14m car loan scandal victims in line for average £700 payout, City regulator announces",
    "url": "https://www.theguardian.com/business/2025/oct/07/uk-car-loan-scandal-victims-in-line-for-payout-fca",
    "image": "https://media.guim.co.uk/5771d31988821aa876fea697284fc323ec82892a/804_40_2736_2190/500.jpg",
    "summary": "The city regulator has launched a compensation scheme for motorists who purchased cars through discretionary commission arrangements between 2007 and 2024. This initiative aims to address potential unfair practices in car sales. Affected motorists can apply for compensation as part of the scheme.",
    "published": "2025-10-07T16:17:03Z"
  }
]