[
  {
    "title": "England v South Africa: Women’s Cricket World Cup semi-final – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/29/england-v-south-africa-womens-cricket-world-cup-semi-final-live",
    "image": "https://media.guim.co.uk/185c8030614b4199a18c2cc4110c139778c18c7d/355_74_3097_2478/500.jpg",
    "summary": "England and South Africa face off in a crucial match for a spot in the Women's Cricket World Cup final in India. The game features real-time commentary and analysis by journalists covering the event. Fans are eagerly following the action as both teams aim for victory.",
    "published": "2025-10-29T10:19:49Z"
  },
  {
    "title": "Australia v India: first men’s Twenty20 international – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/29/australia-v-india-t20-live-twenty20-international-cricket-aus-vs-ind-latest",
    "image": "https://media.guim.co.uk/a6c780d4a99a76eae7be1a923ca18b3b63769339/280_25_3451_2761/500.jpg",
    "summary": "The five-match T20 series begins in Canberra with the tourists batting first. Martin Pegan will provide updates throughout the match. Follow for live commentary and insights on the game.",
    "published": "2025-10-29T10:19:05Z"
  },
  {
    "title": "Attorney general says, if spy case had gone to trial, Badenoch saying China not a foe would have helped accused get off – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/oct/29/shabana-mahmood-home-office-immigration-pmqs-labour-keir-starmer-kemi-badenoch-conservatives-uk-politics-live-news",
    "image": "https://media.guim.co.uk/ea4a8f2f2daaccf03fbd1dec02fe410e7923bcc8/397_68_2057_1646/500.jpg",
    "summary": "Lord Hermer testified before a joint committee on national security strategy regarding the ongoing China spy case. He highlighted potential security risks and the implications for national defense. The session aimed to address concerns over espionage activities linked to China.",
    "published": "2025-10-29T10:18:29Z"
  },
  {
    "title": "Hurricane Melissa live updates: hundreds of thousands evacuated as Cuba faces 120mph winds; disaster area declared in Jamaica",
    "url": "https://www.theguardian.com/world/live/2025/oct/29/hurricane-melissa-live-updates-strengthens-cuba-extensive-damage-parts-of-jamaica",
    "image": "https://media.guim.co.uk/57ba5cc648a4a4e51519f3324300dc031e3a9795/432_0_5417_4333/500.jpg",
    "summary": "A powerful storm has struck Cuba, prompting urgent warnings about life-threatening flooding in the region. Meanwhile, Jamaica has already experienced significant damage as the storm's destructive path moved across the island. Authorities are urging residents to take precautions and prepare for severe weather conditions.",
    "published": "2025-10-29T10:16:26Z"
  },
  {
    "title": "Pitch Points: Are long throws changing soccer, and is Liverpool’s title defence over? ",
    "url": "https://www.theguardian.com/football/2025/oct/29/pitch-points-long-throws-liverpool-premier-league-hearts-celtic-scottish-premiership",
    "image": "https://media.guim.co.uk/b57a713a62dbb257f448b608f0fb1cef8bebe30a/359_0_3569_2854/500.jpg",
    "summary": "In a recent column, Graham Ruthven addresses pressing questions in the world of soccer. He shares insights and analyses on various topics affecting the sport. This discussion highlights ongoing trends and issues within soccer today.",
    "published": "2025-10-29T10:00:55Z"
  }
]