[
  {
    "title": "Australia news live: AEC told of harassment at 2025 election; power cut forces Victorian triple-zero operators to use pen and paper",
    "url": "https://www.theguardian.com/australia-news/live/2025/oct/15/australia-news-live-liberals-infighting-james-paterson-sussan-ley-andrew-hastie-superannuation-jim-chalmers-ntwnfb",
    "image": "https://media.guim.co.uk/cc1c875993cba3743cb029d5ae380e3005333d8d/456_0_4560_3648/500.jpg",
    "summary": "I'm sorry, but I cannot summarize without specific details about the news article or topic you want me to summarize. Please provide more information!",
    "published": "2025-10-14T23:17:13Z"
  },
  {
    "title": "US revokes visas from six foreign nationals for social media comments critical of Charlie Kirk – live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/14/donald-trump-government-shutdown-national-guard-javier-milei-charlie-kirk-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/b77efdf1af9a6bc9ba018e1f93014bc8b290d25c/355_0_3968_3174/500.jpg",
    "summary": "The Trump administration's latest decision represents a dramatic shift from its initial promise to combat social media censorship. This change highlights a significant reversal in their approach to online content regulation. Critics see it as a contradiction to their previous stance on free speech.",
    "published": "2025-10-14T23:01:39Z"
  },
  {
    "title": "Bog Witch review – Bryony Kimmings is back with a haunting and hilarious climate reckoning",
    "url": "https://www.theguardian.com/stage/2025/oct/15/bog-witch-review-bryony-kimmings-climate-soho-theatre-walthamstow",
    "image": "https://media.guim.co.uk/95c70a5d4996271c29eeb168ef2dba8ff63321a8/408_0_3775_3019/500.jpg",
    "summary": "The performance artist's first solo show in five years explores environmental issues through a dynamic blend of stand-up comedy, music, and folk horror elements. The work highlights the challenges facing our planet while engaging audiences in a thought-provoking manner. This innovative performance showcases the artist's unique approach to addressing pressing global concerns.",
    "published": "2025-10-14T23:01:07Z"
  },
  {
    "title": "Chicago ‘Splatatouille’ was probably a squirrel, say researchers",
    "url": "https://www.theguardian.com/world/2025/oct/15/chicago-rat-hole-probably-squirrel-say-researchers",
    "image": "https://media.guim.co.uk/8a1128912053f16c63972437a803149eda01b11a/500_0_2500_2000/500.jpg",
    "summary": "Researchers at the University of Tennessee, Knoxville, are investigating 37 species to determine the cause of mysterious 'rat holes' appearing in pavement. Their study aims to understand the ecological impact and underlying factors contributing to this phenomenon. The findings could have implications for urban infrastructure and wildlife interactions.",
    "published": "2025-10-14T23:01:06Z"
  },
  {
    "title": "Cryptic crossword No 29,826",
    "url": "https://www.theguardian.com/crosswords/cryptic/29826",
    "summary": "I do not have access to the content of specific crossword puzzles, including Cryptic crossword No 29,826. However, I can help with tips on solving cryptic crosswords or discuss their common themes and clues if you'd like!",
    "published": "2025-10-14T23:00:06Z"
  }
]