[
  {
    "title": "Folarin Balogun scores again and US improvement continues in 1-1 draw with Ecuador",
    "url": "https://www.theguardian.com/football/2025/oct/10/usmnt-ecuador-folarin-balogun-mauricio-pochettino",
    "image": "https://media.guim.co.uk/6244b4020e501517357acf26dca28720c6481eff/405_0_3333_2667/500.jpg",
    "summary": "US results have not consistently reflected underlying performances, but recent developments suggest a growing sense of hope. Factors contributing to this optimism include improving conditions and potential for better outcomes. Analysts are beginning to see signs that progress may be on the horizon.",
    "published": "2025-10-11T03:13:10Z"
  },
  {
    "title": "Unease at slow pace of change in Nepal one month on from gen Z protests",
    "url": "https://www.theguardian.com/world/2025/oct/11/nepal-gen-z-protests-one-month-on-slow-change",
    "image": "https://media.guim.co.uk/2924f08f0c7cd571f34519bbfb86c37d15cfea4f/914_0_4548_3640/500.jpg",
    "summary": "Many are frustrated with the slow pace of the promised crackdown on corruption, following the swift toppling of the government after just one day of protests. Advocates for change expected quicker action in response to public demands. The delay is raising concerns over the government's commitment to reform.",
    "published": "2025-10-11T03:00:11Z"
  },
  {
    "title": "Three people dead after light plane crashes on take-off near Wollongong",
    "url": "https://www.theguardian.com/australia-news/2025/oct/11/three-people-dead-after-light-plane-crashes-on-take-off-near-wollongong",
    "image": "https://media.guim.co.uk/052754f211716fa6517d8c98812256d468820772/0_0_2447_1957/500.jpg",
    "summary": "An aircraft caught fire shortly after taking off from Shellharbour Airport around 10 a.m. on Saturday. Emergency services responded to the incident, and there were no reported injuries. The cause of the fire is under investigation.",
    "published": "2025-10-11T02:57:39Z"
  },
  {
    "title": " Rampant Las Vegas Aces complete sweep of Mercury to win third WNBA in four years",
    "url": "https://www.theguardian.com/sport/2025/oct/10/aces-win-third-wnba-title-sweep-phoenix-mercury",
    "image": "https://media.guim.co.uk/b5729f89980e942ca08e4e805208974a5f913a37/284_0_2825_2261/500.jpg",
    "summary": "A'ja Wilson led the Las Vegas Aces with 31 points in a 97–86 victory over the Phoenix Mercury. This win secured the Aces their third championship in four years. The victory completed a four-game sweep in the series.",
    "published": "2025-10-11T02:41:22Z"
  },
  {
    "title": "The Shiralee review – love grows in the harshest place in bountiful adaptation of outback epic",
    "url": "https://www.theguardian.com/stage/2025/oct/11/the-shiralee-love-grows-in-the-harshest-place-in-bountiful-adaption-of-outback-epic",
    "image": "https://media.guim.co.uk/3f1f0b60cbc8bdef41ef3f7c46ceb37d0a74efc7/59_0_1600_1280/500.jpg",
    "summary": "The Sydney Opera House presents a production inspired by D’Arcy Niland's classic novel, exploring the expansive journey of a swagman and his daughter. This adaptation aims to capture the depth and emotional resonance of their story. The performance promises to engage audiences with its rich narrative and creative interpretation.",
    "published": "2025-10-11T02:40:38Z"
  }
]