[
  {
    "title": "USA 2-1 Australia: men’s international football friendly – live updates",
    "url": "https://www.theguardian.com/football/live/2025/oct/15/usa-v-australia-mens-international-football-friendly-live-updates",
    "image": "https://media.guim.co.uk/266e978ba8897c89c4d069e0e132df6e088aad15/913_0_4565_3652/500.jpg",
    "summary": "The US men’s national soccer team is playing a friendly match against Australia in Commerce City, Colorado. Coverage and updates of the game are provided by Alexander Abnos. Fans can follow along for live action and insights.",
    "published": "2025-10-15T03:03:44Z"
  },
  {
    "title": "News live: Australian parents having children at a later age as nation’s fertility rate falls further, ABS finds",
    "url": "https://www.theguardian.com/australia-news/live/2025/oct/15/australia-news-live-liberals-infighting-james-paterson-sussan-ley-andrew-hastie-superannuation-jim-chalmers-ntwnfb",
    "image": "https://media.guim.co.uk/d4f8c86416398a565d8a55f1d5d0ee5055a04b42/1120_0_5600_4480/500.jpg",
    "summary": "Sure! However, I need more information or context about the news you'd like me to summarize. Please provide the details or the article you'd like me to summarize in three lines.",
    "published": "2025-10-15T03:02:29Z"
  },
  {
    "title": "US revokes visas from six foreign nationals for social media comments critical of Charlie Kirk – as it happened",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/14/donald-trump-government-shutdown-national-guard-javier-milei-charlie-kirk-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/b77efdf1af9a6bc9ba018e1f93014bc8b290d25c/355_0_3968_3174/500.jpg",
    "summary": "The Trump administration's recent decision signifies a notable shift from its initial commitment to combat social media censorship. This change raises questions about its priorities and approach to online platforms. The move contrasts sharply with the administration's earlier stance on free expression in digital spaces.",
    "published": "2025-10-15T02:00:30Z"
  },
  {
    "title": "Xi directs quashing of Chinese feminists even as he praises advances at women’s conference",
    "url": "https://www.theguardian.com/world/2025/oct/15/xi-directs-quashing-of-chinese-feminists-even-as-he-praises-advances-at-womens-conference",
    "image": "https://media.guim.co.uk/7bb66f0e5eddce4ee23d7c96086831a0a42ca2f0/309_0_1841_1473/500.jpg",
    "summary": "Chinese President Xi Jinping is driving a shift towards patriarchal politics in China, leading to increased suppression of activists advocating for gender equality. Authorities are silencing voices that they accuse of fostering \"gender antagonism.\" This crackdown reflects a broader trend of tightening control over social movements and discourse in the country.",
    "published": "2025-10-15T02:00:10Z"
  },
  {
    "title": "Candace Owens: Australia’s high court backs government decision to deny visa to US rightwinger",
    "url": "https://www.theguardian.com/australia-news/2025/oct/15/candace-owens-australia-visa-high-court-backs-government-decision-deny",
    "image": "https://media.guim.co.uk/d540bbb0f70e779366b49ccb42a5ab6f13de0c89/348_0_3480_2784/500.jpg",
    "summary": "A court has upheld the home affairs minister's 2024 decision to deny a visa application for a planned speaking tour. The rejection was based on character concerns regarding the applicant. This ruling reinforces the government's authority in immigration matters related to public safety.",
    "published": "2025-10-15T01:23:20Z"
  }
]