[
  {
    "title": "Hurricane Melissa live updates: hundreds of thousands evacuated to shelters as 120mph winds hit Cuba; extensive damage in Jamaica",
    "url": "https://www.theguardian.com/world/live/2025/oct/29/hurricane-melissa-live-updates-strengthens-cuba-extensive-damage-parts-of-jamaica",
    "image": "https://media.guim.co.uk/57ba5cc648a4a4e51519f3324300dc031e3a9795/432_0_5417_4333/500.jpg",
    "summary": "A severe storm has caused destruction in Jamaica and is now threatening life-threatening flooding in Cuba. Authorities are issuing warnings as heavy rains and strong winds approach. Emergency measures are being implemented to protect residents and mitigate impacts.",
    "published": "2025-10-29T08:27:10Z"
  },
  {
    "title": "Israeli strikes in Gaza kill at least 60 overnight as ceasefire looks increasingly fragile",
    "url": "https://www.theguardian.com/world/2025/oct/29/israeli-strikes-in-gaza-overnight-as-ceasefire-looks-increasingly-fragile",
    "image": "https://media.guim.co.uk/82eee537244bbeab533e492cfa300f83f0da01cd/560_0_5600_4480/500.jpg",
    "summary": "Israeli Prime Minister Netanyahu authorized airstrikes following a clash between Israeli forces and Palestinian militants on Tuesday evening. This escalation comes amid ongoing tensions in the region. The strikes represent a continuation of the conflict between Israel and Palestinian groups.",
    "published": "2025-10-29T08:26:10Z"
  },
  {
    "title": "Australia v India: first men’s Twenty20 international – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/29/australia-v-india-t20-live-twenty20-international-cricket-aus-vs-ind-latest",
    "image": "https://media.guim.co.uk/7d1d2d830374f13ccbb372450712f8d42427c203/887_0_4583_3667/500.jpg",
    "summary": "The five-match T20 series begins in Canberra, with Martin Pegan providing live updates. Fans can expect detailed over-by-over reports as the action unfolds. Follow along for all the exciting moments of the series opener.",
    "published": "2025-10-29T08:25:54Z"
  },
  {
    "title": " Trump says he will cut fentanyl tariff on Chinese goods and expects ‘good deal’ with Xi – business live",
    "url": "https://www.theguardian.com/business/live/2025/oct/29/donald-trump-cut-fentanyl-tariff-chinese-goods-expects-great-deal-with-xi-jinping-federal-reserve-rate-cut-business-live",
    "image": "https://media.guim.co.uk/fb420e1f53a4c7ab4a77ee139ae50e811b70e97b/458_0_4583_3668/500.jpg",
    "summary": "Most Asian stock markets rose due to optimistic sentiments surrounding a potential trade deal. Investors are also anticipating a US interest rate cut, which contributed to the positive market momentum. This combination of factors has boosted investor confidence across the region.",
    "published": "2025-10-29T08:16:32Z"
  },
  {
    "title": "Five years, 40,000 kids and three pro cricketers – now Ace programme has bigger ambitions",
    "url": "https://www.theguardian.com/sport/2025/oct/29/five-years-40000-kids-and-three-pro-cricketers-now-ace-programme-has-bigger-ambitions",
    "image": "https://media.guim.co.uk/0a49324895ad55566bb6c1c91e3a21f5c836e9d7/292_0_4826_3861/500.jpg",
    "summary": "Ebony Rainford-Brent is resigning as chair of the innovative programme she launched in 2020 to address unmet needs in cricket. Her initiative aimed to broaden access and participation in the sport. The transition marks a significant moment for the programme as it evolves under new leadership.",
    "published": "2025-10-29T08:00:37Z"
  }
]