[
  {
    "title": "Trump says ‘for the most part, there is consensus’ on next stages of Gaza ceasefire plan – live",
    "url": "https://www.theguardian.com/world/live/2025/oct/11/israel-gaza-ceasefire-hamas-hostages-netanyahu-trump-middle-east-latest-news-updates",
    "image": "https://media.guim.co.uk/427d10da50f878783a74c19da746f351f08fe8e7/834_0_4416_3535/500.jpg",
    "summary": "The US President stated that Hamas is in the process of gathering hostages, while displaced Palestinians are returning to northern Gaza. This highlights the ongoing tension and humanitarian issues in the region. The situation remains complex as efforts continue to address both security and humanitarian concerns.",
    "published": "2025-10-11T08:15:25Z"
  },
  {
    "title": "Tony Blair and Nick Clegg hosted dinner giving tech bosses access to UK minister",
    "url": "https://www.theguardian.com/politics/2025/oct/11/tony-blair-and-nick-clegg-hosted-dinner-giving-tech-bosses-access-to-uk-minister",
    "image": "https://media.guim.co.uk/434dd38a2c55d678523509a3156a4320f26e5122/0_0_1678_1343/500.jpg",
    "summary": "Documents reveal that six tech leaders recently dined with the investment minister, highlighting the increasing influence of a consultancy linked to a former Prime Minister. This meeting suggests potential networking efforts between the tech industry and government officials. The development raises questions about the intersection of business and politics.",
    "published": "2025-10-11T08:05:07Z"
  },
  {
    "title": "‘I’m going to write about all of it’: author Chris Kraus on success, drugs and I Love Dick",
    "url": "https://www.theguardian.com/books/2025/oct/11/im-going-to-write-about-all-of-it-author-chris-kraus-on-success-drugs-and-i-love-dick",
    "image": "https://media.guim.co.uk/b10a2018d74efd60737556d7748e97f82d2206fc/550_1098_2759_2208/500.jpg",
    "summary": "A decade after her first cult hit, the US author discusses the true crime inspiration behind her latest novel. She also shares her thoughts on the complexities of the #MeToo movement and her experiences being married to an addict. The conversation reveals her personal and professional growth since her debut.",
    "published": "2025-10-11T08:00:18Z"
  },
  {
    "title": "Exe Men review – entertaining rugby drama tackles triumph of underdogs Exeter Chiefs",
    "url": "https://www.theguardian.com/stage/2025/oct/11/exe-men-review-exeter-northcott-chiefs-rugby-underdog-story",
    "image": "https://media.guim.co.uk/15cc70d5628f1f99880cde8fa9b36f889e10cad1/742_213_3381_2705/500.jpg",
    "summary": "The Devon club's remarkable transformation from a struggling team to championship victors is recounted with both style and fondness. Their journey highlights resilience and determination. The storytelling captures the essence of their success and the community’s pride.",
    "published": "2025-10-11T08:00:17Z"
  },
  {
    "title": "Emma Doran: ‘When I was growing up, a woman’s biggest compliment would be that she was immaculate’",
    "url": "https://www.theguardian.com/stage/2025/oct/11/emma-doran-standup",
    "image": "https://media.guim.co.uk/657f620b3d5b88c86c6b91ca2274c816e9b81f4d/0_349_4155_3324/500.jpg",
    "summary": "An Irish comedian shares reflections on her journey, offering advice to her younger self about navigating the industry. She humorously discusses the challenges of dealing with faulty microphones during performances. Despite her success, she admits that it still makes her feel uneasy.",
    "published": "2025-10-11T08:00:17Z"
  }
]