[
  {
    "title": "Australia v Argentina: Rugby Championship 2025 – live reaction",
    "url": "https://www.theguardian.com/sport/live/2025/sep/13/rugby-championship-australia-wallabies-v-argentina-pumas-live",
    "image": "https://media.guim.co.uk/31298a294db50e040444b2ecfcb51e6c1f9be376/333_0_6349_5079/500.jpg",
    "summary": "The Wallabies suffered a narrow defeat to Los Pumas, losing the second Test 28-26 in Sydney. The match showcased a tight contest with both teams exchanging leads. Follow Jonathan Howcroft for detailed updates and analysis.",
    "published": "2025-09-13T06:36:14Z"
  },
  {
    "title": "UK lender offers 98% mortgage to first-time buyers – but bars bank of mum and dad",
    "url": "https://www.theguardian.com/money/2025/sep/13/uk-98-per-cent-mortgage-first-time-buyers-newcastle-building-society",
    "image": "https://media.guim.co.uk/95005d6bb28d15add0f4050344fe68e48ec9ef1d/5_23_3124_2499/500.jpg",
    "summary": "Newcastle Building Society is launching new mortgage options targeting individuals with smaller deposits who lack additional financial assistance. This initiative aims to help first-time buyers access the housing market. The society is focusing on making homeownership more attainable for those facing financial barriers.",
    "published": "2025-09-13T06:00:59Z"
  },
  {
    "title": "How many domestic dogs are there and do flies see in slow motion? The kids’ quiz",
    "url": "https://www.theguardian.com/lifeandstyle/2025/sep/13/how-many-domestic-dogs-are-there-and-do-flies-see-in-slow-motion-the-kids-quiz",
    "image": "https://media.guim.co.uk/04746a3cc65171c8f7848874e2e132a6d0c18e26/195_202_1053_842/500.jpg",
    "summary": "Children have created five multiple-choice questions to challenge your knowledge. Readers also have the opportunity to submit their own brainteasers for upcoming quizzes. Engage with these fun quizzes and contribute your questions!",
    "published": "2025-09-13T06:00:59Z"
  },
  {
    "title": "Shocked by Epstein’s birthday book? That culture was everywhere before feminism | Rebecca Solnit",
    "url": "https://www.theguardian.com/commentisfree/2025/sep/13/epstein-birthday-book-feminism-culture",
    "image": "https://media.guim.co.uk/fcaddd0f9872706c49d325bd3b243725491d080f/0_0_4544_3634/500.jpg",
    "summary": "Feminism has shed light on the pervasive issues of child abuse, rape, sexual harassment, and domestic violence. It has played a crucial role in raising awareness and challenging societal norms that perpetuate this culture. Through advocacy and activism, feminism continues to combat these injustices.",
    "published": "2025-09-13T06:00:59Z"
  },
  {
    "title": "Universities around the world cut ties with Israeli academia over Gaza war",
    "url": "https://www.theguardian.com/world/2025/sep/13/universities-around-the-world-cut-ties-with-israeli-academia-over-gaza-war",
    "image": "https://media.guim.co.uk/6fc75bd85f272646c2e3e85050878f76b547edfa/782_0_2543_2035/500.jpg",
    "summary": "Educational institutions across Europe and South America are organizing a boycott of Israeli universities. However, Universities UK has stated that it does not endorse this boycott. The decision reflects ongoing debates about academic collaboration and political activism in the education sector.",
    "published": "2025-09-13T06:00:59Z"
  }
]