[
  {
    "title": "Police need more powers to stop ‘naked racism and hatred’ after allowing Sydney neo-Nazi rally, premier says",
    "url": "https://www.theguardian.com/australia-news/2025/nov/08/nsw-police-powers-sydney-neo-nazi-rally-premier-chris-minnssays",
    "image": "https://media.guim.co.uk/d76eb043023b7c098124891a7b2de67fe18392e7/777_0_7857_6286/500.jpg",
    "summary": "Dozens of neo-Nazis protested outside the New South Wales parliament, displaying an antisemitic banner. The demonstration included chanting a slogan associated with the Hitler Youth. The event has drawn significant condemnation for promoting hate and bigotry.",
    "published": "2025-11-08T06:16:06Z"
  },
  {
    "title": "TV tonight: Cynthia Erivo and Ariana Grande’s big Wicked night in",
    "url": "https://www.theguardian.com/tv-and-radio/2025/nov/08/tv-tonight-cynthia-erivo-and-ariana-grandes-big-wicked-night-in",
    "image": "https://media.guim.co.uk/09da954a3651e7c44bc854369557ec37b02f0061/88_400_1955_1564/500.jpg",
    "summary": "Tonight features a special extravaganza showcasing new songs and exclusive behind-the-scenes content. Additionally, Jade Thirlwall delivers an impressive performance at the Proms. Don't miss out on the highlights of the evening!",
    "published": "2025-11-08T06:15:55Z"
  },
  {
    "title": "Cutting home insulation funding will imperil UK’s climate goals, Reeves told",
    "url": "https://www.theguardian.com/environment/2025/nov/08/cutting-home-insulation-funding-imperil-uk-climate-goals-reeves-told",
    "image": "https://media.guim.co.uk/081cb042b4d192906e4e7a554c88cebff91bd46e/0_0_5600_4480/500.jpg",
    "summary": "Energy firms and charities are calling on the chancellor to refrain from implementing short-term solutions that might negatively impact low-income households. They emphasize the importance of sustainable strategies to support vulnerable communities. The appeal highlights concerns about potential unintended consequences of quick fixes in energy policy.",
    "published": "2025-11-08T06:01:00Z"
  },
  {
    "title": "England facing drastic measures due to extreme drought next year",
    "url": "https://www.theguardian.com/environment/2025/nov/08/england-faces-extreme-drought-next-year",
    "image": "https://media.guim.co.uk/0c8576af08af7b6cd9f086747f40db768e591e96/671_0_6722_5376/500.jpg",
    "summary": "Authorities and water companies are preparing emergency measures in response to the most severe water shortage in decades. This includes strategies to manage supply and ensure access to clean water for affected communities. The situation highlights growing concerns over water resource management amid changing climate conditions.",
    "published": "2025-11-08T06:00:59Z"
  },
  {
    "title": "Tim Dowling: life on the road was so much simpler than being at home",
    "url": "https://www.theguardian.com/lifeandstyle/2025/nov/08/tim-dowling-life-on-the-road-was-so-much-simpler-than-being-at-home",
    "image": "https://media.guim.co.uk/f4ebe0262db2793849def4a55200c01692625f04/685_0_3750_3000/500.jpg",
    "summary": "During the band's tour, there were no unusual interruptions or incidents involving animals or odd behavior. The atmosphere remained calm and controlled. Overall, the experience was free from distractions or disruptions.",
    "published": "2025-11-08T06:00:58Z"
  }
]