[
  {
    "title": "Tories would abolish stamp duty, Badenoch tells party conference – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/oct/08/conservative-tory-conference-kemi-badenoch-labour-keir-starmer-india-uk-politics-live-news-updates",
    "image": "https://media.guim.co.uk/0307c38293edfb7caa70253a42b37082a9e76b9a/225_0_3750_3000/500.jpg",
    "summary": "A party leader criticized a proposed tax, labeling it as a \"bad tax.\" They argue that eliminating it could enhance the housing market and boost social mobility. The leader advocates for reforms to create more accessible housing opportunities.",
    "published": "2025-10-08T12:39:36Z"
  },
  {
    "title": "Women’s Cricket World Cup: Australia v Pakistan – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/08/womens-cricket-world-cup-australia-v-pakistan-live-updates-scores-results-teams-squads-start-time-colombo",
    "image": "https://media.guim.co.uk/74b7eeda9030ff93aa949f483ccddfd15a20e1e8/408_0_2704_2164/500.jpg",
    "summary": "The defending champions aim to regain momentum in the group stage with an ODI match in Colombo. The over-by-over report will provide updates as the game unfolds. Join Megan Maurice for live coverage of the match.",
    "published": "2025-10-08T12:38:05Z"
  },
  {
    "title": "Outgoing French PM says ‘there is desire’ to agree budget and talks down prospect of snap election – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/oct/08/france-emmanuel-macron-lecornu-europe-live-news-updates",
    "image": "https://media.guim.co.uk/904ef0e59c88443374c91a959753d34bb663bb86/881_821_2732_2185/500.jpg",
    "summary": "Sébastien Lecornu addressed an audience at the Matignon Palace, conveying optimism regarding the stability of the current parliament. He expressed confidence that there won't be a need for its dissolution. This statement reflects the government's focus on maintaining legislative continuity.",
    "published": "2025-10-08T12:30:43Z"
  },
  {
    "title": "Ex-FBI director James Comey to appear in court amid concerns of Trump weaponizing justice department – live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/08/donald-trump-james-comey-justice-department-national-guard-chicago-antifa-government-shutdown-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/9e4e461adbf6d46603662f28009457f01213a921/0_0_3000_2400/500.jpg",
    "summary": "The former FBI director is anticipated to enter a not guilty plea in a case that has raised significant concerns about the potential misuse of the FBI for political purposes against Donald Trump's opponents. This situation is part of a broader debate regarding the integrity of the Justice Department. The outcome could further intensify discussions about partisan conflicts within federal law enforcement.",
    "published": "2025-10-08T12:30:32Z"
  },
  {
    "title": "Nobel prize in chemistry awarded to scientists for work on porous materials",
    "url": "https://www.theguardian.com/science/2025/oct/08/nobel-prize-in-chemistry-awarded-to-scientists-for-work-on-porous-materials",
    "image": "https://media.guim.co.uk/7a5be6455c22ec62986e1f0cfd35c5a65d80a558/1291_0_5181_4145/500.jpg",
    "summary": "A trio of researchers has been recognized for their groundbreaking work in creating innovative materials that have diverse applications, including gas storage and drug delivery. Their contributions are set to significantly advance various fields by enhancing efficiency and effectiveness. This recognition highlights the importance of material science in addressing critical challenges in technology and healthcare.",
    "published": "2025-10-08T12:06:05Z"
  }
]