[
  {
    "title": "Ryder Cup 2025: USA 1-3 Europe after day-one foursomes – live updates",
    "url": "https://www.theguardian.com/sport/live/2025/sep/26/ryder-cup-2025-day-one-golf-europe-usa-bethpage-black-live",
    "image": "https://media.guim.co.uk/bc67a20003c68f62689d5947475977fed375c914/1348_700_4125_3300/500.jpg",
    "summary": "Europe makes a strong start in their title defense at Bethpage Black, showcasing impressive performances in the latest round of play. Live updates provide hole-by-hole coverage as the competition unfolds. Follow our writers for continuous coverage and insights.",
    "published": "2025-09-26T17:15:00Z"
  },
  {
    "title": "Trump’s justice department in ‘full cover-up mode’ amid Comey indictment, House Democrat says – live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/26/james-comey-fbi-indictment-donald-trump-executive-orders-tariffs-us-politics-live",
    "image": "https://media.guim.co.uk/8f31529865b8187b958bd3c91fb4e864d8b1aba1/295_0_3932_3146/500.jpg",
    "summary": "Jamie Raskin, the leading Democrat on the House Judiciary Committee, has accused the Department of Justice of acting in President Trump's interests by allegedly covering up certain cases. He raised concerns about the integrity and independence of the DOJ under the current administration. Raskin's comments highlight the ongoing tensions between the committee and the DOJ regarding accountability and transparency.",
    "published": "2025-09-26T17:13:16Z"
  },
  {
    "title": "Why does the UK need digital IDs and what data will they include?",
    "url": "https://www.theguardian.com/politics/2025/sep/26/why-does-the-uk-need-digital-ids-and-what-data-will-they-include",
    "image": "https://media.guim.co.uk/7afa98180f840e21e4e5df6469db8a64e582a600/1397_0_5215_4172/500.jpg",
    "summary": "Starmer's proposal has faced criticism from political rivals and civil liberties organizations. Concerns have been raised about the implications for individuals who do not own smartphones. Campaigners emphasize the potential exclusion of vulnerable populations in the implementation of the plan.",
    "published": "2025-09-26T17:08:39Z"
  },
  {
    "title": "Digital ID plan for UK risks creating ‘an enormous hacking target’, expert warns",
    "url": "https://www.theguardian.com/uk-news/2025/sep/26/keir-starmers-plan-for-digital-ids-risks-creating-an-enormous-hacking-target",
    "image": "https://media.guim.co.uk/4d2cc7f56f31d1889c202d56f1eae7da7c67008e/0_1_3058_2444/500.jpg",
    "summary": "A cyber security expert has issued a warning as technology firms get ready to compete for lucrative multi-billion pound contracts. The expert emphasizes the importance of robust security measures amid increased competition in the tech industry. Concerns have been raised about potential vulnerabilities and the need for thorough cybersecurity evaluations before contract awards.",
    "published": "2025-09-26T17:02:20Z"
  },
  {
    "title": "Nottinghamshire lift trophy after win, Hampshire v Surrey and more: county cricket – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/26/nottinghamshire-v-warwickshire-surrey-v-hampshire-and-more-county-cricket-final-round-live",
    "image": "https://media.guim.co.uk/0a5b282559cc033d465ad3da171d68b264fcd802/691_0_4970_3976/500.jpg",
    "summary": "Day three of the season's final round features updates from a title celebration at Trent Bridge. Tanya Aldred delivers the latest highlights and developments from the event. The atmosphere is festive as teams and fans gather to mark the conclusion of the season.",
    "published": "2025-09-26T17:01:35Z"
  }
]