[
  {
    "title": "Australia news live: Queensland government blames police for overstated figures on drop in crime; new search for Gus to enter third day",
    "url": "https://www.theguardian.com/australia-news/live/2025/oct/15/australia-news-live-liberals-infighting-james-paterson-sussan-ley-andrew-hastie-superannuation-jim-chalmers-ntwnfb",
    "image": "https://media.guim.co.uk/8ae3019be293f123fd92dfe68ca1557a6abedf17/502_747_4066_3253/500.jpg",
    "summary": "Please provide the news content you'd like summarized, and I'll be happy to help!",
    "published": "2025-10-15T07:13:42Z"
  },
  {
    "title": "Gaza ceasefire live: Israelis working to identify second group of hostage remains amid reports vital aid crossing to reopen",
    "url": "https://www.theguardian.com/world/live/2025/oct/15/gaza-ceasefire-israel-hamas-palestine-aid-hostages-detainees-prisoners-live-news-updates",
    "image": "https://media.guim.co.uk/adcc1fcd83a21b80fece9fa06acb966fb043d334/421_0_4205_3364/500.jpg",
    "summary": "Israel announced that the flow of aid into Gaza would be reduced by half and the Rafah crossing will not open as scheduled. This decision is due to delays in the return of hostages' bodies. The situation remains critical as humanitarian efforts face significant setbacks.",
    "published": "2025-10-15T07:12:48Z"
  },
  {
    "title": "Watchdog rules Red Tractor exaggerated its environmental standards",
    "url": "https://www.theguardian.com/world/2025/oct/15/watchdog-rules-red-tractor-exaggerated-environmental-standards",
    "image": "https://media.guim.co.uk/1449599801a21b95276a0a4191f9f5fd54a31cad/513_503_2045_1636/500.jpg",
    "summary": "The Advertising Standards Authority has sided with River Action, stating that a 2023 advertisement by the food safety body was misleading to the public. The ruling highlights concerns over the accuracy of the claims made in the advert. This decision raises questions about advertising standards in the food safety sector.",
    "published": "2025-10-15T07:10:45Z"
  },
  {
    "title": "Rachel Reeves to pitch UK as ‘beacon of stability and growth’ at IMF, amid budget pressure – business live",
    "url": "https://www.theguardian.com/business/live/2025/oct/15/rachel-reeves-uk-beacon-of-stability-growth-imf-budget-tax-spending-stock-markets-business-live-news",
    "image": "https://media.guim.co.uk/5b8bdff87a5b43e5629205086456b5ddbc437c73/625_0_6253_5005/500.jpg",
    "summary": "The latest economic and financial news highlights key developments impacting global markets. Analysts are closely monitoring trends in inflation, interest rates, and employment figures. Ongoing geopolitical tensions and supply chain issues continue to influence investor sentiment and economic stability.",
    "published": "2025-10-15T07:05:13Z"
  },
  {
    "title": "Thousands trapped in El Fasher siege on ‘edge of survival’, says report ",
    "url": "https://www.theguardian.com/global-development/2025/oct/15/thousands-trapped-in-el-fasher-sudan-siege-on-edge-of-survival-says-report-rsf",
    "image": "https://media.guim.co.uk/fce74b35fa8d37c74395406afa868954680078af/640_0_3200_2560/500.jpg",
    "summary": "The Sudanese army's last stronghold in western Sudan has endured over 500 days of assaults from the paramilitary Rapid Support Forces (RSF). Despite the prolonged attacks, the city remains resilient against the ongoing conflict. The situation highlights the intense struggle and prolonged instability in the region.",
    "published": "2025-10-15T07:00:17Z"
  }
]