[
  {
    "title": "Zohran Mamdani takes the stage after winning New York mayoral election – live updates",
    "url": "https://www.theguardian.com/us-news/live/2025/nov/04/nyc-mayor-election-zohran-mamdani-andrew-cuomo-results-latest",
    "image": "https://media.guim.co.uk/22f379fd6dff552cdb51253276cd7761736b60b9/598_0_4671_3736/500.jpg",
    "summary": "A democratic socialist has made history as the first Muslim mayor of a U.S. city, marking a significant win for progressive politics. The elections saw Democrats achieving major victories across several important races. This shift reflects growing support for diverse leadership and progressive ideals within the party.",
    "published": "2025-11-05T04:23:29Z"
  },
  {
    "title": "Australia politics live: question time clashes over Foodbank and energy prices after Chalmers and Hawke forced to withdraw ‘liar’ comments",
    "url": "https://www.theguardian.com/australia-news/live/2025/nov/05/australia-politics-live-nauru-deportations-labor-greens-coalition-anthony-albanese-sussan-ley-nationals-leadership-net-zero-question-time-ntwnfb",
    "image": "https://media.guim.co.uk/51aed3cfcae7023633c40ec0de79a7641e29c84c/1234_0_6388_5113/500.jpg",
    "summary": "I'm sorry, but I need more context or details about the news you are referring to in order to provide a summary. Please provide the text or the main points you want summarized.",
    "published": "2025-11-05T04:18:48Z"
  },
  {
    "title": "Prop 50: Californians pass redistricting measure that helps Democrats flip up to five House seats",
    "url": "https://www.theguardian.com/us-news/2025/nov/04/california-prop-50-voting-result",
    "image": "https://media.guim.co.uk/c3659b1e831902acc6940263c5b9874ef76325ea/292_0_2917_2334/500.jpg",
    "summary": "A recently approved measure could significantly impact the Republican Party's ability to maintain full control of government in the upcoming midterm elections. This decision may influence voter sentiment and party dynamics. The outcome could shape the political landscape for the next election cycle.",
    "published": "2025-11-05T04:07:16Z"
  },
  {
    "title": "At least seven dead and 11 injured after UPS plane crashes near a Kentucky airport",
    "url": "https://www.theguardian.com/us-news/2025/nov/04/louisville-plane-crash-airport-kentucky-latest",
    "image": "https://media.guim.co.uk/2ea9c1b4f61ff3e710423c787343dfdac543257e/13_0_6880_5504/500.jpg",
    "summary": "An aircraft experienced a catastrophic fireball incident shortly after takeoff at Louisville International Airport. Officials warn that the death toll may increase as investigations continue. Emergency response teams remain on the scene to assess the situation and aid any survivors.",
    "published": "2025-11-05T04:00:56Z"
  },
  {
    "title": "Democrat Abigail Spanberger elected governor of Virginia",
    "url": "https://www.theguardian.com/us-news/2025/nov/04/virginia-governor-abigail-spanberger",
    "image": "https://media.guim.co.uk/a9a64649e87053ba6c203d349b5690f3959a6189/472_0_4717_3773/500.jpg",
    "summary": "Former Congresswoman Jennifer McClellan has made history by defeating Republican Winsome Earle-Sears to become Virginia's first female governor. Her victory marks a significant milestone in the state's political landscape. McClellan's election reflects growing support for Democratic leadership in Virginia.",
    "published": "2025-11-05T03:57:55Z"
  }
]