[
  {
    "title": "First cabinet minister enters race to become deputy Labour leader – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/09/bridget-phillipson-labour-deputy-leader-uk-politics-latest-news-updates-keir-starmer",
    "image": "https://media.guim.co.uk/86938f594b280c047557f10389549019381c2fc2/597_0_3092_2473/500.jpg",
    "summary": "Bridget Phillipson has announced her candidacy to succeed Angela Rayner, emphasizing her identity as a \"proud working-class woman.\" In her statement, she highlights her commitment to representing the interests of working-class individuals. Phillipson aims to bring her experiences and perspective to the role.",
    "published": "2025-09-09T08:48:05Z"
  },
  {
    "title": "New Zealand v Australia: international men’s football friendly – live",
    "url": "https://www.theguardian.com/football/live/2025/sep/09/australia-socceroos-vs-new-zealand-all-whites-game-two-live-updates-international-football-friendly-latest",
    "image": "https://media.guim.co.uk/37edb96190d01eaac446472432bd97e81793ea5e/264_0_3385_2708/500.jpg",
    "summary": "The Socceroos and All Whites face off again in the ‘Soccer Ashes’ for their second match in a week. Updates will be provided by Martin Pegan throughout the event. Fans can expect a thrilling showdown between the two teams.",
    "published": "2025-09-09T08:47:47Z"
  },
  {
    "title": "François Bayrou to resign as French PM as government collapses to spark crisis – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/sep/09/france-crisis-government-emmanuel-macron-europe-latest-live-news-updates",
    "image": "https://media.guim.co.uk/2b201e033b7874ab22e5971b3bbb51c02ae9f458/743_0_3717_2973/500.jpg",
    "summary": "The French government collapsed after a vote of confidence failed, with only 194 MPs supporting Emmanuel Macron's ally while 364 opposed. This significant loss highlights political instability in Macron's administration. The situation raises questions about the government's ability to govern effectively moving forward.",
    "published": "2025-09-09T08:47:34Z"
  },
  {
    "title": "Anglo American agrees mining mega merger; Londoners face commuting struggles as tube strike enters second day – business live",
    "url": "https://www.theguardian.com/business/live/2025/sep/09/anglo-mining-mega-merger-londoners-commuting-struggles-tube-strike-second-day-business-live",
    "image": "https://media.guim.co.uk/0f9e2319cb4a332a06ce7286b1ad347dd702ad5a/291_0_3487_2790/500.jpg",
    "summary": "A merger will establish a $53 billion mining giant, prompting concerns over potential job losses as the headquarters relocates to Vancouver. The consolidation raises anxiety among employees about future job security. The deal highlights ongoing industry consolidation amidst changing market dynamics.",
    "published": "2025-09-09T08:46:38Z"
  },
  {
    "title": "Somerset v Yorkshire, Leicestershire v Gloucestershire and more: county cricket day two – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/09/somerset-v-yorkshire-leicestershire-v-gloucestershire-and-more-county-cricket-day-two-live",
    "image": "https://media.guim.co.uk/33c7472340564da3d81f334a98be32f734f06774/1185_1202_3657_2926/500.jpg",
    "summary": "Tanya Aldred provides updates from county grounds on day two of the latest round of fixtures. Fans can follow the rolling report for live insights and developments. Stay tuned for key highlights and matches throughout the day.",
    "published": "2025-09-09T08:46:04Z"
  }
]