[
  {
    "title": "MPs warned to avoid China-linked agents trying to contact them on LinkedIn – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/nov/18/labour-asylum-seekers-keir-starmer-reform-nigel-farage-uk-politics-latest-news",
    "image": "https://media.guim.co.uk/60fec0b91918b4fc06cddf7732a6d1ecaa1e5852/746_0_3448_2758/500.jpg",
    "summary": "Dan Jarvis, the UK security minister, is set to address Members of Parliament regarding concerns over Chinese espionage activities. His statement is expected to outline the government's stance and response to these security threats. The discussion highlights growing apprehensions about China's influence and intelligence operations in the UK.",
    "published": "2025-11-18T12:41:23Z"
  },
  {
    "title": "Poland says ‘everything indicates’ Russia was behind rail sabotage incidents – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/nov/18/poland-russia-ukraine-rail-sabotage-incidents-zelenskyy-macron-merz-starmer-europe-live-news",
    "image": "https://media.guim.co.uk/ecb0b6a93d33b1c00e3e68b576723123b2c63be3/0_0_1066_853/500.jpg",
    "summary": "A security spokesperson has characterized a weekend incident as a terrorist attack. They claim it was instigated by special services from the East. Further details about the attack or its aftermath have not been provided.",
    "published": "2025-11-18T12:40:07Z"
  },
  {
    "title": "Cop30 live: exclusion zone around conference expanded after protests",
    "url": "https://www.theguardian.com/environment/live/2025/nov/18/cop30-climate-protests-latest-news-live-updates-brazil-belem",
    "image": "https://media.guim.co.uk/10ac8ad04135f36e9978cb928dc4337131477515/586_0_4724_3781/500.jpg",
    "summary": "Negotiations are ongoing on the eighth day of the summit, with key discussions still taking place. Additional ministerial national statements are anticipated, indicating continued deliberations. The outcome remains uncertain as leaders strive for consensus.",
    "published": "2025-11-18T12:39:38Z"
  },
  {
    "title": "First Thing: ‘They have total impunity’ – West Bank settler violence rises after Gaza ceasefire",
    "url": "https://www.theguardian.com/us-news/2025/nov/18/first-thing-west-bank-settler-violence-gaza-ceasefire-israel",
    "image": "https://media.guim.co.uk/7d7b2dc4c76ddc0cf22d113e71593e3c5395ae72/534_0_3289_2632/500.jpg",
    "summary": "In October, the UN reported a record high of 260 attacks, marking the highest monthly total recorded. Meanwhile, protests erupted in Charlotte, North Carolina, in response to aggressive immigration arrests. These events highlight ongoing global concerns regarding security and immigration issues.",
    "published": "2025-11-18T12:38:50Z"
  },
  {
    "title": "Tanzania’s descent into repression is a stark warning of how fast Africa’s progress can be eroded | Kenneth Mohammed",
    "url": "https://www.theguardian.com/global-development/2025/nov/18/tanzania-africa-governance-human-rights-tanzania-samia-suluhu-hassan-uganda-drc-rwanda-sudan",
    "image": "https://media.guim.co.uk/597f1957ddb58bdcf12ca37b70fa241627fd3b3e/530_0_3911_3129/500.jpg",
    "summary": "Since taking office, President Samia Suluhu Hassan initially sparked optimism for Tanzania's democratic progression. However, the nation is now experiencing a significant decline in democratic values, indicating a troubling trend. This situation reflects not only a national crisis but also raises concerns about the broader implications for democracy in the region.",
    "published": "2025-11-18T12:24:34Z"
  }
]