[
  {
    "title": "US attorney general vows to appeal dismissal of criminal cases against James Comey and Letitia James – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/nov/25/us-politics-pam-bondi-appeal-james-comey-letitia-james-cases-donald-trump-venezuela-latest-updates",
    "image": "https://media.guim.co.uk/d906b2a8c14e356c13b15dcbdf44bfa715e2b6f4/614_0_6435_5148/500.jpg",
    "summary": "The Pentagon is investigating Arizona Senator Mark Kelly for potentially violating military law. This follows his appearance in a video where lawmakers urged military personnel to \"refuse illegal orders.\" The investigation raises concerns about the implications of such statements on military conduct.",
    "published": "2025-11-25T17:20:17Z"
  },
  {
    "title": "Mayors in England to get power to impose tourism tax on overnight visitors at ‘modest’ rate – UK politics live ",
    "url": "https://www.theguardian.com/politics/live/2025/nov/25/nigel-farage-nathan-gill-labour-reform-uk-russia-keir-starmer-uk-politics-live-news",
    "image": "https://media.guim.co.uk/a63653c2b443cab13b08544f7b993a21a269c95b/37_0_3824_3060/500.jpg",
    "summary": "The government has introduced an overnight levy in preparation for the upcoming budget announcement. This decision aims to address financial challenges and optimize revenue. Details on the levy’s impact and specific measures will be revealed in the budget scheduled for tomorrow.",
    "published": "2025-11-25T17:14:52Z"
  },
  {
    "title": "White House claims ‘tremendous progress’ made in Ukraine-Russia peace plan but says more talks needed - Europe live ",
    "url": "https://www.theguardian.com/world/live/2025/nov/25/us-russia-ukraine-peace-talks-abu-dhabi-kyiv-strikes-zelenskyy-putin-europe-live-news",
    "image": "https://media.guim.co.uk/eb053601e69d2a0f8cc056d984033cbd97ca488f/252_0_4589_3672/500.jpg",
    "summary": "A spokesperson emphasized that important discussions regarding sensitive issues remain necessary among Ukraine, Russia, and the United States. These dialogues are crucial for addressing ongoing tensions and fostering understanding. The statement highlights the complexity of the situation and the need for continued communication.",
    "published": "2025-11-25T17:10:21Z"
  },
  {
    "title": "Cristiano Ronaldo clear to start World Cup after Fifa suspends two games of his ban",
    "url": "https://www.theguardian.com/football/2025/nov/25/cristiano-ronaldo-clear-world-cup-fifa-suspends-two-games-portugal",
    "image": "https://media.guim.co.uk/3a2425cadce24060f329cff1454f5e5aff1b80ef/632_66_1201_961/500.jpg",
    "summary": "Cristiano Ronaldo's ban will extend to two additional games only if he commits a similar infringement within the next year. This ruling allows him to fulfill the remaining punishment conditionally. His current status hinges on future conduct regarding similar offenses.",
    "published": "2025-11-25T17:04:56Z"
  },
  {
    "title": "I got an epidural for all three of my births – none of them worked as expected",
    "url": "https://www.theguardian.com/wellness/2025/nov/25/what-to-know-about-epidural",
    "image": "https://media.guim.co.uk/e1cad90851df6d7df683bb74046309dc27f9c1a6/0_665_2400_1919/500.jpg",
    "summary": "Before opting for an epidural, it’s important to understand that while it can significantly alleviate pain during labor, it may not eliminate it entirely for everyone. Factors such as individual anatomy and the specific location of the injection can influence its effectiveness. Additionally, side effects and varying levels of pain relief can occur, so discussing expectations with a healthcare provider is crucial.",
    "published": "2025-11-25T17:00:27Z"
  }
]