[
  {
    "title": "The week Europe realised it stands alone against Russian expansionism",
    "url": "https://www.theguardian.com/world/2025/nov/29/the-week-europe-realised-it-stands-alone-against-russian-expansionism",
    "image": "https://media.guim.co.uk/fed0bdc88bd2160fb34b90b609e28668d5d8b4e8/0_0_4169_3335/500.jpg",
    "summary": "Washington's plan to negotiate peace in Ukraine while appeasing Putin has faltered, raising concerns about the effectiveness of U.S. strategies. This failure may signal a shift in European nations' trust in American security guarantees. As a result, Europe could reconsider its dependence on U.S. protection moving forward.",
    "published": "2025-11-29T05:00:28Z"
  },
  {
    "title": "Celebrity crib sheet: Katy Perry has spent all year in the headlines – here are the six things you need to know",
    "url": "https://www.theguardian.com/lifeandstyle/2025/nov/29/celebrity-crib-sheet-katy-perry-blue-origin-space-flight-justin-trudeau",
    "image": "https://media.guim.co.uk/e4873c97c4e0d2406d8bf82cefdb58f0a1dc3e68/0_0_3000_2400/500.jpg",
    "summary": "A singer, often criticized for a brief space trip and a failed house purchase, appears to have found love with Canadian Prime Minister Justin Trudeau. Their relationship is generating public interest as she prepares to make headlines again. It's a good moment to catch up on her latest endeavors.",
    "published": "2025-11-29T05:00:27Z"
  },
  {
    "title": "Skyhooks guitarist Bob ‘Bongo’ Starkie dies aged 73",
    "url": "https://www.theguardian.com/music/2025/nov/29/skyhooks-guitarist-bob-bongo-starkie-dies-aged-73",
    "image": "https://media.guim.co.uk/58cfb04eec2a97c9b5464594915cb05bf32e963b/283_28_2715_2172/500.jpg",
    "summary": "Starkie has passed away from leukaemia, with his family and friends by his side. His daughter shared that he spent his final moments listening to Chuck Berry. The family is mourning his loss while cherishing the memories of his life.",
    "published": "2025-11-29T03:51:33Z"
  },
  {
    "title": "‘Call us rubbish’: Ben Stokes hits back at claims that England approach is ‘arrogant’",
    "url": "https://www.theguardian.com/sport/2025/nov/29/ashes-cricket-ben-stokes-england-arrogant-brisbane",
    "image": "https://media.guim.co.uk/6e97eb9bbfd06acdbb9d06c4d77f95e9cc1a5a81/253_70_2863_2292/500.jpg",
    "summary": "The cricket captain has dismissed a term used by former Ashes opponent Mitchell Johnson as the team starts their training with a pink Kookaburra ball in Brisbane. This preparation comes ahead of their upcoming matches. The exchange highlights ongoing tension and rivalry in the sport.",
    "published": "2025-11-29T03:46:10Z"
  },
  {
    "title": "Ukraine war briefing: one killed and seven wounded as Russia launches another overnight attack on Kyiv",
    "url": "https://www.theguardian.com/world/2025/nov/29/ukraine-war-briefing-russia-launches-deadly-overnight-attack-on-kyiv",
    "image": "https://media.guim.co.uk/08419292acfea8b9b487b3587fc3ad48bb70bbd2/404_0_4583_3667/500.jpg",
    "summary": "Explosions were reported in Kyiv as residential buildings were damaged around midnight. The incidents coincided with the resignation of a key ally of President Zelenskyy amid an ongoing anti-corruption investigation. This marks a significant development on the 1,375th day of the conflict.",
    "published": "2025-11-29T03:21:12Z"
  }
]