[
  {
    "title": "Hull KR v Wigan Warriors: Super League Grand Final – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/11/rugby-league-hull-kr-wigan-warriors-super-league-grand-final-live",
    "image": "https://media.guim.co.uk/2cbf22ad0a37c5cd3f94f919b33f3aa9fcf7fdbb/296_0_3436_2748/500.jpg",
    "summary": "The league leaders face off against the reigning champions in a highly anticipated match, with both teams aiming to make history. Luke McLaughlin provides a detailed minute-by-minute report of the game. Fans eagerly await the outcome as the stakes are high for both sides.",
    "published": "2025-10-11T18:22:39Z"
  },
  {
    "title": "Strictly Come Dancing: week three – live",
    "url": "https://www.theguardian.com/tv-and-radio/live/2025/oct/11/strictly-come-dancing-week-three-live",
    "image": "https://media.guim.co.uk/e7d7b8ea2c7a95b1c3b033a900717b99897e6079/382_0_3818_3055/500.jpg",
    "summary": "It's Movie Week, featuring music from films like Miss Congeniality, James Bond, K-Pop Demon Hunters, and Mary Poppins for a dance competition. Contestants will showcase their routines, but some may struggle. The event also anticipates which performances will shine and which will miss the mark.",
    "published": "2025-10-11T18:22:00Z"
  },
  {
    "title": "Hamas official says disarmament ‘out of the question’; Israel prepares prisoners for exchange – live",
    "url": "https://www.theguardian.com/world/live/2025/oct/11/israel-gaza-ceasefire-hamas-hostages-netanyahu-trump-middle-east-latest-news-updates",
    "image": "https://media.guim.co.uk/373bb91e694a157d575f69e59bb39001116b511f/704_0_6250_5000/500.jpg",
    "summary": "Under a truce deal, Israel is set to release prisoners, including those serving life sentences for serious offenses, in exchange for hostages. The agreement aims to facilitate negotiations and reduce tensions. The arrangement highlights ongoing issues related to conflict and human rights in the region.",
    "published": "2025-10-11T18:14:28Z"
  },
  {
    "title": "Chimamanda Ngozi Adichie says she is terrified her sons will ‘join manosphere’",
    "url": "https://www.theguardian.com/books/2025/oct/11/chimamanda-ngozi-adichie-says-she-is-terrified-her-sons-will-join-manosphere",
    "image": "https://media.guim.co.uk/f11fa5e0a4b80db02637f2ece4c8b70be1dccbf8/131_1_3208_2567/500.jpg",
    "summary": "At the Cheltenham Literature Festival, Nigerian-American author described her experiences of motherhood, sharing that having boys has led her to \"worry more\" about their future. She discussed the challenges and concerns faced by parents, particularly in raising sons. The conversation highlighted the societal issues and responsibilities associated with parenting boys in today's world.",
    "published": "2025-10-11T18:14:09Z"
  },
  {
    "title": "Six people dead with multiple injured in three shootings at Mississippi homecoming weekends",
    "url": "https://www.theguardian.com/us-news/2025/oct/11/leland-mississippi-mass-shooting",
    "image": "https://media.guim.co.uk/55a649372cf41b5e4f78ffeea492c2945b40675e/192_0_6456_5164/500.jpg",
    "summary": "In a series of violent incidents, four people were killed in an attack in Leland, while another two fatalities occurred in Heidelberg. Additionally, a third attack took place in Rolling Fork. The incidents have raised concerns about safety in the affected areas.",
    "published": "2025-10-11T18:09:50Z"
  }
]