[
  {
    "title": "Alexander-Arnold left out of England squad, Simons to join Spurs and more: football news – live",
    "url": "https://www.theguardian.com/football/live/2025/aug/29/mourinho-sacked-by-fenerbahce-simmons-to-join-spurs-and-more-football-news-live",
    "image": "https://media.guim.co.uk/40e513886f03a0375292ab5c200b922dd5a1b822/0_0_5417_4332/500.jpg",
    "summary": "Join our writers for the latest updates as we approach an exciting weekend in the top flight of football. Stay tuned for all the important news and analysis. Don't miss out on the action!",
    "published": "2025-08-29T11:26:10Z"
  },
  {
    "title": "Zelenskyy calls for more pressure on Russia so ‘murderers do not feel impunity’ after Thursday’s Kyiv strikes – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/aug/29/ukraine-russia-war-zelenskyy-putin-latest-europe-news-updates-live",
    "image": "https://media.guim.co.uk/c0b037fed46853506ce40735ee8c95e5bbbe0dc6/278_0_4169_3334/500.jpg",
    "summary": "EU defense ministers are set to convene to address the increasing pressure on Russia amid ongoing tensions. Estonian Prime Minister Kaja Kallas has criticized President Putin, accusing him of undermining peace efforts. The discussions aim to explore strategies for enhancing security in light of these provocations.",
    "published": "2025-08-29T11:21:08Z"
  },
  {
    "title": "The X-Men are heading to the Marvel Cinematic Universe. Things will get weird | Ben Child",
    "url": "https://www.theguardian.com/film/2025/aug/29/x-men-heading-to-marvel-cinematic-universe-week-in-geek",
    "image": "https://media.guim.co.uk/c0174fe02acfe1741f24eab176d18482ea5912d0/2611_3_4958_3965/500.jpg",
    "summary": "A reboot of the X-Men franchise is underway, prompting discussions about how to incorporate alternate timelines. Speculation includes the potential use of the Blip, Scarlet Witch's chaos magic, and the Celestials from \"Eternals.\" The studio is exploring various creative avenues to connect these elements.",
    "published": "2025-08-29T11:20:01Z"
  },
  {
    "title": "Backlash as White House chooses Robert F Kennedy Jr deputy to run CDC – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/aug/29/cdc-robert-f-kennedy-jr-donald-trump-federal-reserve-lisa-cook-latest-us-politics-news-live-updates",
    "image": "https://media.guim.co.uk/413dc232b37a3613e5c8b3e89e532ae1c69565d8/1429_0_7200_5760/500.jpg",
    "summary": "Senators are expressing anger over recent developments at the CDC following the appointment of Jim O'Neill to replace Susan Monarez. Concerns have been raised regarding O'Neill's qualifications and the impact of this change on public health policy. This situation has sparked intense scrutiny of the CDC's leadership choices.",
    "published": "2025-08-29T11:17:37Z"
  },
  {
    "title": "Judges due to rule on Epping hotel injunction – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/aug/29/latest-live-uk-politics-news-updates-asylum-hotels-labour-conservatives-reform",
    "image": "https://media.guim.co.uk/ce98a439324cf0ec721f78c26607e0cdcd8d57b5/137_0_2501_2001/500.jpg",
    "summary": "The Home Office and the owner of Bell Hotel are contesting an injunction issued by a local council that seeks to prevent the accommodation of numerous asylum seekers at the hotel. They argue against the legal order aimed at halting the housing of these individuals. The situation highlights ongoing tensions surrounding asylum seeker accommodations in the area.",
    "published": "2025-08-29T11:16:09Z"
  }
]