[
  {
    "title": "‘Financial wellbeing’ app targets low-wage workers with high-interest loans ",
    "url": "https://www.theguardian.com/money/2025/aug/30/financial-wellbeing-app-targets-low-wage-workers-with-high-interest-loans",
    "image": "https://media.guim.co.uk/a3bdc9a87b80f00c7d27aa47b52f7d1422f31f2c/1_0_4998_4000/500.jpg",
    "summary": "Wagestream, a financial technology company, is facing criticism for providing loans of up to £25,000 to employees at companies like Pizza Express and Asda. Critics argue that such loans could lead to increased debt burdens for workers. Concerns are being raised about the implications of enabling easy access to high-value loans without adequate financial safeguards.",
    "published": "2025-08-30T06:43:18Z"
  },
  {
    "title": "The Guide #206: Indie ​bands ​are quitting Spotify, what could it mean for the future of music streaming?",
    "url": "https://www.theguardian.com/culture/2025/aug/29/indie-bands-are-quitting-spotify-what-could-it-mean-for-the-future-of-music-streaming",
    "image": "https://media.guim.co.uk/7bdb1e35381da46a1175649428cfa19c94f4e984/0_152_1170_935/500.jpg",
    "summary": "The leading streaming platform has significantly influenced music consumption and valuation. However, recent controversies indicate that users and artists are questioning whether the value provided is still adequate. This shift could impact the platform's relationship with both audiences and creators.",
    "published": "2025-08-30T06:00:56Z"
  },
  {
    "title": "What links Carol Ferris and Hal Jordan, and Ygritte and Jon Snow? The Saturday quiz",
    "url": "https://www.theguardian.com/lifeandstyle/2025/aug/30/what-links-carol-ferris-and-hal-jordan-and-ygritte-and-jon-snow-the-saturday-quiz",
    "image": "https://media.guim.co.uk/f2397fce5f2cafd87d62fed35661a605ab551c94/200_0_1291_1033/500.jpg",
    "summary": "The Saturday quiz invites participants to test their knowledge on various topics, including biblical figures like Jesus and Moses, as well as modern advancements like Claude, DeepSeek, and Gemini. It encourages exploration of both historical and contemporary subjects. Engage in this fun challenge to enhance your understanding of these diverse themes.",
    "published": "2025-08-30T06:00:55Z"
  },
  {
    "title": "Why don’t we need to sharpen felt-tip pens and why do we burp? The kids’ quiz",
    "url": "https://www.theguardian.com/lifeandstyle/2025/aug/30/why-dont-we-need-to-sharpen-felt-tip-pens-and-why-do-we-burp-the-kids-quiz",
    "image": "https://media.guim.co.uk/38e9f6d1d92619e267abf07ebd0b57d099210e8e/0_0_1500_1200/500.jpg",
    "summary": "Children have created five multiple-choice questions to challenge people's knowledge. The quiz invites participants to test themselves and submit their own questions for future rounds. This initiative promotes engagement and creativity among young quiz enthusiasts.",
    "published": "2025-08-30T06:00:55Z"
  },
  {
    "title": "‘The water left nothing’: Pakistan’s Punjab province reels from deadly floods",
    "url": "https://www.theguardian.com/global-development/2025/aug/30/pakistan-punjab-province-deadly-floods-disease",
    "image": "https://media.guim.co.uk/a065dbfbe1d89e5714da9854cc9cecccd3ca833a/436_0_4361_3489/500.jpg",
    "summary": "Over 1,400 villages have been submerged following the overflow of three large rivers, raising concerns about potential disease outbreaks. The flooding has severely impacted local communities and access to clean water. Authorities are working to assess the situation and provide aid to affected areas.",
    "published": "2025-08-30T06:00:55Z"
  }
]