[
  {
    "title": "Australia news live: ANZ abruptly closes money-back platform Cashrewards; early offer university applications hit record high",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/08/australia-news-live-erin-patterson-mushroom-murders-trial-sentencing-blood-moon-pictures-shark-net-beach-ntwnfb",
    "image": "https://media.guim.co.uk/a29d3cb91175a28192043190269901525019888a/917_0_4583_3667/500.jpg",
    "summary": "Please provide the news content you would like me to summarize.",
    "published": "2025-09-08T07:28:35Z"
  },
  {
    "title": "US tariff tensions hit Chinese export growth, slowest in six months; oil prices climb – business live",
    "url": "https://www.theguardian.com/business/live/2025/sep/08/chinese-export-growth-slowest-six-months-shipments-us-fall-amid-tariff-tensions-oil-prices-climb-business-live",
    "image": "https://media.guim.co.uk/469a3d2eb0eef550c49aee411d39cca03c22e67e/281_0_2813_2250/500.jpg",
    "summary": "In August, Beijing's exports to the United States declined by 33%. Additionally, Germany experienced an unexpected drop in exports in July. These downturns reflect ongoing challenges in global trade amid economic uncertainties.",
    "published": "2025-09-08T07:28:22Z"
  },
  {
    "title": "Hawke urges Nampijinpa Price to say sorry for ‘real damage’ her migration comments caused Indian Australians",
    "url": "https://www.theguardian.com/australia-news/2025/sep/08/alex-hawke-calls-for-jacinta-nampijinpa-price-apology-to-indian-community",
    "image": "https://media.guim.co.uk/9cb0382b5638df51cd92aa8b02aa45f254e95c4c/600_143_2702_2163/500.jpg",
    "summary": "Sussan Ley faces pressure to mend relations with a diaspora community following claims from a Northern Territory senator that the Labor party is importing migrants for electoral gain, despite a lack of evidence. The allegations have sparked controversy and criticism towards the party. Ley's response will be closely watched as she navigates these tensions.",
    "published": "2025-09-08T07:25:30Z"
  },
  {
    "title": "Minns backtracks on right to hunt over fears it could lead to US-style gun future",
    "url": "https://www.theguardian.com/australia-news/2025/sep/08/chris-minns-backtracks-nsw-right-to-hunt-shooters-and-fishers-bill",
    "image": "https://media.guim.co.uk/d70680ba8fc140cfb539c73394be682b2afe48d7/607_185_4421_3539/500.jpg",
    "summary": "The NSW premier initially backed a controversial bill permitting recreational hunters to hunt feral animals on public lands. Following public outcry and concerns over safety and wildlife management, the premier reversed his support. The decision highlights the ongoing debate over hunting regulations in the region.",
    "published": "2025-09-08T07:08:46Z"
  },
  {
    "title": "Tom Phillips, fugitive father on run with children for nearly four years, shot dead by NZ police in exchange of fire",
    "url": "https://www.theguardian.com/world/2025/sep/08/tom-phillips-new-zealand-fugitive-father-shot-dead-nz-police",
    "image": "https://media.guim.co.uk/f9f0a59a0229d41651191bed78ddca513eae7f2c/38_8_712_570/500.jpg",
    "summary": "Phillips, on the run with his children for four years, was shot by police in Piopio. This incident occurred as officers responded to a burglary and came under fire. Authorities are investigating the situation further.",
    "published": "2025-09-08T07:01:03Z"
  }
]