[
  {
    "title": "News live: PNG approves delayed defence treaty with Australia; Commonwealth Bank outage hits customers",
    "url": "https://www.theguardian.com/australia-news/live/2025/oct/02/australia-news-live-dan-tehan-liberals-nuclear-sussan-ley-coalition-anthony-albanese-labor-flotilla-bhp-china-ntwnfb",
    "image": "https://media.guim.co.uk/7af88426585fa7ea730901004001104ad706a0aa/163_310_2503_2003/500.jpg",
    "summary": "Please provide the news article or details you'd like me to summarize, and I'll be happy to help!",
    "published": "2025-10-02T02:56:17Z"
  },
  {
    "title": "Gaza aid flotilla: more than a dozen vessels intercepted by Israeli forces; Greta Thunberg arrested – live",
    "url": "https://www.theguardian.com/world/live/2025/oct/01/israel-gaza-aid-global-sumud-flotilla-middle-east-crisis-latest-updates",
    "image": "https://media.guim.co.uk/1dc8eff7cd550ab162294c9a1525393e9bf0e162/107_0_705_564/500.jpg",
    "summary": "The Israeli foreign ministry shared a video of Greta Thunberg's arrest during a protest related to climate activism. Around 500 activists were intercepted by authorities approximately 75 miles off the coast of Israel. The incident highlights ongoing tensions in the region amid the conflict.",
    "published": "2025-10-02T02:51:45Z"
  },
  {
    "title": "Perky Maxwell House viral ad takes on housing crisis as ‘Maxwell Apartment’",
    "url": "https://www.theguardian.com/us-news/2025/oct/01/maxwell-house-ad-campaign-apartment",
    "image": "https://media.guim.co.uk/c16c893d0fb4c8b403f6891d2912c94b24a87ae8/253_0_2494_1996/500.jpg",
    "summary": "A historic US company is introducing a innovative option for coffee lovers by providing a 12-month lease for pre-ground coffee at a price of under $40. This novel offering allows customers to enjoy a year-long supply of coffee without the need to purchase it outright. The initiative aims to cater to consumers looking for convenience and cost-effectiveness in their coffee consumption.",
    "published": "2025-10-02T01:54:33Z"
  },
  {
    "title": "White House plays racist deepfake videos of Chuck Schumer and Hakeem Jeffries on loop – as it happened.",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/01/us-government-shutdown-update-2025-shutting-funding-trump-democrats-republicans-live-updates-latest-news",
    "image": "https://media.guim.co.uk/c3c341192462c427995c443709fedd57ab223dd0/450_0_4655_3724/500.jpg",
    "summary": "Videos highlighting Trump’s stance were displayed on his social media during a government shutdown, as Republicans push to cut healthcare for Americans. The blog sharing this content has now been closed.",
    "published": "2025-10-02T01:51:58Z"
  },
  {
    "title": "Vanuatu open to signing deal with Australia but will not be subject to ‘bullying’ from larger countries",
    "url": "https://www.theguardian.com/world/2025/oct/02/vanuatu-open-to-signing-deal-with-australia-but-will-not-be-subject-to-bullying-from-larger-countries",
    "image": "https://media.guim.co.uk/14b782d944fa34a24da29a81de2795d51fd3ebbc/819_157_2380_1905/500.jpg",
    "summary": "A country is enhancing its policing collaboration with China amid ongoing negotiations regarding the Nakamal agreement with Australia. The agreement was not finalized last month as anticipated. Efforts are underway to strengthen security ties while addressing diplomatic challenges.",
    "published": "2025-10-02T00:25:57Z"
  }
]