[
  {
    "title": "Australia news live: Qantas says no credit card or financial details compromised as 5.7 million customers’ data leaked",
    "url": "https://www.theguardian.com/australia-news/live/2025/oct/12/australia-news-live-pro-palestine-rally-sydney-optus-anthony-albanese-sussan-ley",
    "image": "https://media.guim.co.uk/900b764b109c3f702463815627a1bc7d3029a2bd/876_0_7857_6286/500.jpg",
    "summary": "I apologize, but I need more context or information about the specific news you're referring to in order to summarize it effectively. Please provide details or the content you would like me to summarize.",
    "published": "2025-10-12T04:16:37Z"
  },
  {
    "title": "Cameroon’s 92-year-old president set for another term as country goes to polls",
    "url": "https://www.theguardian.com/world/2025/oct/12/cameroon-president-paul-biya-favourite-win-election",
    "image": "https://media.guim.co.uk/0573f48fbd220420f616585597f66132310ff88d/417_0_4167_3333/500.jpg",
    "summary": "Paul Biya, Cameroon’s president since 1982, continues to ignore growing calls for his retirement. Despite his prolonged tenure, he is frequently absent from public appearances. His leadership remains a point of contention amid increasing political pressure.",
    "published": "2025-10-12T04:00:42Z"
  },
  {
    "title": "My foolproof guide to living with a partner – and not falling out about home decor | Polly Hudson",
    "url": "https://www.theguardian.com/commentisfree/2025/oct/12/my-foolproof-guide-to-living-with-a-partner-and-not-falling-out-about-home-decor",
    "image": "https://media.guim.co.uk/fd83f46d990658bc49ae29ced5578bdea0bdc840/614_0_5727_4582/500.jpg",
    "summary": "Polly Hudson reflects on the little white lies in relationships, exemplified by her husband’s belief that she’s still searching for the perfect frame for his unattractive painting of Bobby Moore. She suggests that such subtle deceptions can contribute to the longevity of a marriage. Ultimately, these small compromises and shared understandings help maintain harmony in their lives together.",
    "published": "2025-10-12T04:00:42Z"
  },
  {
    "title": "What is the new EU border system EES, and how will it work?",
    "url": "https://www.theguardian.com/world/2025/oct/12/new-eu-new-border-system-ees-delays",
    "image": "https://media.guim.co.uk/6e4c60e5dfa5da80d0c21f577ec7ccd958349ad1/253_0_3779_3024/500.jpg",
    "summary": "A new digital entry and exit scheme will require most travelers to register their biometric information when crossing borders. This initiative aims to enhance security and streamline the immigration process. Implementation details and timelines have yet to be announced.",
    "published": "2025-10-12T04:00:41Z"
  },
  {
    "title": "Trump news at a glance: US troops will be paid despite shutdown, president claims",
    "url": "https://www.theguardian.com/us-news/2025/oct/12/trump-administration-news-updates-today",
    "image": "https://media.guim.co.uk/dbb5363bd94260dc1f45402ea80021b23ce3b793/2315_0_5877_4704/500.jpg",
    "summary": "Donald Trump announced that he has instructed the defense secretary to release funds on October 15. This development is part of ongoing key US political updates. The announcement comes amid various significant political stories emerging on October 11.",
    "published": "2025-10-12T01:16:12Z"
  }
]