[
  {
    "title": "Trump says ‘drug-carrying submarine’ was target of latest strike in the Caribbean – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/17/donald-trump-john-bolton-volodymyr-zelenskyy-us-politics-latest-news-updates",
    "image": "https://media.guim.co.uk/9bdfbd48afa99b834045461aeef122b0d9b2b99a/123_0_1788_1431/500.jpg",
    "summary": "The US president announced that a boat was intercepted carrying a significant quantity of drugs. Senator Marco Rubio indicated that more details would be released later today. The situation highlights ongoing efforts to combat drug trafficking.",
    "published": "2025-10-17T20:18:33Z"
  },
  {
    "title": "Trump claims Maduro willing to give ‘everything’ to ease US tensions",
    "url": "https://www.theguardian.com/world/2025/oct/17/trump-maduro-venezuela",
    "image": "https://media.guim.co.uk/a75cb03c10a2e2f3531fd34878d5bfdc77132511/442_0_4812_3849/500.jpg",
    "summary": "The U.S. President conveyed that his Venezuelan counterpart is cautious in dealings with the United States. He emphasized the seriousness of U.S. intentions. This statement reflects the tense political climate between the two nations.",
    "published": "2025-10-17T20:12:43Z"
  },
  {
    "title": "Corrections and clarifications",
    "url": "https://www.theguardian.com/news/2025/oct/17/corrections-and-clarifications",
    "summary": "Jamie and Mark Ball released Quick Cryptic Crossword No. 80, offering puzzle enthusiasts a new challenge. Alongside the crossword, they shared a delicious recipe featuring red peppers. The combination aims to engage readers with both mental stimulation and culinary inspiration.",
    "published": "2025-10-17T20:00:24Z"
  },
  {
    "title": "At least 11 detained after protesters and police clash outside Chicago Ice center",
    "url": "https://www.theguardian.com/us-news/2025/oct/17/ice-chicago-protesters-arrests-broadview-facility",
    "image": "https://media.guim.co.uk/1aa258563c0d6c5f61f65f2426ebf019b5a52c7e/333_0_3334_2667/500.jpg",
    "summary": "Officers clashed with demonstrators who were instructed to remain within designated \"protest zones.\" Several individuals were reportedly tackled and dragged by police during the confrontation. The incident highlights tensions between law enforcement and protesters during the demonstration.",
    "published": "2025-10-17T19:59:31Z"
  },
  {
    "title": "Trump hesitant about giving Tomahawks to Ukraine, saying ‘hopefully they won’t need it’ – live",
    "url": "https://www.theguardian.com/world/live/2025/oct/17/viktor-orban-vladimir-putin-volodymyr-zelenskyy-donald-trump-europe-latest-news-updates-russia-ukraine-war",
    "image": "https://media.guim.co.uk/260c5a1da7d86ee995515bf468e5a578e4cd4d02/448_0_3262_2611/500.jpg",
    "summary": "Ukrainian President Volodymyr Zelensky continues to urge for more weapons from the US amid ongoing conflict with Russia. However, US President Joe Biden emphasizes that supplying these weapons is complicated. Biden also asserts that Russian President Vladimir Putin is seeking an end to the war.",
    "published": "2025-10-17T19:58:33Z"
  }
]