[
  {
    "title": "Trump says US tried to warn Qatar of impending Israel strike but were ‘too late to stop the attack’ – Middle East crisis live",
    "url": "https://www.theguardian.com/world/live/2025/sep/09/israel-gaza-city-evacuation-order-idf-military-offensive-live-updates-middle-east-crisis-latest-news",
    "image": "https://media.guim.co.uk/194b78f6b7777ba65dde174e77716e009ae0bbba/117_0_1849_1479/500.jpg",
    "summary": "Qatar condemned a recent attack as a \"serious escalation,\" warning that it jeopardizes ongoing ceasefire efforts in Gaza. World leaders expressed concern over the strike on Doha, emphasizing its potential impact on peace initiatives. Hamas reported that six individuals were killed in the attack.",
    "published": "2025-09-09T23:23:27Z"
  },
  {
    "title": "News live: Australian government condemns Israel’s Qatar strikes; breakthrough vaccine to protect koalas from chlamydia",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/10/australia-news-live-nampijinpa-price-littleproud-pacific-albanese-indian-immigration-sussan-ley-coalition-liberal-labor-koala-park-nsw-ntwnfb",
    "image": "https://media.guim.co.uk/5daa99f1fb17d85be7ba3cc415885c8f2e76d60a/576_0_5741_4595/500.jpg",
    "summary": "Can you please provide the news you would like summarized?",
    "published": "2025-09-09T23:21:12Z"
  },
  {
    "title": "Show me the nipple-baring Ziggy knitwear! A tour inside David Bowie’s mind-boggling 90,000-item archive",
    "url": "https://www.theguardian.com/artanddesign/2025/sep/10/ziggy-david-bowie-archive-major-tom-aladdin-sane",
    "image": "https://media.guim.co.uk/7e535bcd378a11ba68807cde7445c7f10decebd8/202_938_4370_3491/500.jpg",
    "summary": "A collection of David Bowie memorabilia, including plans for a Major Tom movie, an Aladdin Sane mask, and unique artworks from fans, has been unveiled to the public. This exhibition promises a captivating experience for Bowie enthusiasts. It's being described as a \"freakiest show\" celebrating the iconic artist's legacy.",
    "published": "2025-09-09T23:01:56Z"
  },
  {
    "title": "Radical Harmony review – Seurat’s shimmering visions blow away his spotty dotty imitators",
    "url": "https://www.theguardian.com/artanddesign/2025/sep/10/radical-harmony-review-georges-seurat-national-gallery",
    "image": "https://media.guim.co.uk/f009016ca6f530e87395753b8ab454379a3e338d/51_55_2616_2109/500.jpg",
    "summary": "The exhibit on neo-impressionism, initiated by Georges Seurat, aims to explore its revolutionary impact. However, critics find the presentation lacking in the joyful brilliance typically associated with the movement. Overall, the showcase fails to capture the vibrant essence of neo-impressionism.",
    "published": "2025-09-09T23:01:56Z"
  },
  {
    "title": "Doctors trial £100 blood test that could transform how NHS detects Alzheimer’s ",
    "url": "https://www.theguardian.com/society/2025/sep/10/doctors-trial-blood-test-could-transform-nhs-alzheimers-diagnoses",
    "image": "https://media.guim.co.uk/f084d36537c556443c8c65f6e403ef66f61f5fc9/265_0_3288_2631/500.jpg",
    "summary": "A clinical trial involving over 1,000 patients is set to investigate a new approach aimed at achieving quicker and more accurate medical diagnoses. Researchers hope this method will enhance diagnostic efficiency and reliability. The trial's findings could significantly impact patient care and treatment outcomes.",
    "published": "2025-09-09T23:01:55Z"
  }
]