[
  {
    "title": "Australia news live: Liberal senator’s remarks about Ley ‘unhelpful’ and ‘undisciplined’, colleague says; tributes flow for John Laws",
    "url": "https://www.theguardian.com/australia-news/live/2025/nov/10/australia-news-live-john-laws-radio-social-media-age-ban-reserve-bank-pauline-hanson-sussan-ley-anthony-albanese-net-zerontwnfb",
    "image": "https://media.guim.co.uk/9ed318f8f79eae512f0ffa5347e3a916ef513297/975_202_6142_4916/500.jpg",
    "summary": "I'm unable to summarize without specific content to reference. Please provide details or text from the news you'd like summarized.",
    "published": "2025-11-09T21:14:58Z"
  },
  {
    "title": "NFL week 10: Bucs v Patriots, Vikings v Ravens, Colts edge Falcons in Berlin and more – live",
    "url": "https://www.theguardian.com/sport/live/2025/nov/09/nfl-week-10-live-vikings-ravens-jets-browns-dolphins-bills-live",
    "image": "https://media.guim.co.uk/d5c1f8a62be82bb67d11e0f16d3024f8379e2d49/944_0_5062_4050/500.jpg",
    "summary": "Indianapolis secured a dramatic overtime victory against Atlanta, thanks to a touchdown from Jonathan Taylor. Following this game, seven NFL matchups are set to begin at 6 PM UK time. Fans are gearing up for an exciting slate of football action.",
    "published": "2025-11-09T21:13:52Z"
  },
  {
    "title": "Dazzling Doku weaves his magic to spark Manchester City’s title charge | Barney Ronay",
    "url": "https://www.theguardian.com/football/2025/nov/09/jeremy-doku-pep-guardiola-manchester-city-liverpool-premier-league",
    "image": "https://media.guim.co.uk/87bc5d5d5c26145e31f854a70d027ade6d4d7e23/346_98_3128_2502/500.jpg",
    "summary": "The winger delivered an electrifying performance that overshadowed top players, contributing significantly to Liverpool's struggles. This display likely marks the end of Liverpool's title defense hopes. The match showcased the winger's impact on the game's outcome.",
    "published": "2025-11-09T21:04:46Z"
  },
  {
    "title": "Corrections and clarifications ",
    "url": "https://www.theguardian.com/news/2025/nov/09/corrections-and-clarifications1",
    "summary": "British Airways has announced new initiatives aimed at enhancing passenger experience and sustainability. The airline plans to upgrade its fleet and invest in greener technologies. These measures align with the company's commitment to reducing its carbon footprint while improving overall service quality.",
    "published": "2025-11-09T21:00:41Z"
  },
  {
    "title": "Strictly Come Dancing: week seven results – as it happened",
    "url": "https://www.theguardian.com/tv-and-radio/live/2025/nov/08/strictly-come-dancing-week-seven-live",
    "image": "https://media.guim.co.uk/ed7b0b577860b6d63c39a750138c68074199792e/584_196_3562_2850/500.jpg",
    "summary": "Vicky Pattison's impressive tango earned the highest scores, while Balvinder Sopal infused the ballroom with a Bollywood style. La Voix struggled with a disappointing foxtrot, landing at the bottom of the leaderboard. The competition raises questions about who will be eliminated at this mid-season point.",
    "published": "2025-11-09T20:33:47Z"
  }
]