[
  {
    "title": "Labour accused of ‘stitch-up’ over deputy leadership election contest – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/08/labour-deputy-leadership-election-contest-keir-starmer-angela-rayner-uk-politics-live",
    "image": "https://media.guim.co.uk/39f92301e527afd5bbde41a40d33459f21d88a0e/0_62_4129_3304/500.jpg",
    "summary": "Former minister Louise Haigh has joined the call for an \"economic reset\" amid reports that candidates will have just four days to secure nominations from MPs. This push highlights the urgency for a strategic economic overhaul as political dynamics shift. The tight timeframe for nominations adds pressure to prospective candidates in the upcoming election.",
    "published": "2025-09-08T09:33:02Z"
  },
  {
    "title": "Commuter misery deepens as TfL website crashes on first day of tube strikes; gold breaks through $3,600 – business live",
    "url": "https://www.theguardian.com/business/live/2025/sep/08/chinese-export-growth-slowest-six-months-shipments-us-fall-amid-tariff-tensions-oil-prices-climb-business-live",
    "image": "https://media.guim.co.uk/27f3e571cc7ddb16381049ef3173c3a889bb528c/826_0_4142_3315/500.jpg",
    "summary": "A major series of strikes in London is causing almost complete disruption to tube train services, which are expected to remain halted until Friday. Meanwhile, shipments from Beijing to the U.S. have decreased significantly, with a 33% drop reported in August. These events highlight ongoing challenges in transportation and trade between the two cities.",
    "published": "2025-09-08T09:32:30Z"
  },
  {
    "title": "Leicestershire v Gloucestershire, Somerset v Yorkshire and more: county cricket – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/08/county-championship-cricket-surrey-warwickshire-somerset-yorkshire-live",
    "image": "https://media.guim.co.uk/b6d442410dab7c1ed66ed107304030f9d8ffb908/0_0_4940_3953/500.jpg",
    "summary": "Tanya Aldred brings day-one updates as the County Championship resumes after a month-long hiatus. Fans can expect coverage of matches and key moments from various grounds. Stay tuned for exciting cricket action as teams compete for victory.",
    "published": "2025-09-08T09:31:44Z"
  },
  {
    "title": "Five people killed in Jerusalem shooting; Israel threatens Gaza City with ‘powerful hurricane’ – Middle East crisis live",
    "url": "https://www.theguardian.com/world/live/2025/sep/08/middle-east-crisis-live-jerusalem-shooting-israel-threatens-gaza-city-powerful-hurricane-latest-news",
    "image": "https://media.guim.co.uk/8f08c5ac32cba1a7bbe727134e644e7c9349a662/597_0_4917_3933/500.jpg",
    "summary": "Israel's defense minister, Israel Katz, has issued a warning about an impending significant military action targeting Gaza City. He described the operation as a \"powerful hurricane,\" indicating a potentially massive impact. The statement foreshadows heightened tensions and significant developments in the region.",
    "published": "2025-09-08T09:24:40Z"
  },
  {
    "title": " Spanish PM Pedro Sánchez says Israel is ‘exterminating a defenceless people’",
    "url": "https://www.theguardian.com/world/2025/sep/08/spanish-pm-pedro-sanchez-israel-exterminating-defenceless-people-gaza",
    "image": "https://media.guim.co.uk/4313c56213611707c042fa8ec2dcdf8c18a2d760/0_1143_4024_3217/500.jpg",
    "summary": "Spain has introduced a series of measures aimed at intensifying pressure on Israeli Prime Minister Benjamin Netanyahu to bring an end to the conflict in Gaza. These measures reflect Spain's commitment to addressing the humanitarian crisis and advocating for a ceasefire. The initiative is part of broader international efforts to resolve the ongoing violence and promote peace in the region.",
    "published": "2025-09-08T09:20:34Z"
  }
]