[
  {
    "title": "Minister insists government will get asylum seekers out of hotels and expects progress ‘within weeks’ - UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/oct/27/asylum-hotel-report-steve-reed-wes-streeting-epping-offender-prison-news-updates-politics-live",
    "image": "https://media.guim.co.uk/9d4a42ce80644989a81cbb39ffbadb938db963a8/145_665_2796_2238/500.jpg",
    "summary": "The Housing Secretary advocates for the use of purpose-built modular structures on sites such as former military bases to address the housing crisis. This approach aims to reduce the dependency on temporary hotel accommodations. The initiative is part of a broader strategy to improve housing availability and sustainability.",
    "published": "2025-10-27T12:41:55Z"
  },
  {
    "title": "Lithuania closes border with Belarus after balloons shut down Vilnius airport – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/oct/27/lithuania-airport-russia-belarus-viktor-orban-pope-leo-europe-live-news-updates",
    "image": "https://media.guim.co.uk/b480f3dd6d296cd4a68952ce66d5416834f239b0/628_0_4098_3278/500.jpg",
    "summary": "Lithuanian Prime Minister stated that the country will not tolerate any hybrid attacks, vowing to take decisive action against threats. Following the detection of 66 unidentified objects by radar overnight, he pledged to shoot down any balloons identified as potential risks. This response highlights Lithuania's commitment to national security amid rising tensions.",
    "published": "2025-10-27T12:40:58Z"
  },
  {
    "title": "Lithuania authorises shooting down of smuggling balloons from Belarus",
    "url": "https://www.theguardian.com/world/2025/oct/27/lithuania-authorises-shooting-down-of-smuggling-balloons-from-belarus",
    "image": "https://media.guim.co.uk/4bfca4d0747bedd5fa74833fc4ee69e701036c22/62_0_1900_1520/500.jpg",
    "summary": "Lithuanian Prime Minister described recent incursions as \"hybrid attacks,\" leading to heightened security concerns. As a result, Vilnius airport experienced four closures last week. The situation underscores escalating tensions in the region.",
    "published": "2025-10-27T12:38:58Z"
  },
  {
    "title": "Denouement review – darkly funny reckoning with relationship dystopia",
    "url": "https://www.theguardian.com/stage/2025/oct/27/denouement-review-lyric-belfast",
    "image": "https://media.guim.co.uk/865eb5c6f8cc7f3c0eff5a58d8872c03f36fd4b2/418_0_4560_3648/500.jpg",
    "summary": "Anna Healy and Patrick O’Kane deliver compelling performances as a tumultuous, long-married couple trapped in a cottage consumed by fire. The play explores their complex relationship dynamics amid escalating tension. The setting serves as a powerful backdrop for their emotional struggles.",
    "published": "2025-10-27T12:29:53Z"
  },
  {
    "title": "Hurricane Melissa strengthens to category 5 and heads for Jamaica amid warning ‘many communities will not survive flooding’ – live",
    "url": "https://www.theguardian.com/world/live/2025/oct/27/hurricane-melissa-jamaica-cuba-caribbean-haiti-dominican-republic-live-news-latest-updates",
    "image": "https://media.guim.co.uk/4d630391f43393014f939f3c3397abf8d0898a02/121_244_2800_2240/500.jpg",
    "summary": "Jamaicans are being urged to seek shelter immediately due to impending severe weather threats. Neighboring countries, including Cuba, Haiti, and the Dominican Republic, are also at risk. Authorities are taking precautions to ensure the safety of residents in affected areas.",
    "published": "2025-10-27T12:28:15Z"
  }
]