[
  {
    "title": "Australian politics live: Tony Abbott suggests UK put migrants in English channel ‘mothership’; free summer weekend transport in Victoria",
    "url": "https://www.theguardian.com/australia-news/live/2025/oct/08/australia-politics-live-gaza-rally-parliament-anthony-albanese-sussan-ley-question-time-andrew-hastie-ntwnfb",
    "image": "https://media.guim.co.uk/72e7e451768536ebd93cb031499e369acbe1498e/167_0_3333_2667/500.jpg",
    "summary": "I’m sorry, but I need more context or details about the news you'd like summarized. Please provide the content or main points you'd like me to summarize, and I'll be happy to help!",
    "published": "2025-10-07T23:07:49Z"
  },
  {
    "title": "Oregon’s governor says she told Kristi Noem ‘there is no insurrection in Oregon’ – live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/07/donald-trump-national-guard-pam-bondi-mark-carney-government-shutdown-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/ce2d02a899104554aaec733305cd5c424543c446/380_0_5417_4335/500.jpg",
    "summary": "Oregon Governor Tina Kotek stated that she requested a meeting with the Homeland Security Secretary prior to visiting the ICE field office in Portland. Her visit highlights concerns about immigration enforcement and the impact on local communities. Kotek's proactive approach underscores the importance of dialogue between state and federal officials on these issues.",
    "published": "2025-10-07T23:05:06Z"
  },
  {
    "title": "Mamdani’s statement on October 7 anniversary draws ire from Israel ",
    "url": "https://www.theguardian.com/us-news/2025/oct/07/zohran-mamdani-statement-october-7-anniversary",
    "image": "https://media.guim.co.uk/efd989d628b29f44952ab3d519b0f3f121a5e4b0/499_0_5017_4016/500.jpg",
    "summary": "A New York City mayoral candidate faces backlash for honoring both Israeli and Palestinian victims of conflict. Critics argue that the move is tone-deaf amid ongoing tensions. Supporters maintain it's a necessary acknowledgment of all lives lost.",
    "published": "2025-10-07T23:02:42Z"
  },
  {
    "title": "Cecil Beaton’s Fashionable World review – a narrow view of beauty from a borderline stalker",
    "url": "https://www.theguardian.com/artanddesign/2025/oct/08/cecil-beatons-fashionable-world-review-national-portrait-gallery-king-vogue",
    "image": "https://media.guim.co.uk/198b41f068adf13a9e6ae6134f717a100278198a/150_125_8429_6744/500.jpg",
    "summary": "The article critiques the 'King of Vogue' as a social climber, highlighting the limited and insular nature of his world. Despite this, it acknowledges that his backdrops are often more captivating than the individuals featured. Overall, it presents a mixed view of his work, emphasizing the appeal of the settings over the subjects.",
    "published": "2025-10-07T23:01:16Z"
  },
  {
    "title": "One in three UK workers have called in sick after work drinks, survey finds",
    "url": "https://www.theguardian.com/society/2025/oct/08/one-in-three-uk-workers-have-called-in-sick-after-work-drinks-survey-finds",
    "image": "https://media.guim.co.uk/4af3968da7c0ba9e56208625f7fa0b8e19360312/212_0_6139_4912/500.jpg",
    "summary": "The IPPR report highlights a looming 'productivity crisis' in the UK, emphasizing that many businesses are failing to adapt to generational shifts. It notes that Gen Z is increasingly moving away from alcohol consumption, affecting workplace culture and productivity. The report urges companies to realign their practices to meet the changing preferences of younger workers.",
    "published": "2025-10-07T23:01:09Z"
  }
]