[
  {
    "title": "Cooper suggests asylum seekers could be moved into warehouses instead of hotels – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/02/cooper-reeves-starmer-green-party-leader-badenoch-devolution-latest-updates",
    "image": "https://media.guim.co.uk/8ee5a1769d35cd81cec92d15a8ed308a2c6e691e/328_0_3445_2756/500.jpg",
    "summary": "The Home Secretary announced the government's plan to reduce the size of the asylum system. They are considering military and industrial sites as potential accommodations for asylum seekers. This strategy aims to streamline processes and manage resources more effectively.",
    "published": "2025-09-02T10:40:56Z"
  },
  {
    "title": "UK long-term borrowing costs reach 27-year high in pre-budget blow for Labour, as the pound slides – business live",
    "url": "https://www.theguardian.com/business/live/2025/sep/02/uk-long-term-borrowing-costs-27-year-high-gold-silver-inflation-business-live-news-updates",
    "image": "https://media.guim.co.uk/e33d07dd27d69afd62d493dfc3b45e781ee7d390/582_0_5839_4672/500.jpg",
    "summary": "The latest financial news highlights significant developments in the global economy, including market fluctuations, interest rate changes, and economic indicators. Analysts are closely monitoring the impact of policy decisions on inflation and growth prospects. Key sectors are reacting to updates on trade and investment, shaping investor sentiment.",
    "published": "2025-09-02T10:40:03Z"
  },
  {
    "title": "Billy Bragg releases song in support of Palestine and Greta Thunberg aid flotilla",
    "url": "https://www.theguardian.com/music/2025/sep/02/billy-bragg-releases-song-hundred-year-hunger-in-support-of-palestine-and-aid-flotilla-greta-thunberg-gaza",
    "image": "https://media.guim.co.uk/70d19aad20b82b7bd3989b224914a39d357da2fc/577_0_5168_4137/500.jpg",
    "summary": "British protest singer has released \"Hundred Year Hunger,\" featuring a chorus in Arabic, to coincide with a humanitarian aid flotilla headed for Gaza. The song highlights the ongoing struggles faced by the region. It aims to raise awareness and support for those affected by the crisis.",
    "published": "2025-09-02T10:40:02Z"
  },
  {
    "title": "Belgium to recognise Palestinian state at UN and sanction Israel – Middle East crisis live",
    "url": "https://www.theguardian.com/world/live/2025/sep/02/middle-east-crisis-israel-gaza-palestine-un-belgium-live-news-updates",
    "image": "https://media.guim.co.uk/6e91d70261e19e5f28df210b67e6d327ed450be9/192_0_1666_1333/500.jpg",
    "summary": "The foreign minister clarified that recent actions are not directed against the Israeli population but are intended to hold the Israeli government accountable for adhering to international and humanitarian laws. The statement emphasizes the importance of legal compliance over political sentiments. The official aims to differentiate between the government and its citizens in addressing concerns about human rights and legality.",
    "published": "2025-09-02T10:38:01Z"
  },
  {
    "title": "Congress returns after recess as threat of government shutdown looms – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/02/congress-returns-government-shutdown-funding-trump-announcement-us-politics-live-latest-updates",
    "image": "https://media.guim.co.uk/276e89e5bbfb1be132fdf4bccd4d9255d61cc01f/800_0_6388_5110/500.jpg",
    "summary": "Republicans and Democrats are struggling to reach an agreement on funding issues. Meanwhile, Donald Trump is scheduled to make a surprise announcement from the Oval Office later today. The political standoff raises tensions as both parties seek resolution.",
    "published": "2025-09-02T10:36:44Z"
  }
]