[
  {
    "title": "Charlie Kirk shooting latest: search for shooting suspect continues as FBI asks public for help",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/11/charlie-kirk-shot-latest-news-updates-utah-university-donald-trump",
    "image": "https://media.guim.co.uk/76c0230ab358372bf02a0a59e55b7ea5d8ab10ca/0_399_1092_873/500.jpg",
    "summary": "The FBI has released images of a shooting suspect and is offering a $100,000 reward for information leading to their capture. Turning Point USA released a statement affirming that Charlie Kirk's legacy will endure. The incidents highlight ongoing concerns about violence and the influence of prominent figures.",
    "published": "2025-09-11T20:28:11Z"
  },
  {
    "title": "Paramount Skydance reportedly preparing takeover bid for Warner Bros Discovery ",
    "url": "https://www.theguardian.com/business/2025/sep/11/paramount-skydance-warner-bros-discovery",
    "image": "https://media.guim.co.uk/8b36b77046b491d8894ad5fad77946f2b6f93fcc/0_0_2916_2333/500.jpg",
    "summary": "A media conglomerate is reportedly structuring a majority cash offer for Warner Bros. Discovery (WBD), with financial backing from the affluent Ellison family. This strategic move reflects the ongoing consolidation in the media industry. Details of the offer are still emerging as talks progress.",
    "published": "2025-09-11T20:20:34Z"
  },
  {
    "title": "Terence Crawford: from a bullet’s glancing blow to boxing’s biggest stage",
    "url": "https://www.theguardian.com/sport/2025/sep/11/terence-crawford-profile-canelo-alvarez-fight",
    "image": "https://media.guim.co.uk/8f719c934bb59b4145c5d4a5eff954d1bd58a6ed/379_0_3777_3023/500.jpg",
    "summary": "Terence Crawford's journey from a near-fatal shooting in Omaha to pursuing a fight with Canelo Álvarez in Las Vegas highlights his resilience and skill in boxing. His story reflects a remarkable transformation and determination to succeed. Crawford is not only building his legacy but also inspiring others with his experiences.",
    "published": "2025-09-11T20:01:15Z"
  },
  {
    "title": "Corrections and clarifications",
    "url": "https://www.theguardian.com/news/2025/sep/11/corrections-and-clarifications",
    "summary": "\"Gianfranco Rosi: Born With Teeth\" is a documentary that explores the life and work of the acclaimed filmmaker Gianfranco Rosi, known for his unique storytelling and cinematographic style. The film delves into Rosi's influences, creative process, and the themes that permeate his documentaries. It highlights his personal journey alongside the broader context of his contributions to contemporary cinema.",
    "published": "2025-09-11T20:00:15Z"
  },
  {
    "title": "Canada: Carney unveils array of national projects to ‘turbocharge’ economy",
    "url": "https://www.theguardian.com/world/2025/sep/11/canada-mark-carney-national-projects-economy",
    "image": "https://media.guim.co.uk/c227a5d84322a747404caa39c6e94308257902e7/333_0_3333_2667/500.jpg",
    "summary": "A recent list prioritizes the expansion of liquefied natural gas (LNG), mining projects, and nuclear power, while excluding oil pipelines. The focus on these sectors comes as efforts to navigate challenges stemming from a trade war with the US. The strategy reflects a shift toward energy diversification and resilience in the face of external pressures.",
    "published": "2025-09-11T19:51:37Z"
  }
]