[
  {
    "title": "World Cup qualifiers, WSL updates and football news – matchday live",
    "url": "https://www.theguardian.com/football/live/2025/oct/12/world-cup-qualifiers-wsl-updates-and-football-news-matchday-live",
    "image": "https://media.guim.co.uk/64ce8b500facbcfae5885d211674993017fec172/0_0_5000_4000/500.jpg",
    "summary": "Emillia Hawkins will lead a buildup and discussion session before the day's events commence. Her coverage aims to provide insights and analysis for viewers. Tune in for a comprehensive overview and expert commentary.",
    "published": "2025-10-12T07:12:44Z"
  },
  {
    "title": "Parliamentary staff of colour earn £2,000 less than white colleagues, study suggests",
    "url": "https://www.theguardian.com/inequality/2025/oct/12/parliamentary-staff-of-colour-earn-2000-less-than-white-colleagues-study-suggests",
    "image": "https://media.guim.co.uk/71ef600428451279f76b08ac2123adcaf3932862/304_244_5811_4649/500.jpg",
    "summary": "A report by the GMB union reveals significant pay disparities, highlighting inequalities faced by women, disabled individuals, and LGBTQ+ staff, including trans and non-binary employees. The findings emphasize the urgent need for organizations to address these disparities to promote fair compensation practices. This report underscores ongoing issues of wage inequality within the workforce.",
    "published": "2025-10-12T07:00:47Z"
  },
  {
    "title": "It can get worse: Blackpool’s latest defeat recalls Mick McCarthy meme",
    "url": "https://www.theguardian.com/football/2025/oct/12/stockport-1-0-blackpool-relegation-fears-after-steve-bruce-sacking",
    "image": "https://media.guim.co.uk/7ea3077e805d7b24ea12f60dd8f98e05912f207c/287_88_2522_2018/500.jpg",
    "summary": "Blackpool began the season with optimism under manager Steve Bruce, but currently find themselves without a manager. They are facing a challenging situation, sitting second from the bottom in League One. Their recent defeat at Stockport has exacerbated their struggles.",
    "published": "2025-10-12T07:00:47Z"
  },
  {
    "title": "Do you really need to buy a new laptop? When to upgrade – and when to hold off",
    "url": "https://www.theguardian.com/thefilter/2025/oct/12/do-you-need-new-laptop-how-to-get-the-most-out-of-current",
    "image": "https://media.guim.co.uk/1996a233eb72f1f3a73a319eeda070434d2ecae2/0_0_5000_4000/500.jpg",
    "summary": "Many users may not need to purchase a new laptop, as their current devices often still have untapped potential. Simple upgrades or software optimizations can enhance performance and extend usability. Evaluating your laptop's capabilities before spending on a new one is advisable.",
    "published": "2025-10-12T07:00:46Z"
  },
  {
    "title": "Parents who film their children crying for clicks should take a good look at themselves | Rhiannon Lucy Cosslett",
    "url": "https://www.theguardian.com/commentisfree/2025/oct/12/parents-children-cry-clicks-big-feelings-tantrums",
    "image": "https://media.guim.co.uk/6d6f2f64f4378b4badcfb0d12e4f509c0ba8891c/377_0_3286_2629/500.jpg",
    "summary": "Guardian columnist Rhiannon Lucy Cosslett argues that sharing toddlers' tantrums and emotional struggles on social media is not a constructive teaching moment. Instead, she deems it a cruel act that exploits children's vulnerabilities. Cosslett emphasizes the importance of protecting young children's emotional experiences from public scrutiny.",
    "published": "2025-10-12T07:00:46Z"
  }
]