[
  {
    "title": "US Open tennis 2025: Aryna Sabalenka v Amanda Anisimova, women’s singles final – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/06/us-open-tennis-2025-aryna-sabalenka-amanda-anisimova-womens-singles-final-live",
    "image": "https://media.guim.co.uk/d149d3da034522cf921d10822d380128ae09328b/500_0_5000_4000/500.jpg",
    "summary": "Aryna Sabalenka aims to defend her title, while Amanda Anisimova seeks to overcome her past struggles at Wimbledon. Katy Murrells provides live updates on their performances. The stage is set for an exciting match as both players compete with high stakes.",
    "published": "2025-09-06T20:29:39Z"
  },
  {
    "title": "More than 425 arrested as protesters defy ban on Palestine Action in London",
    "url": "https://www.theguardian.com/world/2025/sep/06/police-make-arrests-at-london-palestine-action-ban-protest",
    "image": "https://media.guim.co.uk/40ff905602d310caa852b5ad1164891375b05311/298_0_4773_3819/500.jpg",
    "summary": "Police reported that 1,500 individuals gathered in Parliament Square despite a ban, leading to incidents of assault and support for a proscribed group. The authorities are addressing various offenses stemming from the protest. The situation highlights ongoing tensions surrounding the prohibited assembly.",
    "published": "2025-09-06T20:27:29Z"
  },
  {
    "title": "Red Roses must relish unfamiliar pressure in quest for World Cup glory",
    "url": "https://www.theguardian.com/sport/2025/sep/06/england-australia-womens-rugby-world-cup-analysis",
    "image": "https://media.guim.co.uk/ef09f2bca60f5dda92176000e3c86d718d9ba98d/389_0_4726_3780/500.jpg",
    "summary": "In a thrilling Test match, England trailed Australia on the scoreboard for the first time in over eight hours of play. The game showcased intense competition as both teams battled for dominance. This key moment marked a significant shift in momentum during the match.",
    "published": "2025-09-06T20:11:46Z"
  },
  {
    "title": "Blur’s Dave Rowntree: ‘People think music was better in the old days, to which I say: bollocks!’",
    "url": "https://www.theguardian.com/culture/2025/sep/07/blur-drummer-dave-rowntree-interview-britpop-music-not-better-old-days",
    "image": "https://media.guim.co.uk/47ed6cadb89dac0fdd1f5f1b7f59c4b5ffcc60fa/517_0_5600_4480/500.jpg",
    "summary": "The drummer from a prominent Britpop band discusses his relationship with Oasis, clarifying they are not his rivals. He reflects on his unsuccessful attempt to become a Labour MP in the UK. Additionally, he shares his journey of overcoming challenges in mastering mathematics.",
    "published": "2025-09-06T20:00:03Z"
  },
  {
    "title": "NSW locks in great koala national park and brings in immediate ban on logging",
    "url": "https://www.theguardian.com/australia-news/2025/sep/07/nsw-locks-in-great-koala-national-park-and-brings-in-immediate-ban-on-logging",
    "image": "https://media.guim.co.uk/fe56e1a0c2b9562fd350ec853793e43a6034db86/1000_0_5000_4000/500.jpg",
    "summary": "The Minns government is set to establish one of the largest national parks in the state, marking a significant win for forest advocates. This initiative is celebrated as a historic achievement in conservation efforts. The new national park aims to protect vital ecosystems and promote biodiversity.",
    "published": "2025-09-06T20:00:03Z"
  }
]