[
  {
    "title": "Everton v West Ham United: Premier League – live",
    "url": "https://www.theguardian.com/football/live/2025/sep/29/everton-v-west-ham-premier-league-live",
    "image": "https://media.guim.co.uk/8643d015b234a06ee24aa9ae5370b3a7888922df/357_124_2710_2168/500.jpg",
    "summary": "Nuno Espírito Santo is set to start his tenure as West Ham manager facing David Moyes' team at Hill Dickinson Stadium. The match will be reported on in real-time by Daniel Harris. Fans can follow the detailed coverage of the game as it unfolds.",
    "published": "2025-09-29T20:18:29Z"
  },
  {
    "title": "US whistleblowers say they were fired for raising fair housing concerns",
    "url": "https://www.theguardian.com/us-news/2025/sep/29/us-housing-department-hud-whistleblowers",
    "image": "https://media.guim.co.uk/174a6a2acd77e35e6ec772456065b0516e4b93a3/999_0_5001_4000/500.jpg",
    "summary": "Attorneys in Hudson argue that dismissals of discrimination cases highlight a lack of commitment to fighting discrimination under the Trump administration. They describe the actions as \"as blatant as can be,\" emphasizing their concern over the implications for justice and civil rights. The attorneys are advocating for a stronger focus on addressing discrimination.",
    "published": "2025-09-29T20:12:41Z"
  },
  {
    "title": "Trump demands Hamas accept US plan to ‘end Gaza conflict’ as Netanyahu says Israel will ‘finish the job’ if they don’t",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/29/donald-trump-benjamin-netanyahu-gaza-white-house-us-politics-live",
    "image": "https://media.guim.co.uk/f6855d1ff0f1594a3d9aba5cbb5ee09ac76df1ca/473_0_3985_3188/500.jpg",
    "summary": "Israeli Prime Minister Netanyahu expressed his support for Trump's proposed peace plan regarding Gaza. However, he emphasized that Hamas must also agree to the proposal for it to be effective. The situation remains contingent on Hamas' response to the plan.",
    "published": "2025-09-29T20:11:14Z"
  },
  {
    "title": "Bryan Kneale obituary",
    "url": "https://www.theguardian.com/artanddesign/2025/sep/29/bryan-kneale-obituary",
    "image": "https://media.guim.co.uk/833c06061b3d4a33ac20e9b62807952f4bc7a46c/255_0_2491_1993/500.jpg",
    "summary": "An artist and teacher known for starting as a painter has transitioned into sculpting, creating elegant abstract works. Their artistic journey reflects a dedication to exploring different mediums. The artist's contributions continue to inspire both students and art enthusiasts alike.",
    "published": "2025-09-29T20:05:24Z"
  },
  {
    "title": "‘Look into the details’: Arne Slot says new Liverpool full-backs not to blame for defensive lapses",
    "url": "https://www.theguardian.com/football/2025/sep/29/look-into-the-details-arne-slot-says-new-liverpool-full-backs-not-to-blame-for-defensive-lapses",
    "image": "https://media.guim.co.uk/e284ab12ecb06d79e82363cd1984441064f4e06a/0_165_4919_3935/500.jpg",
    "summary": "The Reds will play against Galatasaray in the Champions League on Tuesday, looking to bounce back from their recent loss to Crystal Palace. The team faces scrutiny as they aim to improve their performance. This match presents an opportunity to regain momentum in the tournament.",
    "published": "2025-09-29T20:03:31Z"
  }
]