[
  {
    "title": "Zelenskyy says Russia launched 500 drones and 40 missiles in ‘vile attack’ on Ukraine – Ukraine war live",
    "url": "https://www.theguardian.com/world/live/2025/sep/28/ukraine-russia-war-volodymyr-zelenskyy-vladimir-putin-nato-europe-latest-live-news-updates",
    "image": "https://media.guim.co.uk/e68cf9bc3dcc5937c2a7120ff544d888f723da7b/712_330_1503_1202/500.jpg",
    "summary": "A twelve-year-old girl was among the casualties in Kyiv following recent Russian strikes, which have been condemned by Ukraine's president as \"brutal.\" The attacks underscore the ongoing conflict and the tragic impact on civilians. Ukraine continues to call for international support in the face of such violence.",
    "published": "2025-09-28T09:16:22Z"
  },
  {
    "title": "Newcastle v Arsenal buildup, Barcelona in action, WSL and more – matchday live",
    "url": "https://www.theguardian.com/football/live/2025/sep/28/newcastle-v-arsenal-buildup-barcelona-in-action-wsl-and-more-matchday-live",
    "image": "https://media.guim.co.uk/b6d3fa4a2eaa9fc15a3722ae8f8004fbdd325e57/0_0_5000_4000/500.jpg",
    "summary": "Today's football highlights include a significant match at St James' Park, a packed schedule in the Women's Super League, and Barcelona's efforts to maintain their position in La Liga. Join the discussion to delve into these key games and performances. Stay updated on all the action!",
    "published": "2025-09-28T09:15:42Z"
  },
  {
    "title": "Starmer calls Reform UK’s indefinite leave to remain plans ‘racist’ and says Farage’s party would ‘tear country apart’ – Labour conference live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/28/labour-conference-keir-starmer-latest-uk-politics-news-live-updates",
    "image": "https://media.guim.co.uk/278884c7175aa9e0168f0cf2237632369f74848c/237_0_3750_3000/500.jpg",
    "summary": "The Prime Minister has criticized the Reform party's policy as immoral, expressing concern over its implications. However, he acknowledged that those supporting the party are not inherently racist but are instead expressing frustration with the current political climate. This highlights a divide in public sentiment regarding immigration and governance.",
    "published": "2025-09-28T09:10:41Z"
  },
  {
    "title": "In an era of AI slop and mid TV, is it time for cultural snobbery to make a comeback?",
    "url": "https://www.theguardian.com/tv-and-radio/2025/sep/28/cultural-snobbery-too-much-studio-rogen-house-of-the-dragon",
    "image": "https://media.guim.co.uk/c0a9a567bec551550e4c34cd41f38f2838ce7c97/0_0_709_567/500.jpg",
    "summary": "Lowbrow culture prevails, often dismissing critics as elitists. The increasing prevalence of bland algorithm-driven content raises concerns about the quality of art consumers engage with. This situation suggests it's time for consumers to reconsider the value and depth of the art they consume.",
    "published": "2025-09-28T09:00:07Z"
  },
  {
    "title": "Populist threat to rule of law a danger to UK working class, says attorney general",
    "url": "https://www.theguardian.com/politics/2025/sep/28/labour-richard-hermer-attorney-general-populist-danger-rule-of-law-uk-working-class",
    "image": "https://media.guim.co.uk/5b7c206020ffb7f17b01ea48a0faa1176019eb4e/616_88_3603_2883/500.jpg",
    "summary": "Richard Hermer plans to direct criticism towards Nigel Farage and Robert Jenrick during a Labour conference event. His remarks are expected to highlight political issues and challenge their positions. This event will serve as a platform for Hermer to address key concerns within the party.",
    "published": "2025-09-28T08:00:06Z"
  }
]