[
  {
    "title": "Can anyone challenge the Sinner-Alcaraz supremacy? ATP Finals will reveal all",
    "url": "https://www.theguardian.com/sport/2025/nov/08/can-anyone-challenge-the-sinner-alcaraz-supremacy-atp-finals-will-reveal-all",
    "image": "https://media.guim.co.uk/267c3cb28b19da6b7c0330956b2891be54b1945c/180_0_4758_3807/500.jpg",
    "summary": "The leading two players are significantly ahead of their competitors, making it unlikely for any outsider to secure a victory in Turin. Their dominant performance has established a clear gap in the competition. As a result, the chances of an upset appear slim.",
    "published": "2025-11-09T09:14:59Z"
  },
  {
    "title": "Liverpool travel to Manchester City, Premier League buildup and more – matchday live",
    "url": "https://www.theguardian.com/football/live/2025/nov/09/liverpool-travel-to-manchester-city-premier-league-buildup-and-more-matchday-live",
    "image": "https://media.guim.co.uk/66cda8a0623858319074a7d0ea823f4a72958e16/0_0_5000_4000/500.png",
    "summary": "Join us for a pre-game news segment featuring discussions and previews of the day's events before they kick off. Stay informed and engaged with insights and anticipations. Don't miss out on the latest updates!",
    "published": "2025-11-09T09:04:16Z"
  },
  {
    "title": "America’s men’s grand slam drought is not Taylor Fritz’s burden to carry",
    "url": "https://www.theguardian.com/sport/2025/nov/09/tennis-taylor-fritz-chris-fowler-us-open-drought-analysis",
    "image": "https://media.guim.co.uk/41037fe103c044c191c336986973e0f951ef8fdf/511_0_2543_2035/500.jpg",
    "summary": "Fritz returns to the ATP Finals a year after finishing as a runner-up, reaffirming his status as a top-five talent. His presence serves as a reminder that he is not solely responsible for the ongoing major-title drought. He continues to be a strong competitor in the tournament.",
    "published": "2025-11-09T09:00:28Z"
  },
  {
    "title": "Anthony Barry: ‘The England jersey should feel like a cape, not body armour’",
    "url": "https://www.theguardian.com/football/2025/nov/09/england-coach-anthony-barry-thomas-tuchel-world-cup-football",
    "image": "https://media.guim.co.uk/68d949f1414ee31d6d08350481dfc4b0ebb80629/275_57_3092_2476/500.jpg",
    "summary": "The assistant coach is employing psychological, tactical, and physical profiling techniques to enhance the performance of Thomas Tuchel's England team at the World Cup. This approach aims to provide the team with a competitive advantage. The focus is on optimizing player strengths and strategies in preparation for the tournament.",
    "published": "2025-11-09T09:00:27Z"
  },
  {
    "title": "Arundell has god-given talents – it would be a dereliction of duty not to harness them | Gerard Meagher",
    "url": "https://www.theguardian.com/sport/2025/nov/09/arundell-has-god-given-talents-it-would-be-a-dereliction-of-duty-not-to-harness-them",
    "image": "https://media.guim.co.uk/33cc21b5d960ec4872b82a6b7e044f4037d811ea/451_0_4508_3607/500.jpg",
    "summary": "Steve Borthwick's coaching abilities are being challenged as he works to develop the talented yet inexperienced Henry Arundell. The focus is on harnessing Arundell's raw speed to realize his potential. This opportunity could be a pivotal moment for both the player and the coach.",
    "published": "2025-11-09T08:00:27Z"
  }
]