[
  {
    "title": "WSL: Chelsea v Tottenham, Everton v Manchester United and more – matchday live",
    "url": "https://www.theguardian.com/football/live/2025/oct/12/world-cup-qualifiers-wsl-updates-and-football-news-matchday-live",
    "image": "https://media.guim.co.uk/526b0eb49562fda50b96e00eb25822a5d7480814/486_0_3987_3191/500.jpg",
    "summary": "Tune in for live updates on today's Women's Super League kick-offs and stay informed with the latest breaking football news. Our writers will be providing real-time coverage. Don't miss any of the action!",
    "published": "2025-10-12T12:34:51Z"
  },
  {
    "title": "Ceasefire live: aid trucks enter Gaza as Netanyahu says Israel is ready for ‘immediate’ release of hostages",
    "url": "https://www.theguardian.com/world/live/2025/oct/12/gaza-ceasefire-live-aid-relief-hamas-release-israel-hostages",
    "image": "https://media.guim.co.uk/3705a4625beb65e66edf0eda511b0d3be9181544/0_0_4800_3840/500.jpg",
    "summary": "Israel's military has announced the completion of the first phase of its withdrawal in preparation for an upcoming peace summit in Egypt scheduled for Monday. The move comes as part of efforts to stabilize the region amid ongoing tensions. The summit is expected to address key issues and seek resolutions to ongoing conflicts.",
    "published": "2025-10-12T12:33:02Z"
  },
  {
    "title": "Women’s Cricket World Cup: Australia v India – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/12/womens-cricket-world-cup-australia-v-india-live-updates-scores-results-teams-squads-start-time-visakhapatnam",
    "image": "https://media.guim.co.uk/b68ad297e519de5d9ac70dfceaf4835461f0fcb1/634_0_4583_3666/500.jpg",
    "summary": "In Visakhapatnam, two strong teams are set to establish their dominance in the group stage of an ODI match. The ongoing match highlights the competition between these heavyweight duos. Megan Maurice provides an over-by-over report on the event.",
    "published": "2025-10-12T12:31:20Z"
  },
  {
    "title": "Heavy clashes erupt along Pakistan-Afghanistan border ",
    "url": "https://www.theguardian.com/world/2025/oct/11/heavy-clashes-erupt-along-pakistan-afghanistan-border",
    "image": "https://media.guim.co.uk/c78cb4d8d819810970aaa4e9b2860e65e72bb2f2/0_0_5030_4024/500.jpg",
    "summary": "Tensions have escalated following a Pakistani airstrike in Kabul, prompting the Taliban to launch retaliatory attacks on military posts. This exchange highlights the growing instability in the region. The situation continues to evolve as both sides respond to the unfolding conflict.",
    "published": "2025-10-12T12:29:38Z"
  },
  {
    "title": "Doge-ish comes to Florida: a DeSantis loyalist is going after ‘waste’ in Democratic cities",
    "url": "https://www.theguardian.com/us-news/2025/oct/12/blaise-ingoglia-doge-florida-ron-desantis",
    "image": "https://media.guim.co.uk/5f9918c4f53f636163e45154f3766c53718e4b79/280_0_2846_2277/500.jpg",
    "summary": "Blaise Ingoglia has been appointed by Florida's Republican governor to spearhead an initiative targeting municipal spending. This effort aims to scrutinize and potentially reduce expenses at the local government level. Ingoglia's leadership signals a strategic push for fiscal accountability within Florida's municipalities.",
    "published": "2025-10-12T12:00:53Z"
  }
]