[
  {
    "title": "Australia news live: three injured in Townsville accident involving ADF personnel; essential workers priced out of rentals",
    "url": "https://www.theguardian.com/australia-news/live/2025/oct/16/australia-news-live-tony-burke-crypto-atms-crime-real-income-aihw-wellbeing-bluey-coins-mint-ntwnfb",
    "image": "https://media.guim.co.uk/86e5e61a5db1331102f3d9aae99ea80c97ffce2b/1028_0_5966_4778/500.jpg",
    "summary": "Could you please provide the news article or details you'd like me to summarize?",
    "published": "2025-10-15T22:12:09Z"
  },
  {
    "title": "Trump says US looking at land attacks in Venezuela after lethal strikes on boats – live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/15/donald-trump-federal-government-shutdown-redistricting-voting-rights-act-kash-patel-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/55713839944c40268b341b5f2518581252abdeae/484_0_4840_3872/500.jpg",
    "summary": "Donald Trump asserts, without providing evidence, that each U.S. military strike on boats suspected of drug smuggling saves thousands of lives. His comments highlight his administration's approach to combating drug trafficking. Critics may question the validity of his claims and the lack of supporting data.",
    "published": "2025-10-15T22:08:39Z"
  },
  {
    "title": "Essendon held their nerve and their man Zach Merrett – but to what end? | Jonathan Horn",
    "url": "https://www.theguardian.com/sport/blog/2025/oct/16/essendon-held-their-nerve-and-their-man-zach-merrett-but-to-what-end",
    "image": "https://media.guim.co.uk/a7995ac1dfda68c68ef94950fc4eec70d4b2472b/447_0_3942_3155/500.jpg",
    "summary": "The Bombers captain expressed strong disdain for the trade process, highlighting tensions within the club. Meanwhile, the club is celebrating their perceived success during the AFL trade period. This situation encapsulates the contrasting perspectives surrounding the recent trades.",
    "published": "2025-10-15T21:52:03Z"
  },
  {
    "title": "Sumo stars balance power, intricacy and spectacle at London showcase",
    "url": "https://www.theguardian.com/sport/2025/oct/15/sumo-stars-balance-power-intricacy-and-spectacle-at-london-showcase",
    "image": "https://media.guim.co.uk/a3953d8072649da65c36447fd715d67bc3680c53/1000_0_5000_4000/500.jpg",
    "summary": "An excited crowd gathered for the first official sumo tournament outside Japan in 34 years, reveling in the unique atmosphere. The event showcased the cultural significance of sumo wrestling and attracted fans eager to experience the tradition. This milestone highlights the growing global interest in Japanese culture and sports.",
    "published": "2025-10-15T21:48:41Z"
  },
  {
    "title": "Harry Kane out to avenge World Cup heartache after ‘worst moment’ in Qatar",
    "url": "https://www.theguardian.com/football/2025/oct/15/harry-kane-out-to-avenge-world-cup-heartbreak-after-worst-moment-in-qatar",
    "image": "https://media.guim.co.uk/aae79c84f3847426bda7f0d75f1bf84d32ec74c0/408_0_6880_5504/500.jpg",
    "summary": "Harry Kane stated that missing a penalty against France in the last World Cup was a pivotal moment in his career. This experience has motivated him to enhance his performance and lead England toward future success. He aims to channel this determination into achieving glory for the team.",
    "published": "2025-10-15T21:30:48Z"
  }
]