[
  {
    "title": "Serbia v England: World Cup 2026 qualifying Group K – live",
    "url": "https://www.theguardian.com/football/live/2025/sep/09/serbia-v-england-world-cup-2026-qualifying-group-k-live",
    "image": "https://media.guim.co.uk/04cfba8cfade99b445ec0c062a437861a06caa4a/308_0_2592_2074/500.jpg",
    "summary": "Thomas Tuchel's team is striving to keep their perfect record in Group K. A minute-by-minute report by Rob Smyth will provide updates on the match. Fans are eager to see if they can continue their winning streak.",
    "published": "2025-09-09T18:44:05Z"
  },
  {
    "title": "Apple debuts thinner, $999 iPhone Air at ‘awe-dropping’ annual product event",
    "url": "https://www.theguardian.com/technology/2025/sep/09/apple-iphone-17",
    "image": "https://media.guim.co.uk/fbeba2b55b313f3936d49d5bc003d1584d1444fb/1260_203_4240_3393/500.jpg",
    "summary": "Apple has enhanced its AirPods with a live translation feature, enabling real-time language translation during conversations. Additionally, the company introduced upgrades to the Apple Watch, expanding its functionality and user experience. These updates highlight Apple's commitment to innovation in its audio and wearable technology.",
    "published": "2025-09-09T18:43:45Z"
  },
  {
    "title": "Trump calls release of suggestive note to convicted sex trafficker Jeffrey Epstein a ‘dead issue’",
    "url": "https://www.theguardian.com/us-news/2025/sep/09/trump-jeffrey-epstein-birthday-note",
    "image": "https://media.guim.co.uk/d7a88638d6e3439fad297e4b4f204f6fda597e5f/5_0_7900_6321/500.jpg",
    "summary": "The administration has announced its willingness to facilitate an expert analysis of a signature to verify its authenticity. This review aims to determine if the signature in question belongs to former President Trump. The statement highlights ongoing interest in clarifying the authenticity of documents associated with Trump.",
    "published": "2025-09-09T18:43:32Z"
  },
  {
    "title": "Trump spokesperson calls strike on Qatar ‘unfortunate’ after Israel targets Hamas leaders in Doha – live updates",
    "url": "https://www.theguardian.com/world/live/2025/sep/09/israel-gaza-city-evacuation-order-idf-military-offensive-live-updates-middle-east-crisis-latest-news",
    "image": "https://media.guim.co.uk/194b78f6b7777ba65dde174e77716e009ae0bbba/117_0_1849_1479/500.jpg",
    "summary": "Trump's press secretary criticized the attack on Hamas leaders, stating it does not further Israel or America's objectives. However, they emphasized that Qatar remains a \"strong ally and friend\" to the United States. The comments highlight the complexities of U.S. foreign relations in the region.",
    "published": "2025-09-09T18:43:20Z"
  },
  {
    "title": "Somerset v Yorkshire, Leicestershire v Gloucestershire and more: county cricket, day two – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/09/somerset-v-yorkshire-leicestershire-v-gloucestershire-and-more-county-cricket-day-two-live",
    "image": "https://media.guim.co.uk/acb6a829fb2bdc9c6cb8e49db1038ba82c946d16/508_0_4005_3207/500.jpg",
    "summary": "Tanya Aldred is providing live updates from the county grounds on day two of the current round of fixtures. The rolling report will cover the latest happenings and key moments throughout the day. Stay tuned for real-time insights and developments in the matches.",
    "published": "2025-09-09T18:40:16Z"
  }
]