[
  {
    "title": "Leicester v Birmingham: Championship – live",
    "url": "https://www.theguardian.com/football/live/2025/aug/29/leicester-v-birmingham-championship-live",
    "image": "https://media.guim.co.uk/9663dede07d5ed5134a5373b6b81ef80e2704e36/87_86_2395_1917/500.jpg",
    "summary": "John Brewin will provide live updates from the King Power Stadium during the highly anticipated Championship match. Fans can follow minute-by-minute reports to stay informed on the game's progress. Expect detailed insights and key moments throughout the evening.",
    "published": "2025-08-29T19:22:38Z"
  },
  {
    "title": "Epping council leader calls for calm after judges rule on asylum seeker hotel – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/aug/29/latest-live-uk-politics-news-updates-asylum-hotels-labour-conservatives-reform",
    "image": "https://media.guim.co.uk/69db6f531143c0c52f448704b7123eb50758b45e/396_137_3832_3066/500.jpg",
    "summary": "The Home Office and the owner of the Bell hotel have contested an injunction issued by the council aimed at preventing the accommodation of numerous asylum seekers in the hotel. The legal challenge seeks to overturn the council's decision to restrict the hotel’s use for housing asylum seekers. This situation highlights ongoing tensions surrounding the management of asylum accommodations in the region.",
    "published": "2025-08-29T19:19:24Z"
  },
  {
    "title": "US Open tennis 2025: Pegula v Azarenka, Vondrousova shocks Paolini, Alcaraz flies through – live",
    "url": "https://www.theguardian.com/sport/live/2025/aug/29/us-open-tennis-2025-emma-raducanu-carlos-alcaraz-shelton-paolini-day-six-live",
    "image": "https://media.guim.co.uk/20dde2b9bb93692f33b13cfc40636600d3c61998/416_0_4174_3339/500.jpg",
    "summary": "Katy Murrells is providing live updates from the third round of an event taking place in New York. The rolling report covers key moments and developments. Stay tuned for continuous coverage and insights.",
    "published": "2025-08-29T19:17:52Z"
  },
  {
    "title": "Trump move to cancel $4.9bn in Congress-approved foreign funding prompts condemnation – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/aug/29/cdc-robert-f-kennedy-jr-donald-trump-federal-reserve-lisa-cook-latest-us-politics-news-live-updates",
    "image": "https://media.guim.co.uk/c39fb3da30f92f04a036f0d382b43e78d06e2b8f/560_0_6568_5257/500.jpg",
    "summary": "Republican Senator Susan Collins criticized a recent action as a \"clear violation of the law,\" while Democratic Senator Elizabeth Warren labeled the president a \"wannabe king.\" Both comments reflect bipartisan concern over the president's authority. The situation highlights growing tensions between the parties regarding executive power.",
    "published": "2025-08-29T19:12:07Z"
  },
  {
    "title": "Juliet Ace obituary",
    "url": "https://www.theguardian.com/tv-and-radio/2025/aug/29/juliet-ace-obituary",
    "image": "https://media.guim.co.uk/870688ea6957ae9bd3d15be9ff29a967c34f731e/596_3_2546_2036/500.jpg",
    "summary": "One of the original writers for the TV soap EastEnders and a well-known playwright focused on radio drama has passed away. Their contributions to storytelling in both television and radio have left a significant impact on the industry. The creative legacy they built will be remembered by fans and colleagues alike.",
    "published": "2025-08-29T19:11:51Z"
  }
]