[
  {
    "title": "Charlie Kirk murder suspect told he faces death penalty if convicted in first appearance – live updates",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/16/donald-trump-new-york-times-defamation-charlie-kirk-vance-miller-news-updates-us-politics-live",
    "image": "https://media.guim.co.uk/f191746068588b95ee79d7f4a12e989b5a818f17/591_0_6148_4919/500.jpg",
    "summary": "Tyler Robinson appeared virtually in court facing seven charges, including aggravated murder. His next court date is scheduled for September 29. The proceedings are ongoing as the case develops.",
    "published": "2025-09-16T23:23:19Z"
  },
  {
    "title": "Australia news live: Albanese to leave PNG without defence treaty; BHP cuts 750 coal jobs and mothballs mine",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/17/australia-news-live-liberal-sussan-ley-net-zero-target-climate-crisis-anthony-albanese-donald-trump-trade-tariffs-politics-ntwnfb",
    "image": "https://media.guim.co.uk/fe86b98dc18fe69ae8dd2c941fd703f7e40ecdd4/644_502_6201_4961/500.jpg",
    "summary": "Sure! Please provide the news you would like summarized.",
    "published": "2025-09-16T23:14:53Z"
  },
  {
    "title": "Marie Antoinette Style review: Forget the seedy sex addict slurs – and meet the real classy, sassy queen",
    "url": "https://www.theguardian.com/artanddesign/2025/sep/17/marie-antoinette-style-review-v-and-a-london-exhibition-seedy-sex-addict",
    "image": "https://media.guim.co.uk/283910b74aee456a7e9fd18aa46aafb111fd7a95/17_0_3510_2807/500.jpg",
    "summary": "A spectacular fashion show highlights an array of unique designs, including smallpox headgear and whimsical gowns, showcasing a stark contrast to the negative portrayals in the French revolutionary press. The event emphasizes the true identity of the featured individual, countering the libelous narratives. This captivating display allows for a re-examination of perceptions shaped by historical media.",
    "published": "2025-09-16T23:01:20Z"
  },
  {
    "title": "Hamlet review – Giles Terera dives deep into the prince of Denmark’s torment",
    "url": "https://www.theguardian.com/stage/2025/sep/17/hamlet-review-minerva-theatre-chichester-giles-terera-justin-audibert",
    "image": "https://media.guim.co.uk/69b5a47c665bd8ec3799a0bf5dc1c1df0d4b7572/0_1432_2666_2133/500.jpg",
    "summary": "Justin Audibert's production showcases a classical interpretation, enhanced by a talented cast that effectively utilizes the intimate setting. The performance creates an unsettling atmosphere, drawing the audience into the experience. Overall, it highlights a keen understanding of the work’s emotional depth.",
    "published": "2025-09-16T23:01:19Z"
  },
  {
    "title": "Systemic racism affects maternity care for black women in England, say MPs",
    "url": "https://www.theguardian.com/society/2025/sep/17/systemic-racism-affects-maternity-care-for-black-women-in-england-say-mps",
    "image": "https://media.guim.co.uk/cbf79927f1f3b4cc5e295e983d5bd8ed38f389c0/270_0_1707_1365/500.jpg",
    "summary": "A Commons committee report reveals that women's concerns are often overlooked due to prevalent bias, stereotyping, and racist assumptions. The findings highlight the need for systemic changes to address these discriminatory practices. The committee calls for more inclusive policies to ensure that women's voices are heard and respected.",
    "published": "2025-09-16T23:01:19Z"
  }
]