[
  {
    "title": "Australia news live: Bragg agrees Coalition ‘running out of people to offend’; launch timing for Melbourne’s Metro Tunnel revealed",
    "url": "https://www.theguardian.com/australia-news/live/2025/oct/07/australia-politics-live-october-7-anniversary-hamas-israel-anthony-albanese-sussan-ley-question-time-andrew-hastie-labor-coalition-ntwnfb",
    "image": "https://media.guim.co.uk/572695e0252537854e27e8314ad4565b5bc21dfb/582_280_4570_3659/500.jpg",
    "summary": "I'm sorry, but I need more details or content to summarize the news for you. Please provide the information or a specific article you'd like me to summarize.",
    "published": "2025-10-06T22:14:27Z"
  },
  {
    "title": "Schumer rejects Trump’s claim that bipartisan government shutdown negotiations are under way – live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/06/donald-trump-national-guard-ice-government-shutdown-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/45d69873abb59bc113455dd937bc906007151707/811_0_6827_5464/500.jpg",
    "summary": "The Senate Democratic leader expressed openness to collaboration with the president, stating that if he is now prepared to work together, Democrats will be willing to engage in discussions. This remark indicates a potential shift towards bipartisan efforts. The leader's statement underscores the importance of cooperation moving forward.",
    "published": "2025-10-06T22:11:39Z"
  },
  {
    "title": "UK students urged to mind terror laws before 7 October pro-Palestine protests",
    "url": "https://www.theguardian.com/education/2025/oct/06/pro-palestine-students-urged-to-mind-terror-laws-before-7-october-protests",
    "image": "https://media.guim.co.uk/e46d7d02b1f76be644343d8430685a2d7524ac50/577_0_5000_4000/500.jpg",
    "summary": "On the second anniversary of the Hamas attack that triggered an Israeli offensive, up to 10 pro-Palestine events are scheduled to take place. These events aim to commemorate the anniversary and raise awareness of the ongoing conflict. The gatherings reflect the continued advocacy for Palestinian rights amid the complex geopolitical situation.",
    "published": "2025-10-06T21:53:52Z"
  },
  {
    "title": "US attorney resists pressure from Trump to prosecute Letitia James",
    "url": "https://www.theguardian.com/us-news/2025/oct/06/us-attorney-letitia-james-trump",
    "image": "https://media.guim.co.uk/86fcd9c34422fca7464087dc23087b47bb637e4d/533_0_5333_4267/500.jpg",
    "summary": "A prosecutor has reportedly concluded that there is insufficient probable cause to file charges against the New York attorney general. This decision may stem from a lack of evidence supporting allegations. As a result, the attorney general is expected to avoid legal repercussions at this time.",
    "published": "2025-10-06T21:33:59Z"
  },
  {
    "title": "Harry Kane open to Bayern Munich stay and unsure of Premier League return",
    "url": "https://www.theguardian.com/football/2025/oct/06/harry-kane-bayern-munich-stay-premier-league-return-england-world-cup-qualifiers",
    "image": "https://media.guim.co.uk/06c592fd5dd760133cb967cda2f159cb0a1ff66a/703_0_7030_5624/500.jpg",
    "summary": "The England captain, whose contract with Bayern Munich runs until 2027, expressed interest in potentially extending his stay at the club. He stated, \"In terms of staying longer I could definitely see that.\" This suggests he is open to a longer commitment with Bayern.",
    "published": "2025-10-06T21:30:24Z"
  }
]