[
  {
    "title": "US immigration officers kill man trying to flee vehicle stop near Chicago",
    "url": "https://www.theguardian.com/us-news/2025/sep/12/ice-agent-shooting-chicago",
    "image": "https://media.guim.co.uk/614880ebdc98251c09db7173da72829dc3822ce4/275_0_2735_2189/500.jpg",
    "summary": "Silverio Villegas-Gonzalez shot and killed an officer and injured another during an incident in Franklin Park, Illinois. The confrontation escalated, leading to the tragic shooting. Authorities are investigating the circumstances surrounding the altercation.",
    "published": "2025-09-12T22:23:34Z"
  },
  {
    "title": "Charlie Kirk shooting: suspect set to face aggravated murder charge - live updates",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/12/charlie-kirk-shooter-suspect-latest-news-updates-donald-trump-utah",
    "image": "https://media.guim.co.uk/b3900dee754cc4e9b61442cbd4826f211c47f0af/0_969_1693_1353/500.jpg",
    "summary": "Tyler Robinson, 22, is expected to face charges after a family friend alerted authorities about him allegedly shooting a rightwing activist. The incident prompted law enforcement to investigate the situation further. Details regarding the circumstances of the shooting are still unfolding.",
    "published": "2025-09-12T22:21:03Z"
  },
  {
    "title": "Five Great Reads: Defending Dominique Pelicot, AI relationships, and the neighbourhood cat elections",
    "url": "https://www.theguardian.com/australia-news/2025/sep/13/five-great-reads-defending-dominique-pelicot-ai-relationships-and-the-neighbourhood-cat-elections",
    "image": "https://media.guim.co.uk/a9dc46cde41419d460d764c11ac4ff4883452d12/497_180_2546_2037/500.jpg",
    "summary": "Guardian Australia’s weekend wrap highlights key articles from the past week, curated by Claire Keenan. The selection features significant news stories and analyses, offering insights into current events. Readers can catch up on essential reads to understand the week's developments.",
    "published": "2025-09-12T22:00:46Z"
  },
  {
    "title": "After years living quietly in Florida, Shah of Iran’s alleged ‘chief torturer’ must face accusations in court",
    "url": "https://www.theguardian.com/world/2025/sep/11/parviz-sabeti-shah-iran-lawsuit",
    "image": "https://media.guim.co.uk/9768d28a3178b89eae37a9334104411d92c734d2/0_102_480_384/master/480.jpg",
    "summary": "Parviz Sabeti, previously known for maintaining a low-profile lifestyle, is now embroiled in a significant $225 million lawsuit. The lawsuit pertains to alleged atrocities in prisons in Tehran and other locations. This development marks a stark shift from his prior private existence.",
    "published": "2025-09-12T21:47:50Z"
  },
  {
    "title": "Thomas Frank hopes to be ‘more aware of future plans’ at Spurs after Levy exit",
    "url": "https://www.theguardian.com/football/2025/sep/12/thomas-frank-hopes-to-be-more-aware-of-future-plans-at-spurs-after-levy-exit",
    "image": "https://media.guim.co.uk/ff1b5bfcbf54b33c0e72d8c69cc778498fcd23ce/416_85_2089_1671/500.jpg",
    "summary": "Tottenham manager acknowledged the rapid changes following Daniel Levy's departure. He expressed a desire to contribute to the club's long-term strategy moving forward. The situation highlights the need for stability amidst organizational shifts.",
    "published": "2025-09-12T21:30:46Z"
  }
]