[
  {
    "title": "Ryder Cup 2025: USA 1-3 Europe after day-one foursomes – live updates",
    "url": "https://www.theguardian.com/sport/live/2025/sep/26/ryder-cup-2025-day-one-golf-europe-usa-bethpage-black-live",
    "image": "https://media.guim.co.uk/b1809817b70d395c4e9530c0ba4d164d922deea7/91_0_3886_3109/500.jpg",
    "summary": "Europe begins strong in their title defense at Bethpage Black, with live hole-by-hole updates available. Join our writers for the latest coverage of the event as it unfolds. Excitement builds as the competition progresses.",
    "published": "2025-09-26T16:23:13Z"
  },
  {
    "title": "Starmer says government will introduce digital IDs to ensure Britain’s ‘borders are more secure’ – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/26/keir-starmer-digital-id-cards-immigration-borders-reform-uk-politics-live",
    "image": "https://media.guim.co.uk/a056eccaa47283032977eb2cb62b950c524e23d5/678_0_3418_2736/500.jpg",
    "summary": "An online petition opposing the introduction of digital ID cards by the government is rapidly gaining traction, approaching 900,000 signatures. The petition raises concerns about privacy and security associated with digital identification. Organizers emphasize the importance of public sentiment in influencing government policy on this issue.",
    "published": "2025-09-26T16:21:11Z"
  },
  {
    "title": "Potteries brand is world-class. It must be saved | Letters",
    "url": "https://www.theguardian.com/artanddesign/2025/sep/26/potteries-brand-is-world-class-it-must-be-saved",
    "image": "https://media.guim.co.uk/9cd7c85ba7ff033656894b9a5795e373edad1ac3/560_0_5600_4480/500.jpg",
    "summary": "Letters address the significance of ceramics to the national economy, with Joan Walley highlighting its importance. Dave Proudlove discusses the role of green energy, while Sebastian Lazell criticizes the government's insufficient support for industrial policy. Additionally, Josiah Wedgwood's marketing genius is noted as a key factor in the industry's success.",
    "published": "2025-09-26T16:21:11Z"
  },
  {
    "title": "This jury was too judgmental about ADHD | Letters",
    "url": "https://www.theguardian.com/society/2025/sep/26/you-be-the-judge-jury-was-wrong-about-adhd",
    "image": "https://media.guim.co.uk/19f6f5b4a52125f56c7ba684363316a915a55c7f/996_0_5020_4016/500.jpg",
    "summary": "In a letter, Sue Marshall emphasizes the importance of providing understanding and support to neurodivergent individuals. She argues that they should not be made to feel their differences are merely excuses. Marshall advocates for empathy and recognition of the challenges faced by neurodivergent people.",
    "published": "2025-09-26T16:18:19Z"
  },
  {
    "title": "The reading of the will only happens in fiction | Letters",
    "url": "https://www.theguardian.com/society/2025/sep/26/the-reading-of-the-will-only-happens-in-fiction",
    "image": "https://media.guim.co.uk/f7081b5a38f1f433f35e4958267d8ff1eb7d5a70/290_0_1970_1576/500.jpg",
    "summary": "Graham Mullan emphasizes that the details of a will should be familiar to the deceased's executors and any solicitors involved prior to the person's passing. This transparency can help prevent disputes and ensure a smoother execution of the will. Clear communication is crucial for effective estate management.",
    "published": "2025-09-26T16:16:45Z"
  }
]