[
  {
    "title": "What's streaming in Australia in October: A House of Dynamite, Mr Scorsese and new Alan Partridge",
    "url": "https://www.theguardian.com/tv-and-radio/2025/oct/02/streaming-netflix-amazon-stan-hbo-abc-sbs-australia-october-house-dynamite-mr-scorsese",
    "image": "https://media.guim.co.uk/351be6a2ab53791eb57890862d7ff7f8a74b0992/0_0_1575_1260/500.jpg",
    "summary": "Shane Black's latest heist film is in the works, alongside the Australian horror movie \"Bring Her Back.\" Additionally, Tim Robinson from \"I Think You Should Leave\" dives into a darkly comedic storyline involving a sinister chair company. These new projects highlight a diverse range of genres in upcoming film releases.",
    "published": "2025-10-02T03:30:25Z"
  },
  {
    "title": "Gaza aid flotilla: more than a dozen vessels intercepted by Israeli forces; Greta Thunberg arrested – live",
    "url": "https://www.theguardian.com/world/live/2025/oct/01/israel-gaza-aid-global-sumud-flotilla-middle-east-crisis-latest-updates",
    "image": "https://media.guim.co.uk/1dc8eff7cd550ab162294c9a1525393e9bf0e162/107_0_705_564/500.jpg",
    "summary": "The Israeli foreign ministry shared a video of Greta Thunberg's arrest during a protest. Approximately 500 activists were intercepted while trying to reach the Gaza coast, about 75 miles offshore. The incident highlights ongoing tensions related to the situation in the region.",
    "published": "2025-10-02T03:30:08Z"
  },
  {
    "title": "News live: PNG approves delayed defence treaty with Australia; Commonwealth Bank outage hits customers",
    "url": "https://www.theguardian.com/australia-news/live/2025/oct/02/australia-news-live-dan-tehan-liberals-nuclear-sussan-ley-coalition-anthony-albanese-labor-flotilla-bhp-china-ntwnfb",
    "image": "https://media.guim.co.uk/7af88426585fa7ea730901004001104ad706a0aa/163_310_2503_2003/500.jpg",
    "summary": "I'm sorry, but I cannot access live news updates. However, you can provide me with a news article or key details, and I can help summarize that for you.",
    "published": "2025-10-02T03:22:37Z"
  },
  {
    "title": "Israel’s Gaza flotilla interception triggers protests, diplomatic expulsions and calls for strikes",
    "url": "https://www.theguardian.com/world/2025/oct/02/israels-gaza-flotilla-interception-triggers-protests-diplomatic-expulsions-and-calls-for-strikes",
    "image": "https://media.guim.co.uk/59c67179d303bb96ac6891127f808dfe8454bc05/0_0_5200_4160/500.jpg",
    "summary": "Thousands protested globally in response to the interception of a flotilla and the detention of activists, including Greta Thunberg. The demonstrations highlighted concerns over environmental activism and the rights of protesters. Participants called for greater attention to climate issues and support for those advocating for change.",
    "published": "2025-10-02T03:12:05Z"
  },
  {
    "title": "Revealed: YouTube’s three legal grounds for challenging inclusion in Australia’s under-16s social media ban",
    "url": "https://www.theguardian.com/technology/2025/oct/02/youtube-three-legal-grounds-fchallenging-inclusion-australia-under-16s-social-media-ban",
    "image": "https://media.guim.co.uk/ab4987c092b3410dd475374da96c9c9b78acfefc/408_0_4080_3264/500.jpg",
    "summary": "A recently released letter under the Freedom of Information Act claims that a company was denied procedural fairness upon being included in an upcoming law. The document argues that the company's rights were compromised in the legislative process. This revelation raises concerns about transparency and due process in lawmaking.",
    "published": "2025-10-02T03:03:44Z"
  }
]