[
  {
    "title": "Australia v New Zealand: men’s international football friendly – live",
    "url": "https://www.theguardian.com/football/live/2025/sep/05/australia-socceroos-vs-new-zealand-all-whites-live-updates-international-football-friendly-latest",
    "image": "https://media.guim.co.uk/237a4d6a1eeb3a67906ffca517e5ebda90f1cefb/460_0_3787_3030/500.jpg",
    "summary": "Australia is hosting the first match of two Soccer Ashes fixtures featuring the long-overlooked trophy. Fans can follow Joey Lynch for live updates throughout the event. The match marks a significant moment in Australian soccer history.",
    "published": "2025-09-05T09:32:28Z"
  },
  {
    "title": "Geelong v Brisbane: AFL 2025 second qualifying final – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/05/geelong-v-brisbane-afl-2025-second-qualifying-final-live",
    "image": "https://media.guim.co.uk/4d6fff277a58d045d48ebf3ff7cd83951152aa85/0_0_2500_2000/500.jpg",
    "summary": "The Cats and Lions face off in a crucial match at the MCG for a chance to secure a home preliminary final. Martin Pegan provides live updates on the game. The outcome will determine the playoff positioning for both teams.",
    "published": "2025-09-05T09:29:39Z"
  },
  {
    "title": "Angela Rayner’s political future in balance with rule breach report due – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/05/angela-rayner-stamp-duty-labour-starmer-reform-nigel-farage-uk-politics-live-news-updates",
    "image": "https://media.guim.co.uk/548c85e07b6173161b515e9503fe83ca2eac0715/581_0_5122_4098/500.jpg",
    "summary": "A verdict is anticipated today regarding whether she violated ministerial standards in her purchase of a flat in Hove. The case focuses on potential breaches of conduct related to the transaction. The outcome could have implications for her political career.",
    "published": "2025-09-05T09:26:40Z"
  },
  {
    "title": "Nosferatu to One of Them Days: the seven best films to watch on TV this week",
    "url": "https://www.theguardian.com/tv-and-radio/2025/sep/05/nosferatu-to-one-of-them-days-the-seven-best-films-to-watch-on-tv-this-week",
    "image": "https://media.guim.co.uk/f1f8da92d402cc7077061a745a1036d2c8e9ee9b/280_17_3715_2972/500.jpg",
    "summary": "A classic movie is being reimagined with a terrifying twist, featuring standout performance from Lily-Rose Depp. Meanwhile, SZA and Keke Palmer star in a comedic buddy film that promises to entertain. Additionally, a new romcom with a questionable premise sparks debate over whether it's brilliant or disastrous.",
    "published": "2025-09-05T09:26:26Z"
  },
  {
    "title": "Starmer must not meet Israeli president during UK visit, say Labour MPs",
    "url": "https://www.theguardian.com/politics/2025/sep/04/israel-president-visit-london-talks-ministers-isaac-herzog",
    "image": "https://media.guim.co.uk/58fe53f86dd5d3ed8808284aa7c3a855d5004d1d/510_287_3224_2579/500.jpg",
    "summary": "Israeli President Isaac Herzog is set to visit London for discussions with UK ministers. The visit comes as the UK is on the verge of recognizing Palestinian statehood. This development reflects ongoing diplomatic efforts surrounding the Israel-Palestine conflict.",
    "published": "2025-09-05T09:17:19Z"
  }
]