[
  {
    "title": "News live: Australian government condemns Israel’s Qatar strikes; Meta takes action on deepfake nude apps",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/10/australia-news-live-nampijinpa-price-littleproud-pacific-albanese-indian-immigration-sussan-ley-coalition-liberal-labor-koala-park-nsw-ntwnfb",
    "image": "https://media.guim.co.uk/5daa99f1fb17d85be7ba3cc415885c8f2e76d60a/576_0_5741_4595/500.jpg",
    "summary": "I'm unable to access live news updates, but if you provide details or text from the article, I can help summarize it in three lines!",
    "published": "2025-09-09T22:28:09Z"
  },
  {
    "title": "The president doth protest too much: Trump’s denial on Epstein is backfiring",
    "url": "https://www.theguardian.com/us-news/2025/sep/09/trump-response-epstein-files",
    "image": "https://media.guim.co.uk/754e2a47cf91895bf04cd1319558f4b2e84921f3/0_786_3600_2879/500.jpg",
    "summary": "The White House is reportedly in a state of urgency as former President Trump is acting in an uncharacteristically subdued manner. This behavior has caught officials off guard, complicating their usual strategies. The unexpected shift signals potential shifts in Trump's political tactics or strategies.",
    "published": "2025-09-09T22:20:10Z"
  },
  {
    "title": "Trump says US warned Qatar of impending Israel strike but were ‘too late to stop the attack’ – Middle East crisis live",
    "url": "https://www.theguardian.com/world/live/2025/sep/09/israel-gaza-city-evacuation-order-idf-military-offensive-live-updates-middle-east-crisis-latest-news",
    "image": "https://media.guim.co.uk/194b78f6b7777ba65dde174e77716e009ae0bbba/117_0_1849_1479/500.jpg",
    "summary": "Qatar condemned a recent attack as a \"serious escalation,\" warning it could jeopardize ceasefire efforts in Gaza. World leaders have echoed this concern, emphasizing the delicate situation. Hamas reported that six individuals were killed in the strike.",
    "published": "2025-09-09T22:15:50Z"
  },
  {
    "title": "Thomas Tuchel marvels at England’s display of ‘teamwork in its purest form’",
    "url": "https://www.theguardian.com/football/2025/sep/09/thomas-tuchel-marvels-at-englands-display-of-teamwork-in-its-purest-form",
    "image": "https://media.guim.co.uk/47f97f604b901fb40a70a3d9622f16e6269d3ea1/0_79_2170_1735/500.jpg",
    "summary": "Thomas Tuchel commended his England players for their teamwork and support during the impressive 5-0 victory over Serbia. He highlighted their ability to maintain the right intensity at crucial moments in the match. The performance showcased their collective spirit and determination on the field.",
    "published": "2025-09-09T22:09:25Z"
  },
  {
    "title": "US supreme court temporarily halts lower court order reinstating $5bn in foreign aid",
    "url": "https://www.theguardian.com/us-news/2025/sep/09/trump-supreme-court-foreign-aid",
    "image": "https://media.guim.co.uk/25f9abd2b97af77e80e4b60891d2bff7536e0750/17_0_4583_3667/500.jpg",
    "summary": "Trump previously halted foreign aid funds through a method known as \"pocket rescission.\" Aid organizations are now facing a deadline to respond to this decision by Friday. The situation has raised concerns about the impact on humanitarian efforts abroad.",
    "published": "2025-09-09T22:09:09Z"
  }
]