[
  {
    "title": "UK doctors guilty of sexual misconduct are not being struck off, research finds",
    "url": "https://www.theguardian.com/society/2025/sep/18/uk-doctors-guilty-of-sexual-misconduct-are-not-being-struck-off-research-finds",
    "image": "https://media.guim.co.uk/1c6fb69d0257a494f34f8c1a14cc6739a995ac27/28_0_2632_2106/500.jpg",
    "summary": "An analysis has found that 24% of doctors who have been found guilty of misconduct receive suspensions yet are permitted to continue practicing medicine. This raises concerns about the effectiveness of disciplinary actions in the medical field. The findings highlight potential risks to patient safety and the integrity of medical care.",
    "published": "2025-09-18T22:30:26Z"
  },
  {
    "title": "Haaland with ‘monsters Ronaldo and Messi’ in Champions League 50 club, says Guardiola",
    "url": "https://www.theguardian.com/football/2025/sep/18/haaland-with-monsters-ronaldo-and-messi-in-champions-league-50-club-says-guardiola",
    "image": "https://media.guim.co.uk/f477d81e4d42c783a6e0d7fead9748a4d5178837/417_0_3630_2904/500.jpg",
    "summary": "Pep Guardiola praised Erling Haaland for scoring his 50th Champions League goal in just 49 matches. He remarked that Haaland is now alongside legends Cristiano Ronaldo and Lionel Messi among the competition's top scorers. Guardiola emphasized Haaland’s exceptional talent and achievements in the tournament.",
    "published": "2025-09-18T22:25:19Z"
  },
  {
    "title": "Australia news live: ‘I can’t promise cheaper energy,’ says Bowen; rescuers search bush for crashed plane pilot",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/19/australia-news-live-cheaper-energy-chris-bowen-climate-bush-search-crashed-plane-pilot-julie-bishop-ntwnfb",
    "image": "https://media.guim.co.uk/68c66513d05b78d1b97535ef08f13c888afd6f10/704_93_5246_4199/500.jpg",
    "summary": "The climate minister stated in a 7.30 interview that the government is working to balance emissions with pricing strategies. Meanwhile, a light aircraft has gone missing near Batemans Bay. Search efforts are likely underway to locate the missing plane and its occupants.",
    "published": "2025-09-18T22:25:16Z"
  },
  {
    "title": "Marcus Rashford shows rare talent that clubs will not bet big on | Andy Brassell",
    "url": "https://www.theguardian.com/football/2025/sep/18/marcus-rashford-shows-rare-talent-that-clubs-will-not-bet-big-on",
    "image": "https://media.guim.co.uk/9f483e1d0aca469b2f02fb015485f5cb04053077/865_343_2485_1988/500.jpg",
    "summary": "England forward's initial two goals during his loan at Barcelona indicate a promising start, suggesting that his tenure may evolve beyond a mere temporary arrangement. His impactful performance has the potential to strengthen his position within the team. This could lead to a more permanent role if he continues to succeed.",
    "published": "2025-09-18T22:21:27Z"
  },
  {
    "title": "CDC panel recommends multiple shots for measles, mumps, rubella and chicken pox instead of single vaccine",
    "url": "https://www.theguardian.com/us-news/2025/sep/18/cdc-vaccine-policy",
    "image": "https://media.guim.co.uk/d11389f5b275692b27f0ada8818e904a95a3f29c/683_0_6827_5464/500.jpg",
    "summary": "Experts are expressing concern that adding more vaccination requirements may negatively impact children's health. They worry that it could lead to increased vaccine hesitancy and limit access to essential healthcare. The debate highlights the need for balance between public health measures and individual choice.",
    "published": "2025-09-18T22:13:36Z"
  }
]