[
  {
    "title": "Danish authorities in rush to close security loophole in Chinese electric buses",
    "url": "https://www.theguardian.com/world/2025/nov/05/danish-authorities-in-rush-to-close-security-loophole-in-chinese-electric-buses",
    "image": "https://media.guim.co.uk/eebddd88f1626aff29b4cf74e52913fda48f973d/362_0_3241_2592/500.jpg",
    "summary": "An investigation has been initiated following the revelation that a Chinese supplier gained remote access to the control systems of vehicles. This raises significant concerns regarding cybersecurity and the potential for unauthorized manipulation. Authorities are assessing the implications for vehicle safety and privacy.",
    "published": "2025-11-05T13:30:25Z"
  },
  {
    "title": "Democrat Zohran Mamdani sweeps to victory in New York City mayoral election and lays down challenge to Trump - live",
    "url": "https://www.theguardian.com/us-news/live/2025/nov/05/zohran-mamdani-new-york-nyc-donald-trump-mayor-election-california-new-jersey-virginia-latest-news-results",
    "image": "https://media.guim.co.uk/9617db453cbd1ef5e4a2edd8d8545ed087da9418/665_0_5000_4000/500.jpg",
    "summary": "A 34-year-old democratic socialist has won an election, receiving over 50% of the votes cast. This victory marks a significant achievement for the candidate and their party. The win highlights growing support for progressive policies among voters.",
    "published": "2025-11-05T13:25:47Z"
  },
  {
    "title": "Two people in intensive care and multiple injured after car driven into pedestrians on French island – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/nov/05/latest-europe-live-news-updates-brussels-drones-eu",
    "image": "https://media.guim.co.uk/2504e566117475889b8c2df8c45a868e864dd6c1/0_0_1920_1536/500.jpg",
    "summary": "A suspect has been taken into custody following an incident where a car was deliberately driven into pedestrians and cyclists on Île d'Oléron. Among the injured is an aide to a National Rally MP. Authorities are investigating the motives behind the attack.",
    "published": "2025-11-05T13:24:48Z"
  },
  {
    "title": "Iranian man who made second small boat crossing is returned to France again",
    "url": "https://www.theguardian.com/uk-news/2025/nov/05/iranian-man-who-made-second-small-boat-crossing-is-returned-to-france-again",
    "image": "https://media.guim.co.uk/acc28649d924ba8aa386e086126894e357f78ca5/188_0_1879_1503/500.jpg",
    "summary": "A man who had been returned to France in September returned to the UK last month. However, he has now been flown back to France again. This case raises questions about immigration policies and border control.",
    "published": "2025-11-05T13:19:12Z"
  },
  {
    "title": "The full transcript of Zohran Mamdani’s victory speech after being elected NYC mayor",
    "url": "https://www.theguardian.com/us-news/2025/nov/05/zohran-mamdani-victory-speech-transcript",
    "image": "https://media.guim.co.uk/78380548b620db7dcfb6e20ec5d3be447c9dfbbc/458_0_4576_3661/500.jpg",
    "summary": "The mayor-elect focused on affordability and supporting the working residents of the city during his speech. He conveyed a message of resilience and optimism, declaring that \"Hope is alive.\" His address aims to inspire and unite the community in addressing current challenges.",
    "published": "2025-11-05T13:17:18Z"
  }
]