[
  {
    "title": "‘First job bonus’ worth £5k planned for young people, Stride tells Tory conference – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/oct/06/conservative-tory-party-conference-spending-welfare-immigration-labour-starmer-reform-uk-politics-live-news-updates",
    "image": "https://media.guim.co.uk/d208d0db736ba524a58dc5eb81b1abd7b997f57a/45_0_7200_5760/500.jpg",
    "summary": "The Shadow Chancellor outlined the party's spending plans during the ongoing conference in Manchester. These proposals aim to address key economic issues and reflect the party's vision for future fiscal policies. The announcement is part of a broader agenda being discussed at the event.",
    "published": "2025-10-06T11:11:40Z"
  },
  {
    "title": "Judge blocks Trump’s bid to deploy national guard to Oregon – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/06/donald-trump-national-guard-ice-government-shutdown-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/9722523b75c9a89a5eb36f832f76e5a48ed481b9/139_0_4583_3667/500.jpg",
    "summary": "A US District Judge, Karin Immergut, has issued a ruling that halts any deployment of federal law enforcement to Portland for two weeks. This decision comes amid ongoing legal disputes related to the situation. The ruling temporarily prevents any action while the legal proceedings are resolved.",
    "published": "2025-10-06T11:10:50Z"
  },
  {
    "title": "Lecornu bemoans lack of compromise across political spectrum as he resigns as French PM – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/oct/06/france-pm-resigns-lecornu-macron-europe-live-news-updates",
    "image": "https://media.guim.co.uk/4d8af5f1370c2a742772a6054812c2fbd671885c/903_0_4489_3592/500.jpg",
    "summary": "A newly appointed member of Macron's cabinet has resigned just weeks into the role due to intense backlash and criticism. The departure highlights ongoing tensions surrounding the government's recent changes. This incident raises concerns about stability and public support for Macron's administration.",
    "published": "2025-10-06T11:06:24Z"
  },
  {
    "title": "Dame Jilly Cooper obituary",
    "url": "https://www.theguardian.com/books/2025/oct/06/dame-jilly-cooper-obituary",
    "image": "https://media.guim.co.uk/a6a9279440d65b6104b038039ee1d4dcd2601af9/247_0_2500_2000/500.jpg",
    "summary": "The author of bestselling novels such as \"Riders\" and \"Rivals\" has passed away, known for vividly depicting the English countryside. His works explored themes of land, sports, and passionate relationships among locals. His unique storytelling captured the fervor and complexities of rural life.",
    "published": "2025-10-06T11:03:22Z"
  },
  {
    "title": "‘Logs falling from the sky’: the harrowing true story behind wildfire drama The Lost Bus",
    "url": "https://www.theguardian.com/film/2025/oct/06/lost-bus-movie-camp-wildfire",
    "image": "https://media.guim.co.uk/c8585f2c035ccc6246a80caa861346ebb093d1b8/494_0_2092_1674/500.jpg",
    "summary": "Paul Greengrass’s latest film explores the harrowing experience of the 2018 Camp fire in California. The disaster drama captures the intense emotions and struggles of the survivors who lived through the tragedy. Through their stories, it sheds light on the impact of the devastating wildfire on the community.",
    "published": "2025-10-06T11:01:11Z"
  }
]