[
  {
    "title": "UK long-term borrowing costs reach 27-year high in pre-budget blow for Labour – business live",
    "url": "https://www.theguardian.com/business/live/2025/sep/02/uk-long-term-borrowing-costs-27-year-high-gold-silver-inflation-business-live-news-updates",
    "image": "https://media.guim.co.uk/e33d07dd27d69afd62d493dfc3b45e781ee7d390/582_0_5839_4672/500.jpg",
    "summary": "The latest economic and financial news highlights ongoing developments in global markets, indicating fluctuations in stock prices and commodity values. Central banks are adjusting monetary policies in response to economic indicators, while inflation rates remain a key concern for investors. Analysts predict potential impacts on growth as economies navigate post-pandemic challenges.",
    "published": "2025-09-02T07:31:48Z"
  },
  {
    "title": "Australia news live: Lidia Thorpe labels alleged Camp Sovereignty attack ‘a hate crime’ and urges AFP to investigate",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/02/australia-politics-live-labor-coalition-anthony-albanese-sussan-ley-question-time-cosmetic-surgery-tobacco-excise-ntwnfb",
    "image": "https://media.guim.co.uk/429c36b0d77672318c2e203f71de760a9ac9b011/652_0_5586_4469/500.jpg",
    "summary": "I'm unable to access live news updates. However, you can check major news websites or apps for live updates on current events. If you have a specific news article in mind, please share, and I can help summarize it!",
    "published": "2025-09-02T07:31:37Z"
  },
  {
    "title": "Pressure rises on Reeves as government borrowing costs hit 27-year high",
    "url": "https://www.theguardian.com/business/2025/sep/02/rachel-reeves-uk-borrowing-costs-budget-bond-yields",
    "image": "https://media.guim.co.uk/7041a20fcc3300f3b8baf0593185c62eb4e86761/512_495_2503_2001/500.jpg",
    "summary": "The Chancellor is set to have reduced fiscal flexibility in the upcoming budget due to a rise in the yield of 30-year bonds, which has climbed to 5.68%. This increase may impact government borrowing costs and fiscal planning. The constraints could affect investment and spending decisions moving forward.",
    "published": "2025-09-02T07:29:49Z"
  },
  {
    "title": "Belgium to recognise Palestinian state at UN and sanction Israel – Middle East crisis live",
    "url": "https://www.theguardian.com/world/live/2025/sep/02/middle-east-crisis-israel-gaza-palestine-un-belgium-live-news-updates",
    "image": "https://media.guim.co.uk/6e91d70261e19e5f28df210b67e6d327ed450be9/192_0_1666_1333/500.jpg",
    "summary": "The foreign minister clarified that the recent actions are not directed at the Israeli people but are intended to compel their government to adhere to international and humanitarian law. This statement emphasizes a focus on governmental accountability rather than targeting citizens. The remark highlights ongoing tensions regarding compliance with legal norms in the region.",
    "published": "2025-09-02T07:18:54Z"
  },
  {
    "title": "Afternoon Update: Katter distances himself from neo-Nazi-linked megaphone; FoI transparency backlash; and ‘cosmic’ algae in Melbourne",
    "url": "https://www.theguardian.com/australia-news/2025/sep/02/afternoon-update-tuesday-ntwnfb",
    "image": "https://media.guim.co.uk/39ae73403a5f5d7a0794fd1e4e59832f01092397/566_0_4678_3742/500.jpg",
    "summary": "A veteran politician spoke at an anti-immigration rally in Townsville, addressing the crowd using a microphone linked to the National Socialist Network. His appearance at the event has sparked controversy and criticism. The rally is part of ongoing tensions surrounding immigration policies in the region.",
    "published": "2025-09-02T07:11:41Z"
  }
]