[
  {
    "title": "Chelsea v Paris FC: Women’s Champions League – live",
    "url": "https://www.theguardian.com/football/live/2025/oct/15/chelsea-v-paris-fc-womens-champions-league-live",
    "image": "https://media.guim.co.uk/22565cb4ab43f875a0d1b423787c95125a5fd0bb/388_51_2063_1651/500.jpg",
    "summary": "Taha Hashim is providing a live report on Sonia Bompastor's team as they aim to secure their first European victory of the season. The updates will cover the key moments and developments during the match. Fans can follow along for real-time insights and commentary.",
    "published": "2025-10-15T20:22:02Z"
  },
  {
    "title": "Gaza ceasefire live: Trump reportedly says Israel could resume fighting if Hamas fails to uphold agreement",
    "url": "https://www.theguardian.com/world/live/2025/oct/15/gaza-ceasefire-israel-hamas-palestine-aid-hostages-detainees-prisoners-live-news-updates",
    "image": "https://media.guim.co.uk/1fa1942e1069e28a7952e7ca5c08d14a65eef438/593_0_1993_1595/500.jpg",
    "summary": "US President stated that Israel could quickly resume attacks on Gaza if he chose to do so, amid ongoing tensions. This comment comes as Hamas reports challenges in locating the remaining bodies of hostages. The situation remains volatile as diplomatic efforts continue.",
    "published": "2025-10-15T20:19:38Z"
  },
  {
    "title": "Federal judge temporarily blocks mass layoffs as Trump official estimates 10,000 could be affected – live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/15/donald-trump-federal-government-shutdown-redistricting-voting-rights-act-kash-patel-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/1236457b37a4d0de48d9e8308a7fd9ef4b884464/282_0_4116_3293/500.jpg",
    "summary": "Judge Susan Illston criticized the administration for exploiting a lapse in government operations. Russell Vought stated that his office aims to aggressively eliminate bureaucratic inefficiencies. The exchange highlights tensions between judicial oversight and administrative efforts to streamline government functions.",
    "published": "2025-10-15T20:19:11Z"
  },
  {
    "title": "Australia news live: Tony Burke announces crackdown on crypto ATMs used by money-laundering mules",
    "url": "https://www.theguardian.com/australia-news/live/2025/oct/16/australia-news-live-tony-burke-crypto-atms-crime-real-income-aihw-wellbeing-bluey-coins-mint-ntwnfb",
    "image": "https://media.guim.co.uk/eaceb46eeeee235e93c4b6f077581470ebc32fdf/0_0_6880_5504/500.jpg",
    "summary": "I'm sorry, but I need more information about the news story you'd like summarized. Could you please provide details or a link?",
    "published": "2025-10-15T20:16:21Z"
  },
  {
    "title": "Rangers push to seal Kevin Muscat deal after Danny Röhl withdraws from race",
    "url": "https://www.theguardian.com/football/2025/oct/15/rangers-manager-news-kevin-muscat-danny-rohl",
    "image": "https://media.guim.co.uk/f9509f4291dd5f74a284ce0cb8e0289596a16de6/428_0_2500_2000/500.jpg",
    "summary": "Rangers face increasing pressure to finalize the hiring of Kevin Muscat, following Danny Röhl's withdrawal from consideration for the manager position. The club is seeking a replacement for Russell Martin at Ibrox. The urgency grows as they look to secure a new leader for the team.",
    "published": "2025-10-15T20:16:09Z"
  }
]