[
  {
    "title": "Australia politics live: government condemns planned anti-immigration rallies; Taylor defends focus on Marles-Hegseth meeting",
    "url": "https://www.theguardian.com/australia-news/live/2025/aug/28/australian-politics-live-usman-khawaja-gambling-ads-anthony-albanese-sussan-ley-labor-coalition-question-time-ntwnfb",
    "image": "https://media.guim.co.uk/475eda1eb1cfdca005d86c7ad6c7fc4a5f214444/728_0_6724_5380/500.jpg",
    "summary": "I'm sorry, but I need more context or details about the news in question to provide a summary. Could you please provide the key points or content you'd like me to summarize?",
    "published": "2025-08-28T07:30:22Z"
  },
  {
    "title": "Porepunkah police shooting live updates: Victoria police ‘throwing everything’ at manhunt for suspect as search enters day three – latest news",
    "url": "https://www.theguardian.com/australia-news/live/2025/aug/28/porepunkah-shooting-live-updates-victoria-police-manhunt-latest-news-ntwnfb",
    "image": "https://media.guim.co.uk/0fe521fe5a772dc9147476fed79d99b31fbaa47a/764_0_5000_4001/500.jpg",
    "summary": "I'm sorry, but it seems that you haven't provided any specific news article or content to summarize. Please share the details or main points you'd like me to summarize, and I'll be happy to help!",
    "published": "2025-08-28T07:29:36Z"
  },
  {
    "title": "Picture perfect? How one of the best tennis photos of all time was taken at the US Open",
    "url": "https://www.theguardian.com/sport/2025/aug/28/best-tennis-photo-jasmine-paolini-us-open-ray-giubilo",
    "image": "https://media.guim.co.uk/d62406e699c9f97ee121321555526ede147757d9/123_0_944_755/500.jpg",
    "summary": "Photographer Ray Giubilo captured a striking image of tennis player Jasmine Paolini that is described as both terrifying and sublime. The unique photograph reflects a blend of skill and luck in its creation. Giubilo's work highlights the unpredictable beauty found in sports photography.",
    "published": "2025-08-28T07:24:06Z"
  },
  {
    "title": "UK landlords could face tax from rents that may raise £2bn",
    "url": "https://www.theguardian.com/money/2025/aug/28/uk-landlords-could-face-tax-from-rents",
    "image": "https://media.guim.co.uk/22c0e34a2a0b754af4d93f3f661eb97d87421f57/209_0_4079_3264/500.jpg",
    "summary": "The Treasury is reportedly exploring a budget change that would expand national insurance contributions to encompass rental income. This move could impact landlords and those who earn money from property rentals. The proposal is part of ongoing discussions around tax reforms and government revenue generation.",
    "published": "2025-08-28T07:20:48Z"
  },
  {
    "title": "‘Massive’ Russian missile and drone attack on Kyiv kills at least eight people",
    "url": "https://www.theguardian.com/world/2025/aug/28/russia-launches-kyiv-attack-ukraine-capital-deaths-injuries",
    "image": "https://media.guim.co.uk/df5e0f5c0b0c3ad4164c8fe97f31769a69c1913e/509_0_3340_2672/500.jpg",
    "summary": "Ukrainian President Volodymyr Zelenskyy condemned Moscow for prioritizing ballistic attacks over diplomatic negotiations, following a recent assault that affected over 20 locations in Ukraine. He emphasized the ongoing escalation of hostilities and the consequences for peaceful resolution. The situation highlights the continued conflict between Ukraine and Russia amidst stalled peace talks.",
    "published": "2025-08-28T07:18:14Z"
  }
]