[
  {
    "title": "Australia news live: Ashton Hurn confirmed as new SA Liberal leader; government lends Arnott’s $45m for global Tim Tams push",
    "url": "https://www.theguardian.com/australia-news/live/2025/dec/08/australia-news-live-politics-coalition-housing-policy-liberal-labor-vic-nsw-qld-tasmania-weather-bushfires-economy-education-health-social-media-cost-of-living",
    "image": "https://media.guim.co.uk/5155b53fedad4dcf8406e8eb9f57b9f2cb8429e4/1259_266_3004_2403/500.jpg",
    "summary": "Please provide the news article or details you'd like summarized, and I'll be happy to help!",
    "published": "2025-12-08T03:19:22Z"
  },
  {
    "title": "Japan PM vows ‘resolute’ response after Chinese aircraft accused of locking radar on to Japanese fighter jets",
    "url": "https://www.theguardian.com/world/2025/dec/08/japan-china-radar-fighter-jets-claims",
    "image": "https://media.guim.co.uk/21f2f421f86223f0f0cee71b02a148119f86164d/0_350_4978_3982/500.jpg",
    "summary": "China's ambassador to Japan was summoned following an incident where Chinese J-15 fighter jets reportedly locked their radar onto Japanese F-15s during military training exercises over the weekend. This escalation has heightened tensions between the two countries amid ongoing disputes in the region. Japan has expressed its concerns over the potential military provocations from China.",
    "published": "2025-12-08T02:21:32Z"
  },
  {
    "title": "UN report sounds alarm over Māori rights in New Zealand",
    "url": "https://www.theguardian.com/world/2025/dec/08/un-cerd-report-maori-rights-new-zealand",
    "image": "https://media.guim.co.uk/fcef503c94ff05044f0c17b57111cada04d00184/542_0_5418_4334/500.jpg",
    "summary": "A UN committee expressed worries over government actions such as abolishing the Māori Health Authority and reducing funding for Indigenous services. The committee highlighted the potential negative impact of these policies on Indigenous communities. They urged the government to address these issues to promote equity and well-being for Māori populations.",
    "published": "2025-12-08T02:10:32Z"
  },
  {
    "title": "Ukraine war briefing: Peace talks with US constructive but ‘not easy’, says Zelenskyy",
    "url": "https://www.theguardian.com/world/2025/dec/08/ukraine-war-briefing-peace-talks-with-us-constructive-but-not-easy-says-zelenskyy",
    "image": "https://media.guim.co.uk/a5e9d8e2d4c9ec69a5128c1f595a8f8f63f0ae08/983_0_4913_3931/500.jpg",
    "summary": "Ukrainian President Volodymyr Zelensky's remarks follow negotiations in Florida and precede discussions with European leaders such as Keir Starmer and Emmanuel Macron. These talks aim to strengthen support for Ukraine amid ongoing conflict. The update marks day 1,384 of the war.",
    "published": "2025-12-08T01:39:48Z"
  },
  {
    "title": "Notorious childcare paedophile Ashley Paul Griffith ‘could have been stopped’ five times during decades of offending",
    "url": "https://www.theguardian.com/australia-news/2025/dec/08/queensland-childcare-paedophile-could-have-been-stopped-five-times",
    "image": "https://media.guim.co.uk/fe9c34958098b88035e7cc30e26bdd71b37fa74e/238_0_3282_2626/500.jpg",
    "summary": "A Queensland report reveals a pattern of \"missed opportunities\" spanning two decades regarding the detection and prevention of abuse. It highlights systemic failures where action could have been taken to identify and address abuse situations. The findings call for significant improvements to protect vulnerable individuals in the future.",
    "published": "2025-12-08T00:57:12Z"
  }
]