[
  {
    "title": "US Open tennis 2025: Pegula beats Azarenka, Vondrousova shocks Paolini, Alcaraz flies through – live",
    "url": "https://www.theguardian.com/sport/live/2025/aug/29/us-open-tennis-2025-emma-raducanu-carlos-alcaraz-shelton-paolini-day-six-live",
    "image": "https://media.guim.co.uk/20dde2b9bb93692f33b13cfc40636600d3c61998/416_0_4174_3339/500.jpg",
    "summary": "Katy Murrells is providing live updates from the third round of an event in New York. The report will cover key moments and developments as they unfold. Stay tuned for ongoing coverage and insights.",
    "published": "2025-08-29T20:32:34Z"
  },
  {
    "title": "Leicester v Birmingham: Championship – live",
    "url": "https://www.theguardian.com/football/live/2025/aug/29/leicester-v-birmingham-championship-live",
    "image": "https://media.guim.co.uk/44316f8b50e5594556ee31dccb7c39b2b5c3ae37/629_358_3232_2587/500.jpg",
    "summary": "Join John Brewin for real-time updates from the King Power Stadium as the Championship game unfolds tonight. The minute-by-minute report provides detailed insights and commentary on the match. Fans can follow along for the latest developments and key moments.",
    "published": "2025-08-29T20:31:56Z"
  },
  {
    "title": "Epping council leader calls for calm after judges rule on asylum seeker hotel – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/aug/29/latest-live-uk-politics-news-updates-asylum-hotels-labour-conservatives-reform",
    "image": "https://media.guim.co.uk/69db6f531143c0c52f448704b7123eb50758b45e/396_137_3832_3066/500.jpg",
    "summary": "The Home Office and the owner of the Bell hotel have contested a council injunction that aimed to prevent the accommodation of numerous asylum seekers at the hotel. They argue against the council's decision, which would have halted the housing of vulnerable individuals. The case highlights ongoing tensions surrounding asylum seeker accommodations in the region.",
    "published": "2025-08-29T20:30:27Z"
  },
  {
    "title": "Mother of boy, 15, held at gunpoint by US immigration agents files $1m claim",
    "url": "https://www.theguardian.com/us-news/2025/aug/29/immigration-agents-los-angeles-detention-damages-claim",
    "image": "https://media.guim.co.uk/a50301c18948a29a2ec591ceb0d180bea37f8861/83_0_1348_1080/500.jpg",
    "summary": "Former Trump administration officials are facing allegations of false imprisonment and unconstitutional racial profiling related to an incident in Los Angeles. The accusations suggest that these officials engaged in discriminatory practices during their actions. The case highlights ongoing concerns about civil rights violations under Trump-era policies.",
    "published": "2025-08-29T20:26:51Z"
  },
  {
    "title": "Gaza famine likely to worsen as Israel ends pauses for aid deliveries",
    "url": "https://www.theguardian.com/world/2025/aug/29/israeli-military-ends-pauses-aid-deliveries-gaza-city-famine",
    "image": "https://media.guim.co.uk/bb6c896a51d5fb3e0dc25559f9aff7a0c4de5480/495_0_6228_4983/500.jpg",
    "summary": "The Israeli military has declared a significant operation in Gaza City, intensifying its attacks in advance of a planned offensive. This escalation marks a strategic effort to address ongoing tensions in the region. The situation continues to evolve as military actions are increased.",
    "published": "2025-08-29T20:23:33Z"
  }
]