[
  {
    "title": "India v South Africa: Women’s Cricket World Cup final – live",
    "url": "https://www.theguardian.com/sport/live/2025/nov/02/india-v-south-africa-womens-cricket-world-cup-final-live",
    "image": "https://media.guim.co.uk/055d2fed48ab2019d3e088002cb6ee6bf13c87cf/314_175_3148_2519/500.jpg",
    "summary": "An over-by-over report is underway to determine which team will claim the trophy this season. Writers are providing live updates and insights as the match progresses. Stay tuned to discover whose name will be etched on the trophy.",
    "published": "2025-11-02T17:14:58Z"
  },
  {
    "title": "Manchester City v Bournemouth: Premier League – live",
    "url": "https://www.theguardian.com/football/live/2025/nov/02/manchester-city-v-bournemouth-premier-league-live",
    "image": "https://media.guim.co.uk/6e70b29912ab5c08657a4c54a731e577a5690dbf/643_0_4471_3578/500.jpg",
    "summary": "Michael Butler provides a live report as two teams with strong attacking players compete against each other at the Etihad Stadium. The match promises to be an exciting showdown given their recent performances. Follow the minute-by-minute updates for all the action.",
    "published": "2025-11-02T17:14:28Z"
  },
  {
    "title": "Louvre jewel heist by petty criminals, not organised professionals, says Paris prosecutor",
    "url": "https://www.theguardian.com/world/2025/nov/02/louvre-jewel-heist-petty-criminals-paris-prosecutor",
    "image": "https://media.guim.co.uk/d03181cbdf67e723c45cf3da8d24ce92c8fb5605/0_0_4164_3333/500.jpg",
    "summary": "Laure Beccuau indicated that the involvement of high-level organized crime is unlikely in a recent case. This assessment comes as one perpetrator is still at large. Authorities continue to investigate the situation.",
    "published": "2025-11-02T17:07:25Z"
  },
  {
    "title": "Cambridgeshire train stabbing: suspects both British and ‘nothing to suggest’ attack was terrorism, say police – latest updates",
    "url": "https://www.theguardian.com/uk-news/live/2025/nov/02/cambridgeshire-train-stabbing-life-threatening-injuries-arrests-latest-updates",
    "image": "https://media.guim.co.uk/c64113b57144b27bf5bd5799829b195ed0b3600b/0_0_3471_2777/500.jpg",
    "summary": "Two men have been arrested for attempted murder following an incident that left two individuals in a life-threatening condition. Authorities are investigating the circumstances surrounding the event. The situation remains critical as the victims receive medical care.",
    "published": "2025-11-02T17:03:54Z"
  },
  {
    "title": "Abigail Spanberger presents herself as bulwark against chaos and cruelty",
    "url": "https://www.theguardian.com/us-news/2025/nov/02/abigail-spanberger-virginia-candidate-governor",
    "image": "https://media.guim.co.uk/a9c53d67c955d151bd8952d72265e0ba6e445644/240_0_3682_2946/500.jpg",
    "summary": "The Democratic candidate for Virginia governor is prioritizing practical governance and affordability as a counter to Trumpism. They aim to address cost-of-living concerns rather than relying on flashy tactics. This approach seeks to resonate with voters looking for stability and effective leadership.",
    "published": "2025-11-02T17:01:03Z"
  }
]