[
  {
    "title": "Galatasaray v Liverpool: Champions League – live",
    "url": "https://www.theguardian.com/football/live/2025/sep/30/galatasaray-v-liverpool-champions-league-live",
    "image": "https://media.guim.co.uk/c299738ec15b7f90b4352c6cab2ba76b1cc18d5d/138_0_4645_3715/500.jpg",
    "summary": "Scott Murray is providing a minute-by-minute report from Istanbul, focusing on the latest developments surrounding the Gala host, Arne Slot, and his team, the Reds. Details about the event and performance updates will be shared live. Stay tuned for ongoing coverage and insights.",
    "published": "2025-09-30T17:15:48Z"
  },
  {
    "title": "Chelsea v Benfica, Bodø/Glimt v Tottenham, and more: Champions League – live",
    "url": "https://www.theguardian.com/football/live/2025/sep/30/chelsea-v-benfica-bodglimt-v-tottenham-and-more-champions-league-live",
    "image": "https://media.guim.co.uk/8016c41fa0279762cf4bed03157d3cea84a65e8f/275_0_4840_3872/500.jpg",
    "summary": "Catch all the latest updates from an eventful night of European and Football League matches. Yara El-Shaboury provides live coverage and insights. Stay tuned for highlights and key moments from the games.",
    "published": "2025-09-30T17:15:48Z"
  },
  {
    "title": "Trump says government shutdown likely as House Democrats call out Republicans for delaying votes before funding deadline – live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/30/us-government-shutdown-funding-trump-vance-portland-hegseth-latest-updates",
    "image": "https://media.guim.co.uk/3a7fa41ff81c50527e6b747b3ef56a5b8670e32d/263_0_3333_2667/500.jpg",
    "summary": "Government funding will expire at midnight ET, prompting urgent discussions in Congress. Republican Speaker Mike Johnson delayed the House's return to block further negotiations with Democrats. The move reflects escalating tensions over government funding issues.",
    "published": "2025-09-30T17:14:16Z"
  },
  {
    "title": "Nigel Farage ‘doesn’t like Britain’, Starmer tells Labour conference – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/30/labour-conference-starmer-speech-streeting-nhs-reform",
    "image": "https://media.guim.co.uk/a533235f15b2adce2c55c64678e3737f52da87c6/836_95_3626_2901/500.jpg",
    "summary": "The Prime Minister criticizes Reform's migration plan, labeling it as an \"enemy of national renewal.\" Meanwhile, Nigel Farage claims that Labour's rhetoric threatens the safety of his party's politicians and activists. Tensions rise as both sides voice concerns over immigration policies and political discourse.",
    "published": "2025-09-30T17:06:59Z"
  },
  {
    "title": "Starmer’s further education plans augur well, but the policy detail will be telling",
    "url": "https://www.theguardian.com/education/2025/sep/30/starmer-further-education-plans-policy-detail-will-be-telling",
    "image": "https://media.guim.co.uk/742056a0d20f663bf0c29cc96adda94f9830868b/488_0_4661_3731/500.jpg",
    "summary": "The Prime Minister aims to enhance the appeal of vocational education to both parents and young individuals. This initiative is intended to promote vocational training as a viable alternative to traditional higher education. The goal is to create equal prestige and opportunities in both educational paths.",
    "published": "2025-09-30T17:06:23Z"
  }
]