[
  {
    "title": "Lessons not learned after Georgia Barter driven to suicide by abuse, says her mother",
    "url": "https://www.theguardian.com/society/2025/nov/30/lessons-not-learned-after-georgia-barter-driven-to-suicide-by-abuse-thomas-bignell",
    "image": "https://media.guim.co.uk/acbc2b5a277f710ec52ef7b5e1fecec6b065c6f2/0_17_4000_3200/500.jpg",
    "summary": "The family expressed their deep sadness regarding a minister's response to concerns raised by a London coroner about police access to specific databases. They feel that the issue has not been adequately addressed. The case highlights ongoing tensions around police practices and accountability.",
    "published": "2025-11-30T07:00:04Z"
  },
  {
    "title": "Shopping for Christmas bargains? Beware the ‘spray and pay’ parcel delivery fraud",
    "url": "https://www.theguardian.com/money/2025/nov/30/problem-with-your-parcel-spray-and-pay-delivery-scam-black-friday",
    "image": "https://media.guim.co.uk/f286fb55047bf502ae767c28f79ed423d6475c71/409_0_4085_3268/500.jpg",
    "summary": "Criminals are sending mass texts claiming that a bargain purchase couldn't be delivered, prompting recipients to pay a redelivery fee. This scheme aims to extract personal data and banking information from unsuspecting victims. Authorities caution people to be vigilant about such scams and verify the legitimacy of any unexpected messages.",
    "published": "2025-11-30T07:00:04Z"
  },
  {
    "title": "Winter warmer in the woods: a sizzling sauna and cool, cosy cabin deep in a Sussex forest",
    "url": "https://www.theguardian.com/travel/2025/nov/30/winter-warmer-in-the-woods-a-sizzling-sauna-and-cool-cosy-cabin-deep-in-a-sussex-forest",
    "image": "https://media.guim.co.uk/7dca0bf4a68f08d31fdca7d1255bc1286f7a6ca2/932_0_6462_5172/500.jpg",
    "summary": "Architect-designed cabins and a sauna have been constructed in the High Weald region, harmonizing with the natural landscape. These structures take advantage of the area's stunning views, offering a unique retreat experience. The project emphasizes both aesthetics and integration with the surrounding environment.",
    "published": "2025-11-30T07:00:03Z"
  },
  {
    "title": "Naughty or nice? The best sexy gifts in the UK for Christmas",
    "url": "https://www.theguardian.com/thefilter/2025/nov/30/best-sexy-gifts-christmas-uk",
    "image": "https://media.guim.co.uk/876ec55363cb425af6b6bff415452267cb218646/16_0_3969_3175/500.jpg",
    "summary": "A sex expert shares her top picks for playful Christmas gifts, featuring cheeky stocking stuffers and mini massagers. The suggestions aim to add a fun twist to holiday gifting. These items cater to those looking to spice up their festive celebrations.",
    "published": "2025-11-30T06:00:04Z"
  },
  {
    "title": "I want be a single mum, but feel envious of peers with partners | Annalisa Barbieri",
    "url": "https://www.theguardian.com/lifeandstyle/2025/nov/30/want-be-single-mum-choice-envious-peers-partners-annalisa-barbieri",
    "image": "https://media.guim.co.uk/b26725319d3e4dc03ff9509367c9ef8cc66f9e35/1863_521_7111_5691/500.jpg",
    "summary": "Seeking expert counseling is beneficial, but connecting with other solo mothers can provide additional support and understanding. Engaging with peers may offer valuable insights and shared experiences. Combining both resources could enhance overall well-being.",
    "published": "2025-11-30T06:00:03Z"
  }
]