[
  {
    "title": "Hurricane Melissa leaves 29 dead as category 2 storm heads towards Bermuda – live",
    "url": "https://www.theguardian.com/world/live/2025/oct/30/hurricane-melissa-jamaica-cuba-haiti-bermuda-caribbean-latest-updates-live",
    "image": "https://media.guim.co.uk/18fadf78fc8fcc431c469478208ba847a0f0e91b/687_0_3440_2752/500.jpg",
    "summary": "Jamaica, Haiti, and Cuba are evaluating the damage caused by a recent storm, focusing on recovery efforts in the wake of its impact. Meanwhile, residents of Bermuda are preparing for the arrival of the storm, which has been downgraded but still poses potential risks. Local authorities in Bermuda are advising precautions as they brace for the storm's effects.",
    "published": "2025-10-30T11:15:45Z"
  },
  {
    "title": "India v Australia: Women’s Cricket World Cup semi-final – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/30/india-v-australia-womens-cricket-world-cup-semi-final-live",
    "image": "https://media.guim.co.uk/2c001294bb541cfc583d3fdf0a9948a4f9dce7a4/113_121_1955_1565/500.jpg",
    "summary": "In the second semi-final in Navi Mumbai, the co-hosts face off against the defending champions. Follow our writers for live updates and analysis as the match progresses. Excitement builds as both teams vie for a spot in the final.",
    "published": "2025-10-30T11:12:50Z"
  },
  {
    "title": "UK rule change allows Palestinian scholars to bring families from Gaza",
    "url": "https://www.theguardian.com/education/2025/oct/30/uk-rule-change-allows-palestinian-scholars-to-bring-families-from-gaza-university-students",
    "image": "https://media.guim.co.uk/f520e67a90e90872f710fabddb5aeda3821fb480/71_0_4385_3508/500.jpg",
    "summary": "New visa policies now allow university students to bring children or dependents, reversing previous restrictions. This change aims to create a more supportive environment for student families. The decision has been welcomed by many students seeking to balance their education and family responsibilities.",
    "published": "2025-10-30T11:10:17Z"
  },
  {
    "title": "Dutch election results: far-right and centrist parties in tight race to top as vote count continues – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/oct/30/dutch-election-results-netherlands-geert-wilders-rob-jetten-france-louvre-russia-poland-ukraine-latest-news-updates",
    "image": "https://media.guim.co.uk/45fbaede82341f8794063ed809523495da4345cf/592_0_5000_4000/500.jpg",
    "summary": "Geert Wilders's Party for Freedom (PVV) has slightly surpassed the D66 party in recent polls. Despite this, D66 is anticipated to take the lead in negotiations to establish the next coalition government. The political landscape indicates a potential shift, but centrist influence remains strong.",
    "published": "2025-10-30T11:08:29Z"
  },
  {
    "title": "FTSE 100 winning streak ends as WPP shares hit lowest level since 2008 - business live",
    "url": "https://www.theguardian.com/business/live/2025/oct/30/oil-price-trump-xi-trade-deal-shell-profit-stocks-business-live-news",
    "image": "https://media.guim.co.uk/02265b379740c2085a4ff74b6da035807caeda7e/330_0_2813_2250/500.jpg",
    "summary": "The latest economic and financial news highlights significant market movements and policy updates. Analysts are closely scrutinizing central bank decisions and inflation trends. Key stock indices are reacting to global economic developments and investor sentiment.",
    "published": "2025-10-30T11:06:45Z"
  }
]