[
  {
    "title": "Nato looks to bolster defences in response to Russian air incursions – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/oct/15/russia-ukraine-nato-france-latest-europe-live-news-updates",
    "image": "https://media.guim.co.uk/bf1ca470dd90bcdb3f6abe8e8203b11bff522874/606_0_4145_3316/500.jpg",
    "summary": "Moscow's recent actions, including incursions into NATO territory, raise concerns that it is testing the West in a \"grey zone\" between war and peace. This strategy may aim to challenge NATO's resolve and response capabilities. Analysts warn that these provocations could escalate tensions in the region.",
    "published": "2025-10-15T09:19:10Z"
  },
  {
    "title": "England v Pakistan: Women’s Cricket World Cup – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/15/england-v-pakistan-womens-cricket-world-cup-live",
    "image": "https://media.guim.co.uk/8c01ae94125ade5060ed13b7f9125b7fe46f42b4/458_0_4515_3611/500.jpg",
    "summary": "England aims to keep their perfect record in the tournament as they face Pakistan in Colombo. The match promises to be a thrilling encounter with both teams looking to secure a victory. Follow along for live updates and insights from our writers.",
    "published": "2025-10-15T09:16:36Z"
  },
  {
    "title": "Gaza ceasefire live: Israel says one of the bodies handed over by Hamas is not a hostage amid reports vital aid crossing to reopen",
    "url": "https://www.theguardian.com/world/live/2025/oct/15/gaza-ceasefire-israel-hamas-palestine-aid-hostages-detainees-prisoners-live-news-updates",
    "image": "https://media.guim.co.uk/adcc1fcd83a21b80fece9fa06acb966fb043d334/421_0_4205_3364/500.jpg",
    "summary": "Israel announced a reduction of aid flow to Gaza by half and stated that the Rafah crossing would not open as initially scheduled. This delay is attributed to the ongoing negotiations for the return of hostages' bodies. The situation reflects ongoing tensions and humanitarian concerns in the region.",
    "published": "2025-10-15T09:13:30Z"
  },
  {
    "title": "Capita fined £14m for data protection failings in 2023 cyber-attack",
    "url": "https://www.theguardian.com/business/2025/oct/15/capita-fined-for-data-protection-failings-in-2023-cyber-attack",
    "image": "https://media.guim.co.uk/a1408137d3be20db5bf398f4c46b816fad61d2f5/13_0_2588_2071/500.jpg",
    "summary": "Hackers breached an outsourcing firm, stealing personal information from 6.6 million individuals. Despite the attack, the firm failed to shut down the compromised device for 58 hours. This delay raised concerns about the firm's security protocols and response measures.",
    "published": "2025-10-15T09:13:28Z"
  },
  {
    "title": "Fabio Paratici returns to Tottenham as joint sporting director after 30-month ban",
    "url": "https://www.theguardian.com/football/2025/oct/15/fabio-paratici-tottenham-joint-sporting-director-after-30-month-ban",
    "image": "https://media.guim.co.uk/273acf41c18479e543273a1daa2a14dae50831c4/96_57_2848_2279/500.jpg",
    "summary": "Tottenham has announced the return of Fabio Paratici to the club, marking a key change in its leadership structure for the men's team. Paratici will play a significant role in shaping the team's future. His reappointment signals a strategic move by the club to strengthen its management team.",
    "published": "2025-10-15T09:12:54Z"
  }
]