[
  {
    "title": "Starmer backs ‘independent BBC’ but declines to tell Trump to drop $1bn lawsuit threat – latest updates",
    "url": "https://www.theguardian.com/media/live/2025/nov/12/bbc-donald-trump-panorama-tim-davie-board-robbie-gibb-latest-news-updates",
    "image": "https://media.guim.co.uk/f94d2f44b16b678187729198da22a0b588d04be6/1328_768_3939_3151/500.jpg",
    "summary": "Lib Dem leader Ed Davey accused US President Joe Biden of attempting to undermine a broadcaster. Davey expressed concerns about the implications of Biden's actions on media freedom. The statement highlights ongoing tensions regarding media independence in political discourse.",
    "published": "2025-11-12T15:22:04Z"
  },
  {
    "title": "Abuse ‘ignored’ at Wedomsley detention centre where prolific sex offender attacked young men, report finds",
    "url": "https://www.theguardian.com/society/2025/nov/12/abuse-ignored-medomsley-detention-centre-prolific-sex-offender-young-men-neville-husband",
    "image": "https://media.guim.co.uk/c2cd8cf556dfc9f0885c38542b99cfea8ea2fd63/0_548_4531_3625/500.jpg",
    "summary": "Neville Husband committed 368 sexual offences during his tenure at a youth prison in County Durham from 1969 to 1985. The crimes were reportedly against young inmates under his care. His actions have highlighted severe shortcomings in the oversight and protection of vulnerable youths in the prison system.",
    "published": "2025-11-12T15:16:53Z"
  },
  {
    "title": "To the cashier who left me absolutely speechless – I salute you",
    "url": "https://www.theguardian.com/lifeandstyle/commentisfree/2025/nov/12/to-the-cashier-who-left-me-absolutely-speechless-i-salute-you",
    "image": "https://media.guim.co.uk/7ca6da40cd0c22543bf53af94d79377a773b68a3/1811_0_6387_5111/500.jpg",
    "summary": "An individual reflects on a peculiar encounter that prompted them to reevaluate the communication styles among British people. The interaction stood out as atypical, sparking thoughts about cultural nuances in conversation. This experience highlights the complexities of interpersonal dialogue in Britain.",
    "published": "2025-11-12T15:14:34Z"
  },
  {
    "title": "Keir Starmer under pressure over future of Morgan McSweeney amid briefing row",
    "url": "https://www.theguardian.com/politics/2025/nov/12/keir-starmer-no-10-briefings-ministers-unacceptable-pmqs",
    "image": "https://media.guim.co.uk/d234ccd39eba6db72679b3cb8f431fa506cb8540/183_0_1707_1365/500.jpg",
    "summary": "Ministers and Labour MPs are criticizing the Prime Minister's chief of staff for orchestrating a campaign against Labour MP Wes Streeting. Accusations suggest that the No 10 operation aimed to undermine Streeting's position. The controversy highlights ongoing tensions between government officials and the opposition.",
    "published": "2025-11-12T15:14:16Z"
  },
  {
    "title": "No 10 says Starmer has confidence in Morgan McSweeney after PM condemns attacks on cabinet members – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/nov/12/keir-starmer-wes-streeting-labour-leadership-pmqs-kemi-badenoch-conservatives-uk-politics-live-news",
    "image": "https://media.guim.co.uk/4e85671d9577efaed4d014d357e4184ffbf88145/0_73_869_695/500.jpg",
    "summary": "Prime Minister's spokesperson expresses confidence in the chief of staff amid criticisms from Keir Starmer concerning a \"toxic culture\" at Downing Street. The PM's office defends its leadership amidst the challenge. This statement highlights internal support despite external concerns about workplace environment.",
    "published": "2025-11-12T15:11:41Z"
  }
]