[
  {
    "title": "Netanyahu says news on remaining dead hostages expected ‘within hours’ as Israel halves amount of aid to be let into Gaza – live",
    "url": "https://www.theguardian.com/world/live/2025/oct/14/gaza-ceasefire-israel-hamas-palestine-hostages-detainees-truce-live-news-updates",
    "image": "https://media.guim.co.uk/4485c433f0abc3593206f7f2ed92f476d7ca8b07/278_0_2580_2065/500.jpg",
    "summary": "Hamas has stated that retrieving the remains of deceased individuals in Gaza is taking longer due to extensive rubble. The situation is compounded by Israel's ongoing closure of the Rafah crossing. This further complicates recovery efforts in the area.",
    "published": "2025-10-14T18:26:34Z"
  },
  {
    "title": "Latvia v England: World Cup 2026 qualifier – live",
    "url": "https://www.theguardian.com/football/live/2025/oct/14/latvia-v-england-world-cup-2026-qualifier-live",
    "image": "https://media.guim.co.uk/3b95c6aba1edff97ad5ff8d379d98598b194b91e/302_0_3179_2544/500.jpg",
    "summary": "England is aiming for a win that will secure their World Cup qualification, with live updates provided by Scott Murray. The minute-by-minute report will keep fans informed on the match's progress. Anticipation builds as the team strives for a crucial victory.",
    "published": "2025-10-14T18:24:01Z"
  },
  {
    "title": "House speaker defends White House using research funding to pay military during government shutdown – live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/14/donald-trump-government-shutdown-national-guard-javier-milei-charlie-kirk-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/71f9f04ad27b7d129dea2a5442081efa2fdd331e/616_0_4167_3335/500.jpg",
    "summary": "Mike Johnson declared that the Trump administration has the legitimate authority to transfer funds approved by Congress to the Department of Defense. He emphasized the administration's right to make such financial reallocations. This statement highlights ongoing discussions regarding budget management and defense funding.",
    "published": "2025-10-14T18:23:03Z"
  },
  {
    "title": "World Cup 2026: which countries have qualified and how did they do it?",
    "url": "https://www.theguardian.com/football/2025/oct/10/world-cup-2026-which-countries-have-qualified-and-how-did-they-do-it",
    "image": "https://media.guim.co.uk/0f53653b78bc6b9323f5f61be32524b96b57668c/0_0_5000_4000/500.jpg",
    "summary": "Twenty-three out of 48 spots for the upcoming tournament have been secured. Co-hosts Canada, Mexico, and the USA are among the teams that have qualified. The event continues to shape up as more teams are announced.",
    "published": "2025-10-14T18:20:09Z"
  },
  {
    "title": "DNA test confirmed alleged stalker was not Madeleine McCann, court hears",
    "url": "https://www.theguardian.com/uk-news/2025/oct/14/secret-dna-test-confirmed-alleged-stalker-was-not-madeleine-mccann-says-officer",
    "image": "https://media.guim.co.uk/8dbd3f3706f1af8947530563a7825710b9044e0c/412_0_1439_1152/500.jpg",
    "summary": "An investigating officer has admitted to bypassing standard procedures while evaluating Julia Wandelt, who faces allegations of harassing the McCann family. This deviation from protocol raises questions about the investigation's integrity. Wandelt's case involves claims of a targeted campaign against the family previously involved in a high-profile missing persons case.",
    "published": "2025-10-14T18:19:44Z"
  }
]