[
  {
    "title": "No 10 says claims it concealed evidence or withdrew witnesses to stop China spy trial are ‘categorically untrue’ – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/oct/13/china-spy-trial-keir-starmer-egypt-margaret-thatcher-anniversary-uk-politics-live-news-updates",
    "image": "https://media.guim.co.uk/d2d80b936dfd8305dce9c8788f464b483c87fb7e/1309_695_3678_2942/500.jpg",
    "summary": "The Prime Minister's spokesperson has firmly stated that claims the government influenced the Crown Prosecution Service (CPS) to abandon a case concerning Chinese espionage are \"entirely false.\" This statement comes amid scrutiny over government actions regarding national security and foreign interference. The denial seeks to clarify the government's position on maintaining integrity in legal proceedings.",
    "published": "2025-10-13T17:10:12Z"
  },
  {
    "title": "Arsenal expect Martin Ødegaard to miss six weeks with knee injury",
    "url": "https://www.theguardian.com/football/2025/oct/13/martin-odegaard-arsenal-knee-injury",
    "image": "https://media.guim.co.uk/bba5d8bab95a8805d9c738c2566a4be6b1b39507/322_0_2932_2346/500.jpg",
    "summary": "The club is optimistic about their captain's recovery and potential return to the squad. They specifically aim for him to be available for the north London derby. The match is scheduled for 23 November.",
    "published": "2025-10-13T17:09:46Z"
  },
  {
    "title": "All living Israeli hostages freed and hundreds of Palestinian detainees and prisoners released as Trump leads Egypt summit – live",
    "url": "https://www.theguardian.com/world/live/2025/oct/13/gaza-ceasefire-live-updates-israel-hostages-release-hamas-trump-middle-east",
    "image": "https://media.guim.co.uk/3335e41e059e1c25b39bc7c74536ee353f73ad85/1689_1054_2699_2160/500.jpg",
    "summary": "US President meets with world leaders in Egypt following the return of Israeli hostages. Families of the released hostages express their gratitude as Palestinian detainees are also freed. The gatherings highlight ongoing efforts for peace and reconciliation in the region.",
    "published": "2025-10-13T17:09:38Z"
  },
  {
    "title": "‘Cavalier and aggressive’: why are border agents flooding into US cities? ",
    "url": "https://www.theguardian.com/us-news/2025/oct/12/border-agents-trump-immigration-crackdown",
    "image": "https://media.guim.co.uk/4393177562734795a7ba8e41914a5a7aabef8a5c/250_0_2500_2000/500.jpg",
    "summary": "Border agents are increasingly involved in enforcing immigration policies under Trump, expanding their operations beyond typical rural areas. This shift reflects a broader strategy to tighten borders and control migration. Their enhanced presence has sparked discussions about the implications for both enforcement and community relations.",
    "published": "2025-10-13T17:07:35Z"
  },
  {
    "title": "Were their body parts used in satanic rituals? Netflix tackles the horrific ‘Monster of Florence’ murders",
    "url": "https://www.theguardian.com/tv-and-radio/2025/oct/13/body-parts-satanic-rituals-netflix-monster-of-florence-murders",
    "image": "https://media.guim.co.uk/47d6209fe49b0c1ed9e82e5f8c70024c552952fe/143_0_2594_2076/500.jpg",
    "summary": "A series of shocking murders in Italy has left authorities and the public puzzled, as couples were found killed in their cars with disturbing patterns, notably involving the targeting of sexual organs. Investigative author Tobias Jones examines the available evidence to uncover the motivations behind these brutal acts. The ongoing mystery raises questions about the underlying causes and the identity of the perpetrator.",
    "published": "2025-10-13T17:02:51Z"
  }
]