[
  {
    "title": "Trump news at a glance: president hikes H-1B visa cost to $100,000 a year as aide tells firms to ‘train Americans’",
    "url": "https://www.theguardian.com/us-news/2025/sep/20/trump-administration-news-updates-today-latest",
    "image": "https://media.guim.co.uk/59eb9906dc108507440ca83610919d84feb727a3/718_0_3682_2946/500.jpg",
    "summary": "A recent decision poses a significant challenge to the tech industry, as it may impact key operations. However, the commerce secretary indicates that major companies are supportive of the move. This suggests a potential shift in industry dynamics despite the anticipated setbacks.",
    "published": "2025-09-20T02:52:46Z"
  },
  {
    "title": "Attorney investigating Trump critics resigns after pressure from officials – as it happened",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/19/donald-trump-jimmy-kimmel-suspension-abc-federal-reserve-lisa-cook-us-politics-live-news",
    "image": "https://media.guim.co.uk/5a1531ed739138c2fe7a34a193d4f74f0acaac24/443_0_3593_2874/500.jpg",
    "summary": "Former President Trump expressed a desire for Erik Siebert, who was investigating New York Attorney General Letitia James and former FBI director James Comey, to be removed from his position. The blog regarding this matter has now been closed. Trump's comments highlight his ongoing conflicts with figures in law enforcement and legal oversight.",
    "published": "2025-09-20T02:11:08Z"
  },
  {
    "title": "Ted Cruz compares threats to ABC by FCC chair to those of mob boss",
    "url": "https://www.theguardian.com/us-news/2025/sep/19/ted-cruz-jimmy-kimmel-abc-fcc-mafia",
    "image": "https://media.guim.co.uk/d18674ba45e0b43c0a87c5d9fa1f29a1186458e9/237_0_2209_1767/500.jpg",
    "summary": "Texas Senator expresses strong disapproval of Brendan Carr's threats to revoke licenses in connection with Jimmy Kimmel's suspension, comparing the tactics to those found in the film \"Goodfellas.\" The senator argues that such actions are indicative of intimidation rather than appropriate regulatory measures. This comparison highlights concerns over the politicization of media and potential overreach in governmental authority.",
    "published": "2025-09-20T02:00:45Z"
  },
  {
    "title": "Trump announces new deadly strike on suspected drug boat in Caribbean",
    "url": "https://www.theguardian.com/us-news/2025/sep/19/trump-military-strike-boat-caribbean",
    "image": "https://media.guim.co.uk/f1fe3c8198f42b2219b083bcfc0c925f6e21bbf8/349_0_3063_2450/500.jpg",
    "summary": "The President announced that the US military conducted a strike under his orders, resulting in the deaths of three individuals allegedly involved in transporting illegal narcotics. He emphasized the operation's focus on combating drug trafficking. The strike reflects ongoing efforts to address narcotics-related issues.",
    "published": "2025-09-20T00:22:24Z"
  },
  {
    "title": "‘Incompetent’: SA premier slams Optus as eight-week-old baby among three who died when triple zero calls failed",
    "url": "https://www.theguardian.com/business/2025/sep/19/three-people-died-when-optus-network-upgrade-affected-triple-zero-calls-ceo-confirms",
    "image": "https://media.guim.co.uk/c2ef4f9bf2ab5acccc4e9ea737e39a8c1f9d76dc/281_0_4560_3648/500.jpg",
    "summary": "Peter Malinauskas has expressed criticism towards the telco for its inadequate communication following the deaths of two individuals in South Australia and one in Western Australia during a network upgrade. He emphasized the need for better coordination and information dissemination during such operations. The incidents have raised concerns about safety and accountability in the company's upgrade processes.",
    "published": "2025-09-20T00:02:16Z"
  }
]