[
  {
    "title": "Australia v Argentina: 2025 Rugby Championship – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/06/australia-wallabies-vs-argentina-pumas-live-updates-rugby-championship-international-test-latest",
    "image": "https://media.guim.co.uk/72d9f01110e36b030ab04b656793478574185df0/448_0_4145_3316/500.jpg",
    "summary": "The Wallabies face Argentina, who recently secured an upset victory against the All Blacks. Jonathan Howcroft provides minute-by-minute updates on the match. Fans can follow along for live commentary and insights.",
    "published": "2025-09-06T04:33:37Z"
  },
  {
    "title": "Country diary: The river runs dry in this ‘false autumn’ | Susie White",
    "url": "https://www.theguardian.com/environment/2025/sep/06/country-diary-the-river-runs-dry-in-this-false-autumn",
    "image": "https://media.guim.co.uk/f21aee5ce3aa356447a71d10713ff08744a062db/593_0_2815_2252/500.jpg",
    "summary": "In River East Allen, Northumberland, an unusual experience unfolds as one can effortlessly walk across to the opposite bank. The trees are already shedding their leaves, a sign of the impact from the hard, dry summer. This highlights the changing seasonal dynamics in the area.",
    "published": "2025-09-06T04:30:41Z"
  },
  {
    "title": "In Australia, racist violence is nothing new. But emboldened neo-Nazis form a frightening new spectre",
    "url": "https://www.theguardian.com/australia-news/2025/sep/06/in-australia-racist-violence-is-nothing-new-but-emboldened-neo-nazis-form-frightening-new-spectre",
    "image": "https://media.guim.co.uk/6054bb9cd2be16ded3f1eed2c1edecdc34c29450/1_0_2499_2000/500.jpg",
    "summary": "The 'March for Australia' has drawn comparisons to the Cronulla race riots, raising concerns about the potential resurgence of racial tensions. Observers question whether this movement signifies a troubling repetition of past events or the beginning of a more severe societal issue. The parallels suggest a worrying trend in Australia’s racial dynamics.",
    "published": "2025-09-06T04:26:38Z"
  },
  {
    "title": "Sinner sees off Auger-Aliassime to reach historic US Open final with Alcaraz",
    "url": "https://www.theguardian.com/sport/2025/sep/06/jannik-sinner-felix-auger-aliassime-us-open-final",
    "image": "https://media.guim.co.uk/6307bc8b2ed8d3e41c6825991b58370521084255/177_0_2298_1839/500.jpg",
    "summary": "Jannik Sinner defeated Félix Auger-Aliassime in four sets, securing his place in the US Open final. He will face Carlos Alcaraz, marking their third consecutive Grand Slam final matchup. The match will be for the US Open title and the No. 1 ranking.",
    "published": "2025-09-06T04:07:41Z"
  },
  {
    "title": "Ingredient red flags: how to spot the chemicals to avoid in food, kitchenware and cosmetics",
    "url": "https://www.theguardian.com/lifeandstyle/2025/sep/06/how-spot-chemicals-avoid-food-kitchenware-cosmetics",
    "image": "https://media.guim.co.uk/8b007b9907e3d5e60f3d47df2e0b2839a29acc39/0_0_3000_2400/500.jpg",
    "summary": "The article discusses the potential health risks of everyday products, questioning the safety of fragrance in makeup, the presence of plastics in the kitchen, and the dangers of food dyes. It suggests that some common ingredients in our lives may be harmful to well-being. Readers are encouraged to reconsider the safety of their cosmetic and food choices.",
    "published": "2025-09-06T04:00:44Z"
  }
]