[
  {
    "title": "Charlie Kirk shooting latest: search for killer under way as Trump vows crackdown on ‘political violence’",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/11/charlie-kirk-shot-latest-news-updates-utah-university-donald-trump",
    "image": "https://media.guim.co.uk/30cbf44ad88625ac7938a2f52d2706132688167c/17_66_2297_1837/500.jpg",
    "summary": "In a speech before the shooter of Kirk was identified, Donald Trump accused \"the radical left\" of being responsible for the incident. His comments highlight his ongoing criticism of leftist ideologies. This statement has sparked controversy given the premature timing of his remarks.",
    "published": "2025-09-11T08:36:53Z"
  },
  {
    "title": "Starmer under fresh pressure to sack Mandelson as MP claims parliamentary party ‘100%’ against letting him stay – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/11/peter-mandelson-keir-starmer-deputy-labour-leader-uk-politics-latest-news",
    "image": "https://media.guim.co.uk/c07d84b6f076607ac3574c51f6231bdbd5c70ef6/1437_592_5194_4154/500.jpg",
    "summary": "Andy McDonald, a former shadow cabinet minister for Jeremy Corbyn and Keir Starmer, has called for Peter Mandelson to resign immediately. His remarks come amid ongoing tensions within the Labour Party. McDonald's statement highlights a growing divide among party members regarding Mandelson's role and influence.",
    "published": "2025-09-11T08:28:33Z"
  },
  {
    "title": "Rising costs push John Lewis Partnership into deeper loss; London tube strike enters fourth day – business live",
    "url": "https://www.theguardian.com/business/live/2025/sep/11/john-lewis-deeper-loss-london-tube-strike-fourth-day-ecb-interest-rates-us-inflation-business-live-news-updates",
    "image": "https://media.guim.co.uk/786143db12f1911f45f9116c23f50a7aac93d90f/477_0_4426_3541/500.jpg",
    "summary": "John Lewis reports that it is on track for profit growth for the full year, despite experiencing a larger loss in the first half. The company remains optimistic about its financial outlook. Ongoing coverage will follow the latest economic updates.",
    "published": "2025-09-11T08:28:15Z"
  },
  {
    "title": "UN security council to hold emergency meeting as Poland plans no-fly zone after Russian drone incursion – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/sep/11/europe-live-news-updates-poland-russia-drones-ukraine-war-latest",
    "image": "https://media.guim.co.uk/3351505fa5cf93907799226bae00ea3615781a5c/338_0_3730_2984/500.jpg",
    "summary": "Poland is enhancing its defense measures by planning to limit air traffic in the eastern region. This move aims to bolster national security amid heightened tensions in the area. The decision reflects Poland's proactive approach to potential threats.",
    "published": "2025-09-11T08:22:41Z"
  },
  {
    "title": "Terry Irving awarded $130,000 after decades fighting for justice over five years of wrongful imprisonment",
    "url": "https://www.theguardian.com/australia-news/2025/sep/11/terry-irving-wrongful-imprisonment-compensation-queensland",
    "image": "https://media.guim.co.uk/14ec8975549b68afef6ffcf41830f906b63fa698/601_170_3944_3154/500.jpg",
    "summary": "A Queensland supreme court judge acknowledged that Irving has fought for 30 years for the state to recognize the injustices he faced. The judge emphasized the lack of an apology from the government despite Irving's long struggle. This statement highlights the ongoing issues of accountability and recognition of past wrongs.",
    "published": "2025-09-11T08:14:40Z"
  }
]