[
  {
    "title": "Australia news live: Westpac staff member backpaid $56,000 after $50m in underpayments uncovered",
    "url": "https://www.theguardian.com/australia-news/live/2025/nov/14/australia-news-live-net-zero-coalition-sussan-ley-liberals-climate-change-anthony-albanese-labor-hobart-stadium-ntwnfb",
    "image": "https://media.guim.co.uk/b37d7a9c42c5d49d7189f6c74efbe049be8a43ae/2307_1131_5414_4333/500.jpg",
    "summary": "I’m sorry, but I need more context or details about the news you want summarized. Please provide the specific information or article to summarize.",
    "published": "2025-11-14T05:19:27Z"
  },
  {
    "title": "The UK wants to emulate Denmark’s hardline asylum model – but what does it actually look like?",
    "url": "https://www.theguardian.com/world/2025/nov/14/the-uk-wants-to-emulate-denmarks-hardline-asylum-model-but-what-does-it-actually-look-like",
    "image": "https://media.guim.co.uk/6b90e5679bb0529d6e581ba80a3e7edb1efa9573/494_0_4099_3280/500.jpg",
    "summary": "Denmark has reduced asylum numbers by issuing only short-term status to refugees and focusing on so-called 'ghettoes.' Critics argue that this approach undermines the country's values and humanitarian principles. The measures have sparked significant debate over the treatment of asylum seekers in Denmark.",
    "published": "2025-11-14T05:00:21Z"
  },
  {
    "title": "Fossil fuel lobbyists outnumber all Cop30 delegations except Brazil, report says",
    "url": "https://www.theguardian.com/environment/2025/nov/14/fossil-fuel-lobbyists-cop30",
    "image": "https://media.guim.co.uk/114575508c38d673e7f585fa6ba414914fe34c1f/414_0_4119_3297/500.jpg",
    "summary": "A report by Kick Big Polluters Out reveals that 4% of participants at the upcoming 2025 UN climate summit will be fossil fuel lobbyists. This raises concerns about the influence of the fossil fuel industry on climate policy. Advocates are pushing for greater transparency and reduced corporate presence at the summit.",
    "published": "2025-11-14T05:00:20Z"
  },
  {
    "title": "Experience: I played the trumpet for 25 hours straight",
    "url": "https://www.theguardian.com/lifeandstyle/2025/nov/14/experience-i-played-the-trumpet-for-25-hours-straight",
    "image": "https://media.guim.co.uk/e72f9ea321d07463c1ad1d4eebd3ec3eff26ae06/507_0_6283_5027/500.jpg",
    "summary": "The artist faced a challenge of performing a lengthy set list without the option to repeat any songs or use improvisation. This restriction required careful planning and creativity in song selection. The performance highlighted the artist's versatility and ability to engage the audience with a diverse array of music.",
    "published": "2025-11-14T05:00:20Z"
  },
  {
    "title": "‘I found it 35 years later and dissolved into tears’: readers’ favourite photo booth moments",
    "url": "https://www.theguardian.com/lifeandstyle/2025/nov/14/readers-favourite-photo-booth-moments",
    "image": "https://media.guim.co.uk/6ac0ded6c1e9cacfeb22a370f32b19939fea0ed0/0_81_2268_1814/500.jpg",
    "summary": "As the photo booth celebrates its 100th anniversary, people are reminiscing by sharing their favorite snapshots. Among the highlights are intimate moments like a private kiss and the excitement of a chaotic proposal. This milestone reflects the enduring charm and significance of photo booths in capturing life's special memories.",
    "published": "2025-11-14T05:00:20Z"
  }
]