[
  {
    "title": "Manchester City v Bournemouth: Premier League – live",
    "url": "https://www.theguardian.com/football/live/2025/nov/02/manchester-city-v-bournemouth-premier-league-live",
    "image": "https://media.guim.co.uk/6e70b29912ab5c08657a4c54a731e577a5690dbf/643_0_4471_3578/500.jpg",
    "summary": "Michael Butler provides a minute-by-minute report as two teams with strong attacking players clash at the Etihad Stadium. Both teams are in good form, promising an exciting matchup. Fans can follow the action live as it unfolds.",
    "published": "2025-11-02T18:23:11Z"
  },
  {
    "title": "NFL week nine: Colts v Steelers, Falcons v Patriots, Texans v Broncos and more – live",
    "url": "https://www.theguardian.com/sport/live/2025/nov/02/nfl-week-nine-colts-v-steelers-falcons-v-patriots-chiefs-bills-live",
    "image": "https://media.guim.co.uk/20f8553c53b1c1b921c8e1c6663a363abc64ff17/655_0_4986_3989/500.jpg",
    "summary": "Graham Searles provides updates from a hectic day of sports action. The highlight of the day is the highly anticipated matchup between the Chiefs and the Bills. Fans can expect an exciting showdown as the two teams face off.",
    "published": "2025-11-02T18:20:21Z"
  },
  {
    "title": "India v South Africa: Women’s Cricket World Cup final – live",
    "url": "https://www.theguardian.com/sport/live/2025/nov/02/india-v-south-africa-womens-cricket-world-cup-final-live",
    "image": "https://media.guim.co.uk/7ce4e30bd9f4673d14bdcc2529adc768a29c3ab7/495_116_3355_2686/500.jpg",
    "summary": "The article features an over-by-over report on a thrilling sports match, highlighting the anticipation of which team will claim victory and earn a new trophy. Writers provide insights and updates throughout the game. Fans are eager to discover the champion of this competition.",
    "published": "2025-11-02T18:20:14Z"
  },
  {
    "title": "Cambridgeshire train stabbing: one suspect held on suspicion of attempted murder, after second man released, police say",
    "url": "https://www.theguardian.com/uk-news/live/2025/nov/02/cambridgeshire-train-stabbing-life-threatening-injuries-arrests-latest-updates",
    "image": "https://media.guim.co.uk/c64113b57144b27bf5bd5799829b195ed0b3600b/0_0_3471_2777/500.jpg",
    "summary": "A 32-year-old man arrested in connection with the Huntingdon train knife attack is now being treated as the sole suspect by transport police. The investigation continues as authorities gather more information. No further suspects are currently being sought in the case.",
    "published": "2025-11-02T18:17:11Z"
  },
  {
    "title": "FBI fires top official amid Kash Patel’s outrage over reports of agency jet use",
    "url": "https://www.theguardian.com/us-news/2025/nov/02/fbi-fires-top-official-kash-patel-jet-use",
    "image": "https://media.guim.co.uk/e504121e7f92a514c0b72041a88c2c1fbb571065/369_0_5000_4000/500.jpg",
    "summary": "Patel expressed anger after it was disclosed that he traveled to see his girlfriend. In response to the incident, the agency terminated the official responsible for managing the fleet. The situation highlights issues of accountability and appropriateness within the agency.",
    "published": "2025-11-02T17:40:29Z"
  }
]