[
  {
    "title": "Egypt confirms international leaders’ summit on Monday to discuss Gaza ceasefire - live",
    "url": "https://www.theguardian.com/world/live/2025/oct/11/israel-gaza-ceasefire-hamas-hostages-netanyahu-trump-middle-east-latest-news-updates",
    "image": "https://media.guim.co.uk/373bb91e694a157d575f69e59bb39001116b511f/704_0_6250_5000/500.jpg",
    "summary": "Over 500,000 Palestinians are returning to the devastated Gaza City amid ongoing conflict. As the humanitarian crisis unfolds, 20 world leaders, including former President Trump, are set to engage in discussions regarding the situation. The talks aim to address the escalating tensions and seek potential solutions for the affected region.",
    "published": "2025-10-11T22:12:54Z"
  },
  {
    "title": "Australia news live: pro-Palestine rallies to continue after Gaza ceasefire deal and Opera House ban",
    "url": "https://www.theguardian.com/australia-news/live/2025/oct/12/australia-news-live-pro-palestine-rally-sydney-optus-anthony-albanese-sussan-ley",
    "image": "https://media.guim.co.uk/13acefa2e769a6af3f4b68916d00cb5724367b5c/0_0_4813_3850/500.jpg",
    "summary": "I'm sorry, but I need more context or information about the news you would like summarized. Please provide the details or main points of the news article.",
    "published": "2025-10-11T22:01:28Z"
  },
  {
    "title": "An ethereally self-aware comedy genius: the loss of Diane Keaton is devastating | Peter Bradshaw",
    "url": "https://www.theguardian.com/film/2025/oct/11/an-ethereally-self-aware-comedy-genius-the-loss-of-diane-keaton-is-devastating",
    "image": "https://media.guim.co.uk/e8a22fcab0c00755cc491b4413cdb090dfb41e2a/410_403_2628_2103/500.jpg",
    "summary": "America's sweetheart was an extraordinary actor known for her unique talent and fresh performances. She starred in some of the finest films of the past century, leaving a significant impact on the industry. Her legacy transcends her charming public persona, showcasing her remarkable contributions to cinema.",
    "published": "2025-10-11T21:49:02Z"
  },
  {
    "title": "Donald Trump and Abdel Fatah al-Sisi to chair Gaza peace summit on Monday",
    "url": "https://www.theguardian.com/world/2025/oct/11/donald-trump-and-abdel-fattah-al-sisi-to-chair-gaza-peace-summit",
    "image": "https://media.guim.co.uk/4fc4f9cd07d7a0e05cb42f30a783222b768812df/0_166_1038_830/500.jpg",
    "summary": "A meeting is set to be held in Sharm el-Sheikh, Egypt, featuring leaders from over 20 countries. The Egyptian presidency confirmed the event, emphasizing its significance. Specific details about the agenda or topics to be discussed have not been disclosed.",
    "published": "2025-10-11T21:38:25Z"
  },
  {
    "title": "Portugal 1-0 Republic of Ireland, Spain 2-0 Georgia: World Cup 2026 qualifying – as it happened",
    "url": "https://www.theguardian.com/football/live/2025/oct/11/portugal-v-republic-of-ireland-spain-v-georgia-world-cup-2026-qualifying-live",
    "image": "https://media.guim.co.uk/70e5282d4a8b36dcaa3d3277da2fc35f51762fd4/730_0_3790_3032/500.jpg",
    "summary": "Ireland was edged out by Spain, who secured their perfect record with a late header from Ruben Neves. Meanwhile, Italy showed signs of improvement, continuing their revival in the ongoing tournament. The match highlights the competitive landscape of international football.",
    "published": "2025-10-11T21:22:47Z"
  }
]