[
  {
    "title": "World Cup 2026 draw: updates as the teams await fate in Washington DC – live",
    "url": "https://www.theguardian.com/football/live/2025/dec/05/world-cup-2026-draw-updates-usa-mexico-canada",
    "image": "https://media.guim.co.uk/419a243265325adac3bcb805bddb1dc0fa67c072/1028_687_5899_4719/500.jpg",
    "summary": "Writers will provide updates from the draw in Washington, DC, for the upcoming 48-team tournament next summer. Stay tuned for insights and information about the event. Follow along for live coverage of the draw proceedings.",
    "published": "2025-12-05T17:19:02Z"
  },
  {
    "title": "Brighton owner Tony Bloom faces questions over allegations he bet on his own teams",
    "url": "https://www.theguardian.com/football/2025/dec/05/brighton-owner-tony-bloom",
    "image": "https://media.guim.co.uk/24de7994c33bd63049e4c32f6e3d7c8cc148f2aa/157_193_2461_1969/500.jpg",
    "summary": "A billionaire is alleged to be the anonymous individual responsible for securing $70 million in wins related to a legal case in the U.S. He has denied any involvement in betting against his own teams. The claims raise questions about the integrity of the situation.",
    "published": "2025-12-05T17:17:57Z"
  },
  {
    "title": "Mejbri banned for spitting at Leeds fans, Merino may keep place as Arsenal striker – football live",
    "url": "https://www.theguardian.com/football/live/2025/dec/05/world-cup-draw-buildup-premier-league-news-and-more-football-live",
    "image": "https://media.guim.co.uk/016d13596c995009be0e40c74c9304c86f67b058/239_0_3031_2426/500.jpg",
    "summary": "England and Scotland are set to find out their World Cup fates as the weekend approaches. Join our writers for the latest news and updates on their progress. Stay tuned for all the essential information as the events unfold.",
    "published": "2025-12-05T17:16:21Z"
  },
  {
    "title": "Labour launches child poverty strategy but hints costly welfare system needs reform",
    "url": "https://www.theguardian.com/politics/2025/dec/05/new-uk-child-poverty-strategy-pat-mcfadden-welfare-reform",
    "image": "https://media.guim.co.uk/6ccfac3951236e69fd9ea704d0b04ef65399e91e/465_0_6273_5019/500.jpg",
    "summary": "Pat McFadden, the work and pensions secretary, affirmed that the government remains committed to implementing changes to benefits. He emphasized that there is no intention of retracting these planned modifications. The government is moving forward with its proposed reforms despite any opposition.",
    "published": "2025-12-05T17:09:44Z"
  },
  {
    "title": "Democrats call for Pete Hegseth’s resignation amid scrutiny over deadly boat strikes and Signalgate: ‘a disgrace to the office he holds’ – live",
    "url": "https://www.theguardian.com/us-news/live/2025/dec/05/trump-pete-hegseth-signal-politics-updates",
    "image": "https://media.guim.co.uk/c034bd1e8a295b96aa0ef4cac92e34e4914022d1/295_0_2218_1775/500.jpg",
    "summary": "The largest ideological caucus of House Democrats has demanded the immediate resignation of the defense secretary. They express concern that his actions may jeopardize American lives. This call for resignation highlights growing dissatisfaction within the party regarding his leadership.",
    "published": "2025-12-05T17:08:53Z"
  }
]