[
  {
    "title": "Forest fans turn on Postecoglou, England squad news and more: football – live",
    "url": "https://www.theguardian.com/football/live/2025/oct/03/weekend-football-countdown-nottingham-forest-postecoglou-england-squad-premier-league-news-live",
    "image": "https://media.guim.co.uk/122810dd1eb8e9588a80b34714d25b5d71cbdf9c/535_115_1084_867/500.jpg",
    "summary": "Join our team of writers for the latest updates and insights as we approach the weekend's football matches. Get informed about key player news, upcoming fixtures, and critical storylines. Stay tuned for comprehensive coverage to enhance your weekend viewing experience.",
    "published": "2025-10-03T08:24:16Z"
  },
  {
    "title": "Munich drone disruptions add to Europe’s security worries – latest updates",
    "url": "https://www.theguardian.com/world/live/2025/oct/03/munich-drones-security-europe-russia-ukraine-latest-news-updates",
    "image": "https://media.guim.co.uk/4e3d9395750e2e4c825c31bfb3e72c65408e1c3a/195_0_4832_3866/500.jpg",
    "summary": "Recent sightings of drones occurred just after EU leaders had disputes regarding the \"drone wall\" project during a meeting in Copenhagen. The disagreements highlight tensions surrounding the project’s implementation and goals. This incident underscores ongoing challenges in EU defense cooperation.",
    "published": "2025-10-03T08:23:55Z"
  },
  {
    "title": "China remembers ‘guiding light’ Jane Goodall’s wildlife conservation work",
    "url": "https://www.theguardian.com/science/2025/oct/03/china-remembers-guiding-light-jane-goodall-wildlife-conservation",
    "image": "https://media.guim.co.uk/c11db0816b4f408d331111109ba779c369ed5662/0_0_4473_3580/500.jpg",
    "summary": "Tributes have been paid to a late British primatologist revered for his contributions to animal protection. His institute in China trained thousands of individuals in wildlife conservation methods. The primatologist's legacy has had a lasting impact on conservation efforts in the region.",
    "published": "2025-10-03T08:23:46Z"
  },
  {
    "title": "Two Australian women and four children escape Syrian detention camp and flee to Victoria",
    "url": "https://www.theguardian.com/world/2025/oct/03/two-australian-women-and-four-children-escape-syrian-detention-camp-and-flee-to-victoria",
    "image": "https://media.guim.co.uk/473e915d693d7e0c6d649ceda0daaaadeefd3b46/663_0_6633_5306/500.jpg",
    "summary": "Six Australians undertook a 500km journey from the Al-Hawl detention camp to Lebanon without any government assistance. The camp is known for its violent conditions. This situation highlights the challenges faced by individuals seeking help in conflict zones.",
    "published": "2025-10-03T08:22:23Z"
  },
  {
    "title": "Oil on track for biggest weekly fall since June, but fuel prices creep up – business live",
    "url": "https://www.theguardian.com/business/live/2025/oct/03/oil-price-weekly-fall-opec-fuel-services-sector-no-non-farm-business-live-news",
    "image": "https://media.guim.co.uk/4823c09ce35e910ea801f8e91f0c59d1322c4ef9/855_0_4275_3420/500.jpg",
    "summary": "Rolling coverage provides up-to-date information on the latest developments in the economic and financial sectors. Key events, market trends, and influential factors impacting economies are highlighted. Analysts and experts offer insights to help readers understand the implications of these updates on the broader financial landscape.",
    "published": "2025-10-03T08:22:00Z"
  }
]