[
  {
    "title": "Australia v Argentina: 2025 Rugby Championship – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/06/australia-wallabies-vs-argentina-pumas-live-updates-rugby-championship-international-test-latest",
    "image": "https://media.guim.co.uk/2262108f8c84feda8405ceca1584be6eb2cdf58b/376_0_3068_2455/500.jpg",
    "summary": "The Wallabies face Argentina, who recently achieved a surprising victory over the All Blacks. Jonathan Howcroft provides live updates on the match. The highly anticipated clash showcases two competitive teams in international rugby.",
    "published": "2025-09-06T06:42:03Z"
  },
  {
    "title": "What links a US hare, a fat-free diet and the Peasants’ Revolt? The Saturday quiz",
    "url": "https://www.theguardian.com/lifeandstyle/2025/sep/06/what-links-a-us-hare-a-fat-free-diet-and-the-peasants-revolt-the-saturday-quiz",
    "image": "https://media.guim.co.uk/f5d7fbce26498547ee19dfc2375689721e2a1972/0_0_3000_2400/500.jpg",
    "summary": "Test your knowledge with the Saturday quiz featuring participants like Josiah Amberley, Mr. Melas, and Jonas Oldacre, along with topics like Yellow Pearl and Whole Lotta Love. Challenge yourself with various questions to see how much you know. Get ready for a fun and engaging quiz experience!",
    "published": "2025-09-06T06:00:47Z"
  },
  {
    "title": "Obsession review – nasty horror sees a wish for true love go horribly wrong",
    "url": "https://www.theguardian.com/film/2025/sep/06/obsession-movie-review-tiff",
    "image": "https://media.guim.co.uk/35c65be51348e0bad253ace7a5e94404c70064c8/353_255_1277_1022/500.jpg",
    "summary": "Writer-director Curry Barker releases a new film following the success of his $800 YouTube hit, \"Milk & Serial.\" His latest project is a horror film that combines effective storytelling with gruesome visuals. The film serves as a cautionary tale, pushing the boundaries of gore and fear.",
    "published": "2025-09-06T06:00:47Z"
  },
  {
    "title": "What is the world’s biggest coin and how many lions are there? The kids’ quiz",
    "url": "https://www.theguardian.com/lifeandstyle/2025/sep/06/what-is-the-worlds-biggest-coin-and-how-many-lions-are-there-the-kids-quiz",
    "image": "https://media.guim.co.uk/e1df33e8ca0c7680f382909d98fcb545ac7c4fbd/0_0_1500_1200/500.jpg",
    "summary": "A new quiz features five multiple-choice questions crafted by children to challenge your knowledge. Participants can also submit their own junior brainteasers for upcoming quizzes. It's a fun opportunity to engage with young minds and test your skills!",
    "published": "2025-09-06T06:00:47Z"
  },
  {
    "title": "‘It is a war of drones now’: the ever-evolving tech dominating the frontline in Ukraine ",
    "url": "https://www.theguardian.com/world/2025/sep/06/drones-evolving-technology-at-ukraine-conflict-heart",
    "image": "https://media.guim.co.uk/9df3ba81f4b0cb944c10e58a6306b2894f39f93f/209_0_4688_3750/500.jpg",
    "summary": "New models for reconnaissance, rescue, interception, and attack are significantly transforming operational strategies for both sides in conflicts. This evolution in military tactics is enhancing effectiveness and adaptability on the battlefield. The shift highlights the increasing importance of advanced technology in modern warfare.",
    "published": "2025-09-06T06:00:46Z"
  }
]