[
  {
    "title": "Australia news live: volatile mood in Melbourne as anti-immigration rallies begin across country; Leeser says deal to send NZYQ cohort to Nauru ‘legitimate’",
    "url": "https://www.theguardian.com/australia-news/live/2025/aug/31/australia-news-live-victoria-premier-anti-immigrant-protests-sydney-marathon-porepunkah-shooting-sunday-ntwnfb",
    "summary": "I'm sorry, but I am unable to follow live news updates or access real-time information. However, if you provide me with a specific news article or topic, I can help summarize it for you!",
    "published": "2025-08-31T03:16:39Z"
  },
  {
    "title": "Winter delivers final blast of cold weather, bringing snow and strong winds to Australia’s south-east",
    "url": "https://www.theguardian.com/australia-news/2025/aug/31/winter-delivers-final-blast-of-cold-weather-bringing-snow-and-strong-winds-to-australias-south-east",
    "image": "https://media.guim.co.uk/fba54ad61129966c2ca3acbfe56bc102309901d1/249_0_2485_1988/500.jpg",
    "summary": "A strong weather front has passed through South Australia, Victoria, and New South Wales, bringing significant impacts. According to the Bureau of Meteorology (BoM), the front has now moved into the Tasman Sea. Weather conditions are expected to stabilize following its departure.",
    "published": "2025-08-31T03:00:42Z"
  },
  {
    "title": "Wife of alleged Porepunkah killer Dezi Freeman urges him to surrender, sharing ‘deep sorrow’ at police deaths",
    "url": "https://www.theguardian.com/australia-news/2025/aug/31/dez-freeman-accused-porepunkah-police-killer-dezi-manhunt-day-six-ntwnfb",
    "image": "https://media.guim.co.uk/752550f806be93557f3668d0cf82210bcccdb42a/763_0_4640_3712/500.jpg",
    "summary": "Amalia Freeman has expressed her full support for Victoria police in their ongoing efforts to locate a fugitive suspected of fatally shooting two officers. She emphasizes the importance of the police's work in ensuring community safety. The search for the accused remains a priority for law enforcement.",
    "published": "2025-08-31T03:00:35Z"
  },
  {
    "title": "Trump news at a glance: Backlash in Chicago as mayor defies president’s immigration crackdown",
    "url": "https://www.theguardian.com/us-news/2025/aug/31/president-trump-administration-news-updates-today",
    "image": "https://media.guim.co.uk/c072bca6e31b8c2d9787ffd567292296c3d99421/561_0_5606_4487/500.jpg",
    "summary": "Brandon Johnson has issued an executive order opposing the deployment of federal agents to Chicago. This move reflects concerns over federal intervention in local policing matters. The decision is part of ongoing discussions regarding law enforcement strategies in the city.",
    "published": "2025-08-31T01:23:55Z"
  },
  {
    "title": "Chicago mayor signs executive order directing city to resist Trump’s immigration raids",
    "url": "https://www.theguardian.com/us-news/2025/aug/30/chicago-mayor-executive-order-trump-immigration-raids",
    "image": "https://media.guim.co.uk/0f0b18e6e063a5278543e04c6ab0cb1896ce2e71/253_0_6121_4899/500.jpg",
    "summary": "Chicago Mayor Brandon Johnson has issued an order prohibiting city police from collaborating with federal agents in immigration enforcement. This decision is aimed at protecting immigrant communities and fostering trust between residents and law enforcement. The move is part of Johnson's broader commitment to progressive policies and community safety.",
    "published": "2025-08-31T00:30:37Z"
  }
]