[
  {
    "title": "News live: Albanese urges UAE supermarket chain to challenge Australia’s duopoly",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/30/australia-news-live-albanese-supermarket-united-arab-emirates-uae-coalition-sussan-ley-andrew-hastie-reserve-bank-rba-chalmers-interest-rates-decision-ntwnfb",
    "image": "https://media.guim.co.uk/b04cde3f729d013ff87842fe29cdc0616d5bd019/0_0_6326_5064/500.jpg",
    "summary": "Please provide the news article or details you'd like summarized, and I'll be happy to help!",
    "published": "2025-09-29T22:12:11Z"
  },
  {
    "title": "‘I think we’re headed to a shutdown,’ says JD Vance as Mike Johnson calls for more time for negotiations – live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/29/donald-trump-benjamin-netanyahu-gaza-white-house-us-politics-live",
    "image": "https://media.guim.co.uk/5bc5eabe43ed2cd3d8a36d9d12291101b773ef0a/0_0_4757_3806/500.jpg",
    "summary": "Congressional leaders held a meeting with former President Trump regarding the looming government shutdown. During the discussions, the vice president reportedly expressed skepticism about Democrats' willingness to cooperate. The situation highlights ongoing tensions between parties as they face the deadline to resolve budget issues.",
    "published": "2025-09-29T22:07:37Z"
  },
  {
    "title": "Jim Chalmers’ budget victory lap outpaces reality as Australia’s debt continues to climb",
    "url": "https://www.theguardian.com/business/2025/sep/30/australia-treasurer-chalmers-budget-deficit-smaller-than-expected-structural-challenges-loom",
    "image": "https://media.guim.co.uk/dc665e8a4fe0d3d4b4db2a4c4b0de58ee165d9b6/625_0_6224_4982/500.jpg",
    "summary": "The treasurer acknowledged a favorable outcome that could have been detrimental, yet emphasized the ongoing structural issues. Despite the positive news, employees still face significant responsibilities related to repairs. The situation highlights the need for addressing underlying challenges to improve overall conditions.",
    "published": "2025-09-29T21:52:20Z"
  },
  {
    "title": "What’s in Trump’s 20-point peace plan for Gaza?",
    "url": "https://www.theguardian.com/world/2025/sep/29/trump-peace-plan-gaza-israel-hamas",
    "image": "https://media.guim.co.uk/4816119dd83747fec6e471bac74058d76722ab13/559_0_5602_4480/500.jpg",
    "summary": "A new plan has been proposed to achieve an immediate cessation of hostilities between Israel and Hamas. However, it lacks specific details on the implementation of its key objectives. The absence of a clear strategy raises concerns about the feasibility of the proposed ceasefire.",
    "published": "2025-09-29T21:35:16Z"
  },
  {
    "title": "Trump’s plan for Gaza is ambitious but peace is far from guaranteed",
    "url": "https://www.theguardian.com/world/2025/sep/29/trumps-gaza-peace-plan-is-a-back-of-an-envelope-sketch-but-could-work",
    "image": "https://media.guim.co.uk/25e371db9021cc1bc3b10238edd84e8f70e2aae0/225_0_3983_3187/500.jpg",
    "summary": "The US president has garnered regional support for his initiatives, yet uncertainty remains due to Hamas's reactions and Israel's future actions. The evolving situation complicates the potential for a stable resolution. Ongoing tensions underscore the volatile nature of the region.",
    "published": "2025-09-29T21:27:50Z"
  }
]