[
  {
    "title": "USA v Australia: 2025 Women’s Rugby World Cup – live",
    "url": "https://www.theguardian.com/sport/live/2025/aug/30/usa-v-australia-live-2025-womens-rugby-world-cup-wallaroos-eagles-usa-vs-aus-latest-score-updates",
    "image": "https://media.guim.co.uk/1276d56b5a9c5d0ae0c2e672f187d5b0b5341fb7/0_0_6545_5236/500.jpg",
    "summary": "The Wallaroos face off against Ilona Maher and the Eagles in a crucial Group A match in York. Daniel Gallan provides minute-by-minute updates on the game's progress. Stay tuned for detailed coverage of this exciting matchup.",
    "published": "2025-08-30T19:20:57Z"
  },
  {
    "title": "US Open tennis 2025: Sinner in action, Gauff and Osaka advance on day seven – live",
    "url": "https://www.theguardian.com/sport/live/2025/aug/30/us-open-tennis-2025-gauff-sinner-osaka-day-seven-live",
    "image": "https://media.guim.co.uk/bb7c0e708eb2d32ea3424590e53aa6735c810be6/403_0_5611_4491/500.jpg",
    "summary": "Katy Murrells will provide live updates from the third round at the US Open in Flushing Meadows. The report aims to keep fans informed about the latest match developments. Stay tuned for real-time insights and highlights.",
    "published": "2025-08-30T19:18:27Z"
  },
  {
    "title": "Leeds 0-0 Newcastle: Premier League – as it happened",
    "url": "https://www.theguardian.com/football/live/2025/aug/30/leeds-v-newcastle-premier-league-live",
    "image": "https://media.guim.co.uk/98678df0d969a5bfe343ecf9d20043d24e904513/376_0_1870_1497/500.jpg",
    "summary": "The match at Elland Road ended in a draw with no notable action, leaving both teams sharing the points. Scott Murray provided a minute-by-minute report of the uneventful game. Fans were left disappointed by the lack of excitement on the pitch.",
    "published": "2025-08-30T19:14:29Z"
  },
  {
    "title": "Slot’s revamped Liverpool are vulnerable in a way that they weren’t last season | Jonathan Wilson",
    "url": "https://www.theguardian.com/football/2025/aug/30/slots-revamped-liverpool-are-vulnerable-in-a-way-that-they-werent-last-season",
    "image": "https://media.guim.co.uk/7d0d634db07b0a1a83433f798415f929dcafc7dd/731_0_4403_3523/500.jpg",
    "summary": "Arsenal, dealing with multiple injuries, confronts the reigning champions who are currently struggling to adapt to new players in their system. Both teams are facing challenges as the season unfolds. The matchup highlights the difficulties each side is experiencing at this stage.",
    "published": "2025-08-30T19:00:08Z"
  },
  {
    "title": "Bernie Sanders demands that RFK Jr step down as health secretary",
    "url": "https://www.theguardian.com/us-news/2025/aug/30/bernie-sanders-rfk-jr-resign",
    "image": "https://media.guim.co.uk/b9bc568f06c20b724536f6c8c20aaedf35338417/123_0_4656_3726/500.jpg",
    "summary": "Vermont Senator has criticized Robert F. Kennedy Jr. for posing a risk to public health in his role as head of the U.S. health department. The senator's remarks highlight concerns over Kennedy's policies and statements regarding health measures. The criticism reflects broader apprehensions about the implications of Kennedy's leadership on American health standards.",
    "published": "2025-08-30T18:58:59Z"
  }
]