[
  {
    "title": "Lincoln v Chelsea, Liverpool v Southampton, and more: Carabao Cup – live",
    "url": "https://www.theguardian.com/football/live/2025/sep/23/lincoln-v-chelsea-liverpool-v-southampton-and-more-carabao-cup-live",
    "image": "https://media.guim.co.uk/60fbf52ff0614a937d8ee7552b6d32e7f07e6302/292_0_4618_3694/500.jpg",
    "summary": "Rob Smyth will cover the latest developments as more Premier League teams compete in the third round of the League Cup. Fans can expect updates and insights from the matches. Tune in for all the action and highlights.",
    "published": "2025-09-23T20:34:36Z"
  },
  {
    "title": "Australia news live: Albanese heads to Trump reception in New York; number of regular gamblers rising",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/24/australia-news-live-anthony-albanese-new-york-united-nations-donald-trump-climate-crisis-palestine-israel-gaza-ntwnfb",
    "image": "https://media.guim.co.uk/9cbc16f6f681c618d15764d70a04cb253fd43ea3/893_0_4796_3837/500.jpg",
    "summary": "I'm sorry, but I need more context or content to summarize the news. Please provide the specific news article or topic you'd like summarized.",
    "published": "2025-09-23T20:32:47Z"
  },
  {
    "title": "Lord Ashcroft’s son Andrew buys 3.4% stake worth £100m in Tottenham",
    "url": "https://www.theguardian.com/football/2025/sep/23/lord-ashcrofts-son-andrew-buys-34-stake-worth-100m-in-tottenham",
    "image": "https://media.guim.co.uk/e06ec60ae1a3f8cac7daf6c65258c20baf1aa4e4/196_0_2308_1846/500.jpg",
    "summary": "There is uncertainty regarding whether Ashcroft sold his stake in the Spurs to his son or if the family has simply increased their ownership. The Tottenham Hotspur club has rejected two offers for acquisition. The situation surrounding the club's ownership remains ambiguous.",
    "published": "2025-09-23T20:28:39Z"
  },
  {
    "title": "Can Gucci’s new designer bring the hot sauce and rescue fashion house from flatlining sales?",
    "url": "https://www.theguardian.com/fashion/2025/sep/23/can-guccis-new-designer-bring-the-hot-sauce-and-rescue-fashion-house-from-flatlining-sales",
    "image": "https://media.guim.co.uk/45ff8fd159716ff45f0fadac12fa53014c61f565/498_0_5766_4611/500.jpg",
    "summary": "Gucci kicked off Milan Fashion Week with a visually striking film featuring new looks curated by its recently appointed bold creative director. The film highlights the brand's innovative approach to fashion, blending traditional elements with modern flair. This launch marks a fresh chapter for Gucci as it seeks to redefine its identity on the global stage.",
    "published": "2025-09-23T20:25:16Z"
  },
  {
    "title": "Trump says Ukraine could regain all territory lost to Russia since 2022 invasion after meeting Zelenskyy at UN – live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/23/donald-trump-unga-autism-tylenol-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/a25b42e2be033e6f69d3a2acfe088ab740d153fb/1361_323_5481_4385/500.jpg",
    "summary": "In a recent social media post, the US president expressed robust support for Kyiv, underscoring America's commitment to Ukraine amid ongoing tensions. This statement is considered one of the strongest endorsements the US has made for Ukraine's defense. The message aims to bolster morale and affirm solidarity with the Ukrainian government during this challenging period.",
    "published": "2025-09-23T20:22:19Z"
  }
]