[
  {
    "title": "Ryder Cup 2025: USA 10½-13 ½ Europe as hosts fight back in singles finale – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/28/ryder-cup-2025-usa-europe-golf-singles-matches-live",
    "image": "https://media.guim.co.uk/f55d71bbce6de113dc209ac999050cca9593aa64/336_0_3013_2411/500.jpg",
    "summary": "Scott Murray is providing live updates on the 11 singles matches, where the US team is making a strong effort to stage a comeback. Stay tuned for real-time hole-by-hole coverage as the competition unfolds. Updates will focus on key moments and performances during the matches.",
    "published": "2025-09-28T21:14:51Z"
  },
  {
    "title": "Morning Mail: Alarm at Nauru detention contract price rise; LIV golf course plan threatens Indigenous site; Albanese backs Starmer",
    "url": "https://www.theguardian.com/australia-news/2025/sep/29/morning-mail-monday-ntwnfb",
    "image": "https://media.guim.co.uk/575b4a47e440907d91a66ac552637776bad6a4c0/0_0_5000_4000/500.jpg",
    "summary": "The Nauru detention contract has been criticized for \"gross mismanagement.\" The local Indigenous community is expressing distress over plans for an upgraded golf course on their land. Prime Minister Albanese attended the UK Labour conference, engaging with international political discussions.",
    "published": "2025-09-28T20:36:28Z"
  },
  {
    "title": "Corrections and clarifications",
    "url": "https://www.theguardian.com/news/2025/sep/28/corrections-and-clarifications1",
    "summary": "BP reports a significant increase in global natural gas demand, driven by strong recovery in post-pandemic economies and a shift towards cleaner energy sources. The surge is attributed to rising industrial activities and increased heating needs amid colder winters. BP emphasizes the importance of natural gas as a transitional fuel in the global energy landscape.",
    "published": "2025-09-28T20:00:20Z"
  },
  {
    "title": "Exciting attack, clear culture and a new captain: how England won Rugby World Cup | Sarah Rendell",
    "url": "https://www.theguardian.com/sport/2025/sep/28/exciting-attack-clear-culture-and-a-new-captain-how-england-won-rugby-world-cup",
    "image": "https://media.guim.co.uk/925900725899df483014a01885ad617fca4cb1d1/541_0_4915_3932/500.jpg",
    "summary": "Following a disappointing final, the team revamped its coaching staff and prioritized improved communication strategies. These changes aim to enhance performance and prevent similar heartaches in future competitions. The adjustments reflect a commitment to learning and growth after past challenges.",
    "published": "2025-09-28T20:00:20Z"
  },
  {
    "title": "Arteta hails Arsenal after ‘remarkable’ comeback victory against Newcastle",
    "url": "https://www.theguardian.com/football/2025/sep/28/mikel-arteta-arsenal-newcastle-premier-league-football",
    "image": "https://media.guim.co.uk/396422153e1f5bda0ebc88c7f422a9a7b20dfbbf/310_0_4277_3422/500.jpg",
    "summary": "Mikel Arteta praised his Arsenal team for demonstrating their determination after a late comeback win against Newcastle. He emphasized that the victory showcased the team's identity in the Premier League. The match highlighted Arsenal's resilience and competitive spirit.",
    "published": "2025-09-28T19:57:24Z"
  }
]