[
  {
    "title": "England v South Africa: first men’s T20 international – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/10/england-v-south-africa-first-mens-t20-international-live",
    "image": "https://media.guim.co.uk/d4a873d19bfd5c5e5078d224338c7c51414a6187/1000_0_5000_4000/500.jpg",
    "summary": "Tim de Lisle will provide detailed over-by-over commentary for the inaugural men's T20 match between England and South Africa, taking place in Cardiff. Fans can tune in for live updates and insights throughout the game. This highly anticipated clash marks the opening of the series.",
    "published": "2025-09-10T19:22:30Z"
  },
  {
    "title": "Donald Trump asks for prayers for Charlie Kirk after rightwing activist was shot at Utah university event – latest updates",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/10/donald-trump-jeffrey-epstein-tariffs-immigration-crime-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/dfa838850b730de7152474621d32978a075bdc47/300_0_3000_2400/500.jpg",
    "summary": "The U.S. president made a post on Truth Social regarding an incident that is under scrutiny. FBI Director announced that the agency is closely monitoring the situation at the event. Details about the incident remain limited as investigations continue.",
    "published": "2025-09-10T19:22:00Z"
  },
  {
    "title": "Prince Harry visits King Charles in first face-to-face meeting for 19 months",
    "url": "https://www.theguardian.com/uk-news/2025/sep/10/prince-harry-visits-king-charles-in-first-face-to-face-meeting-for-19-months",
    "image": "https://media.guim.co.uk/761a3ac14639f1553678a11bd886fff577404203/999_378_2600_2080/500.jpg",
    "summary": "A meeting took place at Clarence House following the Duke of Sussex's expression of hope for reconciliation with his family in May. This signifies ongoing efforts to mend familial ties amid reported tensions. The gathering suggests a willingness to address and resolve personal differences.",
    "published": "2025-09-10T19:19:43Z"
  },
  {
    "title": "Poland ‘closer to military conflict than at any time since WW2’ as Nato allies weigh response to Russian drones",
    "url": "https://www.theguardian.com/world/2025/sep/10/poland-shoots-down-drones-over-its-territory-amid-russian-attack-on-ukraine-says-military",
    "image": "https://media.guim.co.uk/d2ca733cdb6fe2ceab77c1a309d05c366e9ae1ec/2783_1389_4599_3680/500.jpg",
    "summary": "Donald Tusk has described Poland as facing a significant provocation following at least 19 incidents of airspace violations. He emphasized the seriousness of the situation and its implications for national security. The occurrences have raised concerns about border integrity and regional stability.",
    "published": "2025-09-10T19:00:02Z"
  },
  {
    "title": "Trump ally Charlie Kirk shot during event at Utah Valley University",
    "url": "https://www.theguardian.com/us-news/2025/sep/10/charlie-kirk-shot-utah",
    "image": "https://media.guim.co.uk/be80fe1494d150130f0aac1a0d7c4e385e3ce729/263_0_2625_2100/500.jpg",
    "summary": "Turning Point USA's executive director was seen in a video被struck by an unknown assailant during an incident. The current condition of the executive director remains unclear. Further details surrounding the incident have yet to be released.",
    "published": "2025-09-10T18:57:07Z"
  }
]