[
  {
    "title": "World Cup qualifying buildup to England v Andorra, WSL Q&A  and Football League – matchday live",
    "url": "https://www.theguardian.com/football/live/2025/sep/06/world-cup-qualifying-buildup-to-england-v-andorra-wsl-qa-and-football-league-matchday-live",
    "image": "https://media.guim.co.uk/6bbdd2e6e47c70dd6499708786934a74327eed03/0_0_5000_4000/500.jpg",
    "summary": "Football news updates highlight preparations for Saturday's World Cup qualifying matches and Women's Super League (WSL) action. Teams are gearing up for crucial fixtures as players aim to secure their spots for the upcoming tournaments. Fans can expect exciting competitions and key developments in both men's and women's football.",
    "published": "2025-09-06T07:22:14Z"
  },
  {
    "title": "Uefa has last chance to keep genie of domestic matches abroad in its bottle",
    "url": "https://www.theguardian.com/football/2025/sep/06/uefa-has-last-chance-to-keep-genie-of-domestic-matches-abroad-in-its-bottle",
    "image": "https://media.guim.co.uk/8f0815e37e9d021deb656e2504e97c95b96cd241/276_0_2668_2134/500.jpg",
    "summary": "La Liga and Serie A are seeking Uefa's approval to host football matches outside their home countries. This move raises concerns about the impact on domestic leagues and traditional football culture. Critics warn that such international ventures could undermine the essence of local football.",
    "published": "2025-09-06T07:00:46Z"
  },
  {
    "title": "Why the legacy of East Germany’s prefab housing blocks is more relevant than ever",
    "url": "https://www.theguardian.com/world/2025/sep/06/why-the-legacy-of-east-germanys-prefab-housing-blocks-is-more-relevant-than-ever",
    "image": "https://media.guim.co.uk/92e819512e25acfbc8a5283ec9c39fe758bfa3a6/0_771_2126_1700/500.jpg",
    "summary": "A new exhibition is revisiting the evolution of once-progressive developments that later faced criticism. It aims to highlight their significance within a collective experience. The show seeks to reframe the narrative around these developments and their impact on society.",
    "published": "2025-09-06T07:00:46Z"
  },
  {
    "title": "Tennis is new front in TV sport wars as Sky and TNT target female viewers",
    "url": "https://www.theguardian.com/sport/2025/sep/06/tennis-sky-sports-broadcasters-female-viewers",
    "image": "https://media.guim.co.uk/7649fa59fa522ecf850302eb70e33f0e023fe4bc/368_92_2372_1897/500.jpg",
    "summary": "Sky Sports has reported that while their overall audience is 31% female, this figure rises significantly to 58% for tennis. An executive noted that no other sport matches this level of female viewership. The data highlights the unique appeal of tennis among female audiences.",
    "published": "2025-09-06T07:00:46Z"
  },
  {
    "title": "‘No pets, no guests, no music’ – and now ‘no wfh’: why house-share ads are getting ever stricter | Kimi Chaddah",
    "url": "https://www.theguardian.com/commentisfree/2025/sep/06/house-share-landlord-pets-guests-music-wfh",
    "image": "https://media.guim.co.uk/d4687b59ea5f02aa5e4a75d516f302166d7eb410/0_50_5500_4400/500.jpg",
    "summary": "Writer Kimi Chaddah highlights that not only landlords but also flatmates are enforcing strict rules in shared living situations. This tension stems from a housing system that fosters competition among tenants. The article suggests that the underlying issue is a flawed system that exacerbates conflicts among those living together.",
    "published": "2025-09-06T07:00:46Z"
  }
]