[
  {
    "title": "Jaguar Land Rover aims to restart limited production after cyber-attack",
    "url": "https://www.theguardian.com/business/2025/oct/06/jaguar-land-rover-restart-production-cyberattack",
    "image": "https://media.guim.co.uk/3a5b0333e3cdae13d1c7b449e722660775a06eea/39_0_4818_3856/500.jpg",
    "summary": "A British carmaker plans to restart production at its plants in Wolverhampton, Solihull, and Slovakia. The company aims to recover from previous disruptions affecting its manufacturing operations. Resuming output is seen as a crucial step towards stabilizing production and meeting demand.",
    "published": "2025-10-06T18:26:58Z"
  },
  {
    "title": "White House calls court ruling blocking Portland national guard deployment ‘untethered from reality’ – live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/06/donald-trump-national-guard-ice-government-shutdown-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/3bc69b7f6e83b19047beea88192f0d34f3fd1323/364_0_2249_1799/500.jpg",
    "summary": "Karoline Leavitt has criticized a decision made by a Trump-appointed judge regarding Trump's plan to deploy military forces in Chicago. The lawsuit from Illinois claims that the deployment is based on a \"flimsy pretext.\" Leavitt's remarks highlight concerns over the legality and justification of the military's involvement.",
    "published": "2025-10-06T18:22:34Z"
  },
  {
    "title": "DfE failure to plan for Covid school closures was ‘extraordinary dereliction of duty’, academy head tells inquiry",
    "url": "https://www.theguardian.com/uk-news/2025/oct/06/dfe-failure-to-plan-for-covid-school-closures-was-extraordinary-dereliction-of-duty-academy-head-tells-inquiry",
    "image": "https://media.guim.co.uk/75b4ebf8e722e98085138efd7f1101a6a5f41fda/288_0_1331_1065/500.jpg",
    "summary": "Jon Coles expressed his astonishment at the government's inadequate planning regarding school closures. He emphasized that it was \"perfectly clear\" that schools were likely to shut down. This lack of foresight has raised serious concerns about the government's preparedness.",
    "published": "2025-10-06T18:13:39Z"
  },
  {
    "title": "Man arrested on suspicion of arson after fire at mosque in East Sussex",
    "url": "https://www.theguardian.com/uk-news/2025/oct/06/man-arrested-suspicion-arson-fire-mosque-east-sussex",
    "image": "https://media.guim.co.uk/1bcbf8c9d40cd3e66451571983fa16d8994c70fd/437_0_1350_1080/500.jpg",
    "summary": "Police in Peacehaven are investigating a fire and have identified a 46-year-old suspect for arson with intent to endanger life. The investigation is ongoing as authorities gather evidence. No injuries have been reported in connection with the blaze.",
    "published": "2025-10-06T18:10:52Z"
  },
  {
    "title": "Israel-Premier Tech to change its name and move away from ‘current identity’",
    "url": "https://www.theguardian.com/sport/2025/oct/06/israel-premier-tech-name-change-vuelta-a-espana-pro-palestinian-protests-cycling",
    "image": "https://media.guim.co.uk/3b452e810819dcabf0e5a2aac840004f76b45d29/81_0_1355_1084/500.jpg",
    "summary": "The cycling team, recently in the spotlight for pro-Palestinian protests during races, has announced a crucial step to ensure its future. The team emphasized the importance of this decision amid ongoing controversies. This move highlights the intersection of sports and social activism.",
    "published": "2025-10-06T18:10:22Z"
  }
]