[
  {
    "title": "François Bayrou leaves Élysée after resigning as France’s PM – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/sep/09/france-crisis-government-emmanuel-macron-europe-latest-live-news-updates",
    "image": "https://media.guim.co.uk/fcc50c8a6b1183ca669b07008305324f3acb3433/2_0_4302_3441/500.jpg",
    "summary": "French President Emmanuel Macron is set to announce his successor in the coming days amid an escalating political crisis. The move comes as tensions rise within the government and public discontent grows. This decision is seen as crucial for stabilizing the political landscape in France.",
    "published": "2025-09-09T13:40:24Z"
  },
  {
    "title": "Somerset v Yorkshire, Leicestershire v Gloucestershire and more: county cricket, day two – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/09/somerset-v-yorkshire-leicestershire-v-gloucestershire-and-more-county-cricket-day-two-live",
    "image": "https://media.guim.co.uk/acb6a829fb2bdc9c6cb8e49db1038ba82c946d16/508_0_4005_3207/500.jpg",
    "summary": "Tanya Aldred provides live updates from the county grounds on day two of the current round of fixtures. Fans can follow her coverage for the latest developments and highlights. Stay tuned for insights and key moments from the matches.",
    "published": "2025-09-09T13:39:54Z"
  },
  {
    "title": "Blasts heard in Doha as Israel says it is targeting Hamas leadership – Middle East crisis live",
    "url": "https://www.theguardian.com/world/live/2025/sep/09/israel-gaza-city-evacuation-order-idf-military-offensive-live-updates-middle-east-crisis-latest-news",
    "image": "https://media.guim.co.uk/b08e33d1807139527bced5f55820091edc296300/153_0_4595_3676/500.jpg",
    "summary": "Explosions were reported in various locations in Qatar as the IDF and Shin Bet announced strikes against individuals they hold accountable for the October 7 massacre. The operation targets those directly involved in orchestrating the attack. The situation highlights ongoing tensions and the Israeli response to security threats.",
    "published": "2025-09-09T13:38:20Z"
  },
  {
    "title": "Lucy Powell to stand for Labour deputy leadership after reshuffle sacking – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/09/bridget-phillipson-labour-deputy-leader-uk-politics-latest-news-updates-keir-starmer",
    "image": "https://media.guim.co.uk/8eb13decf4af5bc6c7231b319863f1b3ae8ea9dc/16_0_4583_3667/500.jpg",
    "summary": "The former leader of the Commons has entered the race alongside candidates Emily Thornberry, Bridget Phillipson, Bell Ribeiro-Addy, and Paula Barker. This development adds to the competition among prominent political figures. The election is poised to showcase a range of perspectives and policies.",
    "published": "2025-09-09T13:36:20Z"
  },
  {
    "title": "FCA warns car finance firms over ‘lost’ data amid £18bn compensation scheme",
    "url": "https://www.theguardian.com/business/2025/sep/09/fca-car-finance-firms-compensation-scheme-car-loans",
    "image": "https://media.guim.co.uk/e4b0f7c022073307043d0a4fb61464e97d00154f/3_0_4687_3750/500.jpg",
    "summary": "City regulators are set to contest banks and lenders that assert they lack documentation regarding mis-sold car loans. The move aims to hold these financial institutions accountable for potential misdeeds. This initiative emphasizes the regulator's commitment to consumer protection and financial transparency.",
    "published": "2025-09-09T13:35:33Z"
  }
]