[
  {
    "title": "Cape Verde seal historic debut place at World Cup 2026 and deny Cameroon",
    "url": "https://www.theguardian.com/football/2025/oct/13/cape-verde-book-world-cup-2026-place-eswatini-cameroon",
    "image": "https://media.guim.co.uk/efad4115d45bbb08e0e4aed355a5200ee2c1f13a/1387_210_4427_3541/500.jpg",
    "summary": "Cape Verde secured a spot in the men's World Cup by defeating Eswatini 3-0 at home. This achievement makes them the second smallest nation to ever qualify for the tournament. Their victory marks a significant milestone in Cape Verde's football history.",
    "published": "2025-10-13T18:22:42Z"
  },
  {
    "title": "All living Israeli hostages freed and hundreds of Palestinian detainees and prisoners released as Trump leads Egypt summit – live",
    "url": "https://www.theguardian.com/world/live/2025/oct/13/gaza-ceasefire-live-updates-israel-hostages-release-hamas-trump-middle-east",
    "image": "https://media.guim.co.uk/3335e41e059e1c25b39bc7c74536ee353f73ad85/1689_1054_2699_2160/500.jpg",
    "summary": "US President Joe Biden is in Egypt for a global summit following the release of hostages by Israel. Families of the hostages welcomed their loved ones home, while Palestinian detainees were also freed. The gathering highlights ongoing tensions and efforts toward peace in the region.",
    "published": "2025-10-13T18:22:15Z"
  },
  {
    "title": "Wales v Belgium: World Cup 2026 qualifying – live",
    "url": "https://www.theguardian.com/football/live/2025/oct/13/wales-v-belgium-world-cup-2026-qualifying-live",
    "image": "https://media.guim.co.uk/a77ba1a1da3382d89b955010379f34755ad3cca1/415_0_4663_3731/500.jpg",
    "summary": "Craig Bellamy's team is aiming for a crucial win against Belgium, which could significantly boost their chances of qualifying for next summer's finals. Michael Butler will cover the match. The outcome could determine their path to the tournament.",
    "published": "2025-10-13T18:19:15Z"
  },
  {
    "title": "Obama takes aim at companies cutting deals with Trump: ‘We have capacity to take a stand’",
    "url": "https://www.theguardian.com/us-news/2025/oct/13/obama-trump-administration-deals-settlements",
    "image": "https://media.guim.co.uk/eb263907e13d4026a6fa9c1239d495c052f28bbb/0_0_4257_3405/500.jpg",
    "summary": "A former president criticized universities, law firms, and businesses for altering their positions in response to societal pressures, arguing they should have remained committed to their principles. He emphasized the importance of standing by one's convictions, even in the face of challenges. The comments reflect a broader discussion on institutional integrity and accountability.",
    "published": "2025-10-13T18:12:19Z"
  },
  {
    "title": "Government made ‘every effort’ to support China spy case, says minister",
    "url": "https://www.theguardian.com/politics/2025/oct/13/government-made-every-effort-to-support-china-spy-case-says-minister",
    "image": "https://media.guim.co.uk/8313073e626002f699a1531407e1311cc0190869/189_0_894_715/500.jpg",
    "summary": "Dan Jarvis has criticized the Conservative Party for insinuating that charges by the Crown Prosecution Service (CPS) were intentionally dropped. He contends that these claims are made \"without a shred of evidence.\" Jarvis's remarks highlight concerns over political narratives surrounding legal decisions.",
    "published": "2025-10-13T18:10:39Z"
  }
]