[
  {
    "title": "US Open tennis day three: Swiatek through, Boulter and Kartal exit, Sinner to come – live",
    "url": "https://www.theguardian.com/sport/live/2025/aug/26/us-open-tennis-day-three-jannik-sinner-and-iga-swiatek-in-action-live",
    "image": "https://media.guim.co.uk/3408d91a8460d5b33e827b254687bfebf73f1b3f/796_92_3389_2711/500.jpg",
    "summary": "Taha Hashim will provide updates on the opening matches of the two favorites in the tournament. Fans are eager to see how these teams perform in their first games. Stay tuned for live updates and analysis.",
    "published": "2025-08-26T17:33:23Z"
  },
  {
    "title": "Kairat v Celtic, Leeds v Sheffield Wednesday: Champions League and Carabao Cup clockwatch – live",
    "url": "https://www.theguardian.com/football/live/2025/aug/26/kairat-v-celtic-leeds-v-sheffield-wednesday-champions-league-and-carabao-cup-clockwatch-live",
    "image": "https://media.guim.co.uk/d143f57a281a219b3f915388a3ccc4dc37e4e455/108_0_2642_2113/500.jpg",
    "summary": "Simon Burnton delivers the latest scores and updates from football matches across Europe and England. Fans can keep track of key events and results as they unfold. The coverage aims to provide real-time information for enthusiasts following their favorite teams.",
    "published": "2025-08-26T17:32:29Z"
  },
  {
    "title": "Christian Pulisic returns but Weston McKennie left off USMNT roster for friendlies",
    "url": "https://www.theguardian.com/football/2025/aug/26/usmnt-roster-christian-pulisic-weston-mckennie-jonathan-klinsmann",
    "image": "https://media.guim.co.uk/3c3535bcd507286d6896d5d6e8a3b7fc5a4da2d3/0_51_3606_2885/500.jpg",
    "summary": "Christian Pulisic has confirmed his return to the U.S. national team after opting out of the summer matches. Coach Mauricio Pochettino has named a squad of 22 players, with an additional selection anticipated soon. Pulisic's presence is expected to bolster the team ahead of upcoming fixtures.",
    "published": "2025-08-26T17:32:18Z"
  },
  {
    "title": "The Guardian view on Nigel Farage’s mass deportation plan: Trumpism in a union jack | Editorial",
    "url": "https://www.theguardian.com/commentisfree/2025/aug/26/the-guardian-view-on-nigel-farages-mass-deportation-plan-trumpism-in-a-union-jack",
    "image": "https://media.guim.co.uk/08e9cd563cd8cd6464c16776bed97e3fb38aa7c8/948_347_6211_4969/500.jpg",
    "summary": "Reform UK's leader appears to be undermining democratic principles by prioritizing fear-based tactics over sound border control policies. This shift raises concerns about the erosion of democratic constraints in favor of authoritarian narratives. The implications of such changes could significantly impact governance and civil liberties.",
    "published": "2025-08-26T17:31:11Z"
  },
  {
    "title": "‘Trump has no authority’: Lisa Cook’s lawyer vows to sue administration over attempted firing of Fed governor – live",
    "url": "https://www.theguardian.com/us-news/live/2025/aug/26/trump-federal-reserve-lisa-cook-news-updates-us-politics-live",
    "image": "https://media.guim.co.uk/bb80bf6325afd21c5ae02bce7d87dc97c1a4eea9/0_0_3000_2400/500.jpg",
    "summary": "A lawyer representing a Federal Reserve governor claims that the Trump administration's attempt to remove her is unfounded, lacking both factual and legal support. The statement signals a strong defense against the administration's actions. The situation highlights ongoing tensions between the Fed and the former administration.",
    "published": "2025-08-26T17:31:05Z"
  }
]