[
  {
    "title": "Farage claims Reform would detain women and children asylum seekers on arrival but can’t name a single location to house migrants - live",
    "url": "https://www.theguardian.com/politics/live/2025/aug/26/nigel-farage-mass-deportations-reform-migration-small-boats-uk-politics-live",
    "image": "https://media.guim.co.uk/e8b7a1ed496a920d0d07260b55fee2c2779e3160/135_0_5320_4256/500.jpg",
    "summary": "Nigel Farage has announced Reform UK's strategy to deport 600,000 asylum seekers, proposing the repeal of human rights laws to facilitate this plan. The proposal includes provisions to detain up to 24,000 illegal migrants concurrently. This initiative is part of the party's agenda for the upcoming election.",
    "published": "2025-08-26T10:42:38Z"
  },
  {
    "title": "Trump’s attempt to fire Federal Reserve chief denounced as ‘authoritarian power grab’ - US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/aug/26/trump-federal-reserve-lisa-cook-news-updates-us-politics-live",
    "image": "https://media.guim.co.uk/8c0d132cafe709eddec2a9ad2e44629b19958282/0_0_3000_2400/500.jpg",
    "summary": "Former President Trump faces accusations of fabricating mortgage fraud allegations against economist Lisa Cook, prompting strong backlash from leading Democrats. The accusations have sparked debates about political motives and the integrity of the claims. Cook, known for her contributions to economic policy, is defended by her supporters, who denounce the allegations as baseless.",
    "published": "2025-08-26T10:42:31Z"
  },
  {
    "title": "Israeli security cabinet to discuss Gaza and hostage deal amid families’ protests – Middle East crisis live",
    "url": "https://www.theguardian.com/world/live/2025/aug/26/israel-gaza-protest-hostage-war-hospital-benjamin-netanyahu-latest-live-news-updates",
    "image": "https://media.guim.co.uk/b1c715739878d468a640a7031f1d7049f7bbdac3/551_0_4585_3668/500.jpg",
    "summary": "Relatives of captured individuals convened in Hostages Square, Tel Aviv, to advocate for their loved ones. They organized a press conference to raise awareness and share their stories. The gathering highlighted the emotional impact of the ongoing situation.",
    "published": "2025-08-26T10:38:56Z"
  },
  {
    "title": "Finnish president says he hopes Trump’s patience with Putin will run out soon - Europe live",
    "url": "https://www.theguardian.com/world/live/2025/aug/26/donald-trump-putin-zelenskyy-france-meeting-europe-live",
    "image": "https://media.guim.co.uk/477ac28699b2237288db7470555603ec1d9665f0/2048_2232_2683_2146/500.jpg",
    "summary": "Alexander Stubb comments that Russia is using typical delaying tactics amid ongoing tensions. Meanwhile, Donald Trump warns of potential 'consequences' if a meeting between Vladimir Putin and Volodymyr Zelenskyy does not occur. The situation underscores rising concerns over diplomatic progress in the conflict.",
    "published": "2025-08-26T10:35:50Z"
  },
  {
    "title": "Fancy a cuppa? My epic kettle showdown – and what I learned",
    "url": "https://www.theguardian.com/thefilter/2025/aug/22/everything-i-learned-testing-kettles",
    "image": "https://media.guim.co.uk/ecc8249914bca79309898f489c832476a6ad9ff1/967_0_7088_5671/500.jpg",
    "summary": "The article explores ways to enhance your sex life with creative suggestions. It also reviews and tests top kettles for boiling water efficiently. Additionally, it covers the best office chairs to improve comfort and productivity while working.",
    "published": "2025-08-26T10:34:19Z"
  }
]