[
  {
    "title": "Wire that fell on Sydney train causing chaos identified in 2020 as risky but then inspected with binoculars",
    "url": "https://www.theguardian.com/australia-news/2025/sep/23/ydney-train-fallen-wire-commuter-chaos-identified-as-beyond-breaking-limits-2020",
    "image": "https://media.guim.co.uk/c9eb2ef8140fb14b627fa5aab1cbc73e01cbdf9a/182_0_1111_889/500.jpg",
    "summary": "A report on a May incident reveals that the visual inspections of high-voltage wires conducted over the past five years used binoculars that were insufficient for adequate viewing. This lack of proper inspection techniques may have contributed to safety concerns. Recommendations for improved inspection methods are likely to follow.",
    "published": "2025-09-23T05:24:31Z"
  },
  {
    "title": "Australia news live: chief medical officer and TGA reject Trump’s paracetamol claims; police dog and handler injured in Melbourne collision",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/23/australia-news-live-albanese-new-york-palestine-united-nations-donald-trump-mark-butler-paracetamol-pregnancy-ntwnfb",
    "image": "https://media.guim.co.uk/f7fcfb7a354d9d613f496b984152793fa11b1c5b/449_0_4560_3648/500.jpg",
    "summary": "Please provide the news that you would like me to summarize.",
    "published": "2025-09-23T05:23:36Z"
  },
  {
    "title": "TV tonight: can Romesh Ranganathan’s standup show improve lives? ",
    "url": "https://www.theguardian.com/tv-and-radio/2025/sep/23/tv-tonight-can-romesh-ranganathans-standup-show-improve-lives",
    "image": "https://media.guim.co.uk/b1c0de4ac23bbb8c23d32f3bb6cd826e850aa798/909_321_6270_5018/500.jpg",
    "summary": "The comedian explores a unique approach with his latest project, while Liz Hurley's outrageous reality show reaches its finale. Viewers can look forward to an entertaining evening of new content. Don't miss out on these highlights!",
    "published": "2025-09-23T05:20:38Z"
  },
  {
    "title": "Sydney’s Night Stalker rapist pleads guilty to 13 charges over attacks against women in 1990s",
    "url": "https://www.theguardian.com/australia-news/2025/sep/23/sydney-night-stalker-rapist-pleads-guilty-13-charges-over-1990s-attacks-against-women-ntwnfb",
    "image": "https://media.guim.co.uk/1253da7e9671f5887214880ef24d3999ccfe6a22/302_0_2651_2121/500.jpg",
    "summary": "Glenn Gary Cameron was arrested at Sydney airport in early 2024, with his identity previously kept secret following advancements in forensic technology. Authorities are now unveiling details about his case. The breakthrough has sparked discussions on the implications of forensic science in law enforcement.",
    "published": "2025-09-23T05:13:14Z"
  },
  {
    "title": "Tenants’ complaints about poor social housing in England jump 43% in a year",
    "url": "https://www.theguardian.com/society/2025/sep/23/tenants-complaints-about-poor-social-housing-in-england-jump-43-percent-ombudsman",
    "image": "https://media.guim.co.uk/2e9dc24f17d063dce5fc0bffb557fc83bebc0019/3928_1217_1462_1169/500.jpg",
    "summary": "The Ombudsman reported making 26,901 interventions to address various issues, including resolving a case where a child's bedroom window was boarded up for four years. These actions highlight significant neglect and the need for improved responsiveness in essential services. The report underscores the role of the Ombudsman in advocating for citizens' rights and resolving systemic failures.",
    "published": "2025-09-23T05:00:41Z"
  }
]