[
  {
    "title": "AFL grand final 2025 live updates: Geelong Cats v Brisbane Lions ",
    "url": "https://www.theguardian.com/sport/live/2025/sep/27/afl-grand-final-2025-live-updates-geelong-vs-lions-blog-scores-results-start-time-cats-v-lions-mcg",
    "image": "https://media.guim.co.uk/17a9e819ee1d8c3b8f82d1f261ea8c270cdf459f/387_0_4207_3367/500.jpg",
    "summary": "The upcoming match features the Cats aiming for their third premiership under coach Chris Scott's leadership within 15 years. Meanwhile, the Lions seek to defend their title and achieve back-to-back championships. Join the writers for pre-game analysis and insights.",
    "published": "2025-09-27T04:21:56Z"
  },
  {
    "title": "Bledisloe Cup live updates: New Zealand All Blacks v Australia Wallabies – Rugby Championship",
    "url": "https://www.theguardian.com/sport/live/2025/sep/27/bledisloe-cup-live-updates-new-zealand-all-blacks-vs-wallabies-australia-rugby-championship-scores-results-kick-off-time-eden-park-auckland",
    "image": "https://media.guim.co.uk/5d4134e96653a4fc50ae0bafe376912b062bef94/347_0_3590_2872/500.jpg",
    "summary": "The Wallabies aim to break their losing streak at Eden Park and make significant progress in the Rugby Championship. The match report is provided by Jonathan Howcroft, detailing the action as it unfolds minute by minute. Fans are eager to see if the Wallabies can overcome their past challenges at this iconic venue.",
    "published": "2025-09-27T04:17:05Z"
  },
  {
    "title": "Barricades in Bari: why the city’s ‘pasta grannies’ are under scrutiny",
    "url": "https://www.theguardian.com/world/2025/sep/27/barricades-in-bari-pasta-grannies-under-scrutiny-italy",
    "image": "https://media.guim.co.uk/7c252221372f4f49140e1e77c01d8631f0b51693/458_0_4583_3668/500.jpg",
    "summary": "Sellers of fresh orecchiette in southern Italy are defending their authenticity after claims surfaced that they are deceiving tourists by selling pre-packaged pasta. In response to these accusations, local vendors are emphasizing the traditional preparation methods and quality of their products. The controversy highlights the tensions between preserving culinary traditions and the pressures of tourism.",
    "published": "2025-09-27T04:00:32Z"
  },
  {
    "title": "Moldova’s election is a choice between two paths: pro-Europe or pro-Russia",
    "url": "https://www.theguardian.com/world/2025/sep/27/moldova-election-determine-future-europe-russia",
    "image": "https://media.guim.co.uk/78e5fbe651d553e28f1a3ec70cd8258b7d5d660a/418_0_4182_3345/500.jpg",
    "summary": "The ruling party with pro-Western leanings is encountering significant opposition as it prepares for elections. Reports suggest potential interference from the Kremlin, intensifying the political landscape. The situation raises concerns about the integrity of the democratic process in the region.",
    "published": "2025-09-27T04:00:32Z"
  },
  {
    "title": "Cradle Mountain tourist dies after walking group overwhelmed by extreme weather at national park",
    "url": "https://www.theguardian.com/australia-news/2025/sep/27/cradle-mountain-tourist-dies-after-walking-group-overwhelmed-by-extreme-weather-at-national-park",
    "image": "https://media.guim.co.uk/449be68b7c73e311c756852c71a2466ca0393084/48_0_960_768/500.jpg",
    "summary": "Tasmania police reported that a group of four Chinese nationals was located by fellow hikers on Friday. Sadly, one woman among the group lost her life. Authorities are currently investigating the circumstances surrounding the incident.",
    "published": "2025-09-27T02:27:18Z"
  }
]