[
  {
    "title": "Starmer says he has confidence in Peter Mandelson despite resurfaced ties to Jeffrey Epstein – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/10/keir-starmer-isaac-herzog-pmqs-labour-kemi-badenoch-uk-politics-live-news-updates",
    "image": "https://media.guim.co.uk/7128bab0ba4f4ce9a68e9a5f263566b65aff5580/156_0_1084_867/500.jpg",
    "summary": "Prime Minister faced questioning from Kemi Badenoch regarding Peter Mandelson's suitability for the position of US ambassador. The scrutiny highlights concerns over Mandelson's qualifications for the role. The exchange underscores ongoing debates about key appointments in the government.",
    "published": "2025-09-10T11:23:54Z"
  },
  {
    "title": "Our Brother review – power games with Pol Pot",
    "url": "https://www.theguardian.com/stage/2025/sep/10/our-brother-review-pol-pot-oran-mor-glasgow",
    "image": "https://media.guim.co.uk/76a58709ce2b6ff16ba7f3f58c7292a0e49e687f/800_63_1078_862/500.jpg",
    "summary": "In Jack MacGregor's play, a naive Scottish academic receives an unexpected opportunity to meet with a genocidal Cambodian dictator. The encounter explores themes of morality, power, and the complexities of historical contexts. As the academic navigates this dangerous interaction, the narrative delves into the consequences of naivety in the face of tyranny.",
    "published": "2025-09-10T11:19:32Z"
  },
  {
    "title": "Surrey v Warwickshire, Somerset v Yorkshire and more: county cricket – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/10/surrey-v-warwickshire-somerset-v-yorkshire-and-more-county-cricket-live",
    "image": "https://media.guim.co.uk/f0ff7d69f121d19d04ce8d7c69d556f5c26cbf89/707_0_2685_2149/500.jpg",
    "summary": "Tanya Alfred provides key updates from day three of the County Championship, highlighting matches taking place at Lord's and the Oval. The report covers significant performances and developments in the ongoing matches. Stay tuned for insights into team standings and player highlights.",
    "published": "2025-09-10T11:18:59Z"
  },
  {
    "title": "White House says it would back forensic analysis of signature on Epstein letter – US politics live blog",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/10/donald-trump-jeffrey-epstein-tariffs-immigration-crime-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/0c0b861dffbed2c5f5b6b925a323c63c5fe26fa6/1549_0_3267_2613/500.jpg",
    "summary": "Trump officials are maintaining that a suggestive note and drawing attributed to the president were not created by him. They have firmly refuted claims linking the artworks to Donald Trump. The controversy surrounding the items continues to attract media attention.",
    "published": "2025-09-10T11:18:15Z"
  },
  {
    "title": "New French PM takes office as ‘Block Everything’ protests rock country – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/sep/10/france-block-everything-protests-macron-lecornu-europe-live-news-updates",
    "image": "https://media.guim.co.uk/49aa09c6389391c30114a68ffa44f289fbb77b90/258_0_2778_2223/500.jpg",
    "summary": "Sebastien Lecornu has been appointed amid widespread protests in France. Demonstrators clashed with authorities, attempting to breach the Gare du Nord station in Paris, where approximately 1,000 people gathered. The unrest reflects growing public discontent over various issues in the country.",
    "published": "2025-09-10T11:17:59Z"
  }
]