[
  {
    "title": "Most of 475 people arrested by US immigration agents at Georgia Hyundai facility are Korean nationals – live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/05/donald-trump-pentagon-department-of-war-immigration-tariffs-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/044eb5ce3fb7049437c4044c77272848f314af01/996_0_5000_4000/500.jpg",
    "summary": "ICE's investigative unit carried out a warrant as part of a continuing criminal investigation, according to a spokesperson from Homeland Security. The details of the investigation have not been disclosed. This action reflects ongoing efforts by ICE to address criminal activity.",
    "published": "2025-09-05T21:25:59Z"
  },
  {
    "title": "Eric Adams says he’s staying in New York mayoral race amid dropout reports",
    "url": "https://www.theguardian.com/us-news/2025/sep/05/eric-adams-staying-in-mayoral-race",
    "image": "https://media.guim.co.uk/cd4cc619f03047c27e6ccd57e540fde7320aaea2/293_0_2913_2333/500.jpg",
    "summary": "Trump is urging Adams, who is currently polling in single digits, to withdraw from the race. This pressure aims to consolidate support and prevent Mamdani from gaining traction. The move reflects Trump's strategy to influence the outcome of the campaign.",
    "published": "2025-09-05T21:25:36Z"
  },
  {
    "title": "US Open tennis 2025: Novak Djokovic v Carlos Alcaraz, men’s semi-final – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/05/us-open-tennis-2025-novak-djokovic-carlos-alcaraz-mens-semi-final-live",
    "image": "https://media.guim.co.uk/d4c3c9f92a73650c161ca7d798ef57f383d47291/399_272_1866_1493/500.jpg",
    "summary": "Katy Murrells provides live updates from the first men's semi-final at Flushing Meadows. Keep an eye on the game-by-game report for key moments and developments. Fans can stay engaged with the action as it unfolds.",
    "published": "2025-09-05T21:21:56Z"
  },
  {
    "title": "Denmark v Scotland, Isak in action for Sweden and more: 2026 World Cup qualifiers - clockwatch",
    "url": "https://www.theguardian.com/football/live/2025/sep/05/denmark-v-scotland-isak-in-action-for-sweden-and-more-2026-world-cup-qualifiers-clockwatch",
    "image": "https://media.guim.co.uk/6f48e53f0f8393d319ce17cfc80cc2f9d72b6c03/402_9_1839_1471/500.jpg",
    "summary": "Scotland secured a notable draw against their opponents at Parken Stadium. Meanwhile, France, Croatia, Italy, Greece, Iceland, Czechia, and Israel all achieved victories in their respective matches. The results highlight a successful day for several European teams in international play.",
    "published": "2025-09-05T21:18:02Z"
  },
  {
    "title": "Rare total lunar eclipse ‘blood moon’ to be visible from UK",
    "url": "https://www.theguardian.com/science/2025/sep/05/rare-total-lunar-eclipse-blood-moon-to-be-visible-from-uk",
    "image": "https://media.guim.co.uk/d848cff2f17d6f86e9afc70b69aba7bdad259316/915_438_3476_2782/500.jpg",
    "summary": "A satellite will appear deep red as the Earth passes between the sun and the moon on Sunday evening at around 7:30 PM. This celestial alignment creates a stunning visual effect during an eclipse. Viewers are encouraged to watch for this rare phenomenon.",
    "published": "2025-09-05T21:11:40Z"
  }
]