[
  {
    "title": "Australia news live: Hastie says he backs Ley but is ‘a little bolder’ about policy; Andrew Forrest describes ‘real pain’ about Trump’s climate denialism",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/25/australia-news-live-penny-wong-anthony-albanese-climate-crisis-united-nations-donald-trump-turkey-cop-politics-ntwnfb",
    "image": "https://media.guim.co.uk/a82b8854334df8a044a523e87270d11a9cc6b683/1657_0_4214_3371/500.jpg",
    "summary": "I'm sorry, but I need more context or details regarding the specific news you'd like summarized. Please provide the content or topic you'd like to focus on.",
    "published": "2025-09-25T06:47:40Z"
  },
  {
    "title": "Less than 1% of population responsible for 40% of all offending in Victoria as crime rate climbs",
    "url": "https://www.theguardian.com/australia-news/2025/sep/25/victoria-crime-rate-increase-up-theft-family-violence",
    "image": "https://media.guim.co.uk/21a159251487dad0f6b9aa491b8ca912be360388/139_0_3220_2577/500.jpg",
    "summary": "In 2024-25, Victoria reported a record high in criminal incidents, with the crime rate increasing by 13.8%, according to the Crime Statistics Agency. This marks a significant rise in criminal activity across the region. The report highlights growing concerns about safety and crime management in Victoria.",
    "published": "2025-09-25T06:44:09Z"
  },
  {
    "title": "Biometric checks to visit EU could take nine months to fully enforce",
    "url": "https://www.theguardian.com/travel/2025/sep/25/biometric-checks-to-visit-eu-to-get-phased-rollout-from-october",
    "image": "https://media.guim.co.uk/267d93c69f3a634c5b4d8af7cd4ce2a1b202e1c9/716_0_4514_3610/500.jpg",
    "summary": "Registration kiosks in the UK are set to open in two weeks. However, the full enforcement of the system may take up to nine months. This timeline suggests a gradual implementation process before complete compliance is expected.",
    "published": "2025-09-25T06:26:15Z"
  },
  {
    "title": "Venetian Vespers by John Banville review – a haunting honeymoon",
    "url": "https://www.theguardian.com/books/2025/sep/25/venetian-vespers-by-john-banville-review-a-haunting-honeymoon",
    "image": "https://media.guim.co.uk/06859961e68496463d8c0281525cf4152cc15b9c/164_14_4165_3332/500.jpg",
    "summary": "The story follows an Englishman's tragic decline in late 19th-century Venice, creating an eerie atmosphere. Despite its captivating setting, the protagonist's pompous nature makes it difficult to engage with his plight. Overall, the tale's haunting qualities are overshadowed by a lack of empathy for the main character.",
    "published": "2025-09-25T06:00:31Z"
  },
  {
    "title": "Guitar ‘smashed up’ by Liam Gallagher on night Oasis split up goes to auction",
    "url": "https://www.theguardian.com/music/2025/sep/25/oasis-guitar-smashed-liam-noel-gallagher-auction",
    "image": "https://media.guim.co.uk/ced93ab1a45e55620e37ea4ac2cdbf418a683570/247_0_4725_3779/500.jpg",
    "summary": "A Red Gibson ES-355, damaged during a fight at the 2009 Rock en Seine festival, is up for sale. The guitar will be sold alongside an acoustic guitar famously used in the song \"Wonderwall.\" Both instruments are of significant interest to collectors and music fans.",
    "published": "2025-09-25T06:00:30Z"
  }
]