[
  {
    "title": "Palmer set to return against Arsenal, Slot defiant, Europa League reaction – football live",
    "url": "https://www.theguardian.com/football/live/2025/nov/28/premier-league-news-europa-league-reaction-previews-and-more-football-live",
    "image": "https://media.guim.co.uk/72d1a19d4bbf773e93cf44bca8c4699c5991beeb/641_107_2668_2134/500.jpg",
    "summary": "A rolling report provides the latest updates and reactions in football as the weekend approaches. Writers are covering key events and news stories in the sport. Fans can stay informed about ongoing developments in the football world.",
    "published": "2025-11-28T11:17:44Z"
  },
  {
    "title": "Pub chain Mitchells & Butlers faces £130m hit from rising wage and food costs",
    "url": "https://www.theguardian.com/business/2025/nov/28/pub-chain-mitchells-butlers-faces-130m-hit-from-rising-wage-and-food-costs",
    "image": "https://media.guim.co.uk/3b3bf4f8a29ffd58bb704e8555d7d5d393345250/26_35_4644_3718/500.jpg",
    "summary": "A group that owns several restaurant brands, including Toby Carvery, is experiencing the effects of rising employer National Insurance contributions (NICs). The increase in costs is impacting their financial performance. The company is navigating these challenges while striving to maintain its operations.",
    "published": "2025-11-28T11:16:17Z"
  },
  {
    "title": "Ukraine’s anti-corruption authorities search properties linked to Zelenskyy’s chief of staff – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/nov/28/europe-latest-news-andriy-yermak-anti-corruption-zelenskyy-ukraine-russia-war-peace-talks-putin",
    "image": "https://media.guim.co.uk/597879bd9c804269eb6fdfb97ccc50ef89b4fafe/126_0_1621_1297/500.jpg",
    "summary": "Andriy Yermak announced that authorities have been granted full access to his apartment. He stated that he is cooperating with the officers during the investigation, with his lawyers present. This follows an unspecified inquiry involving his activities.",
    "published": "2025-11-28T11:12:01Z"
  },
  {
    "title": "Ukraine corruption scandal threatens Zelenskyy’s special relationship with top aide",
    "url": "https://www.theguardian.com/world/2025/nov/28/ukraine-corruption-scandal-threatens-zelenskyy-special-relationship-with-top-aide",
    "image": "https://media.guim.co.uk/6e93aed7159ab8a8f45da0900541ea74069cc8ac/480_0_4800_3840/500.jpg",
    "summary": "A police raid at the residence of Kyiv's primary peace negotiator has sent shockwaves through Ukraine's political landscape. The incident raises concerns about the stability of ongoing negotiations and the government's internal dynamics. Reactions from political figures reflect alarm and uncertainty regarding the implications for Ukraine's diplomatic efforts.",
    "published": "2025-11-28T11:02:18Z"
  },
  {
    "title": "High-fives all round for the Matildas as they crush New Zealand in friendly",
    "url": "https://www.theguardian.com/football/2025/nov/28/high-fives-all-round-for-the-matildas-as-they-crush-new-zealand-in-friendly",
    "image": "https://media.guim.co.uk/e301ca670b31f6f8b23b982dbf91899b7f30bb17/500_0_5000_4000/500.jpg",
    "summary": "Australia secured a convincing 5-0 victory, with goals from Amy Sayer and Hayley Raso, strengthening their confidence ahead of the upcoming Asian Cup. The win showcases the team's strong performance as they prepare for the tournament. This match serves as an encouraging sign for their campaign in the competition.",
    "published": "2025-11-28T11:02:16Z"
  }
]