[
  {
    "title": "John Bolton pleads not guilty to charges of mishandling classified information – live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/17/donald-trump-john-bolton-volodymyr-zelenskyy-us-politics-latest-news-updates",
    "image": "https://media.guim.co.uk/6420359aac3f2de8c7e4e2addd9631e81b40d214/693_0_3452_2763/500.jpg",
    "summary": "A former adviser to Donald Trump has appeared in court for the first time following an 18-count indictment issued by a federal grand jury in Maryland. The charges have not been detailed, but they likely pertain to issues related to Trump's administration. This marks a significant legal development in the ongoing investigations surrounding Trump and his associates.",
    "published": "2025-10-17T17:13:39Z"
  },
  {
    "title": "Home Office offers extra resources in bid to undo ban on Maccabi Tel Aviv fans at Aston Villa tie",
    "url": "https://www.theguardian.com/politics/2025/oct/17/government-officials-seek-lift-ban-maccabi-tel-aviv-fans-aston-villa-game",
    "image": "https://media.guim.co.uk/1917f7d9372fdedf82de95424bb87ee76cb854f1/1142_926_4003_3202/500.jpg",
    "summary": "No 10 reports that discussions are ongoing quickly regarding proposals with West Midlands police. The police have been asked to submit alternative options. The process aims to address current issues effectively.",
    "published": "2025-10-17T17:12:01Z"
  },
  {
    "title": "Young Republicans New York chapter suspended after racist chats leaked",
    "url": "https://www.theguardian.com/us-news/2025/oct/17/ny-republicans-racist-chats-suspended",
    "image": "https://media.guim.co.uk/64bd27f3e14b0dd0f775be96993313fd0b1cb4ed/683_0_6827_5464/500.jpg",
    "summary": "A group was suspended following a unanimous vote after Politico revealed that some members engaged in racist and antisemitic discussions. The decision comes in response to the documented behavior that contradicted the group's values. The suspension reflects a commitment to addressing and condemning such actions.",
    "published": "2025-10-17T17:07:40Z"
  },
  {
    "title": "‘A 360 turn’: concern as fashion shows feature fewer plus-size models",
    "url": "https://www.theguardian.com/fashion/2025/oct/17/fashion-shows-fewer-plus-size-models-vogue-business",
    "image": "https://media.guim.co.uk/488e20b1fe333ea4b700f0ead8a79659fd8ebc1e/0_156_2000_1600/500.jpg",
    "summary": "A report by Vogue Business indicates a decline in the representation of curve or mid-size models in women's fashion collections this season. This shift raises concerns about inclusivity in the industry. The trend suggests a move away from diverse body representation, impacting consumer perception and brand image.",
    "published": "2025-10-17T17:04:38Z"
  },
  {
    "title": "Postecoglou defends trophy record; Arteta backs Gyökeres, Palmer injury blow – football news as it happened",
    "url": "https://www.theguardian.com/football/live/2025/oct/17/premier-league-returns-with-liverpool-v-manchester-united-buildup-football-live",
    "image": "https://media.guim.co.uk/8dd0a07ae4a9d92cfbe69e0d8f6a283871ae11f6/0_0_3276_2621/500.jpg",
    "summary": "The Premier League is set to resume after the international break, bringing an action-packed weekend of football. Teams are gearing up for crucial matches that could impact their standings. Fans eagerly await the return of top-flight action.",
    "published": "2025-10-17T17:01:15Z"
  }
]