[
  {
    "title": "Northern Ireland v Slovakia, Sweden v Switzerland: World Cup qualifying clockwatch – live",
    "url": "https://www.theguardian.com/football/live/2025/oct/10/tuchel-criticises-silent-england-fans-world-cup-qualifying-news-and-more-football-live",
    "image": "https://media.guim.co.uk/4bcc3c77bbb6e3528b5534e72cbfea41c70c8a3f/0_0_1951_1561/500.jpg",
    "summary": "A live report is ongoing as France, Germany, and Sweden compete in World Cup qualifying matches. Writers are providing updates on the latest developments and results. Fans can follow the action as these teams vie for a spot in the tournament.",
    "published": "2025-10-10T20:20:15Z"
  },
  {
    "title": "Trump threatens ‘massive’ China tariffs as Beijing restricts rare-earth exports",
    "url": "https://www.theguardian.com/us-news/2025/oct/10/trump-china-tariffs",
    "image": "https://media.guim.co.uk/8e482f0db7c72148b29a33d4261daad28a938ca0/340_0_3407_2725/500.jpg",
    "summary": "Wall Street experienced a decline as the US president hinted at the possibility of a new trade war. Concerns grew with suggestions that a meeting with Chinese President Xi Jinping might not take place. This uncertainty contributed to investor apprehension and market losses.",
    "published": "2025-10-10T20:10:31Z"
  },
  {
    "title": "‘Substantial’ federal layoffs begin as Congress remains deadlocked over funding to end shutdown – live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/10/letitia-james-donald-trump-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/84c7b03bccaa2922d85ef889e5129dcd2e773dba/475_0_5000_4000/500.jpg",
    "summary": "Multiple U.S. government agencies, including the Treasury, HHS, DHS, and the Department of Education, have confirmed impending budget cuts. While no official figures have been disclosed, the announcements indicate significant reductions in funding. The cuts are expected to impact various programs and services provided by these departments.",
    "published": "2025-10-10T20:02:56Z"
  },
  {
    "title": "Corrections and clarifications",
    "url": "https://www.theguardian.com/news/2025/oct/10/corrections-and-clarifications",
    "summary": "Anne Marie Chebib discusses the benefits of pacing and graded exercise therapy for improving health outcomes. Pacing encourages individuals to manage their activity levels to avoid fatigue, while graded exercise therapy gradually increases physical activity to build endurance. Both approaches aim to enhance quality of life and support recovery.",
    "published": "2025-10-10T20:00:03Z"
  },
  {
    "title": "White House announces federal worker layoffs as shutdown nears third week",
    "url": "https://www.theguardian.com/us-news/2025/oct/10/federal-workers-pay-government-shutdown",
    "image": "https://media.guim.co.uk/2620816aff4ce6cb34fd3139188a567f1c07b9ed/397_0_5001_4000/500.jpg",
    "summary": "The AFL-CIO plans to challenge legal issues in court as AFSCME union leader highlights potential \"devastating effects\" on American workers. The unions express concern over recent policy changes that could impact workers' rights and benefits. The legal action aims to protect labor interests amid ongoing tensions in the labor landscape.",
    "published": "2025-10-10T19:52:59Z"
  }
]