[
  {
    "title": "West Midlands police pressed over ban on Maccabi Tel Aviv fans at Aston Villa tie",
    "url": "https://www.theguardian.com/politics/2025/oct/17/government-officials-seek-lift-ban-maccabi-tel-aviv-fans-aston-villa-game",
    "image": "https://media.guim.co.uk/1917f7d9372fdedf82de95424bb87ee76cb854f1/1142_926_4003_3202/500.jpg",
    "summary": "The area's crime commissioner is calling for a review of a recent decision affecting local law enforcement. Additionally, the culture secretary plans to engage with the Home Office regarding this matter. The move reflects concerns about the impact of the decision on public safety and crime management.",
    "published": "2025-10-17T10:19:49Z"
  },
  {
    "title": "John Bolton says he hopes to expose Trump’s ‘abuse of power’ after being indicted – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/17/donald-trump-john-bolton-volodymyr-zelenskyy-us-politics-latest-news-updates",
    "image": "https://media.guim.co.uk/fbd516d4ba8601adb49432beadce4a4fe5ff11c6/503_0_4369_3496/500.jpg",
    "summary": "A federal grand jury in Maryland has issued an eighteen-count indictment against a former adviser to Donald Trump. The ex-president labeled his former ally a \"bad guy\" in response to the charges. The indictment signifies ongoing legal challenges linked to Trump's circle.",
    "published": "2025-10-17T10:18:55Z"
  },
  {
    "title": "Alisson out for Liverpool; Manchester United stadium latest; Palmer injury setback – football live",
    "url": "https://www.theguardian.com/football/live/2025/oct/17/premier-league-returns-with-liverpool-v-manchester-united-buildup-football-live",
    "image": "https://media.guim.co.uk/085b54ad151639f57ef3c1775998534233e5227f/27_0_4736_3789/500.jpg",
    "summary": "In a rolling report, writers provide live updates as they anticipate a busy weekend of football action. Fans can follow along for the latest news and insights. Expect exciting match previews and team news leading up to the games.",
    "published": "2025-10-17T10:17:08Z"
  },
  {
    "title": "Orbán to speak with Putin as Zelenskyy prepares for White House talks with Trump – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/oct/17/viktor-orban-vladimir-putin-volodymyr-zelenskyy-donald-trump-europe-latest-news-updates-russia-ukraine-war",
    "image": "https://media.guim.co.uk/1abb5ba40089176680e374ad3db3e5c52da17ce7/489_328_3220_2576/500.jpg",
    "summary": "Donald Trump announced his plans to meet with Ukrainian President Volodymyr Zelenskyy today. Following this meeting, he is set to hold discussions with Russian President Vladimir Putin in Hungary. These talks come amid ongoing geopolitical tensions involving both nations.",
    "published": "2025-10-17T10:16:33Z"
  },
  {
    "title": "Infectious diseases in Gaza ‘spiralling out of control’, says WHO – Middle East live",
    "url": "https://www.theguardian.com/world/live/2025/oct/17/israel-gaza-ceasefire-hostages-hamas-benjamin-netanyahu-middle-east-latest-news-updates",
    "image": "https://media.guim.co.uk/726ed06187054db3c45c835841391d11bdb8de04/199_0_4560_3648/500.jpg",
    "summary": "A UN official highlighted the immense challenges posed by various health issues, including meningitis, diarrhea, and respiratory illnesses. The statement underscores the substantial efforts required to address these widespread health concerns. The official emphasized the scale of work needed to tackle these significant public health threats.",
    "published": "2025-10-17T10:10:13Z"
  }
]