[
  {
    "title": "News live: Bowen tells UN Australia’s solar and battery uptake shows climate action ‘not too hard’",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/23/australia-news-live-albanese-new-york-palestine-united-nations-donald-trump-mark-butler-paracetamol-pregnancy-ntwnfb",
    "image": "https://media.guim.co.uk/4684fc962660ae0d5cc1a19ef891b945a074bbad/53_0_6386_5109/500.jpg",
    "summary": "I apologize, but it seems you haven't provided the news article or details for me to summarize. Please share the content you want summarized, and I'll be happy to assist!",
    "published": "2025-09-23T02:53:38Z"
  },
  {
    "title": "Australian health experts warn Trump’s unfounded autism claims about paracetamol may harm pregnant women",
    "url": "https://www.theguardian.com/australia-news/2025/sep/23/australian-health-experts-warns-trumps-unfounded-claims-about-paracetamol-may-harm-pregnant-women",
    "image": "https://media.guim.co.uk/595ec2fbf5f5d1cea70e97319e06139d7c07e698/345_0_4680_3744/500.jpg",
    "summary": "The Therapeutic Goods Administration (TGA) has confirmed that a specific drug is safe for use during pregnancy. This announcement comes amidst concerns from doctors about misinformation being spread by the White House regarding the drug's safety. Medical professionals aim to ensure expectant mothers have accurate information to make informed decisions.",
    "published": "2025-09-23T02:46:57Z"
  },
  {
    "title": "Government required to create plan to protect greater glider in major legal win for Wilderness Society",
    "url": "https://www.theguardian.com/environment/2025/sep/23/environment-minister-to-protect-native-species-greater-glider-glider-after-court-win-for-wilderness-society",
    "image": "https://media.guim.co.uk/cddadeb4b2f3720c96b14521ca4c5226a5db4720/1316_901_1222_978/500.jpg",
    "summary": "Murray Watt acknowledges that previous governments failed to create recovery plans for several endangered species, including the greater glider, ghost bat, lungfish, and sandhill dunnart. This admission highlights a lack of action in conservation efforts for these vulnerable species. The statement emphasizes the need for immediate attention to their protection and recovery.",
    "published": "2025-09-23T02:37:53Z"
  },
  {
    "title": "Parochialism or just vibes? How to pick a team to cheer for in the AFL grand final",
    "url": "https://www.theguardian.com/sport/2025/sep/23/how-to-pick-team-to-cheer-for-afl-grand-final-geelong-cats-brisbane-lions",
    "image": "https://media.guim.co.uk/bc56bc40db681d26dd5341bf0c634b37b7b7ea17/0_451_2000_1599/500.jpg",
    "summary": "This year's championship lacks a clear favorite, leaving neutral fans uncertain about which team to support. Instead, they are faced with the dilemma of deciding which team they dislike less. The absence of a strong sentimental choice heightens the tension surrounding the decider.",
    "published": "2025-09-23T02:30:47Z"
  },
  {
    "title": "Donald Trump signs order designating antifa as a domestic terror organization – as it happened",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/22/donald-trump-charlie-kirk-autism-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/5575e702c456e7484aca274f2f22e2453f0c92d6/86_0_5478_4385/500.jpg",
    "summary": "President cites a pattern of political violence from the left as the reason for a new decision following the killing of right-wing activist Charlie Kirk. This move emphasizes perceived threats against conservative figures. The statement reflects ongoing tensions between political factions in the country.",
    "published": "2025-09-23T01:52:18Z"
  }
]