[
  {
    "title": "Gaza ceasefire plan live: Trump claims Israeli hostages should be released on Monday or Tuesday",
    "url": "https://www.theguardian.com/world/live/2025/oct/09/gaza-ceasefire-live-trump-says-hostages-probably-released-monday-idf-says-gaza-city-still-extremely-dangerous",
    "image": "https://media.guim.co.uk/8f8678e0799c4df390fe5cdc06ada48ead822b5e/205_0_2406_1925/500.jpg",
    "summary": "Trump declared the \"end of the war\" and stated that Gaza will be \"redone,\" signaling optimism about a potential resolution. However, the Israeli security cabinet has not yet publicly approved the proposed deal. This uncertainty raises questions about the future of the situation in Gaza.",
    "published": "2025-10-09T18:28:02Z"
  },
  {
    "title": "Trump says ‘we’re only going to cut Democrat programs’ as Senate again fails to advance stopgap funding bill – live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/09/national-guard-ice-federal-property-chicago-illinois-us-politics-live",
    "image": "https://media.guim.co.uk/a6c5956247d057ce1291913317adeba39eb1037e/1_0_2998_2399/500.jpg",
    "summary": "Donald Trump has stated that federal budget cuts during the government shutdown will primarily affect the priorities of his opponents. Meanwhile, a Democratic proposal aimed at resolving the shutdown has failed once more, marking the ninth day of the impasse. The ongoing stalemate highlights the deep divisions between the two parties.",
    "published": "2025-10-09T18:26:07Z"
  },
  {
    "title": "England v Wales: international football friendly – live",
    "url": "https://www.theguardian.com/football/live/2025/oct/09/england-v-wales-international-football-friendly-live-score-updates",
    "image": "https://media.guim.co.uk/d52e8f7709989ecec675c5df3ae9e2ca9e9e6a02/359_0_3155_2525/500.jpg",
    "summary": "Scott Murray provides live updates from the friendly match taking place at Wembley. Fans can follow the action as it unfolds minute-by-minute. Stay tuned for insights and commentary throughout the game.",
    "published": "2025-10-09T18:23:10Z"
  },
  {
    "title": "‘Trump is like a juggernaut’: how the Gaza ceasefire deal was done",
    "url": "https://www.theguardian.com/world/2025/oct/09/how-the-gaza-ceasefire-deal-was-done-donald-trump",
    "image": "https://media.guim.co.uk/c1b0f9aa5725d5cfb33f419743fa2df648dd02fe/679_43_3268_2615/500.jpg",
    "summary": "A casual conversation on the sidelines of the UN marked a pivotal moment for the US president regarding the conclusion of a two-year war. While the president played a significant role, other nations and leaders also assert their contributions in achieving peace. This discussion highlights the collaborative nature of international diplomacy in resolving conflicts.",
    "published": "2025-10-09T18:14:12Z"
  },
  {
    "title": "Rishi Sunak takes advisory roles with Microsoft and AI firm Anthropic",
    "url": "https://www.theguardian.com/politics/2025/oct/09/rishi-sunak-takes-advisory-roles-with-microsoft-and-ai-firm-anthropic",
    "image": "https://media.guim.co.uk/00464183fbf1a99a4dd837be0a948c60f74a93b3/900_0_4567_3654/500.jpg",
    "summary": "Former UK Prime Minister stated that his roles with a post-ministerial jobs watchdog will not include any lobbying activities or influence over UK policy. This declaration aims to address concerns regarding potential conflicts of interest. The watchdog's purpose is to ensure the integrity of former government officials in their new roles.",
    "published": "2025-10-09T18:01:02Z"
  }
]