[
  {
    "title": "Liverpool v Real Madrid: Champions League – live",
    "url": "https://www.theguardian.com/football/live/2025/nov/04/liverpool-v-real-madrid-champions-league-live",
    "image": "https://media.guim.co.uk/66d223ce33b1970d5d84b423f9cd969cd3e2d599/172_0_2684_2147/500.jpg",
    "summary": "Scott Murray provides a live minute-by-minute update as two major teams face off at Anfield. Fans can follow the match's progress and key moments in this highly anticipated showdown. Stay tuned for real-time insights and commentary throughout the game.",
    "published": "2025-11-04T20:22:34Z"
  },
  {
    "title": "Tottenham v Copenhagen, PSG v Bayern Munich, and more: Champions League – live",
    "url": "https://www.theguardian.com/football/live/2025/nov/04/tottenham-v-copenhagen-psg-v-bayern-munich-and-more-champions-league-live",
    "image": "https://media.guim.co.uk/eb8e757e80fd5b8ed032e6d500e6e1ed5a89c388/265_0_2915_2333/500.jpg",
    "summary": "Rob Smyth will provide live updates and highlights from Tuesday's Champions League matches, delivering real-time goal updates and key plays. Tune in for in-depth coverage of the thrilling action on the pitch. Don't miss the excitement as teams compete for glory in this prestigious tournament.",
    "published": "2025-11-04T20:22:06Z"
  },
  {
    "title": "US elections 2025 live: Mamdani refuses to be ‘intimidated’ by Trump jibes as New York City, New Jersey, Virginia and California vote",
    "url": "https://www.theguardian.com/us-news/live/2025/nov/04/us-elections-2025-live-new-york-city-new-jersey-virginia-california-latest-news-updates-live",
    "image": "https://media.guim.co.uk/88a9be04ff4e347897e06aabd63cfa5e1dbf3434/293_0_2500_2000/500.jpg",
    "summary": "A New York mayoral candidate has responded after President Biden referred to Jewish voters supporting him as \"stupid.\" The candidate condemned the remark, asserting that Jewish voters are entitled to their choices and highlighting the need for respect in political discourse. The exchange underscores tensions between political figures and voter communities.",
    "published": "2025-11-04T20:20:58Z"
  },
  {
    "title": "Australia politics live: Greens say secret Nauru deportations ‘not how any democracy should behave’",
    "url": "https://www.theguardian.com/australia-news/live/2025/nov/05/australia-politics-live-nauru-deportations-labor-greens-coalition-anthony-albanese-sussan-ley-nationals-leadership-net-zero-question-time-ntwnfb",
    "image": "https://media.guim.co.uk/14f3f8c05349329bd07984a7010cd54bc84aa67f/0_0_6714_5374/500.jpg",
    "summary": "To summarize effectively, please provide the news article or details you'd like condensed into three lines.",
    "published": "2025-11-04T20:20:01Z"
  },
  {
    "title": "Anxious Aston residents prepare for Villa’s match against Maccabi Tel Aviv",
    "url": "https://www.theguardian.com/football/2025/nov/04/aston-villa-maccabi-tel-aviv-europa-league-residents-business-owners-concern",
    "image": "https://media.guim.co.uk/3d8ed46dec49fc9517ca1ca9a52a83ae0691b994/0_0_5000_4000/500.jpg",
    "summary": "Residents and business owners near Aston Villa's stadium are voicing concerns ahead of the club's Europa League match against Maccabi Tel Aviv. Their apprehensions likely stem from potential disruptions or safety issues associated with the large influx of fans. The club has yet to address these worries, leaving the community feeling unsettled.",
    "published": "2025-11-04T20:17:24Z"
  }
]