[
  {
    "title": "Nancy Pelosi, former House speaker, says she will not seek re-election to Congress – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/nov/06/donald-trump-government-shutdown-venezuela-senate-vote-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/9305a5fb4cacc6e0ced5395b6e23371ab27f961d/262_0_1611_1289/500.jpg",
    "summary": "Nancy Pelosi, the representative for San Francisco, has announced that she will step down from her position in 2027. This decision marks a significant forthcoming transition in leadership. Pelosi has been a prominent figure in U.S. politics for decades.",
    "published": "2025-11-06T14:18:42Z"
  },
  {
    "title": "Sainsbury’s says shoppers are delaying spending in run-up to budget",
    "url": "https://www.theguardian.com/business/2025/nov/06/sainsburys-rachel-reeves-tax-rises-retailers-inflation",
    "image": "https://media.guim.co.uk/82c59ae165e079d0ede6ada194591d81670efe4e/843_12_5152_4122/500.jpg",
    "summary": "The CEO of a major supermarket has called on Rachel Reeves to avoid increasing taxes on retailers and suppliers, warning that such actions could exacerbate inflation. The appeal comes amid concerns over rising costs for consumers and businesses alike. The supermarket leader emphasizes the need for supportive measures to stabilize the economy.",
    "published": "2025-11-06T14:17:44Z"
  },
  {
    "title": "Bank of England says UK inflation has peaked after leaving rates at 4%; US job cuts jump as firms turn to AI – business live",
    "url": "https://www.theguardian.com/business/live/2025/nov/06/bank-of-england-interest-rates-andrew-bailey-stock-markets-pound-budget-business-live-news",
    "image": "https://media.guim.co.uk/cf2749c6401a2fc1124fba5bf11661e1d65ffbe6/1032_0_5908_4727/500.jpg",
    "summary": "Economists anticipate that the UK will lower interest rates in December following a narrow decision to maintain the Bank Rate at 4% during today's meeting. This suggests a shift in monetary policy as economic conditions evolve. The potential rate cuts highlight concerns about growth and inflation moving forward.",
    "published": "2025-11-06T14:13:15Z"
  },
  {
    "title": "‘We need help’: devastated Jamaican villages still await aid after Hurricane Melissa",
    "url": "https://www.theguardian.com/world/2025/nov/06/hurricane-melissa-jamaica-relief",
    "image": "https://media.guim.co.uk/5ed1e72038d9fce8cb6bbc077f17239f931dd3c1/911_0_6829_5464/500.jpg",
    "summary": "Villages near Montego Bay are reeling from the devastation caused by last week’s Category 5 storm. Residents share heartbreaking accounts of loss, including destroyed homes and uprooted lives. Recovery efforts are urgently needed as the community begins to rebuild.",
    "published": "2025-11-06T14:11:03Z"
  },
  {
    "title": "Jennifer Lawrence says she didn’t need an intimacy coordinator on new film as co-star Robert Pattinson is ‘not pervy’",
    "url": "https://www.theguardian.com/film/2025/nov/06/jennifer-lawrence-intimacy-coordinator-robert-pattinson-die-my-love-pervy",
    "image": "https://media.guim.co.uk/8542dc8fbcb2e961a99a319aad61477aa3b91e10/477_0_4715_3771/500.jpg",
    "summary": "As the film \"Die My Love\" is released, the actor joins several other prominent figures in expressing skepticism about the value of new roles in the industry. They highlight concerns regarding the quality and significance of these roles. The discussion reflects a growing debate about the direction of film and storytelling in today's entertainment landscape.",
    "published": "2025-11-06T14:05:50Z"
  }
]