[
  {
    "title": "Major internet outage hits websites, apps and Lloyds Bank after issue at Amazon Web Services – business live",
    "url": "https://www.theguardian.com/business/live/2025/oct/20/china-economic-growth-gdp-low-house-prices-fall-stock-markets-ftse-business-live-news",
    "image": "https://media.guim.co.uk/c243af906d58094cf7e7337e109f67c64d00da26/492_0_4240_3393/500.jpg",
    "summary": "A widespread online outage affected several major services, including Fortnite, Roblox, Snapchat, Lloyds Bank, and Ring doorbells. Users experienced disruptions in accessing these platforms. The cause of the outage has not been disclosed.",
    "published": "2025-10-20T09:24:34Z"
  },
  {
    "title": "New Zealand chasing 237 to beat England: second men’s T20 international – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/20/new-zealand-v-england-second-mens-t20-international-live",
    "image": "https://media.guim.co.uk/f473672f81f969019e23397fa50ea58b82c04c75/1767_414_4589_3672/500.jpg",
    "summary": "Rob Smyth will provide live, over-by-over updates as England faces New Zealand in the second T20I match at Hagley Oval. Fans can follow the action for real-time commentary and insights. The match promises to be an exciting contest between the two teams.",
    "published": "2025-10-20T09:24:32Z"
  },
  {
    "title": "Gaza ceasefire live: Trump’s envoys arrive in Israel amid scramble to shore up fragile truce – Middle East crisis live",
    "url": "https://www.theguardian.com/world/live/2025/oct/20/gaza-ceasefire-israel-hamas-palestine-hostages-middle-east-crisis-live-news-updates",
    "image": "https://media.guim.co.uk/4d421cd7593d209915c3d8bfb3af4dffd31e91bc/602_0_4560_3648/500.jpg",
    "summary": "US envoy Steve Witkoff and Jared Kushner, former President Trump's son-in-law, are set to meet with members of Prime Minister Benjamin Netanyahu's government. This meeting likely aims to discuss key issues and strengthen ties between the US and Israel. The engagement signals ongoing diplomatic efforts amid regional tensions.",
    "published": "2025-10-20T09:24:19Z"
  },
  {
    "title": "Reform suspends four Kent councillors after Guardian publishes leaked video of fierce infighting",
    "url": "https://www.theguardian.com/politics/2025/oct/20/reform-suspends-four-kent-councillors-after-leaked-video-exposes-fierce-infighting",
    "image": "https://media.guim.co.uk/2e8b2da96757127a1736413863d2ec51a8ac543e/343_0_3410_2728/500.jpg",
    "summary": "Members of Reform’s main county council face investigation due to allegations of bringing the party into disrepute. The inquiry was prompted by concerns raised regarding their conduct. The specific details of the evidence have not been disclosed.",
    "published": "2025-10-20T09:23:14Z"
  },
  {
    "title": "King should decide if laws are needed to remove Prince Andrew’s dukedom, minister suggests – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/oct/20/uk-politics-latest-news-updates-prince-andrew-covid-starmer-labour-reform-education",
    "image": "https://media.guim.co.uk/07f1228926c485f0e598164c9e97519b6c333819/282_0_3690_2952/500.jpg",
    "summary": "Bridget Phillipson stated that the government will take cues from the royal family amid rising demands to revise regulations concerning title ownership. This comes as discussions intensify about potentially stripping an individual of their titles. The situation highlights the ongoing debate around royal privileges and governance.",
    "published": "2025-10-20T09:20:19Z"
  }
]