[
  {
    "title": "John Bolton indicted on charges of mishandling and transmitting classified information – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/16/trump-latest-shutdown-vote-jd-vance-republicans-democrats",
    "image": "https://media.guim.co.uk/92fa2697697fb0e465adab04e4c979b8e74ae568/375_0_3455_2764/500.jpg",
    "summary": "Former national security adviser has been charged with retaining classified information, mirroring the charges brought against Donald Trump in 2023. This development raises questions about the handling of sensitive materials by high-ranking officials. The case adds to the ongoing scrutiny surrounding national security protocols and legal accountability.",
    "published": "2025-10-16T22:14:47Z"
  },
  {
    "title": "Man accused of killing Georgina Ward in 2020 appears in Dudley court",
    "url": "https://www.theguardian.com/uk-news/2025/oct/16/man-accused-of-killing-georgina-ward-in-2020-appears-in-dudley-court",
    "image": "https://media.guim.co.uk/7aab3982d531456e52823b31504af26f3ba1fef8/0_106_1487_1190/500.jpg",
    "summary": "Daniel Birtwistle, 39, is set to stand trial for the manslaughter of a 24-year-old tattoo artist, alongside various assault charges. The trial will address the circumstances surrounding the incident that led to the artist's death. Legal proceedings are ongoing as Birtwistle faces serious accusations.",
    "published": "2025-10-16T22:08:21Z"
  },
  {
    "title": "Australia news live: Ley challenges Albanese over Trump meeting; storm warning for Sydney",
    "url": "https://www.theguardian.com/australia-news/live/2025/oct/17/australia-news-live-sussan-ley-anthony-albanese-trump-meeting-foi-climate-laws-ntwnfb",
    "image": "https://media.guim.co.uk/99064e784e22d4b81763d913748a54062a6e2c0a/0_0_4913_3931/500.jpg",
    "summary": "Please provide the news article or details you would like summarized, and I'll be happy to help!",
    "published": "2025-10-16T22:05:49Z"
  },
  {
    "title": "Starmer condemns ‘wrong decision’ to ban Maccabi Tel Aviv fans from Aston Villa game",
    "url": "https://www.theguardian.com/football/2025/oct/16/maccabi-tel-aviv-fans-banned-from-game-at-aston-villa-in-europa-league",
    "image": "https://media.guim.co.uk/b663a9a095ad7088e68f03c6bee5d134ac3b47b2/791_67_3663_2930/500.jpg",
    "summary": "Maccabi Tel Aviv fans have been banned from attending the Europa League match against Aston Villa on November 6. The decision was made due to safety concerns. Authorities are prioritizing security measures for the event.",
    "published": "2025-10-16T21:23:42Z"
  },
  {
    "title": "Benfica 0-2 Arsenal: Women’s Champions League – as it happened",
    "url": "https://www.theguardian.com/football/live/2025/oct/16/benfica-v-arsenal-womens-champions-league-live",
    "image": "https://media.guim.co.uk/0b921146054de6ee2f83f2764aac3be6da39041e/3222_842_2200_1760/500.jpg",
    "summary": "Beth Mead and Alessia Russo secured a narrow victory for Arsenal in Lisbon with their goals. The match was competitive, showcasing the team's resilience. Arsenal's win underscores their strong form in the tournament.",
    "published": "2025-10-16T21:15:43Z"
  }
]