[
  {
    "title": "Trump-Xi meeting: US president says rare earths deal and tariff cut agreed",
    "url": "https://www.theguardian.com/us-news/2025/oct/30/trump-and-xi-meet-in-south-korea-for-crunch-talks-on-trade",
    "image": "https://media.guim.co.uk/214a6bd816efe5193d1b5c7c06cae0fd5f1bfb78/524_0_4164_3333/500.jpg",
    "summary": "Donald Trump praised the recent trade discussions with China's leader, describing them as \"amazing.\" He highlighted the absence of any obstacles concerning rare earth materials in the negotiations. Trump's positive remarks suggest progress in U.S.-China trade relations.",
    "published": "2025-10-30T08:20:53Z"
  },
  {
    "title": "Queensland to create public register of sex offenders as Daniel Morcombe’s parents ‘hope it will go national’ ",
    "url": "https://www.theguardian.com/australia-news/2025/oct/30/queensland-to-create-public-register-of-sex-offenders-as-daniel-morcombes-parents-hope-it-will-go-national",
    "image": "https://media.guim.co.uk/9189832de3782638ba023101b782ccc093e38bed/729_375_3536_2830/500.jpg",
    "summary": "Bruce and Denise Morcombe are urging other states to adopt measures similar to Queensland's \"Daniel's Law,\" recently passed by the LNP. This law permits the public naming of certain child sexual abusers. The Morcombes advocate for broader protective measures to enhance community safety.",
    "published": "2025-10-30T08:14:44Z"
  },
  {
    "title": "Virgin Trains on track to challenge Eurostar cross-Channel monopoly with access to key depot",
    "url": "https://www.theguardian.com/business/2025/oct/30/virgin-trains-eurostar-cross-channel-monopoly-temple-mills-depot-london",
    "image": "https://media.guim.co.uk/94aaa081dbd400c1aabb12d0c8d5f29fdb1daa74/8_127_3761_3011/500.jpg",
    "summary": "The UK rail regulator has granted approval for Richard Branson's company to utilize the Temple Mills site in London. This decision marks a significant step for the firm in expanding its operations. The move is expected to improve rail services in the area.",
    "published": "2025-10-30T08:14:01Z"
  },
  {
    "title": "Donald Trump says rare earths dispute ‘settled’ after Xi Jinping meeting in South Korea – live updates",
    "url": "https://www.theguardian.com/world/live/2025/oct/30/donald-trump-xi-jinping-meeting-live-updates",
    "image": "https://media.guim.co.uk/bd1c513361c5ea2ab97bd963b56b8b81e60cde38/0_1161_5159_4127/500.jpg",
    "summary": "The recent summit held alongside APEC marked the first meeting between U.S. and Chinese leaders since 2019. This high-stakes encounter comes amid ongoing tensions exacerbated by Trump's trade war. The discussions aim to address and potentially ease the strained relations between the two nations.",
    "published": "2025-10-30T08:11:48Z"
  },
  {
    "title": "Oil price slips after Trump-Xi meeting, Shell’s $5.4bn profit beats expectations – business live",
    "url": "https://www.theguardian.com/business/live/2025/oct/30/oil-price-trump-xi-trade-deal-shell-profit-stocks-business-live-news",
    "image": "https://media.guim.co.uk/2c72d2a353d99de30f6ff4845f76edf44a119ad2/386_0_3266_2614/500.jpg",
    "summary": "The latest economic and financial news highlights significant market movements and economic indicators impacting global economies. Analysts are closely monitoring trends in inflation, interest rates, and employment figures. Key developments are shaping investor sentiment and influencing policy decisions by central banks.",
    "published": "2025-10-30T08:10:03Z"
  }
]