[
  {
    "title": "‘She went through hell’: widow of Chornobyl engineer killed in Russian drone strike on Kyiv",
    "url": "https://www.theguardian.com/world/2025/nov/16/nataliia-khodemchuk-widow-of-chornobyl-engineer-killed-russian-drone-strike-kyiv",
    "image": "https://media.guim.co.uk/444de1d4f785fb172cc6ed24d5c3b01379294384/0_225_904_723/500.jpg",
    "summary": "Ukrainian President Volodymyr Zelenskyy has condemned the Kremlin for causing a new tragedy, referencing the recent death of Nataliia Khodymchuk. He highlighted that her passing is a reminder of the lasting repercussions of past disasters. This statement comes nearly 40 years after the infamous Chernobyl disaster.",
    "published": "2025-11-16T12:34:48Z"
  },
  {
    "title": "Dermatologists criticise ‘dystopian’ skincare products aimed at children",
    "url": "https://www.theguardian.com/fashion/2025/nov/16/dermatologists-criticise-dystopian-skincare-products-aimed-at-children",
    "image": "https://media.guim.co.uk/c438c87b9498f2abfe74cc09ca9a311778a9fc29/144_0_3750_3000/500.jpg",
    "summary": "Recent criticism highlights marketing for celebrity-endorsed skincare treatments aimed at toddlers and older children as \"ridiculous.\" Experts argue these products lack significant skin benefits and may not be appropriate for young users. The trend raises concerns about the commercialization of skincare for vulnerable age groups.",
    "published": "2025-11-16T12:33:56Z"
  },
  {
    "title": "World Cup qualifying latest, WSL updates and more – matchday live",
    "url": "https://www.theguardian.com/football/live/2025/nov/16/world-cup-qualifying-latest-wsl-updates-and-more-matchday-live",
    "image": "https://media.guim.co.uk/77391d45212c5cc69c6daa7752ca6e24b9604a02/0_0_5000_4000/500.jpg",
    "summary": "Join our writers for insights and discussions leading up to the day's events. Stay updated with the latest news and developments. Engage in the buildup before the action unfolds!",
    "published": "2025-11-16T12:33:16Z"
  },
  {
    "title": "Spanish Armada-era astrolabe returns to Scilly after mysterious global journey",
    "url": "https://www.theguardian.com/culture/2025/nov/16/spanish-armada-era-astrolabe-returns-to-scilly-after-mysterious-global-journey",
    "image": "https://media.guim.co.uk/3e58f7f5291bfe223f1474bfbeae798e096a98c2/90_13_475_380/master/475.jpg",
    "summary": "A 16th-century navigation aid, long forgotten on the seabed, was recently discovered and has since been bought and sold between the US and Australia. This historical artifact sheds light on maritime practices of the past. Its journey highlights the ongoing interest in maritime archaeology and historical preservation.",
    "published": "2025-11-16T12:30:31Z"
  },
  {
    "title": "UK watchdogs need to step in on rip-off bills, which are bad for consumers and the economy | Heather Stewart",
    "url": "https://www.theguardian.com/business/2025/nov/16/watchdogs-need-to-step-in-on-rip-off-bills-which-are-bad-for-consumers-and-the-economy",
    "image": "https://media.guim.co.uk/ab334922d763c9c598040613e497e8f1b8101ccd/2393_3069_3291_2634/500.jpg",
    "summary": "Companies are increasingly leveraging their extensive customer data to tailor products and services, enhancing profitability across sectors such as mobile, insurance, and subscriptions. This advantage allows firms to optimize offerings based on consumer behavior and preferences. As a result, customers may feel outmatched in their understanding of available options and terms.",
    "published": "2025-11-16T12:20:34Z"
  }
]