[
  {
    "title": "US government shutdown live: first closure since 2018 begins after funding bill fails",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/30/us-government-shutdown-funding-trump-vance-portland-hegseth-latest-updates",
    "image": "https://media.guim.co.uk/f1df06e9e9b4a4893f80093c8cb695c9adec448f/249_0_3713_2970/500.jpg",
    "summary": "The Senate rejected competing bills as both parties, Republicans and Democrats, engage in accusations of partisan politics. The failure to advance the legislation reflects ongoing tensions and gridlock in Congress. This stalemate underscores the challenges in achieving bipartisan cooperation on key issues.",
    "published": "2025-10-01T05:18:41Z"
  },
  {
    "title": "Australia news live: Albanese hopes China’s possible BHP iron ore blockade ‘very much short term’; police find footprint in search for missing boy",
    "url": "https://www.theguardian.com/australia-news/live/2025/oct/01/australia-news-live-nicole-kidman-divorce-keith-urban-sussan-ley-coalition-andrew-hastie-anthony-albanese-housing-ntwnfb",
    "image": "https://media.guim.co.uk/39c319ecaae475efae88834ef7a73e0c9d068eb5/0_0_6650_5320/500.jpg",
    "summary": "I'm unable to summarize without additional context or details about the specific news story you're referring to. Please provide more information or share the news content you'd like me to summarize.",
    "published": "2025-10-01T05:17:48Z"
  },
  {
    "title": "What does a government shutdown mean and why is this year’s threat more serious?",
    "url": "https://www.theguardian.com/us-news/2025/sep/27/government-shutdown-explainer",
    "image": "https://media.guim.co.uk/088a5ad99a96b6d6ac8ffba8b9a2958fdbc95cdc/124_0_3111_2488/500.jpg",
    "summary": "The US government has officially shut down due to Congress's failure to agree on a funding deal. Essential services and federal employees will be impacted, with many furloughed. Citizens should prepare for possible delays in government services and assistance while negotiations continue.",
    "published": "2025-10-01T05:16:48Z"
  },
  {
    "title": "UK accused of ‘stark injustice’ as woman from Montserrat refused free NHS care",
    "url": "https://www.theguardian.com/uk-news/2025/oct/01/uk-montserrat-british-overseas-territory-citizens-injustice-donaldson-romeo",
    "image": "https://media.guim.co.uk/cee389c804a5e4102365428805c4250b1e460c9a/335_477_934_747/500.jpg",
    "summary": "Cherry Brown, a 69-year-old British overseas territory citizen, became homeless after being sent to England for medical treatment. With no support or accommodation arranged, she found herself sleeping rough. The situation has raised concerns about the care and assistance provided to citizens in need.",
    "published": "2025-10-01T05:00:03Z"
  },
  {
    "title": "‘A steampunk Mr Tayto’: why Irish critics hate Netflix’s House of Guinness",
    "url": "https://www.theguardian.com/world/2025/oct/01/irish-critics-netflix-series-house-of-guinness-ireland",
    "image": "https://media.guim.co.uk/2f462b6479920ffde1dafa617158c22191117bd2/832_0_5930_4748/500.jpg",
    "summary": "The series has received positive reviews in the US and UK, but has struggled to find favor in Ireland, where it has faced harsh criticism. Irish audiences have expressed strong disapproval, contrasting sharply with international reactions. The differing responses highlight cultural variations in taste and expectations.",
    "published": "2025-10-01T05:00:03Z"
  }
]