[
  {
    "title": "North Melbourne complete perfect AFLW season with grand final victory over Brisbane",
    "url": "https://www.theguardian.com/sport/live/2025/nov/29/aflw-grand-final-live-north-melbourne-kangaroos-v-brisbane-lions",
    "image": "https://media.guim.co.uk/7d10161e4949cb3a906a135b74d50ae4d777c334/374_0_3743_2995/500.jpg",
    "summary": "The Kangaroos secured their undefeated status by defeating the Lions by 40 points in the grand final at Ikon Park. This victory cements their legacy as a dominant team in the competition. Their remarkable performance throughout the season has etched their name in history.",
    "published": "2025-11-29T11:14:54Z"
  },
  {
    "title": "Manchester City look to bounce back in Premier League, Lionesses in action – matchday live",
    "url": "https://www.theguardian.com/football/live/2025/nov/29/manchester-city-look-to-bounce-back-in-premier-league-lionesses-in-action-matchday-live",
    "image": "https://media.guim.co.uk/1e361a820adc107e1f7d636768c365202e00b00d/0_0_3757_3005/500.jpg",
    "summary": "Yara El-Shaboury will host a news segment and discussion, leading up to the day's events. Stay tuned for insights and updates. Engage in conversations surrounding the day's action.",
    "published": "2025-11-29T11:09:47Z"
  },
  {
    "title": "UK asylum seekers to be banned from taking taxis to medical appointments",
    "url": "https://www.theguardian.com/uk-news/2025/nov/29/uk-asylum-seekers-to-be-banned-from-taking-taxis-to-medical-appointments",
    "image": "https://media.guim.co.uk/f8471593b5216a7e761638242ab5e4e3739c9750/348_0_3151_2521/500.jpg",
    "summary": "The Home Office is implementing a cost-cutting measure by discontinuing a service, following reports of its annual expenditure of £15.8 million on that service. This move is part of a broader effort to reduce expenses within the department. The decision highlights ongoing discussions about financial efficiency in government spending.",
    "published": "2025-11-29T11:09:06Z"
  },
  {
    "title": "‘When I saw what I captured I felt a Muybridge-like joy’: Roger Tooth’s best phone picture",
    "url": "https://www.theguardian.com/lifeandstyle/2025/nov/29/roger-tooth-best-phone-picture-antony-gormley",
    "image": "https://media.guim.co.uk/76a4431edff1a780ebffa0b41ce8e3a5bf2820b4/0_409_3024_2419/500.jpg",
    "summary": "Tooth was thrilled to photograph one of Antony Gormley's statues located on Crosby beach. An adorable dog unexpectedly joined the scene, adding a charming element to the picture. The encounter pleasantly surprised Tooth, enhancing the experience of capturing the artwork.",
    "published": "2025-11-29T11:00:36Z"
  },
  {
    "title": "The Russia-Ukraine peace deal is not a loss. Nor is it a victory | Stephen Wertheim",
    "url": "https://www.theguardian.com/commentisfree/2025/nov/29/russia-ukraine-peace-deal",
    "image": "https://media.guim.co.uk/12923be15f49644088e0aa6fc42a1ee2605b36c3/1271_0_6355_5084/500.jpg",
    "summary": "The conflict resulted in a ambiguous outcome that is neither a definitive loss nor a triumphant win. It embodies significant aspects of both defeat and victory. This complexity highlights the nuanced nature of the situation.",
    "published": "2025-11-29T11:00:35Z"
  }
]