[
  {
    "title": "Nigel Farage ‘doesn’t like Britain’, says Starmer in keynote speech at Labour conference – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/30/labour-conference-starmer-speech-streeting-nhs-reform",
    "image": "https://media.guim.co.uk/8014e5332eb197c8bd2d156c139b9ee7483f99d9/1448_74_3325_2660/500.jpg",
    "summary": "The Prime Minister criticized Reform UK leader for relying on grievances and warned that such an approach would steer the UK towards decline. He emphasized the need for constructive solutions rather than divisive rhetoric. The remarks highlight ongoing political tensions in the country.",
    "published": "2025-09-30T13:27:00Z"
  },
  {
    "title": "Pete Hegseth declares war on diversity efforts in military and mandates ‘male-standard’ fitness test to combat ‘fat troops’ – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/30/us-government-shutdown-funding-trump-vance-portland-hegseth-latest-updates",
    "image": "https://media.guim.co.uk/9c02946809a54650bf70d95388c32f6d80e07807/700_0_6360_5091/500.jpg",
    "summary": "The Defense Secretary addressed hundreds of generals and admirals at the Marine Corps Museum in Quantico, convening them on short notice. The meeting is likely significant in its implications for military strategy and operations. Details on the agenda or topics discussed have not been disclosed.",
    "published": "2025-09-30T13:25:50Z"
  },
  {
    "title": "Trump gives Hamas ‘three or four days’ to respond to Gaza peace plan or face ‘a very sad end’ – live",
    "url": "https://www.theguardian.com/world/live/2025/sep/30/netanyahu-israel-gaza-hamas-trump-peace-plan-latest-news-middle-east-crisis-live",
    "image": "https://media.guim.co.uk/9b4205aea3f4fabc735b6ffe16d553a37b6532ec/1090_0_4759_3808/500.jpg",
    "summary": "Israeli Prime Minister Netanyahu clarified that he did not consent to a Palestinian state in Trump's Gaza plan, emphasizing that the IDF will continue to maintain a presence in most of the territory. This statement coincides with an ultimatum regarding the future of Israeli-Palestinian relations. Tensions remain high as discussions surrounding territorial control and statehood persist.",
    "published": "2025-09-30T13:21:03Z"
  },
  {
    "title": "Jobs to go at Lincolnshire oil refinery; UK economy grew faster than thought under Labour – business live",
    "url": "https://www.theguardian.com/business/live/2025/sep/30/uk-economy-grew-faster-than-thought-six-months-labour-government-markets-pound-sterling-business-live",
    "image": "https://media.guim.co.uk/753dab227fb6f0e6e8af28205bf97cea39454d64/279_0_3042_2433/500.jpg",
    "summary": "The insolvency firm managing the Lindsey oil refinery has announced job losses following the collapse of its parent company, Prax Group. The shutdown is expected to affect numerous employees at the facility. The bankruptcy of Prax Group has raised concerns about the refinery's future operations and staffing.",
    "published": "2025-09-30T13:17:31Z"
  },
  {
    "title": "Putin ‘in his heart of hearts’ knows he cannot win in Ukraine, US special envoy says – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/sep/30/europe-russia-drones-ukraine-rutte-von-der-leyen-poland-kellogg-latest-updates",
    "image": "https://media.guim.co.uk/f23ed12c345d47c250ad1b2031d9df924af6ba6e/406_0_1645_1317/500.jpg",
    "summary": "During the Warsaw Security Forum, Keith Kellogg stated that the war in Ukraine is \"unwinnable\" for President Putin. He emphasized the challenges facing Russia in achieving its goals in the conflict. Kellogg's remarks highlight growing concerns about the sustainability of Russia's military efforts in Ukraine.",
    "published": "2025-09-30T13:17:31Z"
  }
]