[
  {
    "title": "Ryder Cup 2025: USA v Europe day one updates – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/26/ryder-cup-2025-day-one-golf-europe-usa-bethpage-black-live",
    "image": "https://media.guim.co.uk/474cb9a963d112333c53d6741297a298e4426658/292_0_4333_3467/500.jpg",
    "summary": "The news provides live updates on the opening foursomes and fourballs at Bethpage Back. Coverage includes hole-by-hole details and insights from the writers. Fans can stay informed on the progress of the event.",
    "published": "2025-09-26T14:15:30Z"
  },
  {
    "title": "Starmer says government will introduce digital IDs to ensure Britain’s ‘borders are more secure’ – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/26/keir-starmer-digital-id-cards-immigration-borders-reform-uk-politics-live",
    "image": "https://media.guim.co.uk/a056eccaa47283032977eb2cb62b950c524e23d5/678_0_3418_2736/500.jpg",
    "summary": "An online petition opposing the government's plan to introduce digital ID cards is rapidly gaining traction, nearing 900,000 signatures. Opponents argue that such cards could jeopardize privacy and personal freedoms. The growing support highlights widespread concern over governmental control and surveillance.",
    "published": "2025-09-26T14:13:19Z"
  },
  {
    "title": "Haaland fit for City, Liverpool’s Leoni out for season, Palmer out for three weeks – live",
    "url": "https://www.theguardian.com/football/live/2025/sep/26/premier-league-and-wsl-team-news-europa-league-reaction-and-more-live",
    "image": "https://media.guim.co.uk/b247e2c9cc19b1a1afa67e95ea18fe40871de0fb/765_325_4044_3234/500.jpg",
    "summary": "Weekend football coverage includes news, previews, and commentary in anticipation of a packed schedule in both the Premier League and Women's Super League (WSL). Follow our writers for expert insights ahead of the matches. Stay tuned for updates and analyses throughout the weekend.",
    "published": "2025-09-26T14:12:49Z"
  },
  {
    "title": "Russia has bad intentions towards the whole world, Polish PM says, as EU countries and Ukraine discuss ‘drone wall’ – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/sep/26/denmark-drone-sightings-airport-russia-ukraine-europe-live-news",
    "image": "https://media.guim.co.uk/21841a2384b07d2f60f395036e7d2e668e841dcb/94_0_3860_3088/500.jpg",
    "summary": "European countries will hold discussions today to address the increasing threat of incursions. The meeting aims to develop coordinated strategies to enhance security and respond effectively. Leaders from various nations are expected to share insights and propose solutions.",
    "published": "2025-09-26T14:11:15Z"
  },
  {
    "title": "Nottinghamshire v Warwickshire, Hampshire v Surrey and more: county cricket – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/26/nottinghamshire-v-warwickshire-surrey-v-hampshire-and-more-county-cricket-final-round-live",
    "image": "https://media.guim.co.uk/32a88844c6240c9ea0c9343b41ee291ac1b2dab7/95_0_3799_3038/500.jpg",
    "summary": "Day three of the season's final round at Trent Bridge features a title celebration. Tanya Aldred delivers the latest updates from the event. The atmosphere is vibrant as teams compete for their last matches of the season.",
    "published": "2025-09-26T14:07:36Z"
  }
]