[
  {
    "title": "Von der Leyen says EU ‘cannot tolerate’ disruption of airspace, calling balloons over Lithuania a ‘provocation’ – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/oct/28/zelenskyy-ukraine-peace-talks-putin-russia-alexander-lukashenko-belarus-europe-live-news-latest-updates",
    "image": "https://media.guim.co.uk/67df4a1f8ed652b0890112d56d3827ea3ff2df98/56_0_2570_2055/500.jpg",
    "summary": "The EU is planning to increase investment in military equipment and has expressed its readiness to meet Ukraine's financing needs. This initiative aims to bolster support for Ukraine amid ongoing challenges. Enhanced military support highlights the EU's commitment to strengthening its defense capabilities.",
    "published": "2025-10-28T11:16:26Z"
  },
  {
    "title": "Three more Reform UK councillors expelled from party over ‘dishonest’ behaviour after leaked video meeting – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/oct/28/labour-asylum-seekers-military-sites-keir-starmer-rachel-reeves-reform-uk-yvette-cooper-uk-politics-live-news-latest-updates",
    "image": "https://media.guim.co.uk/4bd9ed0f44567a2d0c22285fcf7a47ed42f07a09/302_0_1349_1080/500.jpg",
    "summary": "During an online meeting, the leader of Kent County Council was seen expressing frustration towards councillors. The footage captured the tense exchange, highlighting disagreements within the council. This incident has sparked discussions about communication practices in local governance.",
    "published": "2025-10-28T11:09:40Z"
  },
  {
    "title": "Trump and new Japanese prime minister share praise and vow to strengthen ‘remarkable’ relationship – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/28/donald-trump-sanae-takaichi-japan-trade-national-guard-us-politics-live",
    "image": "https://media.guim.co.uk/b54141de9497e413508dcc3aa6afd12ecc4ab883/365_0_3554_2843/500.jpg",
    "summary": "In a recent address aboard the USS George Washington, the president proposed the potential deployment of the National Guard to additional U.S. cities. This move comes amid ongoing concerns about safety and security in urban areas. The announcement reflects a heightened focus on addressing domestic challenges.",
    "published": "2025-10-28T11:06:00Z"
  },
  {
    "title": "Rachel Reeves confident Gulf trade deal can be done ‘very soon’; European shares ease from record highs – business live",
    "url": "https://www.theguardian.com/business/live/2025/oct/28/uk-productivity-downgrade-tax-rise-speculation-reeves-hsbc-pharma-business-live",
    "image": "https://media.guim.co.uk/43ed1e105a1e9b20e611de3f9f91272dae1fadf7/432_0_4322_3459/500.jpg",
    "summary": "The UK chancellor is grappling with a significant financial challenge, as public finances are projected to suffer a £20 billion-plus hit due to a downgrade in productivity. This situation adds pressure on the government to find solutions to bolster economic growth. The news underscores the ongoing struggles within the UK's economy.",
    "published": "2025-10-28T11:04:59Z"
  },
  {
    "title": "Want to go to a UK university? Don’t ask me to help you write your personal statement  | Zoe Williams",
    "url": "https://www.theguardian.com/commentisfree/2025/oct/28/want-to-go-to-uk-university-do-not-ask-me-to-help-you-write-your-personal-statement",
    "image": "https://media.guim.co.uk/90053137dae2d2776a6f6004f6f574279cae7be5/749_458_4428_3542/500.jpg",
    "summary": "Admissions tutors are more impressed by relevant experiences and clear, concise communication rather than unrelated activities like babysitting or hobbies such as crochet. Zoe Williams emphasizes the importance of showcasing skills and achievements that align with the desired program. Crafting a focused narrative is key to standing out in the admissions process.",
    "published": "2025-10-28T11:00:33Z"
  }
]