[
  {
    "title": "Brighton v West Ham: Premier League – live",
    "url": "https://www.theguardian.com/football/live/2025/dec/07/brighton-v-west-ham-premier-league-live",
    "image": "https://media.guim.co.uk/419bdd5381adaadb2f5b4652f4121e6079ee6336/319_0_3137_2509/500.jpg",
    "summary": "Brighton seeks to improve their league position with a crucial match against West Ham at the Amex Stadium. Fans can follow live updates from Daniel Harris during the game. The outcome may significantly impact Brighton's ascent in the table.",
    "published": "2025-12-07T15:16:18Z"
  },
  {
    "title": "Britain’s Norris pips Verstappen to win maiden F1 world championship after third place in Abu Dhabi – live reaction",
    "url": "https://www.theguardian.com/sport/live/2025/dec/07/abu-dhabi-grand-prix-formula-one-f1-title-decider-norris-verstappen-piastri-live",
    "image": "https://media.guim.co.uk/791fce9391891543639bf32a970b4c401c138956/466_52_2990_2392/500.jpg",
    "summary": "Lando Norris clinched his first world championship title by finishing third at the Yas Marina Circuit. The victory marks a significant achievement in his racing career. Fans can join Niall McVeigh for live reactions and discussions following the event.",
    "published": "2025-12-07T15:15:12Z"
  },
  {
    "title": "Saturday Night Live: Melissa McCarthy hosts for sixth time but laughs are sparse",
    "url": "https://www.theguardian.com/tv-and-radio/2025/dec/07/saturday-night-live-melissa-mccarthy-recap",
    "image": "https://media.guim.co.uk/d045789f5d591f0d0395e3342fb07f7202eff906/250_0_2500_2000/500.jpg",
    "summary": "A beloved comedic actor makes a comeback in a new episode that receives mixed reviews. The episode humorously targets various figures, including Pete Hegseth and a well-known viral raccoon. Critics describe the content as uninspired and mediocre overall.",
    "published": "2025-12-07T15:08:40Z"
  },
  {
    "title": "Judge blocks Trump prosecutors from accessing key evidence in Comey case",
    "url": "https://www.theguardian.com/us-news/2025/dec/07/judge-blocks-prosecutor-evidence-james-comey",
    "image": "https://media.guim.co.uk/93d1cfd6220247088519cee2b26a6d481805073e/272_0_2535_2028/500.jpg",
    "summary": "A judge ruled that the government likely violated protections against unreasonable searches when investigating an ally of former FBI director James Comey. This decision poses a significant setback for the government's case. The ruling raises concerns over the legality of the actions taken during the investigation.",
    "published": "2025-12-07T15:02:23Z"
  },
  {
    "title": "LA wildfire survivors rebuild holiday traditions after year of devastation",
    "url": "https://www.theguardian.com/us-news/2025/dec/07/la-wildfire-survivors-holidays-christmas",
    "image": "https://media.guim.co.uk/0b0db89fc778b4ca08ed0294a11c314b7a5b349e/409_0_4798_3841/500.jpg",
    "summary": "After losing their homes and cherished belongings in devastating events, Angelenos are finding ways to rebuild their lives and create new traditions this season. The community is coming together to foster resilience amid hardship. Despite the challenges, the spirit of renewal and hope persists.",
    "published": "2025-12-07T15:00:24Z"
  }
]