[
  {
    "title": "Aston Villa v Fulham: Premier League – live",
    "url": "https://www.theguardian.com/football/live/2025/sep/28/aston-villa-v-fulham-premier-league-live",
    "image": "https://media.guim.co.uk/da4323fe51b51bdd3655581c1b08fb6020c0175c/27_0_2776_2221/500.jpg",
    "summary": "Unai Emery's team is looking for a much-needed boost in performance as they face Fulham. Daniel Harris provides a minute-by-minute report on the match. Fans are eager to see if the team can turn their fortunes around.",
    "published": "2025-09-28T14:13:31Z"
  },
  {
    "title": "Newcastle v Arsenal: Premier League – live",
    "url": "https://www.theguardian.com/football/live/2025/sep/28/newcastle-v-arsenal-premier-league-live",
    "image": "https://media.guim.co.uk/a63a3d660b205c47e1a992fcf4bc584292245917/0_140_4813_3850/500.jpg",
    "summary": "Newcastle aims to continue their recent success against Arsenal under Mikel Arteta. Rob Smyth provides a minute-by-minute update on the match. Fans are eager to see if Newcastle can maintain their strong performance.",
    "published": "2025-09-28T14:13:29Z"
  },
  {
    "title": "England squad ratings: how all the Red Roses performed at Rugby World Cup",
    "url": "https://www.theguardian.com/sport/2025/sep/28/england-squad-ratings-how-all-the-red-roses-performed-at-rugby-world-cup",
    "image": "https://media.guim.co.uk/449846efb409856cc4dd857e5c2d65e079da6b20/1046_319_3677_2941/500.jpg",
    "summary": "John Mitchell's team showcased impressive team depth, with 32 players actively contributing throughout the tournament. Their solid performance ensured they faced minimal challenges from opponents. This strength in numbers played a crucial role in their success.",
    "published": "2025-09-28T14:11:22Z"
  },
  {
    "title": "Cinderella review – fun-forward fairytale kicks off ENO makeover",
    "url": "https://www.theguardian.com/music/2025/sep/28/cinderella-review-london-coliseum-eno-english-national-opera",
    "image": "https://media.guim.co.uk/16ba9caa81af94726bacc480a7ac5ff84e9c274d/76_0_5562_4450/500.jpg",
    "summary": "Julia Burbach's dynamic production of Rossini kicks off a new chapter for the English National Opera, showcasing a lively blend of chorus comedy. The fast-paced performance also marks conductor Yi-Chen Lin's debut with the company. This innovative staging sets an exciting tone for the opera's split-site era.",
    "published": "2025-09-28T14:05:00Z"
  },
  {
    "title": "Alternative data suggest uneven inflation amid Trump’s numbers skepticism",
    "url": "https://www.theguardian.com/business/2025/sep/28/inflation-data-trump-bls-cpi",
    "image": "https://media.guim.co.uk/dd3bb475a181a920347ac56a6b522a685f55b084/432_0_4315_3452/500.jpg",
    "summary": "Recent scrutiny of BLS figures has led to a reliance on alternative indices from Truflation, Zillow, Adobe, and ISM, which reveal a more detailed view of price trends. These indices suggest that inflation dynamics may differ from traditional measures. This shift highlights the complexities in understanding current economic conditions.",
    "published": "2025-09-28T14:00:13Z"
  }
]