[
  {
    "title": "Reeves refuses to say she will stick to manifesto pledge on tax rises and insists she must face world ‘as it is’ – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/nov/04/rachel-reeves-speech-tax-budget-labour-keir-starmer-latest-politics-news-live",
    "image": "https://media.guim.co.uk/7ebd2ee66722401ff1d8a55b51fe33ca1c924190/363_0_3411_2729/500.jpg",
    "summary": "In a pre-budget speech, the Chancellor emphasized her commitment to addressing the priorities of the British public. She indicated that forthcoming tax increases are likely as part of the economic strategy. The speech lays the groundwork for upcoming financial decisions aimed at stabilizing the economy.",
    "published": "2025-11-04T15:22:23Z"
  },
  {
    "title": "US elections 2025 live: Donald Trump weighs in as Americans go to the polls in New York City, New Jersey, Virginia and California",
    "url": "https://www.theguardian.com/us-news/live/2025/nov/04/us-elections-2025-live-new-york-city-new-jersey-virginia-california-latest-news-updates-live",
    "image": "https://media.guim.co.uk/88a9be04ff4e347897e06aabd63cfa5e1dbf3434/293_0_2500_2000/500.jpg",
    "summary": "US President Joe Biden criticized Jewish voters who support Democratic New York mayoral candidate Zohran Mamdani, labeling them as \"stupid.\" His remarks sparked controversy and discussions about political alignment within the Jewish community. The comments reflect ongoing tensions in political perspectives related to Israel and the Democratic Party.",
    "published": "2025-11-04T15:22:01Z"
  },
  {
    "title": "WTA Finals tennis: Coco Gauff v Jasmine Paolini, Aryna Sabalenka v Jessica Pegula – live",
    "url": "https://www.theguardian.com/sport/live/2025/nov/04/wta-finals-tennis-coco-gauff-v-jasmine-paolini-aryna-sabalenka-v-jessica-pegula-live",
    "image": "https://media.guim.co.uk/72a247b7d7b80b5892f51d8b981af8d46f34f2fc/819_0_7260_5806/500.jpg",
    "summary": "Yara El-Shaboury will host coverage of the final group-stage matches in the season-ending tournament. Fans can expect updates and insights as teams compete for advancement. Don't miss the action as the tournament reaches its crucial stages.",
    "published": "2025-11-04T15:20:57Z"
  },
  {
    "title": "Pound hits lowest since April as investors anticipate budget tax rises; markets hit by AI valuation jitters – business live",
    "url": "https://www.theguardian.com/business/live/2025/nov/04/tax-rises-inevitable-rachel-reeves-budget-speech-borrowing-pound-stock-markets-business-live-news",
    "image": "https://media.guim.co.uk/68cf1b7ab2dd0c1dd2b4e0289b9527a034ab841e/410_0_3501_2802/500.jpg",
    "summary": "The British pound fell against the U.S. dollar following the chancellor's speech, which hinted at potential tax increases and tighter budget measures. Market reactions suggest concerns about the government's fiscal policies. Investors are wary of the implications for the UK economy.",
    "published": "2025-11-04T15:19:28Z"
  },
  {
    "title": "Haaland says he is far off Ronaldo and Messi but in ‘good way’ to beat goal tally",
    "url": "https://www.theguardian.com/football/2025/nov/04/erling-haaland-manchester-city-lionel-messi-cristiano-ronaldo",
    "image": "https://media.guim.co.uk/18481399c34296c8cadd33eccf7598ce01246a70/141_0_2404_1923/500.jpg",
    "summary": "The striker aims to surpass his total of 56 goals this season. He is a key member of Guardiola's leadership group at Manchester City. His performance and contributions are vital to the team's success.",
    "published": "2025-11-04T15:10:18Z"
  }
]