[
  {
    "title": "Manchester derby buildup, WSL news and a Championship grudge match – matchday live",
    "url": "https://www.theguardian.com/football/live/2025/sep/14/manchester-derby-buildup-wsl-news-and-a-championship-grudge-match-matchday-live",
    "image": "https://media.guim.co.uk/2eac89fde28be8c000bdf9ac32bb41c35de3c356/0_0_5000_4000/500.jpg",
    "summary": "Stay updated with the latest happenings in European football as a packed day of matches unfolds. Key games and developments are shaping the current landscape of the sport. Don't miss out on any important updates or results!",
    "published": "2025-09-14T07:25:38Z"
  },
  {
    "title": "Immigration law firm making £1.7m in legal aid loses contract over standards",
    "url": "https://www.theguardian.com/uk-news/2025/sep/14/immigration-law-firm-loses-legal-aid-contract-performance-concerns",
    "image": "https://media.guim.co.uk/243e48a4c8d1562c53657297c3e6a6b1d1b98764/621_0_6214_4974/500.jpg",
    "summary": "A law firm handling thousands of asylum seeker cases has left many individuals without legal representation, as it took on an overwhelming number of cases with only five solicitors. This situation has raised concerns about the quality of legal support and the fair processing of asylum claims. The issue highlights the ongoing challenges within the immigration legal system.",
    "published": "2025-09-14T07:00:28Z"
  },
  {
    "title": "How to use ChatGPT at university without cheating: ‘Now it’s more like a study partner’ ",
    "url": "https://www.theguardian.com/education/2025/sep/14/how-to-use-chatgpt-at-university-without-cheating-now-its-more-like-a-study-partner",
    "image": "https://media.guim.co.uk/8aadc8e8a102e57dda823bcf57911c02a4c2a7d8/742_0_4750_3800/500.jpg",
    "summary": "The widespread use of AI tools is creating divided opinions among educators, with some perceiving them as beneficial while others view them as a threat. The challenge lies in establishing clear boundaries between acceptable assistance and academic dishonesty. Understanding these dynamics is crucial for navigating the implications of AI in education.",
    "published": "2025-09-14T07:00:27Z"
  },
  {
    "title": "From Shearer to Pogba: how 10 British record signings fared in the Premier League",
    "url": "https://www.theguardian.com/football/2025/sep/14/from-shearer-to-pogba-how-10-british-record-signings-fared-in-the-premier-league",
    "image": "https://media.guim.co.uk/df0b25db99d3fe7f418f7e521a4648e9627ee588/0_0_5000_4000/500.jpg",
    "summary": "As Alexander Isak prepares for his Liverpool debut following a £125 million transfer, the spotlight is on the club's history of record signings. The article highlights five successful high-cost players and contrasts them with five who did not meet expectations. This exploration underscores the risks and rewards of investing heavily in talent.",
    "published": "2025-09-14T07:00:27Z"
  },
  {
    "title": "Love coursework, hate exams? If you’re choosing a university place, don’t forget to check how you will be tested",
    "url": "https://www.theguardian.com/education/2025/sep/14/love-coursework-hate-exams-if-youre-choosing-a-university-place-dont-forget-to-check-how-you-will-be-tested",
    "image": "https://media.guim.co.uk/8ec3c4be7f5341a16792f90ed34fba178fb77973/465_134_4367_3494/500.jpg",
    "summary": "Universities are reevaluating their assessment methods in response to advancements in AI, shifting away from traditional exams. Many institutions are now incorporating presentations, oral exams (vivas), and quizzes to better gauge student understanding. This change aims to reduce the risks of academic dishonesty associated with AI tools.",
    "published": "2025-09-14T07:00:27Z"
  }
]