[
  {
    "title": "TV tonight: meet this year’s Strictly Come Dancing celebrities ",
    "url": "https://www.theguardian.com/tv-and-radio/2025/sep/20/tv-tonight-meet-this-years-strictly-come-dancing-celebrities",
    "image": "https://media.guim.co.uk/7a66220bbaa635afde3c914ae8dad10738373ad6/1253_0_6064_4857/500.jpg",
    "summary": "Tonight's lineup features a Neighbours star alongside a former Leeds United player, adding excitement to the programming. Additionally, viewers can catch the grand finale of the dramatic series The Count of Monte Cristo. Tune in for a mix of entertainment and thrilling storytelling.",
    "published": "2025-09-20T05:15:05Z"
  },
  {
    "title": "From A Big Bold Beautiful Journey to Cardi B: your complete entertainment guide to the week ahead",
    "url": "https://www.theguardian.com/culture/2025/sep/20/big-bold-beautiful-journey-cardi-b-rufus-wainwright-house-of-guinness",
    "image": "https://media.guim.co.uk/57afb00ac0e8be709200de3dd5745734b1d40726/0_0_5000_4000/500.jpg",
    "summary": "Margot Robbie and Colin Farrell lead a new fantasy romance film, showcasing their chemistry in a fantastical setting. In a separate development, a rapper transitions from legal battles to focusing on music, returning to the recording studio. Both projects highlight the diverse talents of their respective stars in the entertainment industry.",
    "published": "2025-09-20T05:01:05Z"
  },
  {
    "title": "Andy Burnham, the man who would be king",
    "url": "https://www.theguardian.com/politics/ng-interactive/2025/sep/20/andy-burnham-the-man-who-would-be-king",
    "image": "https://media.guim.co.uk/9d5d5328a8f626302d07c183824df75c60c3426c/0_382_3509_2807/500.jpg",
    "summary": "The Greater Manchester mayor openly expresses his ambitions to lead the Labour party. However, he confronts substantial challenges ahead in achieving this goal. The political landscape presents hurdles that could complicate his leadership aspirations.",
    "published": "2025-09-20T05:00:08Z"
  },
  {
    "title": "Blind date: ‘The restaurant staff reacted with glee when told them we were going on somewhere’",
    "url": "https://www.theguardian.com/lifeandstyle/2025/sep/20/blind-date-niamh-harry",
    "image": "https://media.guim.co.uk/9906a4ad652d575799037b5e2894018fb386f49f/0_0_5000_4000/500.jpg",
    "summary": "Niamh, a 27-year-old classical music professional, has met Harry, a 30-year-old consultant in the public sector. The two seem to come from different backgrounds but are exploring their connection. Details about their meeting or potential romance remain limited.",
    "published": "2025-09-20T05:00:07Z"
  },
  {
    "title": "Tim Dowling: we’re low on milk … the kids must have moved back home",
    "url": "https://www.theguardian.com/lifeandstyle/2025/sep/20/tim-dowling-we-are-low-on-milk-kids-must-moved-back-home",
    "image": "https://media.guim.co.uk/6b61473b335d5bf41ea44845e214af3be21d2703/625_0_3750_3000/500.jpg",
    "summary": "Two of the sons have returned home after initially moving out, while the third son resides nearby. This change brings the family closer together again. The dynamic of the household has shifted as they adjust to living together once more.",
    "published": "2025-09-20T05:00:06Z"
  }
]