[
  {
    "title": "WTA Finals tennis: Aryna Sabalenka beats Amanda Anisimova in semi-finals; Rybakina denies Pegula – live",
    "url": "https://www.theguardian.com/sport/live/2025/nov/07/wta-finals-tennis-rybakina-pegula-sabalenka-anisimova-live",
    "image": "https://media.guim.co.uk/6c44a8bf57b61b4aeee0439495c3b78334238f00/548_110_2878_2302/500.jpg",
    "summary": "Niall McVeigh shares insights after Aryna Sabalenka's intense victory, leading her to the final against Elena Rybakina. The match showcased Sabalenka's resilience in a challenging contest. Fans eagerly anticipate the showdown in Riyadh.",
    "published": "2025-11-07T20:19:21Z"
  },
  {
    "title": "Twenty percent of flights could be cut if shutdown doesn’t end ‘relatively soon’, says transportation secretary – live",
    "url": "https://www.theguardian.com/us-news/live/2025/nov/07/donald-trump-government-shutdown-air-traffic-flights-snap-viktor-orban-hungary-ukraine-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/28e8fe4de457631d154c20334a66bb0f2ce5f156/51_0_3913_3130/500.jpg",
    "summary": "Sean Duffy warns that flight cancellations at designated airports could increase to 15-20% due to potential absenteeism among air traffic controllers. He highlights concerns over controllers possibly not showing up for work. This situation could lead to significant disruptions in air travel.",
    "published": "2025-11-07T20:09:50Z"
  },
  {
    "title": "Students and faculty at over 100 US universities protest against Trump’s attacks",
    "url": "https://www.theguardian.com/us-news/2025/nov/07/student-protest-trump-education-attacks",
    "image": "https://media.guim.co.uk/8a741e6568929caa30d9ad5f81ce45061ef2d5f8/901_0_4420_3538/500.jpg",
    "summary": "Students, along with national and local organizations, held a day of action across the United States to protest against former President Trump's perceived attacks on academic freedom. The demonstrations aimed to raise awareness about the implications of these actions on education and free expression. Participants called for a reaffirmation of the importance of academic independence in schools and universities.",
    "published": "2025-11-07T20:05:32Z"
  },
  {
    "title": "Sex offender freed from Wandsworth prison by mistake is back in custody",
    "url": "https://www.theguardian.com/society/2025/nov/07/sex-offender-freed-wandsworth-prison-mistake-in-custody-ibrahim-kaddour-cherif",
    "image": "https://media.guim.co.uk/9fd225a890852029c61fa63d03244ba3895c4e09/263_0_1171_937/500.jpg",
    "summary": "Brahim Kaddour-Cherif, who was mistakenly released from custody on October 29, was arrested again in north London on Friday. His prior release was due to a misunderstanding. Authorities have since taken him back into custody.",
    "published": "2025-11-07T19:59:59Z"
  },
  {
    "title": "Virginia Republican who shared violent texts from prominent Democrat loses re-election",
    "url": "https://www.theguardian.com/us-news/2025/nov/07/carrie-coyner-virginia-republican-loses-reelection-jay-jones",
    "image": "https://media.guim.co.uk/e46af1bb1818bcd0d8ff66d2a54fe4f4b3828f83/423_0_4233_3388/500.jpg",
    "summary": "Carrie Coyner conceded defeat following a controversy sparked by her sharing a text message in which a Democrat expressed thoughts about violence against her rival. The scandal drew significant attention during the campaign. Commonly considered detrimental, the incident ultimately influenced the election outcome.",
    "published": "2025-11-07T19:59:52Z"
  }
]