[
  {
    "title": "Ireland v England: first men’s T20 cricket international – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/17/ireland-v-england-first-mens-t20-cricket-live",
    "image": "https://media.guim.co.uk/2e7fb0b464dfbbba1e9edcda79605d9d03964122/0_13_2890_2312/500.jpg",
    "summary": "The first of a three-match T20 mini-series is underway, with Rob Smyth providing an over-by-over report. Fans are eager to see which team will come out on top in this exciting contest. Stay tuned for detailed updates and analysis throughout the match.",
    "published": "2025-09-17T14:37:13Z"
  },
  {
    "title": "Irish TD will not be expelled for wearing blackface, say Social Democrats",
    "url": "https://www.theguardian.com/world/2025/sep/17/irish-td-will-not-be-expelled-for-wearing-blackface-say-social-democrats",
    "image": "https://media.guim.co.uk/9976c50e122b0b1388d4badc0f4993008b0ea0ac/263_0_1350_1080/500.jpg",
    "summary": "Eoin Hayes has issued an apology for his controversial choice to dress as Barack Obama for a Halloween party in 2009. He described the act as a \"huge mistake\" and acknowledged its insensitivity. The statement reflects a recognition of the implications of cultural appropriation and the importance of respecting diverse identities.",
    "published": "2025-09-17T14:35:33Z"
  },
  {
    "title": "UK overall inflation remains at 3.8% in August, but food price growth climbs for fifth month in a row - business live",
    "url": "https://www.theguardian.com/business/live/2025/sep/17/uk-inflation-steady-38-in-july-official-figures-federal-reserve-interest-rates-donald-trump-state-visit-business-live",
    "image": "https://media.guim.co.uk/8b6880f735730e03a3aeb86b794481b78d364fca/323_0_3682_2945/500.jpg",
    "summary": "Food prices have increased at their fastest pace since January 2024, driven by rising costs for vegetables, milk, cheese, and fish. Meanwhile, the US Federal Reserve is anticipated to announce a rate cut later today. This combination of inflation in essential goods and potential monetary easing highlights economic concerns.",
    "published": "2025-09-17T14:35:28Z"
  },
  {
    "title": "King and senior royals host Donald Trump in Windsor for US president’s second state visit – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/17/donald-trump-uk-state-visit-king-charles-windsor-politics-latest-news-updates-labour-keir-starmer",
    "image": "https://media.guim.co.uk/589d40b6d7e3a084a80e595327c5a6419a9462a7/1302_0_4127_3302/500.jpg",
    "summary": "During his first full day in the UK, the US president will participate in multiple events in Windsor. This visit culminates in a state banquet. The trip highlights diplomatic relations between the two countries.",
    "published": "2025-09-17T14:32:23Z"
  },
  {
    "title": "Fired health official testifies to Senate committee about chaos in RFK Jr’s department – live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/17/donald-trump-charlie-kirk-free-speech-nyt-cdc-rfk-epstein-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/0513a52813319b3e300af54bada3851f8d126040/881_0_4415_3532/500.jpg",
    "summary": "Susan Monarez, the former director of the Centers for Disease Control, was dismissed from her position in August. Her termination has raised questions regarding leadership and management within the agency. The reasons for her firing have not been publicly detailed.",
    "published": "2025-09-17T14:31:53Z"
  }
]