[
  {
    "title": "Lecornu bemoans lack of compromise across political spectrum as he resigns as French PM – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/oct/06/france-pm-resigns-lecornu-macron-europe-live-news-updates",
    "image": "https://media.guim.co.uk/4d8af5f1370c2a742772a6054812c2fbd671885c/903_0_4489_3592/500.jpg",
    "summary": "A newly appointed cabinet member has resigned after just under a month in office due to intense criticism directed at President Macron's government. The departure highlights ongoing tensions and dissatisfaction within the administration. This situation raises questions about the stability and effectiveness of Macron's leadership moving forward.",
    "published": "2025-10-06T12:40:55Z"
  },
  {
    "title": "Bari Weiss named editor-in-chief of CBS News as Paramount buys Free Press startup",
    "url": "https://www.theguardian.com/media/2025/oct/06/bari-weiss-cbs-news-paramount-free-press",
    "image": "https://media.guim.co.uk/a817f12baf2b9c9dab4e95908a083dada00f1e71/387_0_4349_3479/500.jpg",
    "summary": "A prominent commentator will take the helm of a well-known U.S. news network, marking a significant return to the media industry. This appointment comes five years after the commentator's contentious departure from The New York Times. The move signals a new chapter for both the network and the commentator’s career.",
    "published": "2025-10-06T12:39:07Z"
  },
  {
    "title": "Judge blocks Trump’s bid to deploy national guard to Oregon – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/06/donald-trump-national-guard-ice-government-shutdown-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/9722523b75c9a89a5eb36f832f76e5a48ed481b9/139_0_4583_3667/500.jpg",
    "summary": "A US District Judge, Karin Immergut, has temporarily blocked any deployment of federal agents to Portland for two weeks. This decision comes in the midst of ongoing legal disputes regarding their presence in the city. The ruling aims to address concerns surrounding the agents' actions and policies.",
    "published": "2025-10-06T12:38:24Z"
  },
  {
    "title": "UK regulators step up crackdown on firms chasing cut of car finance payouts",
    "url": "https://www.theguardian.com/business/2025/oct/06/uk-regulators-crackdown-claims-firms-car-finance-payouts",
    "image": "https://media.guim.co.uk/b3d98be06d0a500fd9056511a706878468f7fb66/431_0_3548_2838/500.jpg",
    "summary": "Certain claims companies have been shut down, while others have been instructed to cease client acquisition. Additionally, misleading advertisements have been ordered to be removed. These measures aim to protect consumers from deceptive practices.",
    "published": "2025-10-06T12:37:42Z"
  },
  {
    "title": "Euro and Paris stock market slide amid French political crisis; gold at record high near $4,000 per ounce – business live",
    "url": "https://www.theguardian.com/business/live/2025/oct/06/yen-slumps-nikkei-record-sanae-takaichi-wins-election-gold-nears-4000-rally-continues-business-live-news",
    "image": "https://media.guim.co.uk/bcc4965e0a3de7e5575e75c132ebc3449419bcc8/553_0_5525_4420/500.jpg",
    "summary": "France's Prime Minister has unexpectedly resigned, prompting rolling coverage of the implications for the country's economy and financial landscape. This sudden political change raises questions about future government stability and policy direction. Analysts are closely monitoring market reactions and potential impacts on economic reforms.",
    "published": "2025-10-06T12:37:22Z"
  }
]