[
  {
    "title": "Australia politics live: Tim Wilson calls government’s move to charge for FoI requests a ‘truth tax’",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/02/australia-politics-live-labor-coalition-anthony-albanese-sussan-ley-question-time-cosmetic-surgery-tobacco-excise-ntwnfb",
    "image": "https://media.guim.co.uk/418139d8f5714fa692de60415b13ea9f4e8c1564/0_82_3173_2540/500.jpg",
    "summary": "Today's news highlights include key developments in politics, international relations, and significant events across various sectors. Stay updated as breaking stories unfold throughout the day. For real-time updates, monitor trusted news sources continuously.",
    "published": "2025-09-01T23:22:01Z"
  },
  {
    "title": "Women’s Super League 2025-26 previews No 9: Manchester City",
    "url": "https://www.theguardian.com/sport/2025/sep/02/womens-super-league-2025-26-preview-manchester-city",
    "image": "https://media.guim.co.uk/f51c9218f7b75507306609cd026556ef731df0b8/377_0_6269_5015/500.jpg",
    "summary": "New head coach Andrée Jeglertz aims to lead the team back to European competition after they missed qualifying for the Women’s Champions League last season. His appointment highlights the club's ambition to regain its competitive edge. Fans and stakeholders are hopeful for a successful season ahead under his guidance.",
    "published": "2025-09-01T23:01:21Z"
  },
  {
    "title": "Children as young as 11 tempted to try betting after being ‘flooded’ by celebrity endorsement",
    "url": "https://www.theguardian.com/society/2025/sep/02/children-as-young-as-11-tempted-to-try-betting-after-being-flooded-by-celebrity-endorsement",
    "image": "https://media.guim.co.uk/fc05e853d72aebb9dcb541bd8f9b5721fce740c1/150_0_2893_2315/500.jpg",
    "summary": "A survey revealed that UK youth aged 11-17 are influenced by celebrities promoting gambling, with many expressing a desire to imitate their actions. This highlights the susceptibility of young people to celebrity culture and its impact on their behavior. The findings raise concerns about the potential normalization of gambling among adolescents.",
    "published": "2025-09-01T23:01:21Z"
  },
  {
    "title": "Three-minute test helps identify people at greater risk of Alzheimer’s, trial finds",
    "url": "https://www.theguardian.com/science/2025/sep/02/three-minute-test-helps-identify-people-at-greater-risk-of-alzheimers-trial-finds",
    "image": "https://media.guim.co.uk/d3319009d83ecad18ae3310bc5f8583425ad8e7a/79_0_1000_800/500.jpg",
    "summary": "A new test identifies memory issues associated with Alzheimer's disease much earlier than standard diagnostic methods. This early detection opens the door for potential drug interventions before significant symptoms appear. The advance could lead to improved treatment outcomes for those at risk of developing Alzheimer's.",
    "published": "2025-09-01T23:01:21Z"
  },
  {
    "title": "At least 45,000 sites in Wales could be contaminated with toxic waste, study says",
    "url": "https://www.theguardian.com/uk-news/2025/sep/02/at-least-45000-sites-in-wales-could-be-contaminated-with-toxic-waste-study-says",
    "image": "https://media.guim.co.uk/134af871bc592ebf2fcc18242861782a23b14012/186_0_2792_2234/500.jpg",
    "summary": "Campaigners report that merely 82 sites have been thoroughly assessed and identified as contaminated, raising concerns about the extent of potential environmental threats. This limited analysis suggests that many hazardous locations may remain unexamined. As a result, the full scale of contamination risks is still unknown.",
    "published": "2025-09-01T23:01:20Z"
  }
]