[
  {
    "title": "England given target of 331 to beat South Africa: second men’s one-day international – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/04/england-v-south-africa-second-mens-one-day-international-live",
    "image": "https://media.guim.co.uk/a08a99760fa32210d07c8645b7bc4ff4cbec2ad1/372_97_3475_2780/500.jpg",
    "summary": "England faces South Africa in a crucial ODI at Lord's, looking to recover from a heavy defeat in the first match. The game presents an opportunity for England to showcase improvement and resilience. Join our writers for live updates and analysis.",
    "published": "2025-09-04T18:46:42Z"
  },
  {
    "title": "Firm used by Angela Rayner to buy stamp duty row flat says it did not offer tax advice",
    "url": "https://www.theguardian.com/politics/2025/sep/04/angela-rayner-used-family-conveyancing-firm-to-buy-tax-row-flat",
    "image": "https://media.guim.co.uk/2b500e5c1c3a45ab87dfe4d9723b15fcfe65b161/204_0_2035_1629/500.jpg",
    "summary": "The head of a family-run conveyancing firm has defended their calculation methods, stating it was \"strictly based on the facts and information provided to us.\" This comes amidst scrutiny regarding their practices. The firm emphasizes transparency and accuracy in their processes.",
    "published": "2025-09-04T18:42:24Z"
  },
  {
    "title": "Canada’s Mark Carney signals austerity measures as government shifts focus from Trump to economy",
    "url": "https://www.theguardian.com/world/2025/sep/04/canada-carney-budget-trump",
    "image": "https://media.guim.co.uk/fe67f67515a763b27b72d1e98e7e9a865abc5d67/514_0_5285_4229/500.jpg",
    "summary": "The Prime Minister advised Canadians to be mindful as Ottawa implements spending cuts aimed at balancing its budget amid historically high military expenditures. The government is taking measures to address financial constraints while managing defense costs. This move reflects an effort to ensure fiscal responsibility in challenging economic times.",
    "published": "2025-09-04T18:42:20Z"
  },
  {
    "title": "RFK Jr hints access to key abortion drug could be cut back ",
    "url": "https://www.theguardian.com/us-news/2025/sep/04/trump-rfk-mifepristone-abortion-pill",
    "image": "https://media.guim.co.uk/027c0ec64338b40f04b68d2598688a3fc6dfe4aa/0_0_3000_2400/500.jpg",
    "summary": "The Health Secretary criticized Biden administration officials for allegedly manipulating data regarding the abortion pill mifepristone. This claim comes despite existing research affirming that mifepristone is both safe and effective. The controversy highlights ongoing debates surrounding reproductive health policies.",
    "published": "2025-09-04T18:36:23Z"
  },
  {
    "title": "RFK Jr grilled in tense hearing about chaos at federal health agencies and vaccines – live updates",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/04/donald-trump-tariffs-immigration-technology-epstein-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/c9ce9df4e0a13cc2fb1c6525d12a19fd293216bc/763_0_4913_3933/500.jpg",
    "summary": "Trump's health secretary is under pressure as he faces challenging questions regarding recent layoffs and budget cuts within the department. Critics are scrutinizing his proposals aimed at \"making America healthy again.\" The discourse focuses on the implications of these changes for public health initiatives.",
    "published": "2025-09-04T18:32:36Z"
  }
]