[
  {
    "title": "EU countries and Ukraine to hold talks on ‘drone wall’ to counter growing threat from Russia and others – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/sep/26/denmark-drone-sightings-airport-russia-ukraine-europe-live-news",
    "image": "https://media.guim.co.uk/8638c1137db75e745a8e1c320dde49c36812af1d/1314_245_5329_4263/500.jpg",
    "summary": "European countries are set to convene today to discuss strategies to address increasing incursions threatening their security. The meeting aims to strengthen collaborative efforts and enhance regional defense measures. This proactive approach highlights the urgency in tackling rising tensions and ensuring stability across the continent.",
    "published": "2025-09-26T12:40:02Z"
  },
  {
    "title": "UK retailers accused of ripping off motorists as fuel margins ‘remain far above historic levels’",
    "url": "https://www.theguardian.com/business/2025/sep/26/uk-retailers-accused-of-ripping-off-motorists-fuel-margins-petrol-diesel-prices",
    "image": "https://media.guim.co.uk/364aad3715357482491c947b14c52b5fff08dae0/0_0_3540_2832/500.jpg",
    "summary": "A watchdog has expressed deep concern over firms increasing petrol and diesel prices, suggesting this is being done at the expense of consumers. The practices observed may indicate price gouging. The report calls for closer scrutiny of the pricing strategies in the fuel market.",
    "published": "2025-09-26T12:38:06Z"
  },
  {
    "title": "Ryder Cup 2025: USA v Europe day one updates – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/26/ryder-cup-2025-day-one-golf-europe-usa-bethpage-black-live",
    "image": "https://media.guim.co.uk/474cb9a963d112333c53d6741297a298e4426658/292_0_4333_3467/500.jpg",
    "summary": "Live updates are being provided for the opening foursomes and fourballs at Bethpage Black. Writers are offering hole-by-hole coverage to keep fans informed. Stay tuned for the latest developments in the event.",
    "published": "2025-09-26T12:37:44Z"
  },
  {
    "title": "Will he? Won’t he? Do the King of the North’s antics remind you of anyone? | Marina Hyde",
    "url": "https://www.theguardian.com/commentisfree/2025/sep/26/king-of-the-north-andy-burnham-liverpool-tory-conferences",
    "image": "https://media.guim.co.uk/40647c567f46d1f670310b4b07c703baf38640bb/757_0_4167_3333/500.jpg",
    "summary": "Marina Hyde reflects on Andy Burnham's upcoming visit to Liverpool, drawing parallels to the Tory conferences of 2017 and 2018. She implies that the past events serve as a cautionary reminder of potential challenges. The commentary suggests skepticism about the current political landscape.",
    "published": "2025-09-26T12:37:27Z"
  },
  {
    "title": "Nottinghamshire v Warwickshire, Hampshire v Surrey and more: county cricket – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/26/nottinghamshire-v-warwickshire-surrey-v-hampshire-and-more-county-cricket-final-round-live",
    "image": "https://media.guim.co.uk/32a88844c6240c9ea0c9343b41ee291ac1b2dab7/95_0_3799_3038/500.jpg",
    "summary": "On day three of the season's final round at Trent Bridge, excitement builds as the title party unfolds. Tanya Aldred shares the latest updates from the event. The atmosphere is celebratory as teams and fans engage in the festivities.",
    "published": "2025-09-26T12:37:21Z"
  }
]