[
  {
    "title": "Manchester City v Napoli: Champions League – live",
    "url": "https://www.theguardian.com/football/live/2025/sep/18/manchester-city-v-napoli-champions-league-live",
    "image": "https://media.guim.co.uk/15c40c08b45d43383496c9124be08b5a1e2e8cb0/246_0_3513_2810/500.jpg",
    "summary": "Italian champions arrive at the Etihad for an exciting match. Simon Burnton provides live minute-by-minute updates. Fans can follow along for the latest developments and key moments.",
    "published": "2025-09-18T19:22:15Z"
  },
  {
    "title": "Newcastle United v Barcelona: Champions League – live",
    "url": "https://www.theguardian.com/football/live/2025/sep/18/newcastle-united-v-barcelona-champions-league-live",
    "image": "https://media.guim.co.uk/139577c8e1a852478ec2cc68b5706d8cffcd0b2e/68_61_1969_1575/500.jpg",
    "summary": "Eddie Howe's team is set to kick off their campaign with a challenging match against Barcelona. Barry Glendenning will provide minute-by-minute updates on the game. Fans can follow the live report for real-time insights and developments.",
    "published": "2025-09-18T19:21:52Z"
  },
  {
    "title": "Jimmy Kimmel suspension: Trump suggests networks who cover him ‘negatively’ could lose licenses – live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/18/jimmy-kimmel-charlie-kirk-comments-show-cancelled-suspended-monologue-trump-us-politics-live",
    "image": "https://media.guim.co.uk/c5e96b967de7e5aa001310c0fc9ab1ba6d6aedce/0_284_6474_5180/500.jpg",
    "summary": "During an in-flight press conference, President Trump claimed that 97% of news networks are biased against him, although he provided no evidence for this assertion. In response, Senator Chuck Schumer accused Trump of attempting to undermine free speech. The exchange highlights ongoing tensions between the administration and the media.",
    "published": "2025-09-18T19:21:02Z"
  },
  {
    "title": "Picasso painting not seen for 80 years unveiled by Paris auction house",
    "url": "https://www.theguardian.com/artanddesign/2025/sep/18/picasso-painting-hidden-for-80-years-auction-paris",
    "image": "https://media.guim.co.uk/1a991cdae61e56bd3eb4a6c19764dc988fd65652/1290_293_3390_2712/500.jpg",
    "summary": "A Portrait of Dora Maar, painted in Paris during WWII, has been privately owned since its purchase in 1944. The artwork has now come to public attention after years in a private collection. Its historical and artistic significance is gaining renewed interest.",
    "published": "2025-09-18T19:16:30Z"
  },
  {
    "title": "Nottinghamshire stun Surrey, Glamorgan promoted and more: county cricket, day four – as it happened",
    "url": "https://www.theguardian.com/sport/live/2025/sep/18/surrey-v-nottinghamshire-somerset-v-hampshire-and-more-county-cricket-day-four-live",
    "image": "https://media.guim.co.uk/6e00c513cd479e01fb23433c5043c61e772fff4f/335_0_2978_2382/500.jpg",
    "summary": "Notts secured a thrilling 20-run victory over Surrey at the Oval, bringing them closer to their first title since 2010. The team's strong performance has put them on the verge of championship glory. Fans are eagerly anticipating the final outcome as the season progresses.",
    "published": "2025-09-18T19:02:55Z"
  }
]