[
  {
    "title": "Australia v England: Ashes second Test, day two – live",
    "url": "https://www.theguardian.com/sport/live/2025/dec/05/australia-vs-england-live-ashes-second-2nd-test-day-two-aus-v-eng-cricket-scores-updates-gabba-brisbane",
    "image": "https://media.guim.co.uk/5bc85deaffc6b352a80ccd2c44390a84ead8731a/82_82_1105_884/500.jpg",
    "summary": "Tourists are all out for 334 runs, with Joe Root scoring an unbeaten century. The second day of the match at the Gabba has provided exciting updates. Follow along for more details from our writers.",
    "published": "2025-12-05T09:21:44Z"
  },
  {
    "title": "World Cup draw buildup, Premier League news and more – football live",
    "url": "https://www.theguardian.com/football/live/2025/dec/05/world-cup-draw-buildup-premier-league-news-and-more-football-live",
    "image": "https://media.guim.co.uk/473ee90305d08565f89b25ac6ec710162b088dc6/195_0_3388_2711/500.jpg",
    "summary": "England and Scotland prepare for an eventful weekend as they await news on their World Cup draw. Writers will provide updates and insights on the teams' upcoming challenges. Stay tuned for the latest developments as the tournament approaches.",
    "published": "2025-12-05T09:20:10Z"
  },
  {
    "title": "Putin-Modi summit in India amid US trade pressure – latest updates",
    "url": "https://www.theguardian.com/world/live/2025/dec/05/vladimir-putin-narendra-modi-russia-india-us-ukraine-trade-latest-news-updates",
    "image": "https://media.guim.co.uk/b3d1c7955d90e0cc08d2d69859f8e9bed4d624fd/357_0_2953_2362/500.jpg",
    "summary": "Two leaders are set to engage in defense and trade discussions on Friday amid the ongoing Ukraine conflict. The U.S. has imposed tariffs on India due to its sustained purchases of Russian oil. These negotiations come at a time of heightened tension regarding international energy trade.",
    "published": "2025-12-05T09:20:07Z"
  },
  {
    "title": "UK house prices stagnated in November; Ocado to get $350m after robotic warehouse cancellations – business live",
    "url": "https://www.theguardian.com/business/live/2025/dec/05/uk-house-prices-affordability-stock-markets-us-inflation-ftse-pound-business-live-news-updates",
    "image": "https://media.guim.co.uk/8a070a72fe3657ee3cd70b98768abc5e984f451c/248_0_3743_2995/500.jpg",
    "summary": "Halifax reports that housing affordability has improved, reaching its best level since late 2015. This change is attributed to a slowdown in price growth. The news reflects a more favorable market for potential homebuyers.",
    "published": "2025-12-05T09:01:55Z"
  },
  {
    "title": "Laura Cannell: Brightly Shone the Moon review | Jude Rogers' folk album of the month",
    "url": "https://www.theguardian.com/music/2025/dec/05/laura-cannell-brightly-shone-the-moon-review-bleakness-and-beauty-in-a-haunting-carol-collection",
    "image": "https://media.guim.co.uk/4acf3fd2ace9751ac86d0c467a3d360a6c6c53cb/0_0_3867_3091/500.jpg",
    "summary": "The violinist embarks on a deep and introspective journey through holiday music, offering a unique and somber interpretation of traditional Christmas songs. Her latest work delves into the darker emotions associated with the season, reshaping familiar melodies. This fresh twist aims to evoke a deeper reflection on the themes of joy and sorrow during the yuletide season.",
    "published": "2025-12-05T09:00:44Z"
  }
]