[
  {
    "title": "Australia news live: Ley challenges Albanese over Trump meeting; storm warning for Sydney",
    "url": "https://www.theguardian.com/australia-news/live/2025/oct/17/australia-news-live-sussan-ley-anthony-albanese-trump-meeting-foi-climate-laws-ntwnfb",
    "image": "https://media.guim.co.uk/99064e784e22d4b81763d913748a54062a6e2c0a/0_0_4913_3931/500.jpg",
    "summary": "Please provide the specific news article or details you'd like summarized, and I'd be happy to help!",
    "published": "2025-10-16T23:15:34Z"
  },
  {
    "title": "John Bolton says ‘I have become the latest target’ after indictment on federal charges – live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/16/trump-latest-shutdown-vote-jd-vance-republicans-democrats",
    "image": "https://media.guim.co.uk/92fa2697697fb0e465adab04e4c979b8e74ae568/375_0_3455_2764/500.jpg",
    "summary": "A former national security adviser has been charged with mishandling classified information and is now accusing the president of \"abuse of power.\" This allegation adds a political dimension to the legal proceedings against the adviser. The situation highlights tensions between national security and political accountability.",
    "published": "2025-10-16T23:12:22Z"
  },
  {
    "title": "Indiana University orders school paper to cease print edition and fires director of student media",
    "url": "https://www.theguardian.com/us-news/2025/oct/16/indiana-university-school-paper",
    "image": "https://media.guim.co.uk/1f8bce05a03c92aabccc3a21e478ecf518909baf/615_0_6146_4919/500.jpg",
    "summary": "Editors at the Indiana Daily Student claim that the university administration's attempts to control news content constitute censorship. They argue that these actions undermine journalistic independence and hinder the publication's ability to report freely. The controversy has sparked debate over press freedom within the institution.",
    "published": "2025-10-16T23:05:17Z"
  },
  {
    "title": "Launch of veteran card will be used to test UK government’s digital ID scheme",
    "url": "https://www.theguardian.com/technology/2025/oct/17/launch-of-veteran-card-will-be-used-to-test-uk-governments-digital-id-scheme",
    "image": "https://media.guim.co.uk/7391fbf864eb4aeb3abf730b30f0f4a6d2c63c31/1060_0_3571_2858/500.jpg",
    "summary": "Ministers are launching a scheme aimed at 1.8 million people to demonstrate the effectiveness of technology. The initiative is designed to alleviate privacy and security concerns surrounding its implementation. By showcasing its benefits, they aim to build public trust in technological solutions.",
    "published": "2025-10-16T23:01:55Z"
  },
  {
    "title": "Banks need stricter controls to prevent romance fraud, says City regulator",
    "url": "https://www.theguardian.com/technology/2025/oct/17/banks-need-stricter-controls-to-prevent-romance-says-city-regulator",
    "image": "https://media.guim.co.uk/24caabe275f63d95a04c05e01a388c36e2a37888/0_0_2058_1648/500.jpg",
    "summary": "The FCA highlights a study indicating that warning signs of victimization are frequently overlooked. It emphasizes the need for enhanced monitoring systems to better identify such risks. This call aims to strengthen protections for vulnerable individuals.",
    "published": "2025-10-16T23:01:55Z"
  }
]