[
  {
    "title": "Australia news live: new NSW Liberals leader says she wants to stop talking about net zero and be ‘a chippy’s best friend’",
    "url": "https://www.theguardian.com/australia-news/live/2025/nov/21/australia-news-live-mark-dreyfus-republic-anthony-albanese-g20-south-africa-eu-trade-deal-nt-cyclone-darwin-airlines-powerbank-ban-nsw-politics-leadership-kellie-sloane-ntwnfb",
    "summary": "I'm sorry, but I need more context or details about the news you want me to summarize. Please provide the information or the main points of the news article.",
    "published": "2025-11-21T01:38:51Z"
  },
  {
    "title": "Australia v England: Ashes first Test, day one – live",
    "url": "https://www.theguardian.com/sport/live/2025/nov/21/australia-vs-england-live-ashes-first-1st-test-day-one-aus-v-eng-cricket-scores-updates-perth",
    "image": "https://media.guim.co.uk/43986f5eccce67be0a64d4d57219725537b2c3d4/0_0_4514_3613/500.jpg",
    "summary": "The highly anticipated series has officially commenced at Perth Stadium, bringing excitement to fans and players alike. Live updates and over-by-over reports will keep readers informed throughout the matches. Join our writers for all the latest developments and insights.",
    "published": "2025-11-21T01:38:43Z"
  },
  {
    "title": "White House walks back Trump’s suggestion of executing Democrats, stands by ‘piggy’ insult to reporter– live",
    "url": "https://www.theguardian.com/us-news/live/2025/nov/20/donald-trump-jeffrey-epstein-justice-department-zohran-mamdani-news-updates-us-politics-live",
    "image": "https://media.guim.co.uk/eecfa7a872f6f6a6ff714741323b49b3ae79322f/327_0_2350_1880/500.jpg",
    "summary": "Karoline Leavitt clarified that Trump does not advocate for executing Democrats, despite his recent social media post implying that some behaviors might warrant such a punishment. The statement came after Trump suggested that Democrats' actions could be \"punishable by DEATH.\" Leavitt aimed to clarify the former president's intentions and distancing from extreme interpretations of his words.",
    "published": "2025-11-21T01:37:32Z"
  },
  {
    "title": "Wieambilla police shooting: coroner delivers findings into Train family killings of three people on remote Queensland property",
    "url": "https://www.theguardian.com/australia-news/2025/nov/21/wieambilla-qld-police-shooting-inquest-coroner-report-findings-queensland-ntwnfb",
    "image": "https://media.guim.co.uk/8179ba7342b1ae02ad840d1e7f18a099cb008747/0_0_2500_2000/500.jpg",
    "summary": "A coroner's report has been released following a five-day inquest into the deaths of Rachel McCrow, Matthew Arnold, and Alan Dare. The inquest aimed to investigate the circumstances surrounding their tragic deaths. Details from the report may provide insights into the events leading up to the fatalities.",
    "published": "2025-11-21T01:33:24Z"
  },
  {
    "title": "Cop30: dozens of countries threaten to block resolution unless it contains roadmap to fossil fuel phase-out",
    "url": "https://www.theguardian.com/environment/2025/nov/21/cop30-countries-threaten-block-resolution-unless-roadmap-to-fossil-fuel-phase-out",
    "image": "https://media.guim.co.uk/64c6ec5628a7f435277686d34ef6f06b868226a2/682_0_4066_3253/500.jpg",
    "summary": "Brazil was reportedly set to abandon its roadmap for transitioning away from fossil fuels due to pushback from petroleum-producing nations. This decision has raised concerns about the country's commitment to environmental sustainability. The move reflects the complex dynamics facing countries balancing fossil fuel interests with climate commitments.",
    "published": "2025-11-21T01:26:29Z"
  }
]