[
  {
    "title": "British Asian families urged to share stories of ‘greatest generation’ who fought for Britain",
    "url": "https://www.theguardian.com/uk-news/2025/nov/09/british-asian-families-share-stories-greatest-generation-fought-for-britain",
    "image": "https://media.guim.co.uk/2b3c66bcbe28ee852575f5511386b2e6d3042084/500_0_5000_4000/500.jpg",
    "summary": "A survey reveals that half of the UK public is unaware of the significant contributions made by 2.5 million British Asian members of the armed forces during World War II. This lack of awareness highlights the need for greater education on the diversity of those who served. Efforts are being made to raise awareness and honor these contributions.",
    "published": "2025-11-09T07:00:27Z"
  },
  {
    "title": "The 26 best UK Christmas gifts for 13-year-olds – chosen by 13-year-olds",
    "url": "https://www.theguardian.com/thefilter/2025/nov/09/best-gifts-13-year-olds-uk",
    "image": "https://media.guim.co.uk/c5772b6c1390348939cd2465fd4d2705718d1933/10_0_3980_3182/500.jpg",
    "summary": "Teens shared their festive wishlists featuring a variety of popular items, including Jellycats, water bottles, skincare products, and guitars. This insight aims to help gift-givers avoid guesswork during the holiday season. The diverse range of requests reflects current trends and interests among young people.",
    "published": "2025-11-09T07:00:26Z"
  },
  {
    "title": " ‘They treat men like vending machines’: Inside the hidden world of social media sperm selling",
    "url": "https://www.theguardian.com/science/2025/nov/09/sperm-selling-donation-social-media-facebook-they-treat-men-like-vending-machines",
    "image": "https://media.guim.co.uk/259686b387e57513e364458ce05d439d0fd5ec28/421_0_4211_3369/500.jpg",
    "summary": "Many individuals seeking parenthood turn to online sperm donor groups as a potential solution. However, these platforms can be complex and lack regulation, leading to various challenges. The experience can be both hopeful and daunting for those navigating this route.",
    "published": "2025-11-09T07:00:25Z"
  },
  {
    "title": "Continental thrift: five of the best cities in Europe for vintage shopping",
    "url": "https://www.theguardian.com/travel/2025/nov/09/continental-thrift-five-of-the-best-cities-in-europe-for-vintage-shopping",
    "image": "https://media.guim.co.uk/37fd585a2c318ed447e0c909fe55951cabfcc787/602_0_6057_4847/500.jpg",
    "summary": "A vintage shopping expert shares her top destinations for finding preloved treasures, highlighting flea markets in Berlin and thrift stores in Athens. She emphasizes the charm of unique souvenirs available in these locations. The guide celebrates the growing trend of sustainable shopping through secondhand items.",
    "published": "2025-11-09T07:00:25Z"
  },
  {
    "title": "‘Black Fraud Day’: shoppers warned over Black Friday scams",
    "url": "https://www.theguardian.com/money/2025/nov/09/black-friday-scams-ai-fake-sites",
    "image": "https://media.guim.co.uk/9aee4892a99081160316f93c639545d9bfe06260/861_0_6827_5464/500.jpg",
    "summary": "Experts warn against unrealistic pricing and requests for bank transfers due to the rise of AI, which complicates the ability to distinguish between genuine and fraudulent websites. They emphasize the importance of caution when engaging in online transactions. Increased awareness can help protect consumers from scams.",
    "published": "2025-11-09T07:00:24Z"
  }
]