[
  {
    "title": "Charlie Kirk apparently shot during debate at Utah university",
    "url": "https://www.theguardian.com/us-news/2025/sep/10/charlie-kirk-shot-utah",
    "image": "https://media.guim.co.uk/be80fe1494d150130f0aac1a0d7c4e385e3ce729/263_0_2625_2100/500.jpg",
    "summary": "The executive director of Turning Point USA, a rightwing organization, was seen in social media videos being struck during an event. The incident has sparked discussions online and raised concerns about safety at political gatherings. Further details about the situation and its context are still emerging.",
    "published": "2025-09-10T18:45:51Z"
  },
  {
    "title": "England v South Africa: first men’s T20 international, start delayed by rain – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/10/england-v-south-africa-first-mens-t20-international-live",
    "image": "https://media.guim.co.uk/dbf6319e221ec37af9651e687eec6484b3445440/542_0_5000_4000/500.jpg",
    "summary": "Tim de Lisle will provide comprehensive over-by-over coverage of the inaugural men's T20 match between England and South Africa. The match takes place in Cardiff. Fans can follow the action closely through his updates.",
    "published": "2025-09-10T18:45:18Z"
  },
  {
    "title": "Kamala Harris calls Joe Biden’s choice to run for 2024 re-election ‘reckless’ in new book – live updates",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/10/donald-trump-jeffrey-epstein-tariffs-immigration-crime-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/89519a6037be3e1c43ea0cd9a4652037d193a748/667_0_3333_2667/500.jpg",
    "summary": "Former Vice President criticizes President Biden in a new book excerpt, suggesting that his decision to run for re-election should not be driven by personal ego. The critique implies that such a significant choice should involve broader considerations rather than individual desires. The comments reflect ongoing tensions within the Democratic Party regarding leadership and election strategy.",
    "published": "2025-09-10T18:44:09Z"
  },
  {
    "title": "Snapchat allows drug dealers to operate openly on platform, finds Danish study",
    "url": "https://www.theguardian.com/technology/2025/sep/10/snapchat-allowing-drug-dealers-to-operate-openly-on-platform-says-danish-research-body",
    "image": "https://media.guim.co.uk/50353a072869155fdfd1d4b1b9b57f3e0493f697/816_0_4080_3264/500.jpg",
    "summary": "A social media platform faces criticism for its inability to effectively filter out explicit usernames like ‘coke’, ‘weed’, and ‘molly’. Critics argue that the presence of such names undermines community standards and safety. The platform's failure to address these issues raises concerns about its content moderation policies.",
    "published": "2025-09-10T18:33:29Z"
  },
  {
    "title": "Poland dismisses Russia’s claim drone incursion was unintentional as Ukraine calls for joint European air defence system – live",
    "url": "https://www.theguardian.com/world/live/2025/sep/10/poland-pm-condemns-repeated-violation-of-airspace-amid-russian-attack-on-ukraine-follow-live",
    "image": "https://media.guim.co.uk/af9ce4f2b1a08165cd41b8e5723aeb0ebfaa1e06/211_0_2108_1686/500.jpg",
    "summary": "Poland's deputy PM asserted that Russian drones intentionally targeted Poland rather than straying off course. Ukrainian President Zelenskyy emphasized the urgent need for Europe to establish an effective air defense system. This highlights escalating concerns over regional security amidst ongoing tensions.",
    "published": "2025-09-10T18:32:58Z"
  }
]