[
  {
    "title": "Jaron Ennis dazzles in 154lb debut with one-round destruction of Uisma Lima",
    "url": "https://www.theguardian.com/sport/2025/oct/12/jaron-ennis-knockout-uisma-lima-154lb-debut-vergil-ortiz",
    "image": "https://media.guim.co.uk/18c0238a4f87701810e88bbe383d5b8173e96049/367_0_3672_2938/500.jpg",
    "summary": "Jaron \"Boots\" Ennis scored a quick victory over Uisma Lima in less than two minutes during his debut at 154 pounds. This impressive performance positions him for a highly anticipated matchup against Vergil Ortiz Jr. in 2026. Ennis showcased his skills, signaling a strong start in the new weight class.",
    "published": "2025-10-12T06:05:55Z"
  },
  {
    "title": "Splendid isolation: 10 beautifully remote getaways in the UK",
    "url": "https://www.theguardian.com/travel/2025/oct/12/10-beautiful-remote-getaways-uk-scotland-cottages-cabins",
    "image": "https://media.guim.co.uk/b1896e04bd3fa75778fbc6b6153bae40ebaa4461/3767_0_4152_3324/500.jpg",
    "summary": "A selection of unique accommodations, including a lighthouse on a Scottish island and a serene lakeside cabin in Cornwall, offers tranquil retreats. These secluded locations promise to rejuvenate and spark creativity. Ideal for escaping the hustle and bustle, they provide a peaceful getaway amidst nature.",
    "published": "2025-10-12T06:00:44Z"
  },
  {
    "title": "‘£850 to skip the queue’: how scammers are exploiting driving test delays",
    "url": "https://www.theguardian.com/money/2025/oct/12/scammers-exploiting-driving-test-delays-great-britain",
    "image": "https://media.guim.co.uk/78240be03d34c73105d3b03ee4fabddc044d80f5/458_0_4557_3648/500.jpg",
    "summary": "Criminals are promoting schemes that allegedly allow individuals to obtain licenses without taking required exams. Engaging in these activities poses significant risks, including potential identity theft and imprisonment. Authorities warn against such fraudulent practices to protect public safety.",
    "published": "2025-10-12T06:00:44Z"
  },
  {
    "title": "‘Brummies united against racism’: poster campaign takes on the far right",
    "url": "https://www.theguardian.com/uk-news/2025/oct/12/brummies-united-against-racism-birmingham-poster-campaign-takes-on-the-far-right",
    "image": "https://media.guim.co.uk/e306031449b36a3a35df4c311a007b7c99b75fef/610_0_5581_4463/500.jpg",
    "summary": "In Birmingham, a strong spirit of neighborly solidarity is emerging in response to incidents of racist intimidation. Community members are uniting to support one another and promote inclusivity. This collective effort aims to combat hate and foster a welcoming environment for all.",
    "published": "2025-10-12T06:00:44Z"
  },
  {
    "title": "TV tonight: Sally Wainwright’s furious drama about a menopausal punk band",
    "url": "https://www.theguardian.com/tv-and-radio/2025/oct/12/tv-tonight-sally-wainwrights-furious-drama-about-a-menopausal-punk-band",
    "image": "https://media.guim.co.uk/cb5f0c51675a033e391803278861807bb5f8ce61/314_0_3971_3177/500.jpg",
    "summary": "Joanna Scanlan and Lorraine Ashborne star in the energetic new series \"Riot Women.\" Additionally, a new show combines elements of \"Fargo\" and \"The Walking Dead\" for a unique viewing experience. Tune in tonight for these exciting premieres.",
    "published": "2025-10-12T05:20:43Z"
  }
]