[
  {
    "title": "Australia news live: energy rebates will not be extended, Chalmers says; SA Liberals confirm new leader",
    "url": "https://www.theguardian.com/australia-news/live/2025/dec/08/australia-news-live-politics-coalition-housing-policy-liberal-labor-vic-nsw-qld-tasmania-weather-bushfires-economy-education-health-social-media-cost-of-living",
    "image": "https://media.guim.co.uk/f4d1dd78c3d9d3b0eb7c088b220c2e2efa2dc744/1024_0_5218_4174/500.jpg",
    "summary": "Could you please provide the news article or content you'd like summarized?",
    "published": "2025-12-08T04:16:01Z"
  },
  {
    "title": "Japan PM vows ‘resolute’ response after Chinese aircraft accused of locking radar on to Japanese fighter jets",
    "url": "https://www.theguardian.com/world/2025/dec/08/japan-china-radar-fighter-jets-claims",
    "image": "https://media.guim.co.uk/21f2f421f86223f0f0cee71b02a148119f86164d/0_350_4978_3982/500.jpg",
    "summary": "China's ambassador to Japan has been summoned following an incident where Chinese J-15 fighter jets reportedly trained their radar on Japanese F-15 aircraft twice over the weekend. The event reflects ongoing tensions between the two nations regarding airspace security. Diplomatic discussions are expected as Japan seeks clarification on the matter.",
    "published": "2025-12-08T04:14:44Z"
  },
  {
    "title": "Trump says Zelenskyy ‘isn’t ready’ to accept US peace deal",
    "url": "https://www.theguardian.com/world/2025/dec/08/ukraine-peace-deal-trump-zelenskyy-not-ready",
    "image": "https://media.guim.co.uk/900e507744971e6c027b5272faa50f6c6fc89509/500_0_5000_4000/500.jpg",
    "summary": "Ukraine's president is scheduled to meet with the leaders of the UK, France, and Germany in London on Monday. The meeting aims to discuss ongoing support for Ukraine amid the conflict with Russia. This gathering underscores the continued solidarity among European nations in addressing the situation in Ukraine.",
    "published": "2025-12-08T03:30:36Z"
  },
  {
    "title": "Thailand launches airstrikes along disputed border with Cambodia as tensions flare",
    "url": "https://www.theguardian.com/world/2025/dec/08/thailand-airstrikes-disputed-border-cambodia",
    "image": "https://media.guim.co.uk/dbb5372b8464661cbd113290b54f9bf50bc25dca/852_0_4673_3741/500.jpg",
    "summary": "Tensions have heightened following the death of a Thai soldier and injuries to four others in recent clashes. This escalation occurs over a month after a ceasefire agreement was facilitated by Donald Trump. The situation is raising concerns about the stability of the region.",
    "published": "2025-12-08T03:28:57Z"
  },
  {
    "title": "UN report sounds alarm over Māori rights in New Zealand",
    "url": "https://www.theguardian.com/world/2025/dec/08/un-cerd-report-maori-rights-new-zealand",
    "image": "https://media.guim.co.uk/fcef503c94ff05044f0c17b57111cada04d00184/542_0_5418_4334/500.jpg",
    "summary": "A UN committee expressed concerns about the government's decision to abolish the Māori Health Authority and implement funding cuts for Indigenous services. This move has raised alarms regarding the potential negative impact on the health and well-being of Indigenous communities. The committee is urging the government to prioritize and protect Indigenous health rights.",
    "published": "2025-12-08T02:10:32Z"
  }
]