[
  {
    "title": "Charlie Kirk shooting: Trump ally in critical condition after being shot at Utah university event – latest updates",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/10/donald-trump-jeffrey-epstein-tariffs-immigration-crime-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/b6a2cf59a7aa27d10492ba0fe8003b986e520d0f/197_0_3333_2667/500.jpg",
    "summary": "A rightwing activist was shot at midday local time, prompting an investigation. The university has confirmed that the suspect is currently not in custody. Authorities are working to track down the shooter.",
    "published": "2025-09-10T20:32:10Z"
  },
  {
    "title": "England v South Africa: first men’s T20 international – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/10/england-v-south-africa-first-mens-t20-international-live",
    "image": "https://media.guim.co.uk/a43e7e47334dc03c324da7b080ae723d106f011a/214_0_3021_2416/500.jpg",
    "summary": "Tim de Lisle will provide live over-by-over coverage of the inaugural men's T20 match between England and South Africa. The event takes place in Cardiff. Fans can tune in for detailed commentary on the action.",
    "published": "2025-09-10T20:28:58Z"
  },
  {
    "title": "England fans’ chants cast Keir Starmer as first prime minister to become The Enemy | Barney Ronay",
    "url": "https://www.theguardian.com/football/2025/sep/10/england-fans-chants-cast-keir-starmer-as-first-prime-minister-to-become-the-enemy",
    "image": "https://media.guim.co.uk/3fb4dcdb5b390a39956090403247e2b21148292e/634_0_6343_5074/500.jpg",
    "summary": "British prime ministers have traditionally maintained a low profile in football culture, particularly on the terraces. However, recent developments indicate a shift in this trend, with more engagement observed. The article suggests that football often reflects broader societal and political narratives.",
    "published": "2025-09-10T20:17:47Z"
  },
  {
    "title": "Charlie Kirk shooting – what we know so far",
    "url": "https://www.theguardian.com/us-news/2025/sep/10/charlie-kirk-shooting-what-we-know",
    "image": "https://media.guim.co.uk/6178eba4d5c366b81f6a9fc45730fcd80313ef28/55_0_3333_2667/500.jpg",
    "summary": "The executive director of Turning Point USA has been reported in critical condition after being shot during an event at Utah Valley University. The incident has raised concerns about safety at political gatherings. Authorities are investigating the shooting.",
    "published": "2025-09-10T20:12:41Z"
  },
  {
    "title": "Zohran Mamdani says Fifa putting profit before fans with World Cup dynamic pricing",
    "url": "https://www.theguardian.com/football/2025/sep/10/zohran-mamdani-interview-fifa-petition-dynamic-pricing-football-weekly",
    "image": "https://media.guim.co.uk/a576ee91fd34e55bd517a32ddbfeb0462f9e2612/983_0_5000_4000/500.jpg",
    "summary": "In an exclusive interview, a New York City mayoral candidate expressed his passion for Arsenal and criticized dynamic pricing. He also shared his thoughts on how he would react if he encountered Donald Trump at the World Cup final. The candidate's personal views highlight his interests and potential political stances.",
    "published": "2025-09-10T20:05:38Z"
  }
]