[
  {
    "title": "Charlie Kirk in his own words: ‘prowling Blacks’ and ‘the great replacement strategy’",
    "url": "https://www.theguardian.com/us-news/2025/sep/11/charlie-kirk-quotes-beliefs",
    "image": "https://media.guim.co.uk/87a3bcf3c577c88f5589151ef38854aa1672ffd4/278_0_3001_2400/500.jpg",
    "summary": "A far-right commentator expressed his strong reactionary views on current events, leaving little room for ambiguity. His remarks reflected a definitive stance on controversial issues. The commentary sparked discussions surrounding his polarizing opinions.",
    "published": "2025-09-11T19:16:01Z"
  },
  {
    "title": "Paramount Skydance reportedly preparing takeover bid for Warner Bros Discovery ",
    "url": "https://www.theguardian.com/business/2025/sep/11/paramount-skydance-warner-bros-discovery",
    "image": "https://media.guim.co.uk/8b36b77046b491d8894ad5fad77946f2b6f93fcc/0_0_2916_2333/500.jpg",
    "summary": "A media conglomerate is reportedly preparing a majority cash offer for Warner Bros. Discovery (WBD), supported by the wealthy Ellison family. This move indicates significant financial backing and interest in acquiring the company. The bid highlights ongoing consolidation trends in the media industry.",
    "published": "2025-09-11T19:13:21Z"
  },
  {
    "title": "Charlie Kirk shooting: FBI says weapon found as hunt for suspect continues",
    "url": "https://www.theguardian.com/us-news/2025/sep/11/charlie-kirk-shooting-police-search-for-suspect-amid-condemnation-of-targeted-killing",
    "image": "https://media.guim.co.uk/3726e22b0eda208b058475b02739ddaf060188af/155_0_4870_3895/500.jpg",
    "summary": "A rifle was discovered in a wooded area linked to a shooter who fled the scene. Former President Trump announced plans to posthumously award the Medal of Freedom to Kirk. The situation underscores the ongoing discussions around gun violence and recognition of contributions in society.",
    "published": "2025-09-11T19:11:29Z"
  },
  {
    "title": "What did Jair Bolsonaro’s trial reveal about the attempted coup?",
    "url": "https://www.theguardian.com/world/2025/sep/11/jair-bolsonaro-conviction-attempted-coup-what-happens-next-explainer",
    "image": "https://media.guim.co.uk/c8e534141dbfcd6ba973c2ca4b951412f3c2e085/1706_767_4675_3740/500.jpg",
    "summary": "Brazil's far-right ex-president has been implicated in leading a criminal organization aimed at maintaining his hold on power. Investigations revealed efforts to undermine democratic processes. This finding raises serious concerns about political integrity in the country.",
    "published": "2025-09-11T19:04:05Z"
  },
  {
    "title": "Brazil’s supreme court finds Bolsonaro guilty of plotting military coup",
    "url": "https://www.theguardian.com/world/2025/sep/11/brazil-supreme-court-bolsonaro-guilty-coup",
    "image": "https://media.guim.co.uk/08aea7c1f84d4169ef1d69dcacab213830351347/953_0_4305_3444/500.jpg",
    "summary": "A former president is facing a potential multi-decade prison sentence for attempting to unlawfully retain power following his defeat in the 2022 election. The charges stem from actions taken during and after the election process. This case has significant implications for political accountability and the rule of law.",
    "published": "2025-09-11T18:57:57Z"
  }
]