[
  {
    "title": "Home secretary unveils plan to create the ‘most controlled and selective’ system in Europe for permanent migration – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/nov/20/covid-inquiry-report-pandemic-labour-conservatives-andy-burnham-uk-politics-live-news",
    "image": "https://media.guim.co.uk/93f0bda1c3914f686e9d6d03af5b3ebc739df1aa/757_0_4653_3722/500.jpg",
    "summary": "Shabana Mahmood announced a proposal for legal migration reform that includes a 20-year waiting period for migrants on benefits to achieve permanent residency. This initiative aims to establish clearer pathways for migrants while addressing welfare concerns. The plan is part of broader efforts to reshape the UK’s immigration system.",
    "published": "2025-11-20T13:28:04Z"
  },
  {
    "title": "World Cup 2026 playoffs draw: Wales v Bosnia and Herzegovina, Czechia v Republic of Ireland, Italy v Northern Ireland – as it happened",
    "url": "https://www.theguardian.com/football/live/2025/nov/20/world-cup-2026-qualifying-playoffs-draw-live",
    "image": "https://media.guim.co.uk/55939a2229c9f0b524bb7f6053626e1db93063d8/1069_0_4686_3748/500.jpg",
    "summary": "Wales and Northern Ireland will compete in the same playoff route for the World Cup finals. Meanwhile, the Republic of Ireland will begin their campaign in Prague. This setup creates an exciting dynamic for the teams vying for a spot in the tournament.",
    "published": "2025-11-20T13:27:36Z"
  },
  {
    "title": "Justice department has 30 days to release all Epstein files after Trump signs bill – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/nov/20/donald-trump-jeffrey-epstein-justice-department-zohran-mamdani-news-updates-us-politics-live",
    "image": "https://media.guim.co.uk/460a2faeeb7cd06a361c8b8256c2d0bfeb055895/1081_0_5421_4337/500.jpg",
    "summary": "Former President Trump criticized Democrats while attempting to control the narrative regarding his connections to the late sex offender Jeffrey Epstein. He aimed to shift attention and deflect scrutiny from any implications of those associations. Trump's comments reflect his broader strategy to rally support amid ongoing controversies.",
    "published": "2025-11-20T13:27:18Z"
  },
  {
    "title": "Joy Crookes says UK and Ireland in ‘dark times’ amid rise of far-right politics",
    "url": "https://www.theguardian.com/music/2025/nov/20/joy-crookes-says-uk-and-ireland-in-dark-times-amid-rise-of-far-right-politics",
    "image": "https://media.guim.co.uk/042743eacba377e1ae0507ed3272b03e031b243a/0_7_3748_2999/500.jpg",
    "summary": "A musician expressed discomfort with the display of national flags during recent visits to Luton and Dublin, stating that it does not contribute to a sense of safety for him. He emphasized the negative feelings associated with the visibility of these symbols. The comment reflects broader concerns about nationalism and its impact on individual well-being in public spaces.",
    "published": "2025-11-20T13:25:58Z"
  },
  {
    "title": "UK government insists it is ‘taking time to get this right’ on single-sex spaces",
    "url": "https://www.theguardian.com/politics/2025/nov/20/uk-government-taking-time-guidance-single-sex-spaces",
    "image": "https://media.guim.co.uk/d0d8fc5bf540efa762cfb18b237aae5ac1654298/408_0_4080_3264/500.jpg",
    "summary": "Labour faces accusations of delaying new guidelines amidst concerns over backlash following a leak from the Equality and Human Rights Commission (EHRC). The leaked guidance suggests that trans individuals may be questioned about their gender based on appearance. Critics argue this approach could be harmful and undermine trans rights.",
    "published": "2025-11-20T13:25:55Z"
  }
]