[
  {
    "title": "Australia news live: SA police wind up search for missing four-year-old; US politicians ‘evangelical’ about Aukus, Conroy says",
    "url": "https://www.theguardian.com/australia-news/live/2025/oct/17/australia-news-live-sussan-ley-anthony-albanese-trump-meeting-foi-climate-laws-ntwnfb",
    "image": "https://media.guim.co.uk/6b9c68751e881eba628133b2e7aa92fd2fa0d033/224_68_1191_953/500.jpg",
    "summary": "It seems like you're referring to a news event but haven't provided specific details. Could you please share more context or the key points of the news article you'd like summarized?",
    "published": "2025-10-17T04:21:04Z"
  },
  {
    "title": "Blue plaque to be unveiled at home of Thomas the Tank Engine creator ",
    "url": "https://www.theguardian.com/culture/2025/oct/17/blue-plaque-thomas-the-tank-engine-creator-rev-w-awdry-home",
    "image": "https://media.guim.co.uk/662d9aacb73b9212a339a075c4452148bc18d467/217_0_2941_2353/500.jpg",
    "summary": "A ceremony was held to celebrate the 80th anniversary of Rev W. Awdry's first book, which introduced the beloved children's character Thomas the Tank Engine. The event coincided with the bicentenary of railways, highlighting the historical significance of both the literary and transportation milestones. Attendees commemorated the enduring legacy of Awdry's work in children's literature and railway history.",
    "published": "2025-10-17T04:00:03Z"
  },
  {
    "title": "London developers to be allowed to reduce percentage of affordable homes",
    "url": "https://www.theguardian.com/society/2025/oct/17/developers-higher-subsidies-fewer-affordable-homes-london",
    "image": "https://media.guim.co.uk/a594ae8a90bab1b80a9a34eb9f7b1cca5cd157a8/380_0_4142_3313/500.jpg",
    "summary": "The Housing Secretary and the Mayor of London are collaborating on initiatives to increase housebuilding efforts. However, homelessness charities are expressing their concerns and protesting against these plans. The tension highlights the challenges of addressing both housing supply and homelessness in the capital.",
    "published": "2025-10-17T04:00:03Z"
  },
  {
    "title": "Sam Fender didn’t need his Mercury prize win – but he earned it with his incisive social realism",
    "url": "https://www.theguardian.com/music/2025/oct/17/sam-fender-didnt-need-his-mercury-prize-win-but-he-earned-it-with-his-incisive-social-realism",
    "image": "https://media.guim.co.uk/3a57001eab882a896e297a6f5c74d9a2579c8fbb/641_599_1452_1161/500.jpg",
    "summary": "The article suggests that an award might have been better awarded to a less mainstream album, yet praises Fender's work for its masterful combination of relatable storytelling and anthemic choruses. Despite its previous success, the artistry in Fender's album is recognized as skillfully executed. Ultimately, it raises questions about award criteria and recognition.",
    "published": "2025-10-17T04:00:02Z"
  },
  {
    "title": "Experience: I am the air guitar world champion",
    "url": "https://www.theguardian.com/lifeandstyle/2025/oct/17/experience-i-am-the-air-guitar-world-champion",
    "image": "https://media.guim.co.uk/b85b896eead2e5f0eca5efa148ac1a0e39d90214/4_0_4431_3545/500.jpg",
    "summary": "The performer expressed overwhelming excitement and disbelief after delivering a high-energy, charismatic 60-second performance. They were shocked to hear that they won the competition. The experience left them feeling momentarily lost in the emotion of the moment.",
    "published": "2025-10-17T04:00:01Z"
  }
]