[
  {
    "title": "Trump’s call to freeze Ukraine conflict at current frontlines is ‘good compromise’, says Zelenskyy – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/oct/22/russia-ukraine-war-kyiv-attack-latest-news-updates-europe",
    "image": "https://media.guim.co.uk/63395252dee8a4f36e32b741f950281e7703587b/228_0_2263_1810/500.jpg",
    "summary": "The Ukrainian president made remarks as the scheduled US-Russian summit faced suspension. This situation coincided with renewed attacks on the cities of Kyiv and Kharkiv. The escalating tensions highlight ongoing concerns in the region amidst geopolitical developments.",
    "published": "2025-10-22T13:32:47Z"
  },
  {
    "title": "Australia v England: Women’s Cricket World Cup – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/22/australia-v-england-womens-cricket-world-cup-live",
    "image": "https://media.guim.co.uk/d3d6f57b6372c42709e38a79eedf1430d61fb38a/417_0_4799_3841/500.jpg",
    "summary": "The two unbeaten teams in the competition face off in Indore. Live updates and commentary are being provided by our writers. Stay tuned for the latest information as the match unfolds.",
    "published": "2025-10-22T13:31:37Z"
  },
  {
    "title": "White paper on overhaul of Send provision in England put back to 2026",
    "url": "https://www.theguardian.com/education/2025/oct/22/white-paper-on-overhaul-of-send-provision-in-england-put-back-to-2026",
    "image": "https://media.guim.co.uk/4807a2dc439c2690fcca292e3472b69a98e48a7e/216_0_2534_2029/500.jpg",
    "summary": "The government has delayed plans initially expected this autumn, seeking additional time to garner support for proposed changes. This decision aims to ensure a more robust consensus before moving forward. The delay indicates a cautious approach to policy adjustments.",
    "published": "2025-10-22T13:30:09Z"
  },
  {
    "title": "Gaza ceasefire could lead to more Israeli alliances in Middle East, Vance says at Netanyahu meeting – live",
    "url": "https://www.theguardian.com/world/live/2025/oct/22/israel-gaza-ceasefire-jd-vance-netanyahu-hamas-hostages-middle-east-latest-news-updates",
    "image": "https://media.guim.co.uk/4e3e52f613ff6dfe5e4036fa96bd1ff899e6867b/527_0_4870_3896/500.jpg",
    "summary": "The U.S. Vice President is visiting Israel to hold discussions with the Israeli Prime Minister during a delicate ceasefire period in Gaza. This meeting aims to address ongoing tensions and foster diplomatic efforts in the region. The fragile situation underscores the need for continued dialogue and conflict resolution.",
    "published": "2025-10-22T13:27:57Z"
  },
  {
    "title": "Fresh blow for grooming gangs inquiry ex-police chief pulls out of running to be chair – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/oct/22/grooming-gangs-inquiry-mahmood-starmer-caerphilly-pmqs-latest-news-updates",
    "image": "https://media.guim.co.uk/b77a343099f455e139e12c14276eca05f4d9dc35/0_62_2593_2074/500.jpg",
    "summary": "Victims of grooming gangs have alleged that the government is trying to influence them into expanding a national inquiry. They claim this manipulation undermines their experiences and demands for justice. The allegations raise concerns about the government's commitment to addressing the issue comprehensively.",
    "published": "2025-10-22T13:26:49Z"
  }
]