[
  {
    "title": "Australia news live: Liberal frontbencher backs Hastie on immigration; Mark Latham threatens legal action after police escort him from Randwick racecourse",
    "url": "https://www.theguardian.com/australia-news/live/2025/oct/05/australia-news-live-hecs-student-debt-mark-butler-albanese-labor-melbourne-metro-nsw-qld-sussan-ley-andrew-hastie-coalition-ntwnfb",
    "image": "https://media.guim.co.uk/edd93429bceeeb5ef1316639bfebc83b28479949/658_0_6583_5266/500.jpg",
    "summary": "I'm sorry, but I cannot access live news updates or current events. However, if you provide me with specific news content or a link, I can help summarize it for you!",
    "published": "2025-10-05T03:00:59Z"
  },
  {
    "title": "Hot public holiday expected for Sydney and Brisbane after record rain for parts of NSW and Queensland in September",
    "url": "https://www.theguardian.com/environment/2025/oct/05/hot-public-holiday-expected-for-sydney-and-brisbane-after-record-rain-for-parts-of-nsw-and-queensland-in-september",
    "image": "https://media.guim.co.uk/b7e78d82faa7ec7362cebc66958ecbd520ffe420/0_0_5160_4128/500.jpg",
    "summary": "Warm weather has arrived in New South Wales and Queensland after recent heavy rainfall that set daily records in over a dozen locations. The deluges caused significant impacts across the regions. Residents are now experiencing a shift to milder temperatures following the intense rain.",
    "published": "2025-10-05T02:40:10Z"
  },
  {
    "title": "Trump authorizes national guard deployment to Chicago, White House says, as border patrol there shoots woman",
    "url": "https://www.theguardian.com/us-news/2025/oct/04/woman-shot-border-patrol-chicago",
    "image": "https://media.guim.co.uk/80ed7e704c0cf1b7b7d87183bb93072f59ef6a44/520_0_5200_4160/500.jpg",
    "summary": "Illinois Governor JB Pritzker has criticized the growing aggression towards citizens and residents in the state. He claims that the administration's actions reflect an alarming increase in hostility. Pritzker emphasizes the need to address and counter these aggressive measures.",
    "published": "2025-10-05T02:02:55Z"
  },
  {
    "title": "Rebecca review – Nikki Shiels is magnificent in confused Daphne du Maurier adaptation",
    "url": "https://www.theguardian.com/stage/2025/oct/05/rebecca-melbourne-theatre-company-review-mtc-nikki-shiels-daphne-du-maurier",
    "image": "https://media.guim.co.uk/2ed30e1ac4681e980044a3eff580ab89d32d14f0/136_0_1667_1334/500.jpg",
    "summary": "The Melbourne Theatre Company's production of Anne-Louise Sarks' adaptation of the 1938 novel offers rich and compelling performances. However, certain elements of the production do not fully resonate with the audience. Overall, it presents a mixed response to the classic story.",
    "published": "2025-10-05T01:33:21Z"
  },
  {
    "title": "Quiptic crossword No 1,350",
    "url": "https://www.theguardian.com/crosswords/quiptic/1350",
    "summary": "Quiptic crossword No. 1,350 has been released, offering a collection of clues that challenge solvers with their wit and wordplay. This weekly crossword continues to engage both novice and experienced enthusiasts alike. Participants are encouraged to share their experiences and solutions online.",
    "published": "2025-10-04T23:00:18Z"
  }
]