[
  {
    "title": "Women who miss first breast cancer screening at ‘40% higher risk’ of dying from the disease",
    "url": "https://www.theguardian.com/society/2025/sep/24/women-who-miss-first-breast-cancer-screening-at-40-higher-risk-of-dying-from-the-disease",
    "image": "https://media.guim.co.uk/71512796ecd69e62a6ed5e52cdc2e31cd29b91af/397_0_5000_4000/500.jpg",
    "summary": "A study tracking 500,000 women in Sweden revealed that 32% did not attend their first scheduled mammogram appointment. The findings highlight significant gaps in early breast cancer screening participation. The researchers emphasize the need for strategies to encourage women to attend these crucial health assessments.",
    "published": "2025-09-24T22:30:19Z"
  },
  {
    "title": "News live: Albanese welcomes China’s climate target; Von der Leyen ‘inspired’ by Australia’s social media ban",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/25/australia-news-live-penny-wong-anthony-albanese-climate-crisis-united-nations-donald-trump-turkey-cop-politics-ntwnfb",
    "image": "https://media.guim.co.uk/6fadd7947006346d709346bf9bbcd1775d3a8685/1101_0_6827_5464/500.jpg",
    "summary": "I'm sorry, but I can't provide a summary without specific news content to work from. Please provide the details or main points of the news article you'd like summarized.",
    "published": "2025-09-24T22:30:09Z"
  },
  {
    "title": "Obama says Trump linking paracetamol to autism is ‘violence against the truth’",
    "url": "https://www.theguardian.com/us-news/2025/sep/24/obama-says-trump-linking-paracetamol-to-autism-is-violence-against-the-truth",
    "image": "https://media.guim.co.uk/69aec6cf89772a8bd5ff144071754ba39cb11b26/968_0_6746_5397/500.jpg",
    "summary": "Former President criticized his successor for making claims about the drug Tylenol in the US, arguing that such statements could negatively impact public health. He emphasized that misinformation could harm women's health specifically. The former president's comments highlight the importance of accurate information regarding medication safety.",
    "published": "2025-09-24T22:23:03Z"
  },
  {
    "title": "Officials reportedly identify Dallas Ice facility shooter; DHS corrects death toll down to one person killed – live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/24/donald-trump-jimmy-kimmel-freedom-of-speech-immigration-government-shutdown-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/2a31ae3af7399a58e942cf59ad12d39e233d5ff4/575_0_4583_3667/500.jpg",
    "summary": "Joshua Jahn killed one detainee and injured two others before taking his own life, according to NBC News. In response to the incident, JD Vance attributed the increase in political violence to Democratic policies. The tragic event highlights ongoing concerns about safety and political tensions.",
    "published": "2025-09-24T22:19:51Z"
  },
  {
    "title": "Liverpool Women honour Matt Beard’s legacy with strong League Cup display",
    "url": "https://www.theguardian.com/football/2025/sep/24/womens-league-cup-liverpool-sunderland",
    "image": "https://media.guim.co.uk/3b24c779046bcc4716735bc7e17526194a05295a/544_0_4175_3339/500.jpg",
    "summary": "Beard's family attended an emotional tribute-filled night as his former team faced Sunderland. The event honored Beard's legacy and impact on the team. The atmosphere was heartfelt, celebrating his contributions to the sport.",
    "published": "2025-09-24T21:59:27Z"
  }
]