[
  {
    "title": "‘No alternative’ to continuing invasion, claims Russia, as Trump says Ukraine could regain all land lost – latest updates",
    "url": "https://www.theguardian.com/world/live/2025/sep/24/russia-ukraine-trump-zelenskyy-unga-drones-europe-latest-news-updates",
    "image": "https://media.guim.co.uk/4e0f9c2bbeea7042b22425c5285121f37c6eac71/403_0_5000_4000/500.jpg",
    "summary": "The Kremlin reacted to the US president's expression of support for Ukraine during the UN General Assembly, labeling it as interference in the conflict. Russian officials emphasized that they view the support for Ukraine as a provocation. They reiterated their commitment to defending their interests and sovereignty in the ongoing situation.",
    "published": "2025-09-24T09:34:57Z"
  },
  {
    "title": "Is Tylenol the same as paracetamol, and should you take it in pregnancy? Here’s why experts say Trump should be ignored",
    "url": "https://www.theguardian.com/society/2025/sep/23/is-paracetamol-safe-during-pregnancy-and-does-it-have-links-to-autism",
    "image": "https://media.guim.co.uk/910012506ecaf372acec329cade98ad1707e0447/293_0_2915_2333/500.jpg",
    "summary": "The US president suggested a link between acetaminophen, a common painkiller, and autism. However, scientific research does not support this claim, as studies have found no credible evidence connecting the two. Experts emphasize the need for further investigation while encouraging reliance on established scientific consensus.",
    "published": "2025-09-24T09:34:54Z"
  },
  {
    "title": "Typhoon Ragasa live: Two million people evacuated in southern China after deaths in Taiwan and Philippines",
    "url": "https://www.theguardian.com/world/live/2025/sep/24/typhoon-ragasa-live-china-hong-kong-taiwan-philippines-latest-storm-news-updates",
    "image": "https://media.guim.co.uk/08e97b9bdc83bc743cba156fd6a74772f9b88251/295_0_2700_2160/500.jpg",
    "summary": "Schools and businesses in Hong Kong and Guangdong are closing in anticipation of severe weather conditions, including strong winds and heavy rain. This follows destructive storms that recently impacted Taiwan and the Philippines. Authorities are taking precautions to ensure public safety ahead of the impending storm.",
    "published": "2025-09-24T09:32:33Z"
  },
  {
    "title": "Adelita Grijalva wins her late father’s House seat in Arizona special election",
    "url": "https://www.theguardian.com/us-news/2025/sep/23/adelita-grijalva-house-seat-arizona",
    "image": "https://media.guim.co.uk/4d2a6c31cee187ef26725b2dce7fab96501e6ee7/110_0_2780_2223/500.jpg",
    "summary": "Grijalva has made history as the first Latina elected to Congress from her state. Her victory further reduces the Republican majority in the House. This milestone reflects a growing diversity in political representation.",
    "published": "2025-09-24T09:29:38Z"
  },
  {
    "title": "Nottinghamshire v Warwickshire, Hampshire v Surrey, and more: county cricket – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/24/nottinghamshire-v-warwickshire-hampshire-v-surrey-and-more-county-cricket-live",
    "image": "https://media.guim.co.uk/1c3ee259188aece2ba8ea4d2f159e825ced4c16b/157_0_2250_1800/500.jpg",
    "summary": "Nottinghamshire aims to secure the County Championship title by facing off against Surrey in the season's final round. Tanya Aldred provides updates on the unfolding match. The day one action is crucial for Notts to clinch the championship.",
    "published": "2025-09-24T09:29:15Z"
  }
]