[
  {
    "title": "World Cup qualifiers, WSL updates and football news – matchday live",
    "url": "https://www.theguardian.com/football/live/2025/oct/12/world-cup-qualifiers-wsl-updates-and-football-news-matchday-live",
    "image": "https://media.guim.co.uk/64ce8b500facbcfae5885d211674993017fec172/0_0_5000_4000/500.jpg",
    "summary": "Emillia Hawkins will host a pre-event buildup and discussion ahead of the day's activities. The session aims to set the stage for what’s to come. Attendees can expect insights and engaging commentary.",
    "published": "2025-10-12T10:17:13Z"
  },
  {
    "title": "Ceasefire live: aid trucks enter Gaza as Hamas confirms it will begin releasing Israeli hostages on Monday morning",
    "url": "https://www.theguardian.com/world/live/2025/oct/12/gaza-ceasefire-live-aid-relief-hamas-release-israel-hostages",
    "image": "https://media.guim.co.uk/3705a4625beb65e66edf0eda511b0d3be9181544/0_0_4800_3840/500.jpg",
    "summary": "Israel's military has announced the completion of the first phase of its withdrawal, coinciding with an upcoming peace summit scheduled in Egypt for Monday. This development is part of ongoing efforts to address regional tensions. The withdrawal aims to facilitate diplomatic discussions and promote stability in the area.",
    "published": "2025-10-12T10:16:10Z"
  },
  {
    "title": "Women’s Cricket World Cup: Australia v India – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/12/womens-cricket-world-cup-australia-v-india-live-updates-scores-results-teams-squads-start-time-visakhapatnam",
    "image": "https://media.guim.co.uk/c9690983aad69d3fc7ebcf29b2bba2e049a37b47/232_0_3862_3089/500.jpg",
    "summary": "In Visakhapatnam, a crucial ODI group stage match features two powerhouse teams vying to establish dominance. The clash promises competitive action as both sides look to make a statement. Megan Maurice provides an over-by-over report on the unfolding game.",
    "published": "2025-10-12T10:14:16Z"
  },
  {
    "title": "This is how we do it: ‘I worried about his kinks, but I’m learning to relax and be playful’",
    "url": "https://www.theguardian.com/lifeandstyle/2025/oct/12/this-is-how-we-do-it-worried-kinks-relax-playful",
    "image": "https://media.guim.co.uk/cd08d1628befe9fe381e1eb0fcd4afa0c3c0df0b/0_0_2000_1600/500.jpg",
    "summary": "Viv discovers that Marty's interest in humiliation and BDSM is unfamiliar, as she has had limited sexual experience with only two other partners before him. This revelation introduces a new dynamic to their relationship. The situation highlights the contrast between their sexual preferences and experiences.",
    "published": "2025-10-12T10:00:49Z"
  },
  {
    "title": "‘Using us as political pawns’: federal workers reel over threats of firings and withheld back pay",
    "url": "https://www.theguardian.com/us-news/2025/oct/12/federal-workers-firings-threats",
    "image": "https://media.guim.co.uk/842f57837fcc633d1af29adfa994f25614879363/869_0_4585_3667/500.jpg",
    "summary": "Amid the ongoing US government shutdown, employees are increasingly anxious about their salaries and job security. Concerns are mounting as the shutdown prolongs, leading to uncertainty in various sectors. The situation highlights the broader impact on workers who depend on government funding and services.",
    "published": "2025-10-12T10:00:49Z"
  }
]