[
  {
    "title": "Far-right National Rally snubs French PM’s bid to salvage cabinet amid political turmoil – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/oct/07/france-macron-lecornu-cabinet-europe-live",
    "image": "https://media.guim.co.uk/20597275c468c0c35a7fbc040b8b91d33b0a75a0/329_0_4299_3440/500.jpg",
    "summary": "Jordan Bardella and Marine Le Pen have rejected an invitation from Minister Gérald Darmanin to discuss solutions for the ongoing crisis. Their refusal highlights ongoing tensions and disagreements within French politics. This decision could complicate efforts to address pressing issues in the country.",
    "published": "2025-10-07T11:15:19Z"
  },
  {
    "title": "Jenrick addresses Tory conference after being accused of racism over ‘no white faces’ comments about Birmingham – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/oct/07/conservative-tory-conference-kemi-badenoch-jenrick-starmer-labour-protests-reform-uk-politics-live-news-updates",
    "image": "https://media.guim.co.uk/b7af819c1b9d1b3223a579b1512b4d004defaeb2/1099_0_4973_3978/500.jpg",
    "summary": "The Labour mayor of the West Midlands has criticized Robert Jenrick's remarks, labeling them as racist for emphasizing color to make a negative assertion about Handsworth. The comments drew backlash for perpetuating harmful stereotypes. The mayor's response highlights concerns over the impact of such statements on community perceptions.",
    "published": "2025-10-07T11:14:55Z"
  },
  {
    "title": "England v Bangladesh: Women’s Cricket World Cup – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/07/england-v-bangladesh-womens-cricket-world-cup-live",
    "image": "https://media.guim.co.uk/1b6ccb1246306aac1e9f0d187b0447aafca190dc/327_0_3002_2402/500.jpg",
    "summary": "Nat Sciver-Brunt's team aims to build momentum following a dominant victory against South Africa. Taha Hashim will provide live updates throughout the match. Fans are eager to see how the team continues their strong performance.",
    "published": "2025-10-07T11:13:42Z"
  },
  {
    "title": "Club World Cup has left an injury trail that is damaging football. But will anyone listen? | Jacob Steinberg",
    "url": "https://www.theguardian.com/football/2025/oct/07/club-world-cup-injury-trail-chelsea-arsenal-real-madrid-fifa",
    "image": "https://media.guim.co.uk/9b4646f8e1eb8bccf38fb602d4d9c73528bdbc45/0_0_5000_4000/500.jpg",
    "summary": "The demanding football schedule has led to an increase in games, but this intensity poses a risk that top players may exhaust their energy before the World Cup. Concerns are rising over player fatigue and potential injuries as the season progresses. Balancing competition with player welfare becomes crucial to ensure peak performance during the tournament.",
    "published": "2025-10-07T11:11:05Z"
  },
  {
    "title": "Israelis gather to mark two years since 7 October Hamas attack as Gaza ceasefire talks continue – live",
    "url": "https://www.theguardian.com/world/live/2025/oct/07/gaza-ceasefire-peace-talks-israel-hamas-egypt-7-october-anniversary-middle-east-crisis-live-news-updates",
    "image": "https://media.guim.co.uk/88f96cf76ce349adfdc52cdcd4d2cb2f1eb2e7e4/1108_250_6296_5037/500.jpg",
    "summary": "Israelis commemorated the second anniversary of a devastating attack by Hamas that resulted in the deaths of 1,200 individuals. The event included memorials and reflections on the ongoing conflict. The anniversary serves as a reminder of the enduring impact of violence in the region.",
    "published": "2025-10-07T11:09:22Z"
  }
]