[
  {
    "title": "Arsenal, Spurs, Man City and Newcastle through to Carabao Cup fourth round – follow the draw live",
    "url": "https://www.theguardian.com/football/live/2025/sep/24/port-vale-v-arsenal-huddersfield-v-manchester-city-and-more-carabao-cup-live",
    "image": "https://media.guim.co.uk/50b431438a08ff9bafffb24475c8720195a54947/70_0_2290_1833/500.jpg",
    "summary": "Scott Murray will provide updates on the League Cup third round action taking place on Wednesday. Fans can tune in for the latest developments and highlights from the matches. Stay informed on the outcomes and key moments of this round in the tournament.",
    "published": "2025-09-24T21:27:00Z"
  },
  {
    "title": "Officials reportedly identify Dallas Ice facility shooter; DHS corrects death toll down to one person killed – live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/24/donald-trump-jimmy-kimmel-freedom-of-speech-immigration-government-shutdown-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/2a31ae3af7399a58e942cf59ad12d39e233d5ff4/575_0_4583_3667/500.jpg",
    "summary": "Joshua Jahn was involved in a violent incident where he killed one detainee and severely injured two others before taking his own life. In response, JD Vance attributed the rise in political violence to Democrats. The situation highlights ongoing concerns about safety and political tensions.",
    "published": "2025-09-24T21:26:08Z"
  },
  {
    "title": "Australia news live: Penny Wong tackles Trump climate claims; EU leader ‘inspired’ by Australian social media ban for kids",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/25/australia-news-live-penny-wong-anthony-albanese-climate-crisis-united-nations-donald-trump-turkey-cop-politics-ntwnfb",
    "image": "https://media.guim.co.uk/275ab3ec81b662b0bcc438dafc4916e315785281/261_0_6880_5504/500.jpg",
    "summary": "I apologize, but I need more context or specific information to summarize the news you're referencing. Please provide the details or the main points of the news article.",
    "published": "2025-09-24T21:24:39Z"
  },
  {
    "title": "Joelinton and Osula double up as Newcastle blow away Bradford City",
    "url": "https://www.theguardian.com/football/2025/sep/24/carabao-cup-third-round-newcastle-bradford-match-report",
    "image": "https://media.guim.co.uk/812e1e65d0e926695da5af586847d68b92f366d5/344_0_3435_2748/500.jpg",
    "summary": "Newcastle United secured a 4-1 victory over Bradford in the Carabao Cup. Joelinton and Will Osula were among the goal scorers contributing to the win. This result allows Newcastle to advance in the tournament.",
    "published": "2025-09-24T21:21:18Z"
  },
  {
    "title": "Palhinha spectacular helps Tottenham ease past Doncaster with Frank intent",
    "url": "https://www.theguardian.com/football/2025/sep/24/carabao-cup-third-round-tottenham-doncaster-match-report",
    "image": "https://media.guim.co.uk/9d2831471937cc859c38c74d54f497c490ac1596/224_0_3013_2410/500.jpg",
    "summary": "Thomas Frank emphasized that Tottenham should strive to compete in every tournament, highlighting their commitment to success. In their Carabao Cup opener, Tottenham secured a convincing 3-0 victory over Doncaster. The win showcases their determination to progress in the competition.",
    "published": "2025-09-24T21:17:43Z"
  }
]