[
  {
    "title": "Australia v England: Ashes second Test, day three – live",
    "url": "https://www.theguardian.com/sport/live/2025/dec/06/australia-vs-england-live-ashes-second-2nd-test-day-three-aus-v-eng-cricket-scores-updates-gabba-brisbane",
    "image": "https://media.guim.co.uk/66acac467ffc5c43ba1918ef67aabf6a12b1cc0b/777_0_5000_4000/500.jpg",
    "summary": "The hosts secured a substantial first-innings lead of 177 runs while playing at the Gabba. They then took to bowling under the lights to capitalize on their advantage. Live updates are being provided by the writers covering the match.",
    "published": "2025-12-06T08:24:20Z"
  },
  {
    "title": "World Cup draw reaction with fixture schedule to come – matchday live",
    "url": "https://www.theguardian.com/football/live/2025/dec/06/world-cup-draw-reaction-with-fixture-schedule-to-come-matchday-live",
    "image": "https://media.guim.co.uk/fe360ff2a0ef197b86781b0ef204edfd835dfe0f/961_0_6880_5504/500.jpg",
    "summary": "Stay updated on reactions to the World Cup draw, featuring insights and analyses from our writers. Discover pre-match news and perspectives as teams prepare for the tournament. Don't miss key highlights and expert commentary leading up to the event.",
    "published": "2025-12-06T08:21:36Z"
  },
  {
    "title": "‘They can’t take away your imagination and creativity’: Nazanin Zaghari-Ratcliffe on how sewing helped her in Iran jail",
    "url": "https://www.theguardian.com/fashion/2025/dec/06/nazanin-zaghari-ratcliffe-imperial-war-museum-liberty",
    "image": "https://media.guim.co.uk/d38bfb72b7dd15e756fd6b58f91d621ab87329f4/613_0_6128_4905/500.jpg",
    "summary": "Zaghari-Ratcliffe crafted clothes for her daughter during her imprisonment, symbolizing resilience through creativity. This inspiration has led to a new collaboration between London's Imperial War Museum and Liberty's fabric department. The project highlights creativity as a powerful form of resistance.",
    "published": "2025-12-06T08:01:46Z"
  },
  {
    "title": "BBC showing tennis’s new Battle of the Sexes will just offer up opportunity to belittle women’s sport | Barney Ronay",
    "url": "https://www.theguardian.com/sport/2025/dec/06/bbc-showing-tenniss-new-battle-of-the-sexes-will-just-offer-up-opportunity-to-belittle-womens-sport",
    "image": "https://media.guim.co.uk/4fb2541172f55bbcb72e2a646cd3b4b8a4aa09aa/0_0_5000_3999/500.jpg",
    "summary": "The match between Aryna Sabalenka and Nick Kyrgios highlights a clash between traditional media values and the pervasive toxicity of online discourse. Their encounter illustrates how sports can reflect and amplify the negative aspects of social media interactions. This situation raises concerns about the influence of internet culture on the sports community and its traditional representation.",
    "published": "2025-12-06T08:00:49Z"
  },
  {
    "title": "Crystal Palace fans are literally fighting each other. How has it come to this?",
    "url": "https://www.theguardian.com/football/2025/dec/06/crystal-palace-fans-are-literally-fighting-each-other-how-has-it-come-to-this",
    "image": "https://media.guim.co.uk/90bed66b99088e711ca837a0618cf32110cb5a97/1958_0_4014_3211/500.jpg",
    "summary": "Clashes have erupted between rival factions due to a longstanding feud that centers around allegations of racism. The conflict highlights deep-rooted tensions within the community. The situation continues to escalate, raising concerns over public safety and social cohesion.",
    "published": "2025-12-06T08:00:49Z"
  }
]