[
  {
    "title": "England v Argentina: Autumn Nations Series rugby union – live",
    "url": "https://www.theguardian.com/sport/live/2025/nov/23/england-v-argentina-autumn-nations-series-rugby-union-live",
    "image": "https://media.guim.co.uk/d4d4f387aec463e8f9c7146b3058ab1a7381aa99/374_342_3767_3015/500.jpg",
    "summary": "Daniel Gallan offers live updates on England's final match of 2025. Follow along for minute-by-minute insights and key moments. Stay tuned for ongoing developments in the game.",
    "published": "2025-11-23T17:15:53Z"
  },
  {
    "title": "‘That doesn’t exist’: Doge reportedly quietly disbanded ahead of schedule",
    "url": "https://www.theguardian.com/us-news/2025/nov/23/trump-musk-doge-reportedly-disbanded",
    "image": "https://media.guim.co.uk/7c089562f40ae262a35d4cc5f1ce54c83a076050/449_0_5000_4000/500.jpg",
    "summary": "The Trump administration has released a statement suggesting that a Musk-led agency is likely facing disbandment. This confirmation aligns with ongoing suspicions about the agency's future. The announcement adds uncertainty to its operations and leadership.",
    "published": "2025-11-23T17:14:34Z"
  },
  {
    "title": "Arsenal v Tottenham: Premier League – live",
    "url": "https://www.theguardian.com/football/live/2025/nov/23/arsenal-v-tottenham-premier-league-live",
    "image": "https://media.guim.co.uk/7568b57e1c3b22e24f4677538017f0eb2c16c132/1082_720_4911_3929/500.jpg",
    "summary": "The article discusses the anticipation of Tottenham Hotspur's upcoming match against Arsenal at the Emirates Stadium. It highlights the significance of the game, as Spurs have not won there since 2010. Daniel Harris will be covering the event, emphasizing its importance in the North London rivalry.",
    "published": "2025-11-23T17:13:52Z"
  },
  {
    "title": "A wealth tax would be simple and fair – what’s not to like? | Letters",
    "url": "https://www.theguardian.com/uk-news/2025/nov/23/a-wealth-tax-would-be-simple-and-fair-whats-not-to-like",
    "image": "https://media.guim.co.uk/fd7e3b4527456871764f396226e8d09e27aee744/464_0_4536_3629/500.jpg",
    "summary": "Readers react to Aditya Chakrabortty's article, arguing that a modest 1% tax on the wealthy is insufficient to address Britain's growing inequality. Some suggest more substantial measures and reforms are necessary to create real change. The letters highlight diverse perspectives on income distribution and economic policy.",
    "published": "2025-11-23T17:07:19Z"
  },
  {
    "title": "Private finance plans for NHS buildings | Letters ",
    "url": "https://www.theguardian.com/society/2025/nov/23/private-finance-plans-for-nhs-buildings",
    "image": "https://media.guim.co.uk/5f72fa6074e0a0d677b2f3f08d911ca9ad24e5db/0_0_3186_2549/500.jpg",
    "summary": "Johnbosco Nwogbo argues that introducing new private finance debt is unwise, while Lord Hutton contends that Private Finance Initiatives (PFIs) have positively benefited the NHS and its patients. The debate highlights contrasting opinions on the role of private finance in public health. Both perspectives emphasize the ongoing discussions about the financial strategies in the healthcare sector.",
    "published": "2025-11-23T17:06:35Z"
  }
]