[
  {
    "title": "Hurricane Melissa leaves 29 dead as category 2 storm heads towards Bermuda – live",
    "url": "https://www.theguardian.com/world/live/2025/oct/30/hurricane-melissa-jamaica-cuba-haiti-bermuda-caribbean-latest-updates-live",
    "image": "https://media.guim.co.uk/18fadf78fc8fcc431c469478208ba847a0f0e91b/687_0_3440_2752/500.jpg",
    "summary": "Jamaica, Haiti, and Cuba are evaluating the damage caused by a recent storm, while residents in Bermuda are preparing for the arrival of a downgraded version of the same storm. The affected regions are assessing the impact on infrastructure and communities. Preparations are being made in Bermuda for potential challenges despite the storm's weakened state.",
    "published": "2025-10-30T17:17:57Z"
  },
  {
    "title": "India beat Australia in historic chase to reach Women’s Cricket World Cup final – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/30/india-v-australia-womens-cricket-world-cup-semi-final-live",
    "image": "https://media.guim.co.uk/7ae763cb9b6c7f01054b68b5c3235c0e4ae4a336/429_0_4846_3877/500.jpg",
    "summary": "In the second semi-final in Navi Mumbai, the co-hosts delivered a stunning performance, shocking the defending champions. The match unfolded with exciting commentary from our writers. Fans reacted passionately as the unexpected outcome unfolded.",
    "published": "2025-10-30T17:17:32Z"
  },
  {
    "title": "More than half of UK businesses changing DEI approach due to Trump’s criticism",
    "url": "https://www.theguardian.com/world/2025/oct/30/more-than-half-of-uk-businesses-changing-strategy-on-ethical-policies-research-finds",
    "image": "https://media.guim.co.uk/82d86cb9db70a9e004d01361fb05789985f46664/470_0_4167_3335/500.jpg",
    "summary": "Major UK organizations are responding to a backlash against diversity initiatives in the US by reassessing or potentially eliminating their own diversity policies. This shift comes amid growing scrutiny and opposition to such initiatives across various sectors. Companies are re-evaluating their approaches to ensure alignment with evolving societal attitudes towards diversity and inclusion.",
    "published": "2025-10-30T17:16:02Z"
  },
  {
    "title": "New York declares state of emergency to help food banks in government shutdown – US politics live",
    "url": "https://www.theguardian.com/world/live/2025/oct/30/donald-trump-xi-jinping-meeting-live-updates",
    "image": "https://media.guim.co.uk/2cdd2bf406cc3c87ec574848fcf9f70a42308bea/170_0_950_760/500.jpg",
    "summary": "The federal funding for the national food stamps program is set to expire on Saturday due to the ongoing government shutdown. This has prompted concerns about the impact on millions of Americans who rely on food assistance. Lawmakers are under pressure to resolve the funding issues before the deadline.",
    "published": "2025-10-30T17:15:13Z"
  },
  {
    "title": "Alan Kilburn obituary",
    "url": "https://www.theguardian.com/society/2025/oct/30/alan-kilburn-obituary",
    "image": "https://media.guim.co.uk/2e1348fc31d3f6446208146afa585ec6cd72c3db/0_0_721_577/500.jpg",
    "summary": "The chief executive of a housing association, known for innovating the use of private finance to enhance social housing, has passed away. Their contributions significantly impacted the sector, promoting greater investment in affordable homes. Colleagues and the community remember their visionary leadership and commitment to social welfare.",
    "published": "2025-10-30T17:11:26Z"
  }
]