[
  {
    "title": "Top Starmer aide resigns over explicit Diane Abbott messages in further blow to PM – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/15/keir-starmer-peter-mandelson-labour-reform-tories-uk-politics-live-news-updates",
    "image": "https://media.guim.co.uk/14e971cefa4204c99b097dae19bf090c12945f9e/0_0_2708_2166/500.jpg",
    "summary": "Paul Ovenden, the director of strategy, has resigned to prevent becoming a distraction following the revelation of derogatory emails. His departure comes amidst growing scrutiny over the contents of those emails. Ovenden's exit reflects an effort to maintain organizational focus and integrity.",
    "published": "2025-09-15T16:45:27Z"
  },
  {
    "title": "‘His music jostles like a get-together over a feijoada’: Hermeto Pascoal was Brazilian music’s experimental genius",
    "url": "https://www.theguardian.com/music/2025/sep/15/his-music-jostles-like-a-get-together-over-a-feijoada-hermeto-pascoal-was-brazilian-musics-experimental-genius",
    "image": "https://media.guim.co.uk/958451749bfb235e95ac08523bfb8814f0df8d69/0_163_2718_2173/500.jpg",
    "summary": "An innovative artist explored unique sound by performing in rivers and using unconventional instruments like kettles and bottles. He collaborated with jazz legend Miles Davis, showcasing his diverse musical abilities. His contributions to music and sound exploration are profound and far-reaching.",
    "published": "2025-09-15T16:44:44Z"
  },
  {
    "title": "Trump threatens to call national emergency in Washington DC over Ice cooperation – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/15/donald-trump-politics-washington-dc-national-emergency-ice-charlie-kirk-live-news-updates",
    "image": "https://media.guim.co.uk/be55a3a43c721979621ff247058474aa7a4a8c69/414_0_5000_4000/500.jpg",
    "summary": "President pledges to \"federalize\" the capital city following the mayor's decision for local police to abstain from collaboration with ICE in immigration enforcement efforts. The move highlights a significant tension between local and federal authorities over immigration policies. This announcement could lead to increased federal control and potential changes in law enforcement practices in the city.",
    "published": "2025-09-15T16:43:31Z"
  },
  {
    "title": "UK fighters to fly air defence missions over Poland – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/sep/15/russia-ukraine-romania-poland-drone-trump-tariffs-europe-live-news-updates",
    "image": "https://media.guim.co.uk/53cb310706901dc4e822940cc134f797fb0b45de/25_0_2918_2334/500.jpg",
    "summary": "Typhoon jets will be deployed from a RAF base in Lincolnshire to bolster the UK's defense capabilities. Prime Minister Keir Starmer stated that the aircraft's presence aims to \"deter aggression.\" This move reflects the UK's commitment to strengthening its military readiness amid rising global tensions.",
    "published": "2025-09-15T16:42:13Z"
  },
  {
    "title": "Senior Starmer adviser quits over offensive Diane Abbott messages",
    "url": "https://www.theguardian.com/politics/2025/sep/15/senior-starmer-adviser-paul-ovenden-quits-over-offensive-diane-abbott-messages",
    "image": "https://media.guim.co.uk/d0397d4f7d91a1f3bee61aae77b997cb94bed11e/0_0_2031_1623/500.jpg",
    "summary": "Paul Ovenden, the political strategy director, has departed, marking another setback for the Prime Minister following the recent exits of key figures Peter Mandelson and Angela Rayner. This leadership shakeup raises concerns about the stability and effectiveness of the PM's team. The departures highlight ongoing challenges within the party as it navigates political pressures.",
    "published": "2025-09-15T16:39:29Z"
  }
]