[
  {
    "title": "Australia v England: Women’s Cricket World Cup – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/22/australia-v-england-womens-cricket-world-cup-live",
    "image": "https://media.guim.co.uk/d3d6f57b6372c42709e38a79eedf1430d61fb38a/417_0_4799_3841/500.jpg",
    "summary": "The two unbeaten teams in the competition are facing off in Indore. Writers provide updates on the match as it unfolds. Stay tuned for continuous coverage of the game.",
    "published": "2025-10-22T12:42:48Z"
  },
  {
    "title": "Trump’s call to freeze Ukraine conflict at current frontlines is ‘good compromise’, says Zelenskyy – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/oct/22/russia-ukraine-war-kyiv-attack-latest-news-updates-europe",
    "image": "https://media.guim.co.uk/63395252dee8a4f36e32b741f950281e7703587b/228_0_2263_1810/500.jpg",
    "summary": "Ukrainian President Volodymyr Zelensky has made remarks coinciding with the cancellation of a scheduled summit between the US and Russia. This development comes amidst renewed attacks on Ukrainian cities, including Kyiv and Kharkiv. The situation highlights ongoing tensions and security concerns in the region.",
    "published": "2025-10-22T12:41:43Z"
  },
  {
    "title": "Starmer says Louise Casey will join grooming gangs inquiry after four survivors quit panel – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/oct/22/grooming-gangs-inquiry-mahmood-starmer-caerphilly-pmqs-latest-news-updates",
    "image": "https://media.guim.co.uk/26e8e8d5b071207a31343169c953d2ca5bc6c635/0_0_1666_1333/500.jpg",
    "summary": "Victims of grooming gangs have alleged that the government is attempting to coerce them into expanding a national inquiry. They claim this pressure undermines their experiences and the focus on their specific cases. The accusations highlight ongoing tensions between victims and government efforts to address the issue.",
    "published": "2025-10-22T12:36:36Z"
  },
  {
    "title": "Wild bear pays surprise visit to bear enclosure at California zoo: ‘He was very polite’",
    "url": "https://www.theguardian.com/us-news/2025/oct/22/wild-bear-sequoia-park-zoo",
    "image": "https://media.guim.co.uk/4a2dfbfac19552c65994a71d2cd214f2f1625891/160_0_1681_1345/500.jpg",
    "summary": "Sequoia Park Zoo staff discovered a wild black bear during an inspection. The wild bear was observed looking in at three captive bears in the zoo. This incident highlights the proximity of wildlife to the zoo.",
    "published": "2025-10-22T12:31:34Z"
  },
  {
    "title": "Gaza ceasefire could lead to more Israeli alliances in Middle East, Vance says at Netanyahu meeting – live",
    "url": "https://www.theguardian.com/world/live/2025/oct/22/israel-gaza-ceasefire-jd-vance-netanyahu-hamas-hostages-middle-east-latest-news-updates",
    "image": "https://media.guim.co.uk/4e3e52f613ff6dfe5e4036fa96bd1ff899e6867b/527_0_4870_3896/500.jpg",
    "summary": "The U.S. Vice President is visiting Israel to meet with the Israeli Prime Minister as a fragile ceasefire in Gaza is in effect. The meeting aims to discuss ongoing tensions and diplomatic efforts in the region. This visit underscores the U.S. commitment to supporting stability in Israel and Gaza.",
    "published": "2025-10-22T12:31:23Z"
  }
]