[
  {
    "title": "Polish PM says it would be ‘good to know’ who wrote plan to end war in Ukraine, amid concerns over Moscow involvement – live",
    "url": "https://www.theguardian.com/world/live/2025/nov/23/ukrainian-us-emergency-talks-plan-war-russia-live",
    "image": "https://media.guim.co.uk/c82b9742a207341ec5c4ce1982ad3037ee8f2495/511_0_6651_5321/500.jpg",
    "summary": "Ukrainian President Volodymyr Zelenskyy emphasized the urgency of countering \"wicked Russian attacks\" during recent emergency talks with U.S. officials. He called for comprehensive measures to strengthen Ukraine's defense. The discussions highlight ongoing concerns over Russian aggression and the need for international support.",
    "published": "2025-11-23T12:32:17Z"
  },
  {
    "title": "Arsenal v Tottenham buildup, Liverpool lose again, and Sheffield derby updates – matchday live",
    "url": "https://www.theguardian.com/football/live/2025/nov/23/arsenal-v-tottenham-hotspur-buildup-and-sheffield-derby-updates-matchday-live",
    "image": "https://media.guim.co.uk/277e9fa0a0fc1ddf50aa5502adbfe322f7bcf84a/1265_998_2071_1657/500.jpg",
    "summary": "Join our writers for updates and insights as a busy weekend of domestic football action approaches. Get ready for exciting matches and key storylines. Stay informed with the latest news and analysis.",
    "published": "2025-11-23T12:30:29Z"
  },
  {
    "title": "Fluffy and fabulous! 17 ways with marshmallows – from cheesecake to salad to an espresso martini",
    "url": "https://www.theguardian.com/food/2025/nov/23/fluffy-and-fabulous-17-ways-with-marshmallows-from-cheesecake-to-salad-to-an-espresso-martini",
    "image": "https://media.guim.co.uk/9c8f63e46761c65a402a5a40ad82f94def8fdae4/686_0_6827_5464/500.jpg",
    "summary": "Thanksgiving is the prime season for enjoying certain flavors, often paired with both savory dishes and desserts. This year, consider incorporating them into sweet potatoes, strawberry mousse, or even soup for a unique twist. Now is the perfect time to experiment with these combinations.",
    "published": "2025-11-23T12:30:08Z"
  },
  {
    "title": "Beareaved parents face ‘harrowing’ delays for NHS postmorterms",
    "url": "https://www.theguardian.com/society/2025/nov/23/beareaved-parents-face-harrowing-delays-for-nhs-postmorterms",
    "image": "https://media.guim.co.uk/dd8b078db8c3d975b15ca1b697c805eaf608a192/366_0_3333_2667/500.jpg",
    "summary": "The chair of the Royal College of Pathologists has declared a crisis in healthcare services due to a shortage of specialist doctors. This shortage is impacting the quality and availability of medical services. Urgent measures are needed to address the growing challenges in the healthcare system.",
    "published": "2025-11-23T12:20:22Z"
  },
  {
    "title": "Huddersfield Contemporary Music festival review – ghostly echoes, fearless voices and the rattle of milk frothers",
    "url": "https://www.theguardian.com/music/2025/nov/23/huddersfield-contemporary-music-festival-review-opening-concerts",
    "image": "https://media.guim.co.uk/4e9d8fdd05183ee7ed4422bdca924564d4315ed6/479_192_5316_4252/500.jpg",
    "summary": "The opening concerts of the gala featured captivating world and UK premieres, showcasing a blend of precise ensemble performances with electronic music. The event highlighted innovative percussion sound effects, contributing to a unique auditory experience. This fusion of new sounds aimed to engage and astonish the audience.",
    "published": "2025-11-23T12:02:35Z"
  }
]