[
  {
    "title": "Qarabag v Chelsea: Champions League – live",
    "url": "https://www.theguardian.com/football/live/2025/nov/05/qarabag-v-chelsea-champions-league-live",
    "image": "https://media.guim.co.uk/159d8b80ddde7a216384eb54b6c5b457f039d268/0_23_2129_1703/500.jpg",
    "summary": "John Brewin provides live minute-by-minute updates on Chelsea's long-distance away match in Baku. Follow along for real-time coverage and insights as the game unfolds. Stay tuned for the latest developments and highlights.",
    "published": "2025-11-05T18:28:49Z"
  },
  {
    "title": "Republicans file lawsuit challenging California’s redistricting measure",
    "url": "https://www.theguardian.com/us-news/2025/nov/05/california-redistricting-measure-republican-lawsuit",
    "image": "https://media.guim.co.uk/720ebe141e1d9cfbaa1b9eb8a0e7bf56969c13b3/292_0_2917_2334/500.jpg",
    "summary": "Voters approved Prop 50, granting the legislature the authority to redraw congressional maps. This decision is expected to favor Democrats in the House. The move has significant implications for future electoral dynamics.",
    "published": "2025-11-05T18:27:51Z"
  },
  {
    "title": "WTA Finals tennis: Iga Swiatek v Amanda Anisimova; Elena Rybakina beats Ekaterina Alexandrova – live",
    "url": "https://www.theguardian.com/sport/live/2025/nov/05/wta-finals-tennis-elena-rybakina-v-ekaterina-alexandrova-iga-swiatek-v-amanda-anisimova-live",
    "image": "https://media.guim.co.uk/6a1c5190f88c2d79a7bc8c088678dfe99b7f0600/268_0_3280_2624/500.jpg",
    "summary": "Taha Hashim will be hosting coverage of the latest group-stage matches in the season-ending tournament. Fans can expect insightful commentary and analysis. Stay tuned for updates on this exciting event!",
    "published": "2025-11-05T18:25:45Z"
  },
  {
    "title": "Zohran Mamdani announces all-female transition team as he prepares for New York mayoralty",
    "url": "https://www.theguardian.com/us-news/2025/nov/05/zohran-mamdani-transition-team",
    "image": "https://media.guim.co.uk/993893f70ac94c37cfbe04110e248fcc3d9fcddf/1867_1279_3212_2570/500.jpg",
    "summary": "A team featuring Lina Khan, the Biden-appointed FTC commissioner, alongside other former Democratic city officials, has been formed. The group's focus appears to be on advancing regulatory and consumer protection initiatives. The composition reflects a commitment to addressing key policy issues from a progressive perspective.",
    "published": "2025-11-05T18:25:03Z"
  },
  {
    "title": "Marks & Spencer’s cyber-trauma is bad, but clearly manageable",
    "url": "https://www.theguardian.com/business/nils-pratley-on-finance/2025/nov/05/marks-spencers-cyber-trauma-is-bad-but-clearly-manageable",
    "image": "https://media.guim.co.uk/449daed0fb68eae7320aa50a5ab5f6358204148e/920_0_6561_5251/500.jpg",
    "summary": "The chief executive has openly criticized the chancellor ahead of an upcoming budget, suggesting it may pose a greater risk to businesses than a recent incident. Concerns are mounting over the potential impact of the budget on the economic landscape. This tension reflects broader anxieties within the business community as the budget approaches.",
    "published": "2025-11-05T18:22:21Z"
  }
]