[
  {
    "title": "Donald Trump and Xi Jinping shake hands and depart after meeting in South Korea – live updates",
    "url": "https://www.theguardian.com/world/live/2025/oct/30/donald-trump-xi-jinping-meeting-live-updates",
    "image": "https://media.guim.co.uk/bd1c513361c5ea2ab97bd963b56b8b81e60cde38/0_1161_5159_4127/500.jpg",
    "summary": "The recent summit on the sidelines of APEC marked the first meeting between US and Chinese leaders since 2019. This dialogue comes amid ongoing tensions exacerbated by the trade war initiated by Donald Trump. The meeting aimed to address and potentially ease these strained relations.",
    "published": "2025-10-30T04:22:19Z"
  },
  {
    "title": "Australia politics live: Bridget McKenzie accuses PM of ‘bullying’ Senate chamber as extended question time threatens to erupt",
    "url": "https://www.theguardian.com/australia-news/live/2025/oct/30/anthony-albanese-donald-trump-meeting-murray-watt-epbc-nature-laws-press-club-parliament-labor-coalition-sussan-ley-ntwnfb",
    "image": "https://media.guim.co.uk/7a1e3591ec66a29e0adb708d7e2b85fe59dd14c2/1563_14_5939_4752/500.jpg",
    "summary": "Please provide the news article or details you would like summarized, and I will be happy to help!",
    "published": "2025-10-30T04:21:50Z"
  },
  {
    "title": "Trump and Xi meet in South Korea for crunch talks on trade",
    "url": "https://www.theguardian.com/us-news/2025/oct/30/trump-and-xi-meet-in-south-korea-for-crunch-talks-on-trade",
    "image": "https://media.guim.co.uk/214a6bd816efe5193d1b5c7c06cae0fd5f1bfb78/524_0_4164_3333/500.jpg",
    "summary": "During their talks, US and Chinese leaders signaled a willingness to reach a truce on several significant issues. This development suggests a potential easing of tensions between the two nations. Both sides are exploring avenues for cooperation amid ongoing challenges.",
    "published": "2025-10-30T03:36:43Z"
  },
  {
    "title": "‘Bats out for Benny’: Teenager killed by cricket ball remembered amid debate over neck guards",
    "url": "https://www.theguardian.com/sport/2025/oct/30/teenager-killed-by-cricket-ball-remembered-as-classic-australian-child-amid-debate-over-neck-guards",
    "image": "https://media.guim.co.uk/4a6c5e6d6986edf24408089224cbe94f6d4991ea/331_0_5915_4732/500.jpg",
    "summary": "A 17-year-old boy tragically died after being struck in the neck by a ball during practice, lacking a neck guard. Officials emphasize that their focus is on supporting both the victim's family and the player who threw the ball. The incident highlights the importance of safety measures in sports.",
    "published": "2025-10-30T03:32:43Z"
  },
  {
    "title": "Hurricane Melissa death toll rises as storm wreaks destruction across Caribbean – as it happened",
    "url": "https://www.theguardian.com/world/live/2025/oct/29/hurricane-melissa-live-updates-strengthens-cuba-extensive-damage-parts-of-jamaica",
    "image": "https://media.guim.co.uk/556fba4f8b291c7c54388fc5d148ebad70038534/403_0_3613_2891/500.jpg",
    "summary": "The blog has officially ceased operations and will no longer be updated. All content previously shared will remain accessible, but no new posts will be published. Readers are encouraged to explore other resources or similar platforms for continued information.",
    "published": "2025-10-30T03:13:26Z"
  }
]