[
  {
    "title": "Australia v India: men’s first one-day international – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/19/australia-v-india-mens-cricket-one-day-international-live",
    "image": "https://media.guim.co.uk/f0193f9165d3eba8fc4f829452c22edda6878581/557_0_3603_2882/500.jpg",
    "summary": "The summer of cricket kicks off with the first ODI at Optus Stadium in Perth. Martin Pegan provides live updates on the match. Fans can expect exciting play as the season commences.",
    "published": "2025-10-19T06:13:10Z"
  },
  {
    "title": "‘The wire began to smoke’: how to avoid counterfeits scams on Vinted and other resale sites",
    "url": "https://www.theguardian.com/technology/2025/oct/19/how-to-avoid-counterfeit-scams-on-vinted-and-other-resale-sites",
    "image": "https://media.guim.co.uk/3a57e5f8924c8215340586df27e76ddd8cf35d95/0_2776_4520_3616/500.jpg",
    "summary": "The article outlines essential steps to safeguard against common scams when shopping online, including thorough examination of sellers' profiles and reviews. It emphasizes the importance of secure payment methods for added protection. These measures aim to enhance consumer safety and confidence in online transactions.",
    "published": "2025-10-19T06:00:08Z"
  },
  {
    "title": "We cycled 2,000 miles from Cornwall to Portugal – with surfboards in tow ",
    "url": "https://www.theguardian.com/travel/2025/oct/19/we-cycled-2000-miles-from-cornwall-to-portugal-with-surfboards-in-tow",
    "image": "https://media.guim.co.uk/71506f68c61eda836c8f646a7f9d88600dafd67c/0_0_3750_3000/500.jpg",
    "summary": "Martin and Lizzy embark on an adventurous journey to the south-west tip of Europe. Their quest is fueled by a desire for freedom and excitement. Along the way, they're searching for the continent's best surfing spots.",
    "published": "2025-10-19T06:00:07Z"
  },
  {
    "title": "Xi Jinping is preparing to go toe to toe with Donald Trump – and there will only be one winner | Simon Tisdall",
    "url": "https://www.theguardian.com/commentisfree/2025/oct/19/donald-trump-xi-jinping-china-trade-tariffs-us-beijing",
    "image": "https://media.guim.co.uk/5709ff3d72af0bf84a51240d88abf2aa573bf8bb/634_238_2744_2195/500.jpg",
    "summary": "Beijing recognizes that the U.S. \"America First\" policies are pushing away both traditional and emerging allies. This shift is seen as creating a strategic vacuum that China could exploit. Commentator Simon Tisdall highlights the implications of this change in global dynamics.",
    "published": "2025-10-19T06:00:07Z"
  },
  {
    "title": "Bolivia to vote in presidential runoff that will turn it to the right",
    "url": "https://www.theguardian.com/world/2025/oct/19/bolivia-election-vote-presidential-runoff-turn-right-coca",
    "image": "https://media.guim.co.uk/ae3c1fd8db7c958036907ddacf3cca4e7f39d356/593_0_6880_5504/500.jpg",
    "summary": "The end of nearly 20 years of leftist governance may signal a resurgence in the \"war on drugs,\" with a potential shift in policies regarding coca cultivation. This change could lead to stricter enforcement against illegal coca production. The move reflects a broader strategy to combat drug trafficking and its associated violence.",
    "published": "2025-10-19T06:00:06Z"
  }
]