[
  {
    "title": "World Athletics Championships: 100m heats, women’s 10,000m final and more on night one – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/13/world-athletics-championships-100m-heats-womens-10000m-final-and-more-on-night-one-live",
    "image": "https://media.guim.co.uk/df84a366655629f3dfd1a52649363a43dae80172/536_0_4753_3805/500.jpg",
    "summary": "Billy Munday is providing live updates from the first evening session in Tokyo. The report will cover key events and highlights from the session. Stay tuned for ongoing coverage and insights.",
    "published": "2025-09-13T08:35:43Z"
  },
  {
    "title": "Premier League returns with Postecoglou taking Nottingham Forest to Arsenal – matchday live",
    "url": "https://www.theguardian.com/football/live/2025/sep/13/premier-league-returns-with-postecoglou-taking-nottingham-forest-to-arsenal-matchday-live",
    "image": "https://media.guim.co.uk/23dd2966a3097db39c29561d6a635ae8a072a9d4/0_0_5000_4000/500.jpg",
    "summary": "Rob Smyth discusses the excitement surrounding the Premier League's return, highlighting Arsenal's upcoming match against Nottingham Forest. The game will take place during the lunchtime slot. Fans are eager for the action as the season gets underway.",
    "published": "2025-09-13T08:33:53Z"
  },
  {
    "title": "Starmer’s team has ‘gone into the bunker’ since cabinet reshuffle, says Labour MP – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/13/uk-politics-latest-news-unite-the-kingdom-march-far-right-rally-london-labour-keir-starmer",
    "image": "https://media.guim.co.uk/aeb340f70dde2810175815d42830148a9e371293/734_482_3266_2613/500.jpg",
    "summary": "Following the resignations of Angela Rayner and the dismissal of Peter Mandelson, Labour MPs are questioning the viability of Keir Starmer's leadership. Speculation is growing about whether he could face a challenge for the party's leadership, including his position as a potential Prime Minister. This unrest reflects broader concerns within the party regarding future electoral prospects.",
    "published": "2025-09-13T08:33:21Z"
  },
  {
    "title": "Canelo v Crawford: our experts predict the winner of Saturday’s big fight",
    "url": "https://www.theguardian.com/sport/2025/sep/13/canelo-alvarez-terence-crawford-predictions",
    "image": "https://media.guim.co.uk/2a87dc91391762e94861ddbabbcd0e4f427035f8/551_0_5506_4405/500.jpg",
    "summary": "Canelo Álvarez and Terence Crawford are set to face off in Las Vegas, igniting a debate about whether Canelo's powerful punches or Crawford's precise technique will determine the outcome. Writers provide insights and arguments supporting both fighters' strengths. The matchup promises to be a thrilling clash of styles.",
    "published": "2025-09-13T08:30:01Z"
  },
  {
    "title": "‘I’ve seen so many people go down rabbit holes’: Patricia Lockwood on losing touch with reality",
    "url": "https://www.theguardian.com/books/2025/sep/13/ive-seen-so-many-people-go-down-rabbit-holes-patricia-lockwood-on-losing-touch-with-reality",
    "image": "https://media.guim.co.uk/bfa9642c115483e128dcaadce62664eb2c7c046a/1165_766_3252_2602/500.jpg",
    "summary": "The author of \"Priestdaddy\" discusses her decision to leave social media and her views on MAGA conspiracies. She reveals that her second novel emerged from a chaotic period following the Covid pandemic. The conversation highlights her creative process and reflections on contemporary issues.",
    "published": "2025-09-13T08:00:59Z"
  }
]