[
  {
    "title": "ITV confirms it is in talks to sell media and entertainment operations to Sky – business live",
    "url": "https://www.theguardian.com/business/live/2025/nov/07/itv-talks-sell-broadcasting-arm-sky-shares-bank-of-england-stock-markets-business-live",
    "image": "https://media.guim.co.uk/00ce7b1fbe922b05084eb427bab3c5cca58210fc/239_0_3021_2417/500.jpg",
    "summary": "ITV is in early talks to potentially sell its Media and Entertainment (M&E) business to Sky. The deal is valued at £1.6 billion. Further details about the negotiations have not been disclosed.",
    "published": "2025-11-07T07:09:49Z"
  },
  {
    "title": "From fiasco to feted: the story of the Dream of Gerontius, the revolutionary music of The Choral",
    "url": "https://www.theguardian.com/music/2025/nov/07/elgar-the-dream-of-gerontius-the-choral-alan-bennett-fact-fiction",
    "image": "https://media.guim.co.uk/dc39f4314bcef56b58f0fb4adc7e1757d5ccf9f6/0_0_1334_1067/500.jpg",
    "summary": "\"The Choral\" focuses on an amateur choral society in wartime Yorkshire as they tackle Elgar’s groundbreaking and contentious composition. The narrative raises questions about the accuracy of Alan Bennett’s fictional portrayal versus historical reality. It explores the intersection of art, community, and the impact of war on cultural expression.",
    "published": "2025-11-07T07:00:21Z"
  },
  {
    "title": "Kemi Badenoch to relaunch exclusive ‘advisory board’ for high-value donors",
    "url": "https://www.theguardian.com/politics/2025/nov/07/kemi-badenoch-to-relaunch-exclusive-advisory-board-for-high-value-donors",
    "image": "https://media.guim.co.uk/c7de98ea4913aea870fd5a4495f6dad8fe39d2b3/639_0_6370_5095/500.jpg",
    "summary": "The Tory leader intends to revive a controversial group that previously offered major donors direct access to senior government ministers. This move has sparked concerns over the influence of financial contributions on political decision-making. Critics argue it undermines transparency and accountability in governance.",
    "published": "2025-11-07T07:00:21Z"
  },
  {
    "title": "Love & War: From frontlines to family life. Pulitzer-winning conflict photographer Lynsey Addario on the five stories that defined her career",
    "url": "https://www.theguardian.com/artanddesign/ng-interactive/2025/nov/07/pulitzer-winning-conflict-photographer-lynsey-addario-five-stories",
    "image": "https://media.guim.co.uk/0ab40ea3b32b9663be3196cca28eed22cac3f94e/731_121_4769_3816/500.jpg",
    "summary": "Pulitzer-winning conflict photographer Lynsey Addario discusses five pivotal stories that shaped her illustrious career. These experiences highlight her courage and commitment to capturing the human experience in war zones. Her work emphasizes the importance of storytelling in raising awareness and fostering understanding of global conflicts.",
    "published": "2025-11-07T07:00:21Z"
  },
  {
    "title": "In Love With Love by Ella Risbridger review – a sexy celebration of romantic fiction",
    "url": "https://www.theguardian.com/books/2025/nov/07/in-love-with-love-by-ella-risbridger-review-a-sexy-celebration-of-romantic-fiction",
    "image": "https://media.guim.co.uk/903752e3199318273c735a23c3779ac4904868e0/385_0_2456_1965/500.jpg",
    "summary": "A writer reflects on the evolution of literature centered around desire, tracing its roots from classic works like \"Pride and Prejudice\" to modern bestsellers such as \"Fifty Shades of Grey.\" This exploration highlights how themes of passion and intimacy have transformed over time. Ultimately, it celebrates the enduring allure of romantic and erotic storytelling.",
    "published": "2025-11-07T07:00:20Z"
  }
]