[
  {
    "title": "Australia news live: Investigation into handling of unpaid tax debt as ATO urged to take ‘more compassionate’ approach",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/12/anthony-albanese-pacific-islands-forum-woodside-north-west-shelf-decision-sussan-ley-labor-coalition-ntwnfb",
    "image": "https://media.guim.co.uk/b02590adbae02e6fcdb44fda965069615dc1c2af/0_0_2670_2136/500.jpg",
    "summary": "Stay updated with real-time news coverage as current events unfold. Get the latest headlines and developments across various topics. Access live updates to stay informed on breaking news.",
    "published": "2025-09-11T21:23:50Z"
  },
  {
    "title": "Oxford Union condemns president-elect’s reported comments on Charlie Kirk shooting",
    "url": "https://www.theguardian.com/education/2025/sep/11/oxford-union-condemns-president-elects-reported-comments-on-charlie-kirk-shooting",
    "image": "https://media.guim.co.uk/f499367d07db6c6df071619caf142c922a8e3163/318_101_1091_874/500.jpg",
    "summary": "Current leadership strongly condemns George Abaraonye's remarks, reaffirming their stance against political violence. They express a unified rejection of any rhetoric that promotes such behavior. The leadership emphasizes a commitment to peaceful political discourse.",
    "published": "2025-09-11T21:18:30Z"
  },
  {
    "title": "Charlie Kirk shooting latest: search for shooting suspect continues as FBI asks public for help",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/11/charlie-kirk-shot-latest-news-updates-utah-university-donald-trump",
    "image": "https://media.guim.co.uk/76c0230ab358372bf02a0a59e55b7ea5d8ab10ca/0_399_1092_873/500.jpg",
    "summary": "The FBI has released images of a shooting suspect and is offering a $100,000 reward for information leading to their apprehension. Meanwhile, Turning Point USA released a statement affirming that Charlie Kirk's legacy will endure. The two events highlight ongoing concerns about public safety and influential figures in conservative circles.",
    "published": "2025-09-11T20:58:37Z"
  },
  {
    "title": "The Newsreader review – if this powerful Aussie drama were a US show, it’d be a smash hit",
    "url": "https://www.theguardian.com/tv-and-radio/2025/sep/11/the-newsreader-review-if-this-powerful-aussie-drama-were-a-us-show-itd-be-a-smash-hit",
    "image": "https://media.guim.co.uk/457503e237718acbc5a9d0f56b16a98b64877fef/649_0_3571_2857/500.jpg",
    "summary": "An Australian show set in the 1980s showcases the rivalry between newscasters, delivering a blend of soap opera elements and high drama. Its campy approach adds to the entertainment value, making it stand out as a notable period drama. Viewers are treated to a nostalgic and exaggerated portrayal of the media world during that era.",
    "published": "2025-09-11T20:55:16Z"
  },
  {
    "title": "Catalans Dragons deal major blow to Leeds’ hopes of top-two finish",
    "url": "https://www.theguardian.com/sport/2025/sep/11/catalans-dragons-deal-major-blow-to-leeds-hopes-of-top-two-finish",
    "image": "https://media.guim.co.uk/2a876f0529caf5a42d6c2b753bac991ca3bf1cf4/690_0_4706_3765/500.jpg",
    "summary": "Leeds suffered a setback in their bid for a top-two finish in the Super League after falling to the Catalans Dragons. The match ended with a score of 16-8 in favor of Catalans. This loss puts Leeds' playoff ambitions at risk.",
    "published": "2025-09-11T20:55:07Z"
  }
]