[
  {
    "title": "Ed Miliband urges Labour to move on after Starmer apologises to Streeting for hostile briefings from No 10 – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/nov/13/ed-miliband-wes-streeting-keir-starmer-briefing-news-updates-uk-politics-live",
    "image": "https://media.guim.co.uk/bbeb05b4c485719165441a306adb31403c6865ba/0_0_3333_2667/500.jpg",
    "summary": "The fallout from a controversial briefing operation targeting Wes Streeting persists, leading to increasing calls for Labour leader Keir Starmer to dismiss his chief of staff, Morgan McSweeney. The situation has sparked internal divisions within the party. Critics argue that accountability is needed following the episode.",
    "published": "2025-11-13T11:15:58Z"
  },
  {
    "title": "Gasp-worthy, clunky, a moral problem? Critics react to The Hunger Games: On Stage",
    "url": "https://www.theguardian.com/stage/2025/nov/13/hunger-games-on-stage-premiere-critics-reviews",
    "image": "https://media.guim.co.uk/54a8dc54b1492063a224cc880522beffe1d260be/796_214_3529_2824/500.jpg",
    "summary": "The adaptation of Suzanne Collins' dystopian novel has premiered in a custom-built theatre in Canary Wharf. Reviews have started pouring in, reflecting anticipation surrounding its release. Critics are eager to discuss how the adaptation translates the source material to the stage.",
    "published": "2025-11-13T11:12:39Z"
  },
  {
    "title": "US government reopens after shutdown with House to vote on Epstein files next week – politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/nov/13/donald-trump-jeffrey-epstein-files-us-government-shutdown-latest-news-updates",
    "image": "https://media.guim.co.uk/dabd0712ca88402bd15370f7b0511acd18f61988/438_0_4380_3504/500.jpg",
    "summary": "The proposed bill must first pass the House of Representatives before making its way to the Senate. Only after approval from both chambers can the files be released. The process highlights the need for bipartisan support to proceed with the legislation.",
    "published": "2025-11-13T11:12:23Z"
  },
  {
    "title": "Police and crime commissioners to be abolished, government to announce",
    "url": "https://www.theguardian.com/uk-news/2025/nov/13/police-and-commissioners-to-be-abolished-government-to-announce",
    "image": "https://media.guim.co.uk/efd27493d4ea4e9b2d5673245b129dfc3e5cdf97/333_0_3333_2667/500.jpg",
    "summary": "A system implemented in 2012 across England and Wales has been criticized by police chiefs for its effectiveness. They have raised concerns about its impact on law enforcement operations. The criticism highlights ongoing debates about policing methods and resource management.",
    "published": "2025-11-13T11:10:48Z"
  },
  {
    "title": "UK exports to US hit lowest level since January 2022 as tariffs bite – business live",
    "url": "https://www.theguardian.com/business/live/2025/nov/13/uk-gdp-report-economy-growth-jlr-hack-stock-markets-pound-bonds-business-live-news",
    "image": "https://media.guim.co.uk/9289bb80afc5d14bc9352054d1fcd52fc58df771/338_0_4099_3280/500.jpg",
    "summary": "Recent economic data reveals a decline in UK exports to the US, coinciding with a contraction in Britain's economy during September. This downturn raises concerns about the overall health of the UK's financial landscape. The situation signals potential challenges for future trade relations and economic growth.",
    "published": "2025-11-13T11:09:15Z"
  }
]