[
  {
    "title": "England v Samoa: Women’s Rugby World Cup 2025 – live",
    "url": "https://www.theguardian.com/sport/live/2025/aug/30/england-v-samoa-womens-rugby-world-cup-2025-live",
    "image": "https://media.guim.co.uk/894b189d820438020cfd751f818b916b94509322/864_0_5000_4000/500.jpg",
    "summary": "Daniel Gallan provides live updates as the host team faces Samoa in their second match of Pool A. Fans can follow the minute-by-minute report for all the action. Stay tuned for insights and key moments throughout the game.",
    "published": "2025-08-30T17:29:15Z"
  },
  {
    "title": "US Open tennis 2025: Gauff advances, Sinner and Osaka in action on day seven – live",
    "url": "https://www.theguardian.com/sport/live/2025/aug/30/us-open-tennis-2025-gauff-sinner-osaka-day-seven-live",
    "image": "https://media.guim.co.uk/b43c994b9cca7715692c53b8ad62f709763579c9/0_0_5417_4334/500.jpg",
    "summary": "Katy Murrells provides live updates from the third round of the US Open at Flushing Meadows. Fans can follow her report for the latest scores and highlights. Stay tuned for real-time coverage of the matches.",
    "published": "2025-08-30T17:28:37Z"
  },
  {
    "title": "Leeds v Newcastle: Premier League – live",
    "url": "https://www.theguardian.com/football/live/2025/aug/30/leeds-v-newcastle-premier-league-live",
    "image": "https://media.guim.co.uk/b0466665b14ba591f7cfa5ddffde77faa20fd481/501_0_5008_4007/500.jpg",
    "summary": "Newcastle is seeking their first league victory of the season during a match at Elland Road. Scott Murray will provide a minute-by-minute report with updates on the game. Fans are eager to see if Newcastle can secure the much-needed win.",
    "published": "2025-08-30T17:22:14Z"
  },
  {
    "title": "New York City declares Harlem legionnaire’s disease outbreak over",
    "url": "https://www.theguardian.com/us-news/2025/aug/30/new-york-city-harlem-legionnaires-disease-outbreak-over",
    "image": "https://media.guim.co.uk/47906eaef3cc46dede1c3669a922abec7257552a/668_0_6683_5347/500.jpg",
    "summary": "A local hospital's cooling tower was identified as the source of bacteria linked to a outbreak, resulting in the deaths of seven individuals and hospitalization of 90 others over three weeks. Health officials are investigating the situation to prevent further spread. The hospital is taking measures to address the contamination.",
    "published": "2025-08-30T17:07:34Z"
  },
  {
    "title": "Investigation launched into ‘horrific murder’ of Ukrainian politician in Lviv ",
    "url": "https://www.theguardian.com/world/2025/aug/30/andriy-parubiy-murder-shot-dead-ukraine-politician-lviv",
    "image": "https://media.guim.co.uk/4544c9b3811d17420911e256253b15d66c51d746/297_0_3077_2462/500.jpg",
    "summary": "Former parliamentary speaker Andriy Parubiy has been reported shot dead amid ongoing discussions among EU ministers regarding strategies to compel Moscow to engage in negotiations. The incident highlights the escalating tensions and violence in the region. The EU's focus remains on finding diplomatic solutions to the conflict.",
    "published": "2025-08-30T16:53:14Z"
  }
]