[
  {
    "title": "Pierpaolo Piccioli champions female emancipation with loose-fitting Balenciaga collection ",
    "url": "https://www.theguardian.com/fashion/2025/oct/05/pierpaolo-piccioli-loose-fitting-balenciaga-paris-celine",
    "image": "https://media.guim.co.uk/f0a7efe188dc5030aaf17a41b749da98a77513fd/2495_657_5648_4519/500.jpg",
    "summary": "The fashion world sees a blend of couture heritage and streetwear sensibilities, as the \"nicest man in fashion\" finds harmony between the two styles. Meanwhile, Céline showcases a fusion of French-girl elegance infused with an American aesthetic. This evolving dynamic highlights a shift towards inclusivity and versatility in contemporary fashion.",
    "published": "2025-10-05T15:14:09Z"
  },
  {
    "title": "Van Hecke saves point for Brighton after Verburggen’s own goal against Wolves",
    "url": "https://www.theguardian.com/football/2025/oct/05/wolves-brighton-premier-league-match-report",
    "image": "https://media.guim.co.uk/9472be69f0dc0c843c837d17da7a4cf37be152d5/277_0_2667_2134/500.jpg",
    "summary": "Brighton earned a point with a 1-1 draw against Wolves after Jan Paul van Hecke equalized. Bart Verbruggen's own goal in the 21st minute initially put Wolves ahead. Van Hecke's response ensured Brighton salvaged a draw.",
    "published": "2025-10-05T15:13:15Z"
  },
  {
    "title": "Newcastle 2-0 Nottingham Forest, Everton 2-1 Crystal Palace and more: Premier League clockwatch – live",
    "url": "https://www.theguardian.com/football/live/2025/oct/05/newcastle-nottingham-forest-everton-crystal-palace-premier-league-clockwatch-live",
    "image": "https://media.guim.co.uk/5f187c4d1a6e1faeb64edbcc28d1c448f269475d/289_0_2917_2333/500.jpg",
    "summary": "Rob Smyth will provide live updates on goals and other news from four ongoing Premier League matches. Fans can follow along for real-time scores and highlights. Stay tuned for exciting developments in the games!",
    "published": "2025-10-05T15:12:43Z"
  },
  {
    "title": "Goals in each half from Donyell Malen give Aston Villa edge over Burnley",
    "url": "https://www.theguardian.com/football/2025/oct/05/aston-villa-burnley-premier-league-match-report",
    "image": "https://media.guim.co.uk/1436c95d4c470939ec42d1bae4b3d1c16e5a6c31/258_0_1999_1599/500.jpg",
    "summary": "The Dutch striker scored two goals to secure a victory for his team, one before half-time and another shortly after. Although the visitors mounted a late comeback, they could not overcome the deficit. The match ended with the home team taking all three points.",
    "published": "2025-10-05T15:09:40Z"
  },
  {
    "title": "Pro-Palestine marches have become ‘carnivals of hatred’, Badenoch tells Tory conference – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/oct/05/conservative-tory-conference-kemi-badenoch-echr-immigration-uk-politics-live-news-updates",
    "image": "https://media.guim.co.uk/e3cd560e9fc1b080fc7b5ccf1008ca80a3d75b49/549_0_5000_4000/500.jpg",
    "summary": "A party leader has criticized the UK government for failing to effectively address extremism, asserting that such ideologies have been allowed to flourish without sufficient intervention. The leader emphasizes the need for stronger measures to combat radicalization in society. This statement highlights growing concerns over national security and social cohesion in Britain.",
    "published": "2025-10-05T15:06:39Z"
  }
]