[
  {
    "title": "Australia news live: Sussan Ley announces shadow ministry reshuffle after Jacinta Nampijinpa Price demotion",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/14/australia-news-live-albanese-papua-new-guinea-aldi-solar-environment-richard-marles-sunday-ntwnfb",
    "image": "https://media.guim.co.uk/eb00333d2b46544f6d03cc0076abfc11a9911b06/366_0_3163_2531/500.jpg",
    "summary": "I apologize, but I cannot access live news updates. However, if you provide me with details about a specific news story or event, I can summarize that for you!",
    "published": "2025-09-14T04:36:10Z"
  },
  {
    "title": "Canelo Álvarez v Terence Crawford: undisputed super middleweight championship – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/13/canelo-alvarez-v-terence-crawford-undisputed-super-middleweight-championship-live-buildup",
    "image": "https://media.guim.co.uk/f689fe92b311d71ceeb91f0bb6e4f0824731d3a2/547_0_5448_4360/500.jpg",
    "summary": "Canelo Álvarez and Terence Crawford face off at Allegiant Stadium in a highly anticipated boxing match. This matchup is being hailed as one of the biggest in recent years. Bryan Graham provides ongoing updates on the event.",
    "published": "2025-09-14T04:31:42Z"
  },
  {
    "title": "Prince Harry and King Charles reconciling? Their feud was the only relatable thing about them | Polly Hudson",
    "url": "https://www.theguardian.com/commentisfree/2025/sep/14/royal-family-feud-king-charles-prince-harry-relatable",
    "image": "https://media.guim.co.uk/0fe2bc65ef59e8c1b0fe47007763610556c22ae8/0_1_3000_2400/500.jpg",
    "summary": "Freelance journalist Polly Hudson comments on her family dynamics, noting that even her most difficult relatives have never insulted her in public, like in an interview with Oprah. She contrasts her own experiences with those of celebrities who have shared negative familial stories. Hudson emphasizes her relatively positive family relationships compared to others in the spotlight.",
    "published": "2025-09-14T04:00:23Z"
  },
  {
    "title": "Trump news at a glance: Kirk critics lose jobs amid rancour after killing",
    "url": "https://www.theguardian.com/us-news/2025/sep/14/trump-administration-charlie-kirk-news-updates-latest",
    "image": "https://media.guim.co.uk/56d028a61547d09365f557ce56321e58693d3246/960_155_4037_3230/500.jpg",
    "summary": "Authorities are conducting a purge, firing individuals who have made comments deemed offensive in relation to the killing of a conservative free speech advocate. This crackdown highlights tensions surrounding free speech and accountability in online discourse. The situation unfolds amidst escalating debates over freedom of expression and its limits in the public sphere.",
    "published": "2025-09-14T02:21:03Z"
  },
  {
    "title": "Questions linger about alleged shooter’s motivation for killing Charlie Kirk",
    "url": "https://www.theguardian.com/us-news/2025/sep/13/charlie-kirk-killing-alleged-shooter-motivation",
    "image": "https://media.guim.co.uk/f06a1614b64328d1c4c910def1df62c1a5fdf9ed/0_0_4916_3933/500.jpg",
    "summary": "Authorities are closely examining the background and political affiliations of a suspect involved in the killing of a far-right influencer. This scrutiny comes in the wake of the violent incident, raising concerns about extremist motivations. Investigators aim to understand the broader implications of the attack on political discourse.",
    "published": "2025-09-14T00:29:56Z"
  }
]