[
  {
    "title": "Gaza ceasefire plan live: Israel says it is preparing to pull back troops; living hostages could be released within days",
    "url": "https://www.theguardian.com/world/live/2025/oct/09/gaza-ceasefire-live-trump-says-hostages-probably-released-monday-idf-says-gaza-city-still-extremely-dangerous",
    "image": "https://media.guim.co.uk/ac1babc39647947640e9097dc52d3072092c055f/108_0_3780_3024/500.jpg",
    "summary": "US President Donald Trump announced that Israel and Hamas have reached an agreement on a \"first phase\" plan to pause hostilities. This plan includes provisions for the release of some hostages and prisoners. The announcement indicates a potential step towards easing tensions in the region.",
    "published": "2025-10-09T15:29:00Z"
  },
  {
    "title": "Man loses appeal against Gisèle Pelicot rape conviction",
    "url": "https://www.theguardian.com/world/2025/oct/09/man-loses-appeal-against-gisele-pelicot-rape-conviction-husamettin-dogan",
    "image": "https://media.guim.co.uk/dd2e2f4081be04c3e4fd0d8384caa4869e806704/115_0_6505_5205/500.jpg",
    "summary": "Husamettin Dogan's prison sentence has been increased to 10 years after a court found him guilty of raping Pelicot while she was sedated. The decision came following an appeal in which the severity of the crime was reassessed. The case highlights critical issues surrounding consent and the treatment of victims in sexual assault cases.",
    "published": "2025-10-09T15:27:12Z"
  },
  {
    "title": "Norway braces for Trump’s reaction if he does not win Nobel peace prize",
    "url": "https://www.theguardian.com/world/2025/oct/09/norway-braces-for-trumps-reaction-if-he-does-not-win-nobel-peace-prize",
    "image": "https://media.guim.co.uk/b2fbd979b23f35f77b2dbfaa9a76dcbd59d17644/451_0_4491_3592/500.jpg",
    "summary": "An analyst suggests that the US president might consider imposing tariffs, seeking increased contributions from NATO allies, or labeling Norway as an enemy. This implies heightened tensions between the US and its allies. The potential measures reflect ongoing concerns over military funding and trade relations.",
    "published": "2025-10-09T15:26:28Z"
  },
  {
    "title": "Bad Lads review – brutality, shame and fear as horrors of youth detention centre are laid bare",
    "url": "https://www.theguardian.com/stage/2025/oct/09/bad-lads-review-live-theatre-newcastle",
    "image": "https://media.guim.co.uk/7cb398e3666c947bf58147735c9b248e5a74ff42/256_92_1589_1272/500.jpg",
    "summary": "The news highlights a harrowing account of a 17-year-old who endured relentless abuse at Medomsley Detention Centre. The story is based on real-life testimonies, shedding light on the traumatic experiences faced by young individuals in such facilities. This narrative aims to raise awareness about the harsh conditions and treatment within the detention system.",
    "published": "2025-10-09T15:25:55Z"
  },
  {
    "title": "A teenager fled horror in Syria – only to be murdered on a sunny day in Huddersfield",
    "url": "https://www.theguardian.com/uk-news/2025/oct/09/teenager-fled-horror-syria-murdered-sunny-day-huddersfield-ahmad-al-ibrahim-alfie-franco",
    "image": "https://media.guim.co.uk/554140359356d023b718119b29397ad35f716a7f/0_140_1054_843/500.jpg",
    "summary": "Ahmad Al Ibrahim, a 16-year-old, tragically lost his life following a seemingly harmless interaction with Alfie Franco. The incident highlights concerns about youth safety and the unpredictability of social situations. Ahmad's death is a somber reminder of the potential dangers that can arise during attempts to connect with peers.",
    "published": "2025-10-09T15:24:05Z"
  }
]