[
  {
    "title": "White House halts $2.1bn of Chicago transport funding; Senate to hold vote as shutdown enters third day – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/03/shutdown-congress-trump-senate-latest-updates",
    "image": "https://media.guim.co.uk/4552f1f7817e2cb44bdb4b189dfb79c34355ef31/512_0_5275_4222/500.jpg",
    "summary": "Trump aide Russ Vought warned that a hold on funding would hinder efforts to extend and modernize the city's transit lines. The Senate currently shows little hope of reaching an agreement to prevent a government shutdown. This could have significant implications for urban transportation development.",
    "published": "2025-10-03T15:17:42Z"
  },
  {
    "title": "Manchester synagogue victim died after being shot by police, as Lammy heckled at vigil – latest",
    "url": "https://www.theguardian.com/uk-news/live/2025/oct/03/manchester-synagogue-attack-victims-adrian-daulby-melvin-cravitz-attacker-jihad-al-shamie-latest-news-updates",
    "image": "https://media.guim.co.uk/5347b15f89fa47dd6352daad2ae5a946f25a0b07/231_0_5423_4340/500.jpg",
    "summary": "The justice secretary faced public backlash as a crowd gathered to honor the victims of a recent terror attack, chanting \"shame on you.\" Tensions rose during the memorial event, highlighting community anger over the government's response. Emotions ran high as attendees sought to remember those lost and voice their frustrations.",
    "published": "2025-10-03T15:17:03Z"
  },
  {
    "title": "England fans ‘astonished’ by World Cup ticket prices; Antony hits out at United treatment: football – live",
    "url": "https://www.theguardian.com/football/live/2025/oct/03/weekend-football-countdown-nottingham-forest-postecoglou-england-squad-premier-league-news-live",
    "image": "https://media.guim.co.uk/6e2e583bc281b8b890af548ef98dbd5342bba7d0/106_0_2745_2196/500.jpg",
    "summary": "Tune in for insights and updates from our writers as they cover the latest news leading up to the weekend's football games. Get ready for an exciting weekend of matches! Stay informed with the most recent developments in the football world.",
    "published": "2025-10-03T15:16:53Z"
  },
  {
    "title": "UK political class ‘poisoned by wealth’, says Zack Polanski as he sets out plan to tax assets of richest 1% – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/oct/03/greens-labour-reform-conservatives-immigration-uk-politics-live-news-updates",
    "image": "https://media.guim.co.uk/230f3f716b1479d4b506a4187fec02c39aa795b2/648_0_4274_3419/500.jpg",
    "summary": "Filmmaker Roman Polanski has expressed the need for a deeper discussion on patriotism that transcends mere symbolic gestures like flag-waving. He argues for a meaningful dialogue about national identity and values. Polanski's comments aim to challenge superficial expressions of patriotism in contemporary society.",
    "published": "2025-10-03T15:16:11Z"
  },
  {
    "title": "Egypt foreign minister urges Hamas to accept Trump Gaza plan and disarm",
    "url": "https://www.theguardian.com/world/2025/oct/03/egypt-foreign-minister-urges-hamas-to-accept-trump-gaza-plan-and-disarm",
    "image": "https://media.guim.co.uk/04260d5817a1c436b667df54c1520d51e3c58bec/947_0_6250_5000/500.jpg",
    "summary": "Hamas is reportedly divided over its response to a deal, with differing opinions within the group regarding their next steps. Meanwhile, US President Joe Biden has established a deadline of Sunday for the militant organization to provide a reply. The situation remains tense as negotiations continue.",
    "published": "2025-10-03T15:14:25Z"
  }
]