[
  {
    "title": "Donald Trump to host Saudi crown prince Mohammed bin Salman at White House - live updates",
    "url": "https://www.theguardian.com/world/live/2025/nov/18/donald-trump-mbs-saudi-arabia-meeting-f35-jets-latest",
    "image": "https://media.guim.co.uk/8b25f96c34a27ffb850d963d113b78921be194b9/143_0_2151_1721/500.jpg",
    "summary": "President plans to sell F-35 stealth jets to Saudi Arabia during Crown Prince Mohammed bin Salman's first US visit since the 2018 murder of journalist Jamal Khashoggi. This arms deal marks a significant development in US-Saudi relations amid ongoing scrutiny over human rights issues. The meeting signals a potential shift in diplomatic dynamics as both nations navigate complex regional challenges.",
    "published": "2025-11-18T16:28:02Z"
  },
  {
    "title": "Stock market sell-off continues, as Google boss warns ‘no company immune’ if AI bubble bursts – business live",
    "url": "https://www.theguardian.com/business/live/2025/nov/18/stock-market-sell-off-ai-bubble-google-nvidia-ftse-100-bitcoin-business-live-news",
    "image": "https://media.guim.co.uk/3ccbfec548a26b1be54e8697e6563377ca7bae09/135_0_6315_5052/500.jpg",
    "summary": "Shares across Asia are experiencing a decline, reflecting broader economic concerns. In addition, Bitcoin has fallen to a seven-month low, intensifying worries in the cryptocurrency market. This downturn highlights ongoing instability in financial markets.",
    "published": "2025-11-18T16:25:17Z"
  },
  {
    "title": "Two Ukrainian men believed to be working with Russia identified as suspects in Polish rail sabotage attacks – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/nov/18/poland-russia-ukraine-rail-sabotage-incidents-zelenskyy-macron-merz-starmer-europe-live-news",
    "image": "https://media.guim.co.uk/ecb0b6a93d33b1c00e3e68b576723123b2c63be3/0_0_1066_853/500.jpg",
    "summary": "Donald Tusk has alerted the Polish parliament about a growing \"escalation\" of Russian intelligence operations throughout Europe. He emphasized the need for vigilance in response to these increasing threats. Tusk's warning reflects broader concerns regarding national security amidst heightened geopolitical tensions.",
    "published": "2025-11-18T16:24:55Z"
  },
  {
    "title": "Epstein survivors and US House members speak on Capitol Hill ahead of vote on release of Epstein files – US politics live ",
    "url": "https://www.theguardian.com/us-news/live/2025/nov/18/house-vote-jeffrey-epstein-files-donald-trump-republicans-democrats-us-politics-live-news",
    "image": "https://media.guim.co.uk/853f0e2fd34c9185281cbc4837b52d32e1f52ada/510_0_4651_3720/500.jpg",
    "summary": "Donald Trump has ended his opposition to the release of files related to convicted sex offender Jeffrey Epstein. This decision paves the way for a vote on making the documents public. The move is significant given Epstein's connections to various high-profile individuals.",
    "published": "2025-11-18T16:23:28Z"
  },
  {
    "title": "Chinese spying amounts to interference in UK democracy, minister says, after MI5 warns MPs – politics live",
    "url": "https://www.theguardian.com/politics/live/2025/nov/18/labour-asylum-seekers-keir-starmer-reform-nigel-farage-uk-politics-latest-news",
    "image": "https://media.guim.co.uk/60fec0b91918b4fc06cddf7732a6d1ecaa1e5852/746_0_3448_2758/500.jpg",
    "summary": "Dan Jarvis, the UK's security minister, has revealed that China is attempting to reach out to Members of Parliament and peers to obtain sensitive information regarding the UK Parliament. This highlights ongoing concerns about foreign interference in UK politics. The government is taking the matter seriously amid rising tensions with China.",
    "published": "2025-11-18T16:22:44Z"
  }
]