[
  {
    "title": "Families ‘shattered’ and community ‘terrified’ as police continue to hunt alleged machete murderers",
    "url": "https://www.theguardian.com/australia-news/2025/sep/08/families-shattered-and-community-terrified-as-police-continue-to-hunt-alleged-cobblebank-machete-murderers-ntwnfb",
    "image": "https://media.guim.co.uk/640a3aa2bb878563cf17c8950fa3d46b22fa25bc/1366_0_6805_5447/500.jpg",
    "summary": "The Premier has expressed strong support for the South Sudanese community in light of recent youth gang-related killings in Cobblebank. The government is committed to addressing the issues surrounding youth gang crime. Efforts will focus on collaboration with community leaders to foster safety and support for affected families.",
    "published": "2025-09-08T08:47:47Z"
  },
  {
    "title": "Tell us how the London tube strike has affected your commute",
    "url": "https://www.theguardian.com/uk-news/2025/sep/08/tell-us-how-the-london-tube-strike-has-affected-your-commute",
    "image": "https://media.guim.co.uk/99f0f66d6065bbb31278291df7fa199419cfa6c3/421_905_3442_2753/500.jpg",
    "summary": "Authorities are seeking feedback from individuals regarding how recent strike actions have impacted their daily commutes. They aim to gather insights on the challenges faced during this time. The initiative seeks to understand the broader effects on public transportation and work routines.",
    "published": "2025-09-08T08:45:44Z"
  },
  {
    "title": "Five people killed in Jerusalem shooting; Israel threatens Gaza City with ‘powerful hurricane’ – Middle East crisis live",
    "url": "https://www.theguardian.com/world/live/2025/sep/08/middle-east-crisis-live-jerusalem-shooting-israel-threatens-gaza-city-powerful-hurricane-latest-news",
    "image": "https://media.guim.co.uk/8f08c5ac32cba1a7bbe727134e644e7c9349a662/597_0_4917_3933/500.jpg",
    "summary": "Israel's defense minister, Israel Katz, has issued a warning about an impending military operation, describing it as a 'powerful hurricane' set to affect Gaza City later today. The statement suggests significant military action may be forthcoming. This announcement follows ongoing tensions in the region.",
    "published": "2025-09-08T08:44:57Z"
  },
  {
    "title": "Labour accused of ‘stitch-up’ over deputy leadership election contest – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/08/labour-deputy-leadership-election-contest-keir-starmer-angela-rayner-uk-politics-live",
    "image": "https://media.guim.co.uk/39f92301e527afd5bbde41a40d33459f21d88a0e/0_62_4129_3304/500.jpg",
    "summary": "Former minister Louise Haigh has joined the call for an 'economic reset' amid reports that candidates will have just four days to secure MP nominations. This urgency highlights the need for swift action and leadership in economic policy. The tight timeline raises concerns about the electoral process and candidate selection.",
    "published": "2025-09-08T08:41:36Z"
  },
  {
    "title": "Commuter misery deepens as TfL website crashes on first day of tube strikes; China’s exports hit by US tariff tensions– business live",
    "url": "https://www.theguardian.com/business/live/2025/sep/08/chinese-export-growth-slowest-six-months-shipments-us-fall-amid-tariff-tensions-oil-prices-climb-business-live",
    "image": "https://media.guim.co.uk/27f3e571cc7ddb16381049ef3173c3a889bb528c/826_0_4142_3315/500.jpg",
    "summary": "London's tube services are severely disrupted due to a series of strikes, resulting in minimal train operations until Friday. Meanwhile, shipments from Beijing to the US have dropped by 33% in August. These developments highlight ongoing labor and trade tensions.",
    "published": "2025-09-08T08:36:04Z"
  }
]