[
  {
    "title": "New Zealand v Canada: Women’s Rugby World Cup 2025 semi-final – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/19/new-zealand-v-canada-womens-rugby-world-cup-2025-semi-final-live",
    "image": "https://media.guim.co.uk/3c609933318e1dce0a2d7a1291cf76a82ec570c0/733_390_4210_3368/500.jpg",
    "summary": "Niall McVeigh provides a live minute-by-minute report from the first semi-final at Ashton Gate. Fans can expect real-time updates and key moments from the match. Stay tuned for the latest developments and highlights during the game.",
    "published": "2025-09-19T18:45:35Z"
  },
  {
    "title": "Estonia requests Nato article 4 consultation after ‘unacceptable’ violation of its airspace by Russian MiG-31s – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/sep/19/eu-sanctions-russia-oil-ukraine-vladimir-putin-volodymyr-zelenskyy-donald-trump-france-macron-europe-live-news",
    "image": "https://media.guim.co.uk/2b9a3bdac6c1558afbf9445cff2c5644686bbd7f/242_0_2049_1639/500.jpg",
    "summary": "NATO has condemned Russia for its \"reckless behavior\" following the interception of three MiG-31 fighters over Estonian airspace by NATO jets. The incident raises escalating concerns about airspace security and military tensions in the region. NATO continues to monitor the situation closely as part of its commitment to collective defense.",
    "published": "2025-09-19T18:45:16Z"
  },
  {
    "title": "House passes spending bill as Democrats protest healthcare cuts: ‘We don’t work for Trump’",
    "url": "https://www.theguardian.com/us-news/2025/sep/19/government-shutdown-democrats-healthcare",
    "image": "https://media.guim.co.uk/ed279065c771c001dd2b22c0af066eb2563ae8c7/375_0_3712_2971/500.jpg",
    "summary": "The U.S. government is on the brink of a shutdown as Democrats reject a Republican bill perceived to significantly weaken healthcare provisions. This political standoff highlights deep partisan divisions over budgetary priorities. Without a resolution, government operations may be suspended, impacting numerous services.",
    "published": "2025-09-19T18:43:29Z"
  },
  {
    "title": "Louisiana reports five deaths from flesh-eating bacteria found in coastal waters",
    "url": "https://www.theguardian.com/us-news/2025/sep/19/louisiana-flesh-eating-bacteria-deaths",
    "image": "https://media.guim.co.uk/b3e4dc9164b7f932c15a86fb1c6f8e6f9fe02eda/538_0_3109_2489/500.jpg",
    "summary": "Officials report an increase in deaths from Vibrio vulnificus, a bacteria often linked to warm coastal waters, exceeding average figures. This spike is attributed to climate change, which is expected to elevate cases further. Public health warnings have been issued to raise awareness and encourage caution in affected areas.",
    "published": "2025-09-19T18:34:30Z"
  },
  {
    "title": "Man arrested by Ice dies in jail cell in Long Island, New York",
    "url": "https://www.theguardian.com/us-news/2025/sep/19/ice-death-long-island-ny",
    "image": "https://media.guim.co.uk/7063dc1056785c3f2bf476f7ee9afe98a32fa669/169_0_1549_1240/500.jpg",
    "summary": "Officials in Nassau County confirmed the death of a 42-year-old man to Newsday. Specific details surrounding the incident have not been disclosed. The investigation is ongoing.",
    "published": "2025-09-19T18:34:02Z"
  }
]