[
  {
    "title": "Charlie Kirk shooting latest: FBI recovers rifle believed to have been used to kill Trump ally as suspect still at large",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/11/charlie-kirk-shot-latest-news-updates-utah-university-donald-trump",
    "image": "https://media.guim.co.uk/373b54c2e4780bad2b6021835b6d681010631d20/484_0_1967_1574/500.jpg",
    "summary": "The FBI discovered a high-powered bolt action rifle in a wooded area while investigating a suspect who reportedly blended into the surroundings and appears to be of college age. In a separate announcement, former President Trump plans to award Kirk the Presidential Medal of Freedom. Further details about the suspect or the circumstances surrounding the rifle have not been disclosed.",
    "published": "2025-09-11T15:30:48Z"
  },
  {
    "title": "No 10 says Starmer found Mandelson’s emails to Epstein ‘reprehensible’ – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/11/peter-mandelson-keir-starmer-deputy-labour-leader-uk-politics-latest-news",
    "image": "https://media.guim.co.uk/c07d84b6f076607ac3574c51f6231bdbd5c70ef6/1437_592_5194_4154/500.jpg",
    "summary": "No 10 has refused to confirm whether Prime Minister was misled by Peter Mandelson, despite multiple inquiries. The lack of clarity raises questions about the accuracy of information provided to the PM. This situation highlights ongoing tensions surrounding political communication and accountability.",
    "published": "2025-09-11T15:29:46Z"
  },
  {
    "title": "Starmer and Cooper lead from the back as junior ministers take the Mandy flak | John Crace",
    "url": "https://www.theguardian.com/politics/2025/sep/11/starmer-and-cooper-lead-from-the-back-as-junior-ministers-take-the-mandy-flak",
    "image": "https://media.guim.co.uk/bf8cb3bf5642098fcbd8bb1983a4e6ee9075f474/298_29_1218_975/500.jpg",
    "summary": "During a Commons session, MP Stephen Doughty found himself alone addressing comments related to Peter Mandelson, as both the Prime Minister and Foreign Secretary were absent. This absence left Doughty to handle the discussion without key government support. The situation highlighted a lack of leadership during a critical moment in parliamentary proceedings.",
    "published": "2025-09-11T15:29:09Z"
  },
  {
    "title": "Starmer is always torn between risk and caution. When it came to Mandelson, the wrong side won | Emma Burnell",
    "url": "https://www.theguardian.com/commentisfree/2025/sep/11/keir-starmer-peter-mandelson-labour-risk",
    "image": "https://media.guim.co.uk/c07d84b6f076607ac3574c51f6231bdbd5c70ef6/711_0_6103_4883/500.jpg",
    "summary": "The Prime Minister's prolonged support for an embattled official has left him unable to take credit for the eventual dismissal. LabourList editor Emma Burnell characterizes the situation as a \"worst-of-both-worlds\" scenario. The PM faces criticism for his decision-making amid the controversy.",
    "published": "2025-09-11T15:28:00Z"
  },
  {
    "title": "Notts beat Worcestershire, Surrey v Warwickshire and more: county cricket, day four – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/11/worcestershire-v-nottinghamshire-surrey-v-warwickshire-and-more-county-cricket-day-four-live",
    "image": "https://media.guim.co.uk/1581c6001aa5286f6d2745bc3bd9765be03d277b/0_157_2449_1959/500.jpg",
    "summary": "Tanya Aldred provides live updates on the final day of the latest County Championship matches. Fans can follow her rolling report for the latest developments and outcomes. Key highlights and crucial moments will be covered as the matches unfold.",
    "published": "2025-09-11T15:27:57Z"
  }
]