[
  {
    "title": "Rebecca review – Nikki Shiels is magnificent in confused Daphne du Maurier adaptation",
    "url": "https://www.theguardian.com/stage/2025/oct/05/rebecca-melbourne-theatre-company-review-mtc-nikki-shiels-daphne-du-maurier",
    "image": "https://media.guim.co.uk/2ed30e1ac4681e980044a3eff580ab89d32d14f0/136_0_1667_1334/500.jpg",
    "summary": "The Melbourne Theatre Company's adaptation of the 1938 novel, directed by Anne-Louise Sarks, features rich and compelling performances. However, certain elements of the production do not resonate as effectively. Overall, the interpretation offers a captivating but uneven experience.",
    "published": "2025-10-05T01:33:21Z"
  },
  {
    "title": "Australia news live: Liberal frontbencher backs Andrew Hastie on immigration; police investigate 84-year-old woman’s ‘suspicious’ death in Sydney",
    "url": "https://www.theguardian.com/australia-news/live/2025/oct/05/australia-news-live-hecs-student-debt-mark-butler-albanese-labor-melbourne-metro-nsw-qld-sussan-ley-andrew-hastie-coalition-ntwnfb",
    "image": "https://media.guim.co.uk/edd93429bceeeb5ef1316639bfebc83b28479949/658_0_6583_5266/500.jpg",
    "summary": "To provide an accurate summary, please provide the news article or details you'd like summarized.",
    "published": "2025-10-05T01:29:36Z"
  },
  {
    "title": "Pritzker warns Trump planning to send national guard to Chicago as border patrol there shoots woman",
    "url": "https://www.theguardian.com/us-news/2025/oct/04/woman-shot-border-patrol-chicago",
    "image": "https://media.guim.co.uk/80ed7e704c0cf1b7b7d87183bb93072f59ef6a44/520_0_5200_4160/500.jpg",
    "summary": "The Illinois governor has announced that his administration is intensifying efforts to combat what he describes as escalating aggression against the state's citizens and residents. He emphasizes the need to address safety and security concerns within the community. The announcement suggests a proactive approach to safeguarding residents from emerging threats.",
    "published": "2025-10-04T23:48:36Z"
  },
  {
    "title": "Quiptic crossword No 1,350",
    "url": "https://www.theguardian.com/crosswords/quiptic/1350",
    "summary": "Quiptic crossword No. 1,350 has been released, featuring a range of clues designed for solvers of varying skill levels. This edition maintains the series' trademark blend of clever wordplay and hints. Enthusiasts are encouraged to tackle the puzzle and share their solutions.",
    "published": "2025-10-04T23:00:18Z"
  },
  {
    "title": "Ex-NFL player and Fox Sports star Mark Sanchez arrested after being stabbed",
    "url": "https://www.theguardian.com/sport/2025/oct/04/nfl-mark-sanchez-stabbing-fox",
    "image": "https://media.guim.co.uk/d249bf28cbd54e3bdf9eb2c24d4505eef89e4207/395_0_6198_4960/500.jpg",
    "summary": "The circumstances of the incident involving Sanchez are still uncertain, as he remains hospitalized. He has not yet been booked into detention. Further details about the situation are awaited.",
    "published": "2025-10-04T22:33:59Z"
  }
]