[
  {
    "title": "Australia news live: Hastie says he backs Ley but is ‘a little bolder’ about policy; Andrew Forrest describes ‘real pain’ about Trump’s climate denialism",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/25/australia-news-live-penny-wong-anthony-albanese-climate-crisis-united-nations-donald-trump-turkey-cop-politics-ntwnfb",
    "image": "https://media.guim.co.uk/a82b8854334df8a044a523e87270d11a9cc6b683/1657_0_4214_3371/500.jpg",
    "summary": "Please provide the news article or details you would like summarized, and I'll be happy to assist!",
    "published": "2025-09-25T05:33:51Z"
  },
  {
    "title": "Thursday briefing: Why Starmer’s fixer is back in the headlines",
    "url": "https://www.theguardian.com/world/2025/sep/24/thursday-briefing-why-starmers-fixer-is-back-in-the-headlines",
    "image": "https://media.guim.co.uk/ab99bfbff1be63d2f63f1bf356c8acf01eb867ef/0_46_1000_800/500.jpg",
    "summary": "As Labour's conference approaches, Morgan McSweeney's involvement in Labour Together donations is raising concerns about a potential scandal engulfing the party. The situation has prompted scrutiny and speculation about its impact on Labour's reputation. This comes at a critical time for the party as it prepares for the upcoming event.",
    "published": "2025-09-25T05:32:50Z"
  },
  {
    "title": "TV tonight: the final season of hit roguish comedy Brassic",
    "url": "https://www.theguardian.com/tv-and-radio/2025/sep/25/tv-tonight-final-brassic-long-lost-family",
    "image": "https://media.guim.co.uk/1e908a16151dceb5c42b4033a1551c9302815e24/325_0_6381_5107/500.jpg",
    "summary": "Tonight's viewing features Joseph Gilgun and Michelle Keegan bringing cheerful energy in their latest project. Additionally, \"Long Lost Family\" will showcase some touching, emotional stories. It's an evening filled with both lighthearted entertainment and heartfelt moments.",
    "published": "2025-09-25T05:20:27Z"
  },
  {
    "title": "Ed Miliband looking into more North Sea drilling despite Labour pledge",
    "url": "https://www.theguardian.com/business/2025/sep/25/ed-miliband-looking-into-more-north-sea-drilling-despite-labour-pledge",
    "image": "https://media.guim.co.uk/3c555bb8a40b3d7c9df73c9edd199d190a15ad5a/412_0_4680_3744/500.jpg",
    "summary": "The Energy Secretary is exploring options to facilitate oil and gas exploration while adhering to the government's manifesto commitments. The aim is to balance energy needs with environmental and political pledges. Discussions are underway to find a workable solution that satisfies all parties involved.",
    "published": "2025-09-25T05:00:29Z"
  },
  {
    "title": "Apple calls for changes to anti-monopoly laws and says it may stop shipping to the EU",
    "url": "https://www.theguardian.com/technology/2025/sep/25/apple-calls-for-changes-to-anti-monopoly-laws-and-says-it-may-stop-shipping-to-the-eu",
    "image": "https://media.guim.co.uk/f95581b788b88a2ece0cf6aed8b976ee2f91011f/370_0_3698_2959/500.jpg",
    "summary": "Apple has criticized the European Union's Digital Markets Act, claiming it hinders innovation and leads to delayed features. The company argues that these delays ultimately result in a less favorable user experience. Apple emphasizes the need for regulatory frameworks that support technological advancement.",
    "published": "2025-09-25T05:00:29Z"
  }
]