[
  {
    "title": "Nigel Farage’s biographer says Reform UK leader should apologise after fresh claims of racism at school – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/nov/19/pmqs-uk-politics-latest-news-john-healey-rachel-reeves-keir-starmer-labour",
    "image": "https://media.guim.co.uk/04f3a0c55261270f0026676f1f2011ff718941a2/0_278_4812_3850/500.jpg",
    "summary": "The Guardian recently published an investigation into Nigel Farage's experiences as a student at Dulwich College, a prestigious private school in south London. The report sheds light on his formative years and the impact of his education on his later political career. This scrutiny adds to the ongoing discourse surrounding Farage's background and public persona.",
    "published": "2025-11-19T11:14:43Z"
  },
  {
    "title": "UK inflation dips to 3.6% despite accelerating food price growth – business live",
    "url": "https://www.theguardian.com/business/live/2025/nov/19/uk-inflation-cpi-budget-sterling-pound-stocks-bonds-bank-of-england-interest-rates-business-live",
    "image": "https://media.guim.co.uk/2da76c80ecea91918577b15fd1576eca5cf95eca/417_0_4167_3333/500.jpg",
    "summary": "Chancellor Rachel Reeves is monitoring inflation data closely as she prepares for her upcoming autumn budget, scheduled for next Wednesday. The inflation figures are expected to influence her budget decisions. Reeves aims to address economic concerns while drafting the budget.",
    "published": "2025-11-19T11:12:08Z"
  },
  {
    "title": "The Wizard of Oz review – Dorothy follows the yellow brick road from the Lake District",
    "url": "https://www.theguardian.com/stage/2025/nov/19/the-wizard-of-oz-review-theatre-by-the-lake-keswick",
    "image": "https://media.guim.co.uk/dc02e2c8dd3e60b0ed16c61fc6dffd2d5dbd3467/664_0_1742_1394/500.jpg",
    "summary": "Sonia Jalaly's update features all key characters while exploring themes of self-realization. The narrative is infused with lively songs and a playful sense of humor. Overall, it combines engaging storytelling with lighthearted entertainment.",
    "published": "2025-11-19T11:09:12Z"
  },
  {
    "title": "Wimbledon debenture tickets to get exemption from UK resale crackdown",
    "url": "https://www.theguardian.com/money/2025/nov/19/wimbledon-debenture-tickets-exempt-uk-resale-crackdown",
    "image": "https://media.guim.co.uk/671cc355a569326b58805306c27370173c53ab84/0_210_4570_3657/500.jpg",
    "summary": "Organizers have expressed concerns that a proposed ban on reselling tickets above their face value could negatively impact investments in event facilities. They argue that such regulations might deter potential funding and improvements. The proposal raises questions about the balance between consumer protection and financial incentives for venues.",
    "published": "2025-11-19T11:07:29Z"
  },
  {
    "title": "Poland detains several people in connection with rail sabotage as foreign minister condemns Russian ‘state terrorism’ – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/nov/19/russia-ukraine-poland-zelenskyy-germany-sweden-turkey-europe-live-latest-news-updates",
    "image": "https://media.guim.co.uk/62f0f311cfb4a70a8399b19e7bb1a8135213fbc3/226_0_4311_3449/500.jpg",
    "summary": "Polish official Radosław Sikorski announced that Poland will take action beyond diplomatic measures in response to recent incidents. The country will also revoke its consent for the last remaining Russian consulate in Poland. This decision reflects growing tensions between Poland and Russia.",
    "published": "2025-11-19T11:07:12Z"
  }
]