[
  {
    "title": "Bank of England slows bond-selling QT programme, and leaves UK interest rates on hold – business live",
    "url": "https://www.theguardian.com/business/live/2025/sep/18/bank-of-england-uk-interest-rates-bond-selling-qt-programme-andrew-bailey-business-live",
    "image": "https://media.guim.co.uk/1569d81fc094ab2948d99c38fcb53b3898d72b72/610_0_4591_3674/500.jpg",
    "summary": "Stay updated with real-time coverage of current economic and financial developments, including market trends and key economic indicators. Analysts provide insights into significant events impacting the global economy. Key highlights focus on policy changes, stock market movements, and financial forecasts.",
    "published": "2025-09-18T11:25:33Z"
  },
  {
    "title": "World Athletics Championships 2025: 400m finals, 200m semis and more – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/18/world-athletics-championships-2025-400m-finals-200m-semis-and-more-live",
    "image": "https://media.guim.co.uk/7512247519882acf456aef472f02cc3915da0bcc/1199_0_6060_4848/500.jpg",
    "summary": "Daniel Harris reports on the sixth night of events in Tokyo, highlighting the competition for medals in both the men’s and women’s 400m races. The excitement builds as top athletes compete for Olympic glory. Stay tuned for the latest updates and results.",
    "published": "2025-09-18T11:24:12Z"
  },
  {
    "title": "Surrey v Nottinghamshire, Somerset v Hampshire, and more: county cricket, day four – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/18/surrey-v-nottinghamshire-somerset-v-hampshire-and-more-county-cricket-day-four-live",
    "image": "https://media.guim.co.uk/c05c1e0a91abc803fa8b8879d58806d56c163b65/269_0_4546_3636/500.jpg",
    "summary": "Tanya Aldred provides live updates on the concluding day of the current County Championship matches. Fans can expect insights and highlights as teams vie for crucial points. Stay tuned for final scores and standout performances.",
    "published": "2025-09-18T11:21:15Z"
  },
  {
    "title": "Small changes, big impact: five top tips to help you live more sustainably",
    "url": "https://www.theguardian.com/waste-no-space/2025/sep/18/sustainable-living-tips-small-changes-big-impact",
    "image": "https://media.guim.co.uk/dbeba76058df73f733c7a9d4432e9e2c965b8783/288_0_1444_1155/500.jpg",
    "summary": "Embracing an eco-friendly lifestyle can be simplified through small, daily choices like repairing and reusing items. These manageable actions contribute significantly to environmental sustainability. By making conscious decisions, individuals can drive meaningful change in their habits.",
    "published": "2025-09-18T11:19:14Z"
  },
  {
    "title": "New French PM under pressure as strikes disrupt schools and transport across country – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/sep/18/france-strikes-lecornu-merz-sanchez-von-der-leyen-europe-live-latest-updates",
    "image": "https://media.guim.co.uk/4fd7e1b814aee38fa93e527ae9d16eb180dd6a2a/483_0_6880_5504/500.jpg",
    "summary": "An estimated 800,000 people are expected to participate in a march protesting budget cuts, public services, and wages. This demonstration follows the recent appointment of Sébastien Lecornu. The event highlights growing public discontent over economic issues.",
    "published": "2025-09-18T11:19:04Z"
  }
]