[
  {
    "title": "Liz Truss warns there is ‘a reckoning coming’ for central banks, and backs Trump in battle with Fed – business live",
    "url": "https://www.theguardian.com/business/live/2025/aug/28/tesla-sales-fall-across-europe-byd-bond-market-shares-ftse-business-live-news-updates",
    "image": "https://media.guim.co.uk/cfdb5cc7bda6dc4d6aea2245075bdbf20e3d9fad/484_0_4840_3872/500.jpg",
    "summary": "Former Prime Minister criticized the Bank of England, warning that the UK is trapped in an \"economic doom loop.\" This highlights ongoing concerns about the country's financial stability as economic challenges persist. The commentary adds to the rolling coverage of significant economic and financial news.",
    "published": "2025-08-28T09:31:47Z"
  },
  {
    "title": "Minister refuses to deny reports Rachel Reeves considering tax increase for landlords in budget – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/aug/28/latest-uk-politics-news-keir-starmer-rachel-reeves-labour-live-updates",
    "image": "https://media.guim.co.uk/04fcc70fae2cfebfc05b3f3ed628e4b6ea8a10f2/153_0_3085_2469/500.jpg",
    "summary": "Stephen Morgan emphasizes that Labour is prioritizing economic growth in response to reports of a potential national insurance tax on rental income. He aims to assure constituents about the party's commitment to supporting the economy. The focus is on creating a favorable environment for renters and property owners alike.",
    "published": "2025-08-28T09:31:03Z"
  },
  {
    "title": "Russia hits British Council and EU delegation offices in overnight airstrikes on Kyiv - Europe live",
    "url": "https://www.theguardian.com/world/live/2025/aug/28/ukraine-kyiv-strike-russia-europe-zelenskyy-putin-updates-live-news-latest",
    "image": "https://media.guim.co.uk/73f3dc40757f1c02fa6275f97f063d845d9d9749/184_0_1778_1422/500.jpg",
    "summary": "Ukrainian President Zelenskyy urges a strong response to the brutal killings of civilians, calling the acts \"horrific.\" Meanwhile, EU leaders also denounce the deliberate attacks, emphasizing the need for accountability. The collective outcry highlights the ongoing humanitarian crisis amidst the conflict.",
    "published": "2025-08-28T09:27:25Z"
  },
  {
    "title": "David Strathairn: ‘Authoritarianism is a very frightening concept when it comes to the arts’",
    "url": "https://www.theguardian.com/film/2025/aug/28/david-strathairn-interview-a-little-prayer",
    "image": "https://media.guim.co.uk/41201619ed6115312df0c668a9d69de52f7b05ac/369_0_1349_1080/500.jpg",
    "summary": "Oscar-nominated actor, recognized for roles in \"Good Night, and Good Luck\" and the Bourne franchise, discusses his latest film project. He shares insights into the film's themes and his character. The actor reflects on his career and the evolution of his craft.",
    "published": "2025-08-28T09:11:47Z"
  },
  {
    "title": "Pandemonium and pure joy: how my club Grimsby beat impossible odds to stun United",
    "url": "https://www.theguardian.com/football/2025/aug/28/grimsby-manchester-united-how-beat-jason-stockwood",
    "image": "https://media.guim.co.uk/5cd5b7b99f25b673fe08104009699cbdb5853b4c/335_74_3651_2920/500.jpg",
    "summary": "A remarkable event showcased heart, bravery, and teamwork, leaving a lasting impression on the community. The memorable night is anticipated to be recounted for years in social settings. Its significance highlights the power of unity and courage in challenging circumstances.",
    "published": "2025-08-28T09:08:33Z"
  }
]