[
  {
    "title": "Dutch election results: far-right and centrist parties in dead heat as last votes counted – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/oct/30/dutch-election-results-netherlands-geert-wilders-rob-jetten-france-louvre-russia-poland-ukraine-latest-news-updates",
    "image": "https://media.guim.co.uk/03d0f6884740bf4efaf82d78985fd75e63c33dab/0_0_11811_9449/500.jpg",
    "summary": "Geert Wilders’s PVV and Rob Jetten’s D66 have effectively tied in recent elections. A centrist party is anticipated to take the lead in coalition talks following this outcome. The future government formation will depend on negotiations among these parties.",
    "published": "2025-10-30T12:40:00Z"
  },
  {
    "title": "Hurricane Melissa leaves 29 dead as category 2 storm heads towards Bermuda – live",
    "url": "https://www.theguardian.com/world/live/2025/oct/30/hurricane-melissa-jamaica-cuba-haiti-bermuda-caribbean-latest-updates-live",
    "image": "https://media.guim.co.uk/18fadf78fc8fcc431c469478208ba847a0f0e91b/687_0_3440_2752/500.jpg",
    "summary": "Jamaica, Haiti, and Cuba are evaluating the damage caused by recent storms, with officials focusing on recovery efforts. Meanwhile, residents of Bermuda are preparing for the arrival of a downgraded storm. The situation highlights the ongoing impact of severe weather in the Caribbean region.",
    "published": "2025-10-30T12:39:21Z"
  },
  {
    "title": "India v Australia: Women’s Cricket World Cup semi-final – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/30/india-v-australia-womens-cricket-world-cup-semi-final-live",
    "image": "https://media.guim.co.uk/4c12ec47f58385780684f9d937ca521ec1085ba1/328_132_2781_2225/500.jpg",
    "summary": "In the second semi-final in Navi Mumbai, the co-hosts are competing against the defending champions. Live updates and commentary are provided by our writers throughout the match. Stay tuned for over-by-over reports on the game.",
    "published": "2025-10-30T12:39:11Z"
  },
  {
    "title": "Donald Trump says rare earths dispute ‘settled’ and China to resume buying US soybeans after Xi Jinping talks – live",
    "url": "https://www.theguardian.com/world/live/2025/oct/30/donald-trump-xi-jinping-meeting-live-updates",
    "image": "https://media.guim.co.uk/f142922b5839e6ebfff15fce39e5395897f21e4b/417_0_4167_3333/500.jpg",
    "summary": "China's leader announced a \"consensus\" on trade issues amid rising tensions. This comes as concerns grow over the U.S. president's directive for the Pentagon to initiate nuclear weapons testing. The situation highlights escalating geopolitical challenges between the two nations.",
    "published": "2025-10-30T12:36:30Z"
  },
  {
    "title": "How deprived is your area? Look up your postcode as new data for England released",
    "url": "https://www.theguardian.com/society/ng-interactive/2025/oct/30/how-deprived-is-your-area",
    "summary": "New data reveals comprehensive rankings of deprivation across all areas of England based on various metrics. Residents can check how their local area compares in terms of these statistics. The findings aim to shed light on social and economic challenges faced by different communities.",
    "published": "2025-10-30T12:26:45Z"
  }
]