[
  {
    "title": "US Open tennis day three: Sinner in action, Swiatek through, Boulter and Kartal exit – live",
    "url": "https://www.theguardian.com/sport/live/2025/aug/26/us-open-tennis-day-three-jannik-sinner-and-iga-swiatek-in-action-live",
    "image": "https://media.guim.co.uk/ff0da1f8a3813489d9f3a68e9a37665d268feccf/397_0_6515_5212/500.jpg",
    "summary": "Two favorite teams are set to play their opening matches, and fans are eager to see how they perform. Writers will provide live updates and insights on the games. Stay tuned for analysis on the teams' performances as the matches unfold.",
    "published": "2025-08-26T18:48:18Z"
  },
  {
    "title": "‘Trump has no authority’: Lisa Cook’s lawyer vows to sue administration over attempted firing of Fed governor – live",
    "url": "https://www.theguardian.com/us-news/live/2025/aug/26/trump-federal-reserve-lisa-cook-news-updates-us-politics-live",
    "image": "https://media.guim.co.uk/bb80bf6325afd21c5ae02bce7d87dc97c1a4eea9/0_0_3000_2400/500.jpg",
    "summary": "A lawyer for a Federal Reserve governor asserts that the Trump administration's attempt to dismiss her is unfounded both factually and legally. The claim comes amid ongoing tensions regarding the Federal Reserve's independence. The governor's legal team is prepared to challenge any efforts to remove her from office.",
    "published": "2025-08-26T18:48:06Z"
  },
  {
    "title": "Israeli protesters stage ‘day of disruption’ calling for end to war in Gaza",
    "url": "https://www.theguardian.com/world/2025/aug/26/israeli-protesters-stage-day-of-disruption-calling-for-end-to-war-in-gaza",
    "image": "https://media.guim.co.uk/46330834b29bca3e9a31420681546513816833ee/1000_0_5000_4002/500.jpg",
    "summary": "Israeli Prime Minister Netanyahu is gearing up for an offensive in Gaza City as tensions persist. Meanwhile, mediators are waiting for a response regarding a proposed ceasefire. The situation remains critical amid ongoing conflict.",
    "published": "2025-08-26T18:46:43Z"
  },
  {
    "title": "Kairat v Celtic, Leeds v Sheffield Wednesday: Champions League and Carabao Cup clockwatch – live",
    "url": "https://www.theguardian.com/football/live/2025/aug/26/kairat-v-celtic-leeds-v-sheffield-wednesday-champions-league-and-carabao-cup-clockwatch-live",
    "image": "https://media.guim.co.uk/d143f57a281a219b3f915388a3ccc4dc37e4e455/108_0_2642_2113/500.jpg",
    "summary": "Simon Burnton delivers the most recent scores and updates from Europe and England's football matches. Key moments and highlights are reported as they happen. Fans can stay informed about all the action and developments in real-time.",
    "published": "2025-08-26T18:46:39Z"
  },
  {
    "title": "Court tosses Trump lawsuit against Maryland judges over US deportations",
    "url": "https://www.theguardian.com/us-news/2025/aug/26/trump-lawsuit-maryland-judges-tossed",
    "image": "https://media.guim.co.uk/ea019baf10f1a62104a90cced5bb44f5b9d477b2/335_0_3331_2666/500.jpg",
    "summary": "A federal judge nominated by Trump ruled that judges in Maryland have \"absolute immunity\" from lawsuits related to their judicial decisions. This ruling reinforces the legal principle that judges are protected from being sued for actions taken in their official capacity. The decision highlights ongoing discussions about judicial accountability and immunity in the legal system.",
    "published": "2025-08-26T18:18:39Z"
  }
]