[
  {
    "title": "US Open tennis 2025: Aryna Sabalenka beats Amanda Anisimova in women’s singles final – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/06/us-open-tennis-2025-aryna-sabalenka-amanda-anisimova-womens-singles-final-live",
    "image": "https://media.guim.co.uk/4d8f09a93ed20b83dd6374ed93e8baf084130d90/700_0_4626_3703/500.jpg",
    "summary": "Aryna Sabalenka seeks to defend her title while Amanda Anisimova aims to overcome her previous challenges at Wimbledon. Katy Murrells provides ongoing coverage of the event. The competition highlights the determination of both players as they face each other on the court.",
    "published": "2025-09-06T22:29:23Z"
  },
  {
    "title": "Aryna Sabalenka sweeps aside Amanda Anisimova to retain US Open title",
    "url": "https://www.theguardian.com/sport/2025/sep/06/aryna-sabalenka-sweeps-aside-amanda-anisimova-to-retain-us-open-title",
    "image": "https://media.guim.co.uk/67acf0c7439ae099d2fda1c36cc1b8dfbfc5328c/377_0_3416_2733/500.jpg",
    "summary": "Aryna Sabalenka won the women's US Open by defeating Amanda Anisimova 6-3, 7-6 in the final. This victory marks Sabalenka's successful defense of her title. The match showcased her resilience and skill on the court.",
    "published": "2025-09-06T22:18:33Z"
  },
  {
    "title": "Fuze review – twisty London-set heist thriller should have stolen some personality",
    "url": "https://www.theguardian.com/film/2025/sep/06/fuze-review-london-heist-thriller",
    "image": "https://media.guim.co.uk/4defcbcf91126a25618ec2e11d1f21549d7e42d5/141_0_6942_5557/500.jpg",
    "summary": "Scottish director David Mackenzie has cast Aaron Taylor-Johnson and Theo James in his latest film, which features a plot filled with double-crossing. While it promises a thrilling caper, the film is criticized for lacking visual style. The project aims to engage audiences with its intriguing storyline, despite the stylistic shortcomings.",
    "published": "2025-09-06T21:38:00Z"
  },
  {
    "title": "World Cup qualifying roundup: Ronaldo scores twice as Portugal pay Jota tributes",
    "url": "https://www.theguardian.com/football/2025/sep/06/world-cup-qualifying-roundup-ronaldo-scores-twice-as-portugal-pay-jota-tributes",
    "image": "https://media.guim.co.uk/ce22b8bf979ffcb0311ea01d54dea9de564e8adc/302_0_2638_2110/500.jpg",
    "summary": "Cristiano Ronaldo scored two goals as Portugal defeated Armenia 5-0 in a World Cup qualifier. The match took place in Yerevan and was marked by an emotional atmosphere. Ronaldo's performance added to his record of international goals, showcasing his enduring talent.",
    "published": "2025-09-06T21:22:38Z"
  },
  {
    "title": "Reshuffle of junior ministers raises fears over future of Labour’s workers’ rights bill",
    "url": "https://www.theguardian.com/politics/2025/sep/06/reshuffle-of-junior-ministers-raises-fears-over-future-of-labours-workers-rights-bill",
    "image": "https://media.guim.co.uk/c2e8d22909e2d7bcef2080f8b3a9a0aa725e25ac/0_0_1064_850/500.jpg",
    "summary": "Tensions are rising as employment rights minister Justin Madders has been dismissed and union allies marginalized, leading to speculation about impending conflicts over significant reforms. The political maneuvering has raised concerns among labor advocates regarding the future of workers' rights. A potential showdown appears likely as differing interests clash in the wake of these changes.",
    "published": "2025-09-06T21:08:50Z"
  }
]