[
  {
    "title": "Starmer rebuffs renewed talk of Andy Burnham leadership challenge",
    "url": "https://www.theguardian.com/politics/2025/nov/21/starmer-rebuffs-renewed-talk-of-andy-burnham-leadership-challenge",
    "image": "https://media.guim.co.uk/2b93bebf4ce3f3b3dfc91769d5ff6a7b5867566b/419_0_4188_3350/500.jpg",
    "summary": "Labour leader Keir Starmer dismissed speculation about a potential leadership challenge from Manchester Mayor Andy Burnham. Starmer emphasized his commitment to leading the party and rejected calls for any changes in leadership. The comment comes amid discussions about the party's future direction and unity.",
    "published": "2025-11-21T17:17:56Z"
  },
  {
    "title": "Palmer breaks toe in mishap; Celtic AGM cut short amid jeers; Liverpool injuries: football news – live",
    "url": "https://www.theguardian.com/football/live/2025/nov/21/premier-league-returns-wolves-to-unveil-edwards-and-more-football-news-live",
    "image": "https://media.guim.co.uk/46b501b8f0d15a767e18e8006e9b082f48496244/368_0_3791_3033/500.jpg",
    "summary": "Join our writers for an overview of the upcoming weekend's domestic football matches, featuring key insights and analysis. Prepare for an exciting lineup of games as teams vie for crucial points. Stay tuned for updates and highlights as the action unfolds.",
    "published": "2025-11-21T17:15:49Z"
  },
  {
    "title": "Nigeria reels after second mass school abduction in a week",
    "url": "https://www.theguardian.com/world/2025/nov/21/nigeria-reels-after-second-mass-school-abduction-in-a-week",
    "image": "https://media.guim.co.uk/e3844a764f72be09a9e72842bc354ee6c2ae4aca/499_0_2374_1900/500.jpg",
    "summary": "Students were taken from a Catholic school in Niger state due to escalating threats from former President Donald Trump, who has called for intervention to stop what he terms \"Christian genocide.\" The situation highlights rising tensions in the region concerning religious safety. This move aims to protect students amid growing concerns over their security.",
    "published": "2025-11-21T17:13:42Z"
  },
  {
    "title": "Trump claims he’s ‘not threatening death’ for Democrats but says ‘they’re in serious trouble’ as he prepares to meet Mamdani – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/nov/21/donald-trump-democrats-republicans-zohran-mamdani-us-politics-latest-news-updates",
    "image": "https://media.guim.co.uk/f6dc0ca4e1bafcd0274dc386e65a9df440a77ab5/669_0_3559_2849/500.jpg",
    "summary": "Chuck Schumer criticized Donald Trump's recent comments, describing them as incitements to violence against elected officials. Trump also stated that he and New York Assemblyman Zohran Mamdani would have a productive meeting. The remarks have sparked significant concern among lawmakers regarding public safety.",
    "published": "2025-11-21T17:11:55Z"
  },
  {
    "title": "Ukraine risks losing key partner or its dignity, warns Zelenskyy, as Trump sets Thanksgiving deadline to accept deal – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/nov/21/europe-latest-news-russia-ukraine-war-updates-zelenskyy-putin-g20",
    "image": "https://media.guim.co.uk/9db26e6a635fd6e0e40e8e15559eeb918b3ec7a8/285_0_1350_1080/500.jpg",
    "summary": "In a recent radio interview, US President indicated that \"Thursday is an appropriate time\" for discussions regarding Ukraine. This comes as Ukrainian leader evaluates a proposal from the US. The timing suggests potential advancements in diplomatic relations and support for Ukraine.",
    "published": "2025-11-21T17:09:45Z"
  }
]