[
  {
    "title": "Starmer says he expects debate about ‘full horror’ of what happened in Gaza when media allowed in – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/oct/14/keir-starmer-china-national-security-spying-gaza-nigel-farage-uk-politics-live-news-updates",
    "image": "https://media.guim.co.uk/a62e2bee5a65addf5e2afa8e22f90a0f32212ab2/388_2_1151_921/500.jpg",
    "summary": "Prime Minister praised Donald Trump's role in facilitating a Middle East peace deal, emphasizing the importance of its implementation moving forward. He expressed optimism about the progress made but stressed that success hinges on effective execution. The focus now shifts to ensuring the agreement translates into tangible results in the region.",
    "published": "2025-10-14T16:21:12Z"
  },
  {
    "title": "House speaker defends administration’s move to keep military paid during government shutdown – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/14/donald-trump-government-shutdown-national-guard-javier-milei-charlie-kirk-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/71f9f04ad27b7d129dea2a5442081efa2fdd331e/616_0_4167_3335/500.jpg",
    "summary": "Mike Johnson affirmed that the Trump administration is entitled to allocate \"duly appropriated dollars from Congress to the Department of Defense.\" His statement highlights the administration's authority in financial matters regarding defense funding. This position underscores the ongoing debate over budgetary control and executive power in appropriations.",
    "published": "2025-10-14T16:18:31Z"
  },
  {
    "title": "‘Almost 30m plays on Spotify!’ When fake bands hit the real-life big time, from Spinal Tap to the Flaming Dildos",
    "url": "https://www.theguardian.com/music/2025/oct/14/spotify-fake-bands-spinal-tap-commitments-flaming-dildos-stereophonic-scott-pilgrim",
    "image": "https://media.guim.co.uk/1e7d50ef15ce6af6f2c0dcca42a7514e42338538/475_0_4748_3798/500.jpg",
    "summary": "Creators of popular works like Scott Pilgrim and The Commitments share insights on crafting believable fictional bands for various media. They discuss the creative process behind these invented groups and the unexpected success that can lead to chart-topping hits. The conversation highlights the blend of art and music in storytelling.",
    "published": "2025-10-14T16:14:43Z"
  },
  {
    "title": "Hamas says it will return bodies of four Israeli hostages tonight after Israel says it will keep Rafah crossing closed – Gaza ceasefire live",
    "url": "https://www.theguardian.com/world/live/2025/oct/14/gaza-ceasefire-israel-hamas-palestine-hostages-detainees-truce-live-news-updates",
    "image": "https://media.guim.co.uk/b911994cfbf7f44c97869341e06f2dc62d4b1759/794_0_4680_3744/500.jpg",
    "summary": "Hamas has informed mediators of its intention to transfer the bodies of four deceased hostages. This transfer is scheduled for 10 PM local time. The move highlights ongoing negotiations and tensions in the region.",
    "published": "2025-10-14T16:11:00Z"
  },
  {
    "title": "US supreme court rejects Alex Jones appeal over $1.4bn defamation penalty",
    "url": "https://www.theguardian.com/us-news/2025/oct/14/alex-jones-supreme-court-appeal-rejected",
    "image": "https://media.guim.co.uk/a54d3832c76cf43c68aba890c206c7e6c75fb258/412_0_4801_3840/500.jpg",
    "summary": "Infowars founder Alex Jones was ordered to pay substantial damages due to his false claims regarding the Sandy Hook massacre. The verdict came after he faced multiple lawsuits for promoting conspiracy theories that harmed the victims' families. This ruling underscores the legal consequences of spreading misinformation.",
    "published": "2025-10-14T16:03:13Z"
  }
]