[
  {
    "title": "The best Black Friday 2025 deals in the UK on the products we love, from window vacs to sunrise alarms",
    "url": "https://www.theguardian.com/thefilter/2025/nov/27/best-black-friday-deals-uk-2025-filter-tested-recommended",
    "image": "https://media.guim.co.uk/f0306201ffead6f726634986c4fa93dc59e0b590/0_0_5000_4000/500.jpg",
    "summary": "Black Friday has arrived, featuring genuine discounts on curated products. Filter has streamlined options to showcase high-quality deals across various categories including home, tech, beauty, and toys. Shoppers can find reliable bargains without the usual overwhelm.",
    "published": "2025-11-28T12:41:56Z"
  },
  {
    "title": "Video shows Israeli forces shooting Palestinians dead moments after surrender",
    "url": "https://www.theguardian.com/world/2025/nov/28/video-shows-israeli-forces-shooting-palestinians-dead-moments-after-surrender",
    "image": "https://media.guim.co.uk/621c755e0efc1d46b3d1fe3143d578504cb43667/99_0_988_790/500.jpg",
    "summary": "A far-right minister has defended the killing of two men who seemingly surrendered, stating that \"terrorists must die.\" This controversial assertion has sparked significant debate regarding the ethics of such actions. Critics argue that the statement raises serious concerns over due process and human rights.",
    "published": "2025-11-28T12:41:19Z"
  },
  {
    "title": "Palmer set to return against Arsenal, Slot defiant, arrests made after violence at Villa – football live",
    "url": "https://www.theguardian.com/football/live/2025/nov/28/premier-league-news-europa-league-reaction-previews-and-more-football-live",
    "image": "https://media.guim.co.uk/0e30b458e27f21ee2f3bd5b38a1f8f356bf5deba/0_810_3878_3103/500.jpg",
    "summary": "A rolling report provides updates on the latest football news and reactions as the weekend approaches. Writers are actively sharing insights and developments in the sport. Stay tuned for ongoing coverage and analysis.",
    "published": "2025-11-28T12:38:39Z"
  },
  {
    "title": "Putin praises Orbán’s ‘balanced’ position on Ukraine as leaders meet in Moscow – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/nov/28/europe-latest-news-andriy-yermak-anti-corruption-zelenskyy-ukraine-russia-war-peace-talks-putin",
    "image": "https://media.guim.co.uk/597879bd9c804269eb6fdfb97ccc50ef89b4fafe/126_0_1621_1297/500.jpg",
    "summary": "Hungarian Prime Minister Viktor Orbán met with Russian President Vladimir Putin at the Kremlin to discuss various topics. A key focus of their discussions was on energy deliveries between Hungary and Russia. The meeting highlights ongoing cooperation amid geopolitical tensions in Europe.",
    "published": "2025-11-28T12:38:10Z"
  },
  {
    "title": "UK at risk of ‘sudden confidence crisis’ if markets lose faith in budget – business live",
    "url": "https://www.theguardian.com/business/live/2025/nov/28/black-friday-consumers-scams-bad-deals-stock-market-ftse-pound-business-live",
    "image": "https://media.guim.co.uk/dec78de4dde1c7a8e455a1c0ae22063ce7128983/1002_0_4557_3646/500.jpg",
    "summary": "The latest economic and financial news highlights significant market movements and trends impacting global economies. Analysts are monitoring factors such as inflation rates, employment statistics, and central bank policies. Key updates include shifts in stock markets and emerging economic indicators that could influence future fiscal strategies.",
    "published": "2025-11-28T12:36:02Z"
  }
]