[
  {
    "title": "Trump says Ukraine could regain all territory lost to Russia since 2022 invasion after meeting Zelenskyy at UN – live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/23/donald-trump-unga-autism-tylenol-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/a25b42e2be033e6f69d3a2acfe088ab740d153fb/1361_323_5481_4385/500.jpg",
    "summary": "The US president's recent social media post represents a significant show of support for Kyiv amidst ongoing tensions. This message highlights the administration's commitment to backing Ukraine in its challenges. The post underscores a strong solidarity with the country during a critical time.",
    "published": "2025-09-23T22:32:32Z"
  },
  {
    "title": "US justice official leading prosecutions of minor crimes pleaded guilty to DUI",
    "url": "https://www.theguardian.com/us-news/2025/sep/23/doj-official-dui",
    "image": "https://media.guim.co.uk/acf1cf53e3f99ed1bcd5ef7de157aa07500f4094/124_3_1246_997/500.jpg",
    "summary": "Aakash Singh has been promoted to a high-ranking position despite facing criminal charges from four years ago. Experts find this elevation unusual, raising concerns about accountability and standards within the organization. The decision may prompt further scrutiny regarding the criteria for leadership appointments.",
    "published": "2025-09-23T22:32:24Z"
  },
  {
    "title": "Australia news live: Albanese meets world leaders at UN; new NSW police commissioner named",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/24/australia-news-live-anthony-albanese-new-york-united-nations-donald-trump-climate-crisis-palestine-israel-gaza-ntwnfb",
    "image": "https://media.guim.co.uk/9cbc16f6f681c618d15764d70a04cb253fd43ea3/893_0_4796_3837/500.jpg",
    "summary": "I currently cannot access live news updates or specific articles. Please provide the details or key points of the news you would like summarized, and I'll be happy to help!",
    "published": "2025-09-23T22:32:04Z"
  },
  {
    "title": "Mal Lanyon named NSW police commissioner replacing Karen Webb",
    "url": "https://www.theguardian.com/australia-news/2025/sep/24/mal-lanyon-named-nsw-police-commissioner-replacing-karen-webb",
    "image": "https://media.guim.co.uk/ed46eed7aa13834d1ed08ea41de0a58f01b671bb/454_0_4523_3620/500.jpg",
    "summary": "Lanyon, previously the deputy to Karen Webb, has been appointed as the new leader. He will officially assume the position on October 1. This transition marks a new leadership era following Webb's tenure.",
    "published": "2025-09-23T21:57:54Z"
  },
  {
    "title": "US border patrol collected DNA from thousands of US citizens for years, data shows",
    "url": "https://www.theguardian.com/technology/2025/sep/23/us-border-patrol-dna-data",
    "image": "https://media.guim.co.uk/a9e103f0758b52e8b9b8e716d63a8a254f9e446f/0_0_3229_2584/500.jpg",
    "summary": "Customs and Border Protection (CBP) officers collected DNA samples from approximately 2,000 citizens, including minors as young as 14. Many individuals sampled had not faced any criminal charges. This practice has raised concerns about privacy and the implications of collecting genetic data from non-offenders.",
    "published": "2025-09-23T21:49:09Z"
  }
]