[
  {
    "title": "Liverpool v Atlético Madrid: Champions League – live",
    "url": "https://www.theguardian.com/football/live/2025/sep/17/liverpool-v-atletico-madrid-champions-league-live",
    "image": "https://media.guim.co.uk/14cf4b89421ed2ea5998ccb26deb095970b69cd3/1092_554_2084_1667/500.jpg",
    "summary": "Alexander Isak will start for Liverpool in their challenging European opener against Diego Simeone's team. The match is highly anticipated, and live updates will be provided by Simon Burnton. Fans can expect an exciting showdown as both teams aim for victory.",
    "published": "2025-09-17T20:32:58Z"
  },
  {
    "title": "Bayern Munich v Chelsea: Champions League – live",
    "url": "https://www.theguardian.com/football/live/2025/sep/17/bayern-munich-v-chelsea-champions-league-live",
    "image": "https://media.guim.co.uk/49e4cc71cbf22dc5848abf4e056f1ebbb98f341f/222_0_3111_2489/500.jpg",
    "summary": "A live report is underway covering the performance of the Club World Cup champions as they face Harry Kane and his team in Germany. Luke McLaughlin is providing minute-by-minute updates on the match. The excitement is building as fans anticipate the showdown.",
    "published": "2025-09-17T20:32:34Z"
  },
  {
    "title": "Ex-US health official warns of RFK Jr’s risk to public health: ‘We’re going to see kids dying of vaccine-preventable diseases’ – live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/17/donald-trump-charlie-kirk-free-speech-nyt-cdc-rfk-epstein-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/588ddd7fb1bd97b4757b8f5ad8de5098e0fbfcb6/917_0_4583_3667/500.jpg",
    "summary": "Dr. Debra Houry and Susan Monarez warn that the U.S. is inadequately prepared to prevent chronic diseases and respond to future pandemics. They emphasize the need for improved public health strategies and resources. Their statements highlight potential vulnerabilities in the nation's healthcare system.",
    "published": "2025-09-17T20:29:29Z"
  },
  {
    "title": "Donald Trump joins royals for state banquet at Windsor – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/17/donald-trump-uk-state-visit-king-charles-windsor-politics-latest-news-updates-labour-keir-starmer",
    "image": "https://media.guim.co.uk/31e11fefaf516769f56ba42e97c119d2dd1a2b58/1101_678_3953_3162/500.jpg",
    "summary": "During the US president's second state visit, a feast attended by politicians, dignitaries, and prominent tech entrepreneurs took place. The event was overshadowed by protests, reflecting public dissent against the president. Tensions highlighted the divide in opinions surrounding his administration.",
    "published": "2025-09-17T20:25:29Z"
  },
  {
    "title": "Conte leans on De Bruyne for Napoli’s ‘students against teachers’ clash with Manchester City",
    "url": "https://www.theguardian.com/football/2025/sep/17/antonio-conte-napoli-manchester-city-champions-league-students-teachers",
    "image": "https://media.guim.co.uk/c390e3a70ed2e44eb8e80e172d93a79f8ca817af/0_152_4550_3640/500.jpg",
    "summary": "Antonio Conte is consulting Kevin De Bruyne for strategies to challenge Manchester City in Napoli's upcoming Champions League match. The collaboration aims to leverage De Bruyne's insights to strengthen Napoli's game plan. This interaction highlights Conte's proactive approach to preparing for a tough opponent.",
    "published": "2025-09-17T20:18:38Z"
  }
]