[
  {
    "title": "Charlie Kirk shooting latest: Utah governor confirms identity of suspect and says family friend turned him in",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/12/charlie-kirk-shooter-suspect-latest-news-updates-donald-trump-utah",
    "image": "https://media.guim.co.uk/b3900dee754cc4e9b61442cbd4826f211c47f0af/0_969_1693_1353/500.jpg",
    "summary": "Spencer Cox reported that Tyler Robinson, 22, confessed to a family friend that he shot Kirk. The FBI director confirmed that the suspect was apprehended on Thursday evening. Further details surrounding the incident have not been disclosed.",
    "published": "2025-09-12T18:38:56Z"
  },
  {
    "title": "Charlie Kirk shooting suspect: details of messages and gun casings emerge",
    "url": "https://www.theguardian.com/us-news/2025/sep/12/suspect-charlie-kirk-shooting",
    "image": "https://media.guim.co.uk/646f69b5389c78e13ce7dd435ad5c8d301338df0/840_75_6319_5056/500.jpg",
    "summary": "Utah officials received communication from a family friend regarding Tyler Robinson, a 22-year-old accused of murdering a right-wing activist. The investigation surrounding the case is ongoing. No further details have been disclosed about the relationship or the circumstances of the crime.",
    "published": "2025-09-12T18:38:42Z"
  },
  {
    "title": "England v South Africa: second men’s T20 international – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/12/england-v-south-africa-second-mens-t20-international-live",
    "image": "https://media.guim.co.uk/23c8b8703ea2fe2ec36cf45735eb5cfdb1a2a230/395_0_2276_1820/500.jpg",
    "summary": "Harry Brook's team aims to equalize the series at Old Trafford. Rob Smyth provides live updates in an over-by-over report. Fans are eagerly watching the match unfold.",
    "published": "2025-09-12T18:36:11Z"
  },
  {
    "title": "AstraZeneca pauses £200m investment in Cambridge research site",
    "url": "https://www.theguardian.com/business/2025/sep/12/astrazeneca-pauses-200m-investment-in-cambridge-research-site",
    "image": "https://media.guim.co.uk/2673e1bb7f692364a5daa7e4c15586421f154666/2_1400_3835_3070/500.jpg",
    "summary": "A recent decision has halted the progress of the drugmaker's widely publicized £650 million investment package in the UK. As a result, none of the planned initiatives will be moving forward at this time. This development raises concerns about the company's commitment to the UK market.",
    "published": "2025-09-12T18:29:52Z"
  },
  {
    "title": "US immigration officers kill man trying to flee vehicle stop near Chicago",
    "url": "https://www.theguardian.com/us-news/2025/sep/12/ice-agent-shooting-chicago",
    "image": "https://media.guim.co.uk/614880ebdc98251c09db7173da72829dc3822ce4/275_0_2735_2189/500.jpg",
    "summary": "A fatal shooting took place during a protest outside the Ice processing center in Broadview, Illinois. The incident has drawn attention to ongoing tensions surrounding immigration policies and the treatment of individuals in detention. Local authorities are investigating the circumstances surrounding the shooting.",
    "published": "2025-09-12T18:18:37Z"
  }
]