[
  {
    "title": "Amazon fires 150 unionized third-party drivers, Teamsters says",
    "url": "https://www.theguardian.com/technology/2025/sep/08/amazon-fires-drivers-cornucopia",
    "image": "https://media.guim.co.uk/cc69e0883f8f7ced82ebb7b93b7bb89d90ee4721/737_354_3250_2600/500.jpg",
    "summary": "A union has accused Amazon of illegal practices following the termination of drivers employed by contractor Cornucopia. The union claims that the dismissals violate labor laws. This incident raises concerns about worker rights and practices within Amazon's subcontracting arrangements.",
    "published": "2025-09-08T22:31:15Z"
  },
  {
    "title": "Australia news live: Greens warn new EV tax would be a ‘disaster’; ANZ to sack 3,500 workers",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/09/australia-news-live-anthony-albanese-vanuatu-china-pacific-forum-murray-watt-nature-protection-laws-ntwnfb",
    "image": "https://media.guim.co.uk/64fad5204aa408ad10145494b9dc7cb553875a0e/928_0_4640_3712/500.jpg",
    "summary": "Could you please provide the specific news article or details you'd like summarized?",
    "published": "2025-09-08T22:29:26Z"
  },
  {
    "title": "Murdoch family reaches deal to resolve succession fight over media empire",
    "url": "https://www.theguardian.com/us-news/2025/sep/08/rupert-murdoch-lachlan-family-succession-deal",
    "image": "https://media.guim.co.uk/e745624b49bf5d0b51ac27fd4f33cf7a0248ba22/333_0_3334_2667/500.jpg",
    "summary": "Rupert Murdoch's family has announced that his eldest son, Lachlan Murdoch, will take over control of the family's business empire. This transfer of authority solidifies Lachlan's position within the organization. The decision marks a significant moment in the succession of Murdoch's media legacy.",
    "published": "2025-09-08T22:01:25Z"
  },
  {
    "title": "White House hits back after Democrats share alleged Trump ‘birthday note’ to Jeffrey Epstein – live updates",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/08/donald-trump-immigration-hyundai-tariffs-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/e4821a6fe4cda117c0d83c16e8ec877227f429fc/386_1736_1801_1441/500.jpg",
    "summary": "Trump's press secretary asserts that an image shared by Democrats on the House Oversight Committee confirms that the former president neither drew nor signed the picture in question. The statement comes amidst ongoing debates regarding the authenticity and implications of various documents. This development highlights the ongoing political tensions surrounding Trump and the investigation.",
    "published": "2025-09-08T21:52:20Z"
  },
  {
    "title": "Chicago-area residents warned federal agents may be about to arrive",
    "url": "https://www.theguardian.com/us-news/2025/sep/08/chicago-suburb-evanston-federal-agents",
    "image": "https://media.guim.co.uk/271c98349473594544d14181387e1b685680f110/642_0_5029_4024/500.jpg",
    "summary": "Evanston officials are encouraging residents to report any sightings of federal agents amid concerns over a potential immigration crackdown threatened by Trump. This move aims to ensure community safety and support for undocumented individuals. The local government is actively addressing fears related to federal immigration enforcement.",
    "published": "2025-09-08T21:52:16Z"
  }
]