[
  {
    "title": "WTA Finals tennis: Swiatek v Rybakina, Anisimova v Keys – live",
    "url": "https://www.theguardian.com/sport/live/2025/nov/03/wta-finals-swiatek-v-rybakina-anisimova-v-keys-live",
    "image": "https://media.guim.co.uk/bfd9d9612fb208dec2b8f52d15b1c2b62abe6159/457_117_3281_2625/500.jpg",
    "summary": "Daniel Harris will provide live updates from the season-ending tournament taking place in Saudi Arabia. The event marks the conclusion of the competitive season. Fans can stay informed about the latest developments and results through Harris's coverage.",
    "published": "2025-11-03T15:21:00Z"
  },
  {
    "title": "Rome: worker trapped and one injured after part of medieval tower collapses",
    "url": "https://www.theguardian.com/world/2025/nov/03/rome-tower-collapse-torre-dei-conti-italy",
    "image": "https://media.guim.co.uk/e144e8774c8be67c92e869a6ec49af409c55c177/235_0_4187_3349/500.jpg",
    "summary": "Three individuals were rescued from the Torre dei Conti while restoration works were ongoing. The incident highlights the potential dangers associated with such construction activities. Emergency services responded promptly to ensure their safety.",
    "published": "2025-11-03T15:20:49Z"
  },
  {
    "title": "US government shutdown nearing record for longest in history as Trump delays food benefits to millions – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/nov/03/us-government-shutdown-donald-trump-latest-politics-news",
    "image": "https://media.guim.co.uk/b4b84f22380a10ccc00539f03de99303b099a38c/17_0_5000_4000/500.jpg",
    "summary": "Republicans assert that President Biden is eager to resolve the ongoing government shutdown, which has reached its 33rd day. They highlight his urgency in seeking a resolution to the standoff. The situation continues to impact federal services and employees across the country.",
    "published": "2025-11-03T15:19:39Z"
  },
  {
    "title": "Farage accused of betraying pensioners after triple lock hint in speech Tories say was rambling and incoherent – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/nov/03/nigel-farage-reform-speech-labour-conservatives-politics-live-latest-updates",
    "image": "https://media.guim.co.uk/87242bb4df31cdef46cbce71b10ac05b15972b5a/1337_1301_3038_2430/500.jpg",
    "summary": "The leader of a reform initiative has declined to guarantee the continuation of a system that ensures pension increases. This has raised concerns among retirees about the security of their future benefits. The lack of commitment could impact public trust in the proposed reforms.",
    "published": "2025-11-03T15:15:42Z"
  },
  {
    "title": "India’s World Cup win can set a new world order in women’s cricket – if it spends money wisely",
    "url": "https://www.theguardian.com/sport/2025/nov/03/india-world-cup-win-can-set-a-new-world-order-in-womens-cricket-if-it-spends-money-wisely",
    "image": "https://media.guim.co.uk/a54fe873eef9b2cfb0a2df2ca47ed313b8eecec3/372_0_5000_4000/500.jpg",
    "summary": "India should take note of Australia's cricket success, which stemmed from strong grassroots development. Emphasizing foundational programs can enhance the overall talent pool in Indian cricket. Learning from Australia’s model could foster long-term growth in the sport.",
    "published": "2025-11-03T15:12:30Z"
  }
]