[
  {
    "title": "Greenpeace threatens to sue crown estate for driving up cost of offshore wind",
    "url": "https://www.theguardian.com/uk-news/2025/oct/13/greenpeace-threatens-to-sue-crown-estate-for-driving-up-cost-of-offshore-wind",
    "image": "https://media.guim.co.uk/9e39900a5fcd887d3781c5164c5dbb2a87d64232/615_0_4213_3371/500.jpg",
    "summary": "An environmental group has accused a king's property management company of exploiting its monopoly on seabed ownership for profit. They claim that the company's practices prioritize profit over environmental protection. The allegations have raised concerns about the impact on marine ecosystems.",
    "published": "2025-10-13T13:24:42Z"
  },
  {
    "title": "Gaza ceasefire: all living Israeli hostages freed as Trump heads to Egypt for summit – latest updates",
    "url": "https://www.theguardian.com/world/live/2025/oct/13/gaza-ceasefire-live-updates-israel-hostages-release-hamas-trump-middle-east",
    "image": "https://media.guim.co.uk/6ba849e25a3ab7eec8e3518a2e28c910b05f978a/243_0_3247_2597/500.jpg",
    "summary": "US President received a standing ovation in the Knesset following the return of 20 hostages. In conjunction, hundreds of Palestinian prisoners were released. The events highlight ongoing tensions and negotiations in the region.",
    "published": "2025-10-13T13:20:48Z"
  },
  {
    "title": "No 10 says claims it concealed evidence or withdrew witnesses to stop China spy trial are ‘categorically untrue’ – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/oct/13/china-spy-trial-keir-starmer-egypt-margaret-thatcher-anniversary-uk-politics-live-news-updates",
    "image": "https://media.guim.co.uk/d2d80b936dfd8305dce9c8788f464b483c87fb7e/1309_695_3678_2942/500.jpg",
    "summary": "The spokesperson for the Prime Minister has strongly denied claims that the government influenced the Crown Prosecution Service (CPS) to drop a case concerning alleged Chinese espionage. They described the assertion as \"entirely false.\" The statement aims to clarify the government's stance amid ongoing concerns about foreign interference.",
    "published": "2025-10-13T13:18:40Z"
  },
  {
    "title": "Why has the US-China trade war restarted and how have markets reacted?",
    "url": "https://www.theguardian.com/world/2025/oct/13/why-us-china-trade-war-restarted-tariffs",
    "image": "https://media.guim.co.uk/5722ab6c61c26af7f05210e2dde2015692a440ed/452_0_2494_1995/500.jpg",
    "summary": "Trump has imposed 100% tariffs on Chinese imports in response to China's newly introduced restrictions on rare earth materials. This escalation comes just a month before a planned agreement between the two countries. The move signals heightened trade tensions and complicates the path to potential negotiations.",
    "published": "2025-10-13T13:17:02Z"
  },
  {
    "title": "Share a tip on your favourite winter mountain holiday in Europe",
    "url": "https://www.theguardian.com/travel/2025/oct/13/share-a-tip-on-your-favourite-winter-mountain-holiday-in-europe",
    "image": "https://media.guim.co.uk/881950108ac316add57333d93e077fcbe615ff28/321_0_5311_4249/500.jpg",
    "summary": "The article invites readers to share their favorite winter getaway experiences in Europe, ranging from snowshoeing in the Arctic to relaxing in an Alpine cabin. Participants have a chance to win £200 toward a Coolstays break. The best submission will be rewarded with the prize.",
    "published": "2025-10-13T13:15:12Z"
  }
]