[
  {
    "title": "Tanzania police arrest opposition party official after deadly election protests",
    "url": "https://www.theguardian.com/world/2025/nov/08/tanzania-officials-seek-arrest-key-opposition-figures-fatal-election-protests--samia-suluhu-hassan-",
    "image": "https://media.guim.co.uk/4bcce5abd59d7c58d0d233f59645c54f89608ad6/234_0_2087_1670/500.jpg",
    "summary": "The Chadema party reported that its deputy secretary general has been arrested. They also labeled the recent election of the incumbent president as fraudulent. This incident reflects ongoing tensions and disputes regarding the electoral process in the country.",
    "published": "2025-11-08T15:17:47Z"
  },
  {
    "title": "Scotland v New Zealand: Autumn Nations Series rugby union – live ",
    "url": "https://www.theguardian.com/sport/live/2025/nov/08/scotland-v-new-zealand-autumn-nations-series-rugby-union-live",
    "image": "https://media.guim.co.uk/acba706be8c517c7a5063ed52ae309b3d3a37ec1/146_0_3791_3032/500.jpg",
    "summary": "Lee Calvert provides live updates as the All Blacks prepare to face off against their opponents at Murrayfield. Fans can expect detailed, minute-by-minute coverage of the match. Stay tuned for the latest developments throughout the game.",
    "published": "2025-11-08T15:16:31Z"
  },
  {
    "title": "Everton v Fulham, West Ham v Burnley, and more: football clockwatch – live",
    "url": "https://www.theguardian.com/football/live/2025/nov/08/everton-v-fulham-west-ham-v-burnley-and-more-football-clockwatch-live",
    "image": "https://media.guim.co.uk/1082192168062403ee69a286b3c9d558e013f786/425_61_2441_1952/500.jpg",
    "summary": "Barry Glendenning will provide live updates from Premier League matches and other games starting at 3pm GMT. Tune in for the latest scores and highlights. Stay informed about all the action unfolding on the pitch.",
    "published": "2025-11-08T15:14:31Z"
  },
  {
    "title": "São Paulo Grand Prix: Norris boosts title bid with sprint win after Piastri crash – live",
    "url": "https://www.theguardian.com/sport/live/2025/nov/08/sao-paulo-grand-prix-f1-sprint-qualifying-oscar-piastri-lando-norris",
    "image": "https://media.guim.co.uk/a87cf5301b8255149555c23d20233412b5edd6de/0_37_4794_3835/500.jpg",
    "summary": "Brazil is hosting an exciting series of races as drivers compete in the sprint race followed by a quest for pole position. Fans can stay updated on the latest developments and results from these thrilling competitions. The atmosphere is high-stakes as contenders vie for key advantages in the championship.",
    "published": "2025-11-08T15:08:47Z"
  },
  {
    "title": "Why does UK government want to copy Denmark’s immigration system?",
    "url": "https://www.theguardian.com/uk-news/2025/nov/08/home-office-want-copy-denmark-immigration-system",
    "image": "https://media.guim.co.uk/5b24d7afd1160560b8ab6a8fcaa9105c7a8be726/34_0_6627_5304/500.jpg",
    "summary": "Denmark's strict immigration rules are seen as a factor contributing to the Social Democrats' political strength. However, some Labour MPs argue that these policies reflect far-right ideologies. The debate highlights a divide in perspectives on immigration and its impact on political dynamics.",
    "published": "2025-11-08T15:01:12Z"
  }
]