[
  {
    "title": "Zohran Mamdani wins New York mayoral election – live updates ",
    "url": "https://www.theguardian.com/us-news/live/2025/nov/04/nyc-mayor-election-zohran-mamdani-andrew-cuomo-results-latest",
    "image": "https://media.guim.co.uk/1e402ee1c3662f1d7203b19734db054a28418f38/256_0_2291_1834/500.jpg",
    "summary": "A democratic socialist has made history by becoming the first Muslim mayor of the city. This landmark election marks a significant milestone for representation and diversity in local governance. The new mayor's victory is celebrated by supporters as a step towards inclusivity.",
    "published": "2025-11-05T03:09:33Z"
  },
  {
    "title": "Pennsylvania keeps three liberal justices, preserving swing-state court control",
    "url": "https://www.theguardian.com/us-news/2025/nov/04/pennsylvania-supreme-court-election",
    "image": "https://media.guim.co.uk/4dbf172253ee2028ebb5b2ad1d1f66514bb746c6/0_0_3000_2400/500.jpg",
    "summary": "Democrats secured a 5-2 majority in a key swing-state court by winning three judges' elections for 10-year terms. This outcome is significant for shaping judicial decisions in the state. The results reflect continued Democratic strength in the judiciary amid ongoing political battles.",
    "published": "2025-11-05T03:07:04Z"
  },
  {
    "title": "Australia politics live: question time under way after McCormack chides Coalition colleagues for not giving Ley ‘clear air’ as leader",
    "url": "https://www.theguardian.com/australia-news/live/2025/nov/05/australia-politics-live-nauru-deportations-labor-greens-coalition-anthony-albanese-sussan-ley-nationals-leadership-net-zero-question-time-ntwnfb",
    "image": "https://media.guim.co.uk/650c15ea7e37200910687abfea8b16eb3f2aaa9c/622_0_6222_4978/500.jpg",
    "summary": "I'm sorry, but I need more context or information about the specific news article you want summarized. Could you please provide the details or main points of the news?",
    "published": "2025-11-05T03:05:34Z"
  },
  {
    "title": "Zohran Mamdani faces a daunting task: making his campaign pledges a reality",
    "url": "https://www.theguardian.com/us-news/2025/nov/04/zohran-mamdani-campaign-promises-analysis",
    "image": "https://media.guim.co.uk/a7d2ac69c056dd3bfaeb080a2ed579f3a4c4b815/560_0_5600_4480/500.jpg",
    "summary": "A democratic socialist leader has pledged to provide free childcare, implement free bus services, and enforce a rent freeze in New York City. As public expectations rise, the challenge remains for him to fulfill these promises in a timely manner. The urgency increases as citizens grow impatient for tangible results.",
    "published": "2025-11-05T02:41:24Z"
  },
  {
    "title": "Zohran Mamdani: meteoric rise of New York’s visionary new mayor",
    "url": "https://www.theguardian.com/us-news/2025/nov/04/zohran-mamdani-profile",
    "image": "https://media.guim.co.uk/91f2eb05e45018fc253a38c286d1bd1d70716864/566_0_4034_3229/500.jpg",
    "summary": "A charismatic 34-year-old candidate invigorated voters with her relatable approach, inspiring enthusiasm in the political arena. Her campaign strategy offers a successful model for other progressive candidates to emulate. This impact highlights her potential to reshape the political landscape.",
    "published": "2025-11-05T02:39:25Z"
  }
]