[
  {
    "title": "‘Ukraine’s future is our future’, says Starmer, as he vows coalition will take Russian oil and gas off market to choke funding – Europe live ",
    "url": "https://www.theguardian.com/world/live/2025/oct/24/volodmyr-zelenskyy-ukraine-russia-vladimir-putin-sanctions-keir-starmer-coalition-of-the-willing-military-support-europe-live-news",
    "image": "https://media.guim.co.uk/7778b93eb89128fb9006195980318b9bacbfd2ac/397_0_6830_5464/500.jpg",
    "summary": "Ukrainian President Volodymyr Zelenskyy and UK Labour leader Keir Starmer held a press conference alongside members of a \"coalition of willing\" nations. They discussed collective efforts to support Ukraine amidst the ongoing conflict. The coalition aims to strengthen diplomatic and military assistance to bolster Ukraine's defenses against aggression.",
    "published": "2025-10-24T17:13:38Z"
  },
  {
    "title": "Dave Ball obituary",
    "url": "https://www.theguardian.com/music/2025/oct/24/dave-ball-obituary",
    "image": "https://media.guim.co.uk/7b88b56efaf00e70f69852a19668de508dd14159/0_99_1800_1439/500.jpg",
    "summary": "One half of the synth-pop duo Soft Cell, recognized for their iconic No. 1 hit \"Tainted Love,\" has passed away. The duo, formed in the early 1980s, is celebrated for their significant impact on the music scene. Fans and fellow artists are mourning the loss of this influential musician.",
    "published": "2025-10-24T17:07:05Z"
  },
  {
    "title": "Schumer says Democrats will force vote to overturn Canada tariffs as Carney says nation ‘stands ready’ to continue US trade talks – live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/24/donald-trump-trade-negotiations-canada-mark-carney-terminated-tariff-letitia-james-new-york-us-politics-live-news",
    "image": "https://media.guim.co.uk/76634a605e91f546734d90beb535dfeb4fcb80e9/393_0_3400_2719/500.jpg",
    "summary": "A Democratic leader criticized Canada's tariffs as \"damaging\" and pledged to work toward reversing them. Meanwhile, the Canadian Prime Minister expressed a desire for progress in trade negotiations. Both sides are looking to address ongoing trade tensions.",
    "published": "2025-10-24T17:05:46Z"
  },
  {
    "title": "Fernandes still committed to Manchester United before landmark 300th game: football – as it happened",
    "url": "https://www.theguardian.com/football/live/2025/oct/24/premier-league-news-europa-league-reaction-and-more-weekend-football-countdown-live",
    "image": "https://media.guim.co.uk/d7151cc0e7d67294e67ba542581ad031b92928a2/743_0_6105_4884/500.jpg",
    "summary": "Sheffield Wednesday has entered administration under owner Dejphon Chansiri, resulting in a 12-point deduction for the club. Meanwhile, Manchester United's Bruno Fernandes is preparing to achieve a significant milestone in his career. The developments highlight contrasting situations in English football.",
    "published": "2025-10-24T16:57:56Z"
  },
  {
    "title": "Palestinian factions say they agree to let independent technocrat committee run Gaza",
    "url": "https://www.theguardian.com/world/2025/oct/24/palestinian-factions-say-they-agree-to-let-independent-technocrat-committee-run-gaza",
    "image": "https://media.guim.co.uk/89ac494c5e80d2b7114e4e68cf703fb6986f148e/672_0_6723_5378/500.jpg",
    "summary": "The administration has announced plans to manage basic services in collaboration with Arab nations and international organizations. This commitment was outlined in a joint statement. The initiative aims to enhance support and cooperation in service delivery.",
    "published": "2025-10-24T16:50:30Z"
  }
]