[
  {
    "title": "Australia news live: Speakman quotes Mark Twain and digs in as NSW Liberals inch towards leadership spill; NT cyclone intensifies",
    "url": "https://www.theguardian.com/australia-news/live/2025/nov/20/australia-news-live-volcano-java-labor-nature-laws-coalition-sussan-ley-anthony-albanese-nsw-leadership-spill-liberal-chaos-ntwnfb",
    "image": "https://media.guim.co.uk/a8740e1950a38702fdb7964a5e11861ae9f22bca/4532_1533_2573_2058/500.jpg",
    "summary": "Please provide the news article or details you would like summarized, and I'll be happy to assist you!",
    "published": "2025-11-19T23:13:18Z"
  },
  {
    "title": "The landline may be having a renaissance – but it’s to a world in which the art of phone calls has changed | Paul Daley",
    "url": "https://www.theguardian.com/commentisfree/2025/nov/20/the-landline-may-be-having-a-renaissance-but-its-to-a-world-in-which-the-art-of-phone-calls-has-changed",
    "image": "https://media.guim.co.uk/f947ed4e0fe925aa6b599bc6c6e386015e1d73b4/0_1757_4999_3998/500.jpg",
    "summary": "Many people feel nostalgic for the era when landline phones facilitated family communication, fostering connections in a shared space. This reflects a contrast to the current reliance on smartphones, which have become personal extensions for individuals. The sentiment highlights a longing for simpler, communal interactions in a digital age.",
    "published": "2025-11-19T22:51:36Z"
  },
  {
    "title": "Justice department will release Epstein files within 30 days, says US attorney general – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/nov/19/us-congress-epstein-files-donald-trump-saudi-arabia-redistricting-latest-news-updates",
    "image": "https://media.guim.co.uk/ab112c869b28d2d647fc8f754d5adade2334ef7f/484_0_3091_2473/500.jpg",
    "summary": "Pam Bondi addressed the press following the US Senate's passage of a bill aimed at releasing certain files. However, concerns arose that the agency might withhold material relevant to an investigation ordered by former President Trump. The situation highlights tensions between transparency and ongoing legal inquiries.",
    "published": "2025-11-19T22:36:40Z"
  },
  {
    "title": "Full grand jury didn’t see final Comey indictment, prosecutors admit",
    "url": "https://www.theguardian.com/us-news/2025/nov/19/comey-indictment-grand-jury",
    "image": "https://media.guim.co.uk/f7892eb7acc8dbef5915336bda11e62e846c983d/1556_39_2910_2328/500.jpg",
    "summary": "Federal lawyers have made a concession that complicates the prosecution of the former FBI director. This development adds to the growing challenges faced in the legal proceedings against him. The situation has raised concerns about the viability of the case moving forward.",
    "published": "2025-11-19T22:33:28Z"
  },
  {
    "title": "Arsenal 2-1 Real Madrid: Women’s Champions League – as it happened",
    "url": "https://www.theguardian.com/football/live/2025/nov/19/arsenal-v-real-madrid-womens-champions-league-live",
    "image": "https://media.guim.co.uk/dec7484751b117c9ce2b075127e693073dd0362c/1777_705_2432_1946/500.jpg",
    "summary": "Alessia Russo scored two goals to help Arsenal secure a comeback victory against Real, reigniting their title defense. The match was closely monitored by Scott Murray, who provided a minute-by-minute report. Arsenal's performance showcased their resilience and determination in the competition.",
    "published": "2025-11-19T22:27:24Z"
  }
]