[
  {
    "title": "Australia politics live: PM under pressure over inaction on gambling as question time begins",
    "url": "https://www.theguardian.com/australia-news/live/2025/aug/28/australian-politics-live-usman-khawaja-gambling-ads-anthony-albanese-sussan-ley-labor-coalition-question-time-ntwnfb",
    "image": "https://media.guim.co.uk/19679d88f2fa52258c97f0d478c15f2668679d5e/524_0_5242_4194/500.jpg",
    "summary": "I'm sorry, but I need more context or content to summarize. Please provide the details or text you'd like me to summarize.",
    "published": "2025-08-28T04:40:20Z"
  },
  {
    "title": "Porepunkah police shooting live updates: Victoria police ‘throwing everything’ at manhunt for suspect as search enters day three – latest news",
    "url": "https://www.theguardian.com/australia-news/live/2025/aug/28/porepunkah-shooting-live-updates-victoria-police-manhunt-latest-news-ntwnfb",
    "image": "https://media.guim.co.uk/7ed4d8a89b73c6845e3e574cbbfbe8b80c969e03/608_240_3244_2596/500.jpg",
    "summary": "I'm sorry, but I can't summarize news or content without more specific information or context. Please provide details about the news article or topic you'd like me to summarize!",
    "published": "2025-08-28T04:40:08Z"
  },
  {
    "title": "Samoa’s election: Personal rivalries, geopolitical tensions and everything else you need to know",
    "url": "https://www.theguardian.com/world/2025/aug/28/samoa-election-personal-rivalries-geopolitical-tensions-what-you-need-to-know",
    "image": "https://media.guim.co.uk/f34df35fa04a34cbd1da0d5ac47aef3ea0e3b236/0_0_4320_3456/500.jpg",
    "summary": "Samoa is set to hold parliamentary elections on Friday amid ongoing political turmoil. The elections follow a period of instability that has affected the country's governance. Voters will have the opportunity to shape the future of their leadership during this critical moment.",
    "published": "2025-08-28T04:38:25Z"
  },
  {
    "title": "Country diary: The sight – and smell – of a habitat success story | Paul Evans",
    "url": "https://www.theguardian.com/environment/2025/aug/28/country-diary-the-sight-and-smell-of-a-habitat-success-story",
    "image": "https://media.guim.co.uk/f5bd5c2d93c80fd9c98f509d59e0ed56b596b856/0_0_3780_3024/500.jpg",
    "summary": "The Stiperstones nature reserve in Shropshire has expanded to include two sites from a community organization. This development emphasizes a commitment to restoration in addition to conservation efforts. The initiative aims to enhance the area's natural beauty and biodiversity.",
    "published": "2025-08-28T04:30:22Z"
  },
  {
    "title": "Meet the water sommeliers: they believe H₂O can rival wine – but would you pay £19 a bottle?",
    "url": "https://www.theguardian.com/lifeandstyle/2025/aug/28/water-sommeliers-rival-wine-terroir",
    "image": "https://media.guim.co.uk/ba53092ded80cf92963ffcfe8e5473969a00f9e0/0_1233_5334_4265/500.jpg",
    "summary": "A restaurant in Cheshire, England, has introduced a water menu, similar to initiatives by various US establishments. This concept raises the question of whether it's possible to distinguish between different water sources and their unique terroirs. The trend reflects a growing interest in the nuances of water, similar to wine tasting.",
    "published": "2025-08-28T04:00:21Z"
  }
]