[
  {
    "title": "Reeves says she did not lie about public finances amid row over deficit claims – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/nov/30/rachel-reeves-defend-budget-deficit-claims-keir-starmer-your-party-uk-politics-live",
    "image": "https://media.guim.co.uk/08cc47bf62ec61873cf294b0f89ab9be938f866d/371_0_2500_2000/500.jpg",
    "summary": "Chancellor faced intense questioning on Sunday morning shows regarding allegations of misleading the public about the economy's condition. Critics demanded clarity on the government's economic policies and their impact on citizens. The Chancellor defended her statements, claiming transparency in communication.",
    "published": "2025-11-30T09:15:31Z"
  },
  {
    "title": "Chelsea v Arsenal buildup, Slot under pressure, Frank angry at fan boos – matchday live",
    "url": "https://www.theguardian.com/sport/live/2025/nov/30/chelsea-v-arsenal-buildup-slot-under-pressure-at-liverpool-and-more-matchday-live",
    "image": "https://media.guim.co.uk/736869e9c95c2794ff7aebf250ca9d6babbee4aa/0_0_5000_4000/500.jpg",
    "summary": "John Brewin will host a segment featuring news and discussions in anticipation of the day's events. Tune in for insights and analysis leading up to the action. Don't miss the opportunity to engage in the conversation!",
    "published": "2025-11-30T09:13:18Z"
  },
  {
    "title": "‘I sang karaoke with Novak Djokovic – a surreal experience’: Jacob Collier’s honest playlist",
    "url": "https://www.theguardian.com/music/2025/nov/30/jacob-collier-honest-playlist-music-jazz-earth-wind-fire-bon-jovi-laura-mvula",
    "image": "https://media.guim.co.uk/b5fe0bf4ca4f6cc74df91cd35998fe85ccd0ecea/0_0_6466_5172/500.jpg",
    "summary": "A musical prodigy, who discovered Stevie Wonder at the age of two and showcased his talent by dancing to Brazilian jazz at a Grammys afterparty, has shared his opinion on the best song in the world. His journey reflects a deep appreciation for music from an early age. The specific song he considers the best, however, remains undisclosed.",
    "published": "2025-11-30T09:00:01Z"
  },
  {
    "title": "Bridge to the past: JR to wrap Pont Neuf again, 40 years after artistic forebears",
    "url": "https://www.theguardian.com/world/2025/nov/30/bridge-to-the-past-jr-to-wrap-pont-neuf-again-40-years-after-artistic-forebears",
    "image": "https://media.guim.co.uk/3377cd313b1f1dbeb7ff5f93ac6700e713f76eeb/903_0_6830_5464/500.jpg",
    "summary": "A French artist is set to create a tribute to renowned artists Christo and Jeanne-Claude by covering a bridge over the Seine River. The project aims to pay homage to their iconic wrapping art style. Details about the installation and its execution are yet to be revealed.",
    "published": "2025-11-30T09:00:01Z"
  },
  {
    "title": "Head ready to open again in second Ashes Test and says flexible batters will be key",
    "url": "https://www.theguardian.com/sport/2025/nov/30/travis-head-second-ashes-test-batting-opener-felxibility-key",
    "image": "https://media.guim.co.uk/3b7a0db9728c5e9eb6e747b3cb9e2298c7ec30fe/594_0_4630_3704/500.jpg",
    "summary": "Travis Head believes that the future of Test cricket depends on versatile batters who can adapt to different roles. He arrived in Brisbane emphasizing the need for flexibility in batting positions. His insights reflect a shift in the approach to the game, highlighting the importance of adaptability.",
    "published": "2025-11-30T08:57:04Z"
  }
]