[
  {
    "title": "Australia v India: fourth men’s Twenty20 international – live",
    "url": "https://www.theguardian.com/sport/live/2025/nov/06/australia-v-india-mens-cricket-twenty20-international-live-updates",
    "image": "https://media.guim.co.uk/0c846dcdf853d381eb9243098543a1c27173fac5/481_0_4583_3666/500.jpg",
    "summary": "Australia is chasing 168 runs to win the T20 match on the Gold Coast, with the series currently tied at 1-1. Martin Pegan will provide updates throughout the game. The tension builds as both teams vie for victory.",
    "published": "2025-11-06T11:17:14Z"
  },
  {
    "title": "Senate to vote on legislation to stop unauthorized war against Venezuela – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/nov/06/donald-trump-government-shutdown-venezuela-senate-vote-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/1b960dceb5220fd36f347168fab24bb92335aedb/317_0_4234_3387/500.jpg",
    "summary": "A bipartisan group of lawmakers has introduced a proposal in response to reports that the Trump administration is contemplating domestic land strikes. The initiative aims to address concerns over the use of military force within the U.S. The proposal highlights the need for legislative oversight and safeguards regarding such actions.",
    "published": "2025-11-06T11:16:50Z"
  },
  {
    "title": "Prison governors criticise Tories for exploiting release errors, saying long-term underfunding to blame – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/nov/06/prisoner-release-david-lammy-latest-live-politics-news-updates",
    "image": "https://media.guim.co.uk/b1eb6b85baa765fd6ab0b47925c0f19673edaba5/427_67_3838_3071/500.jpg",
    "summary": "Prison governors in England have criticized the Conservative government's stance, labeling it as \"disingenuous.\" They argue that the austerity measures implemented over recent years have negatively impacted the prison system. The governors express concern over the consequences of budget cuts on safety and rehabilitation efforts.",
    "published": "2025-11-06T11:13:29Z"
  },
  {
    "title": "Bank of England to make ‘finely balanced decision’ on interest rates today; UK construction activity tumbles – business live",
    "url": "https://www.theguardian.com/business/live/2025/nov/06/bank-of-england-interest-rates-andrew-bailey-stock-markets-pound-budget-business-live-news",
    "image": "https://media.guim.co.uk/cf2749c6401a2fc1124fba5bf11661e1d65ffbe6/1032_0_5908_4727/500.jpg",
    "summary": "Analysts are predicting that the Bank of England (BoE) may lower interest rates in its latest decision. This comes amid ongoing economic and financial developments. Rolling coverage continues to track these updates closely.",
    "published": "2025-11-06T11:12:53Z"
  },
  {
    "title": "US ends deportation protections for South Sudanese nationals",
    "url": "https://www.theguardian.com/us-news/2025/nov/06/us-ends-deportation-protections-for-south-sudanese-nationals",
    "image": "https://media.guim.co.uk/41f1f918dbec6a774dd6ba11c86a1552744a18af/685_0_4583_3667/500.jpg",
    "summary": "South Sudanese individuals with temporary protected status are now given a 60-day deadline to depart the U.S. or face potential deportation. This decision affects many who have relied on this status for refuge. The move has raised concerns about the impact on affected communities.",
    "published": "2025-11-06T11:12:43Z"
  }
]