[
  {
    "title": "Jon Stewart on US violence: ‘These mass shootings don’t fit neatly into our left-right paradigm’",
    "url": "https://www.theguardian.com/culture/2025/sep/30/jon-stewart-mass-shootings-trump",
    "image": "https://media.guim.co.uk/582d9adb23e2495a01574e09d30a4ce0b5e154ec/633_110_2014_1611/500.jpg",
    "summary": "Late-night hosts tackled the political blame game surrounding mass shootings, highlighting how both parties shift responsibility in the aftermath. They also critiqued former President Trump's controversial AI-generated video promoting a conspiracy theory about medical treatments. The commentary emphasized the absurdity of the rhetoric and the need for accountability.",
    "published": "2025-09-30T15:16:27Z"
  },
  {
    "title": "Nigel Farage ‘doesn’t like Britain’, Starmer tells Labour conference – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/30/labour-conference-starmer-speech-streeting-nhs-reform",
    "image": "https://media.guim.co.uk/a533235f15b2adce2c55c64678e3737f52da87c6/836_95_3626_2901/500.jpg",
    "summary": "The Prime Minister criticized Reform UK's migration plan, labeling it as a barrier to national renewal. He emphasized that economic growth is essential for overcoming societal divisions. The comments reflect a commitment to a more inclusive approach to migration and economic policy.",
    "published": "2025-09-30T15:16:07Z"
  },
  {
    "title": "Second victim dies following shooting at Texas immigration facility",
    "url": "https://www.theguardian.com/us-news/2025/sep/30/victim-dies-dallas-ice-facility-shooting-miguel-angel-garcia-hernandez",
    "image": "https://media.guim.co.uk/e4c1989dae76bb3cc08ca8fcd86f94a3bf2e9424/0_0_1200_960/500.jpg",
    "summary": "Miguel Ángel García-Hernández, a father of four, passed away after being taken off life support. He had sustained injuries that ultimately led to his death. The incident highlights the tragic impact on his family and community.",
    "published": "2025-09-30T15:14:32Z"
  },
  {
    "title": "Trump claims US faces ‘invasion from within’ in address to military leaders after Hegseth declares war on diversity efforts – live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/30/us-government-shutdown-funding-trump-vance-portland-hegseth-latest-updates",
    "image": "https://media.guim.co.uk/7abaa73b508dc9013a15372c92d23b273f4d4068/809_0_5001_4000/500.jpg",
    "summary": "During an event in Virginia, US President Biden urged hundreds of military leaders to help \"straighten out\" American cities. This statement followed Defense Secretary Lloyd Austin's controversial remarks about \"fat troops\" and the need for improved fitness. The comments sparked discussions about military readiness and societal issues.",
    "published": "2025-09-30T15:13:21Z"
  },
  {
    "title": "Putin ‘in his heart of hearts’ knows he cannot win in Ukraine, US special envoy says – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/sep/30/europe-russia-drones-ukraine-rutte-von-der-leyen-poland-kellogg-latest-updates",
    "image": "https://media.guim.co.uk/f23ed12c345d47c250ad1b2031d9df924af6ba6e/406_0_1645_1317/500.jpg",
    "summary": "Keith Kellogg, speaking at the Warsaw Security Forum, stated that the war in Ukraine is \"unwinnable\" for Russian President Vladimir Putin. He emphasized the challenges faced by Russia in achieving its objectives in the conflict. Kellogg's comments reflect growing skepticism about Russia's military strategy and prospects in Ukraine.",
    "published": "2025-09-30T15:12:16Z"
  }
]