[
  {
    "title": "US Open tennis 2025 women’s semi-finals: Osaka v Anisimova; Sabalenka beats Pegula – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/04/us-open-tennis-womens-semi-finals-sabalenka-pegula-osaka-anisimova-live",
    "image": "https://media.guim.co.uk/edcae77cca34ff0c5497777d09ca502261407bd0/198_0_2791_2233/500.jpg",
    "summary": "Beau Dure is providing live updates on the women’s singles semi-finals at Flushing Meadows. Fans can follow the latest developments and key moments of the matches. Stay tuned for in-depth coverage and insights throughout the event.",
    "published": "2025-09-05T04:37:50Z"
  },
  {
    "title": "Australia news live: Alan Joyce secures final $3.8m bonus; man caught riding motorbike at 218km/hr on Queensland highway",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/05/australia-news-live-albanese-trump-tariffs-meeting-porepunkah-police-officer-funerals-ntwnfb",
    "image": "https://media.guim.co.uk/780c7fe0e8da9491cfad02181153bf2b6896bdc9/745_0_6008_4807/500.jpg",
    "summary": "I'm sorry, but I need the specific news content you're referring to in order to provide a summary. Please share the details or text you'd like me to summarize!",
    "published": "2025-09-05T04:35:54Z"
  },
  {
    "title": "Country diary: Tiny polished pebbles with a big appetite | Claire Stares",
    "url": "https://www.theguardian.com/environment/2025/sep/05/country-diary-tiny-polished-pebbles-with-a-big-appetite",
    "image": "https://media.guim.co.uk/fd4ea3861fc720b03bddab45ac8af9ddda2ff760/566_0_5200_4160/500.jpg",
    "summary": "In Langstone, Hampshire, a neighbor's garden sparked an investigation that revealed a striking insect not found in local field guides. The insect identified is the alder leaf beetle. This discovery highlights the potential for uncharted species in familiar areas.",
    "published": "2025-09-05T04:30:14Z"
  },
  {
    "title": "Eagles squeeze past Cowboys as Carter ejected for spitting on Prescott six seconds into season",
    "url": "https://www.theguardian.com/sport/2025/sep/04/jalen-carter-ejection-eagles-cowboys-spit-dak-prescott",
    "image": "https://media.guim.co.uk/4fae07a4b299038a6c28f10efde9977d498d5799/440_10_2685_2149/500.jpg",
    "summary": "Philadelphia Eagles defensive tackle Jalen Carter was ejected from the NFL season opener just moments into the game for spitting on Dallas Cowboys quarterback Dak Prescott. The incident added controversy to the matchup between the two rival teams. Carter's actions drew immediate attention and led to discussions on sportsmanship in the league.",
    "published": "2025-09-05T04:25:32Z"
  },
  {
    "title": "It’s the big fat Greek farming scandal – devised by the political elite and paid for by ordinary people | Alexander Clapp",
    "url": "https://www.theguardian.com/commentisfree/2025/sep/05/greek-farming-political-elite-eu-subsidy-scandal-greece",
    "image": "https://media.guim.co.uk/c036eebb6447fdf9ed06accc8dc6ae176bd96753/436_0_6139_4912/500.jpg",
    "summary": "Journalist Alexander Clapp highlights a significant EU subsidy scandal that exposes the inner workings of power in Greece. The scandal unveils accountability issues and the intricate relationships between political entities and financial support. This revelation prompts a deeper analysis of corruption and governance in the region.",
    "published": "2025-09-05T04:00:18Z"
  }
]