[
  {
    "title": "World Athletics Championships 2025: 100m finals, men’s 10,000m and more – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/14/world-athletics-championships-2025-100m-finals-mens-10000m-and-more-live",
    "image": "https://media.guim.co.uk/a1a0e746103a19e554a4d017d910cf21fc90017d/393_0_5284_4227/500.jpg",
    "summary": "Daniel Harris is covering a bustling evening in Tokyo where numerous medals are at stake. The latest updates on the competitions will be provided. Stay tuned for highlights and results from the events.",
    "published": "2025-09-14T10:30:21Z"
  },
  {
    "title": "‘He’s way better than Mayweather’: Crawford hailed by Canelo after signature win",
    "url": "https://www.theguardian.com/sport/2025/sep/14/terence-crawford-canelo-alvarez-boxing-quotes-reaction",
    "image": "https://media.guim.co.uk/fe611256e42357b2a8d26f709e6c77e5c53afc05/105_0_4143_3313/500.jpg",
    "summary": "Terence Crawford expressed that his win over Canelo Álvarez serves as vindication after facing years of skepticism. Meanwhile, Canelo acknowledged his struggle, stating he couldn't find a way to counter Crawford's strategy. The fight highlighted Crawford's skill and raised questions about Canelo's approach.",
    "published": "2025-09-14T10:28:32Z"
  },
  {
    "title": "Wilder to return at Sheffield United after Sellés sacking, Manchester derby buildup – matchday live",
    "url": "https://www.theguardian.com/football/live/2025/sep/14/manchester-derby-buildup-wsl-news-and-a-championship-grudge-match-matchday-live",
    "image": "https://media.guim.co.uk/2eac89fde28be8c000bdf9ac32bb41c35de3c356/0_0_5000_4000/500.jpg",
    "summary": "Stay updated with the latest developments in European football as matches unfold and teams compete in various leagues. Key events and player performances are making headlines on this action-packed day. Don't miss out on the thrilling moments and results from across the continent.",
    "published": "2025-09-14T10:28:16Z"
  },
  {
    "title": "Sinfonia of London – weapons-grade energy and contagious dynamism",
    "url": "https://www.theguardian.com/music/2025/sep/14/sinfonia-of-london-proms-john-wilson-james-ehnes",
    "image": "https://media.guim.co.uk/dcff716cf81d33e483502cd40a2b1f767391a0a8/0_0_2500_2000/500.jpg",
    "summary": "Conductor John Wilson has elevated the orchestra to one of Britain’s finest. Violinist James Ehnes excelled as the soloist, delivering a performance that immediately soared. Their collaboration showcased exceptional musical talent and captivating chemistry.",
    "published": "2025-09-14T10:25:44Z"
  },
  {
    "title": "Scale of ‘Unite the Kingdom’ march shows free speech ‘alive and well’ in UK, says minister – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/14/unite-the-kingdom-march-tommy-robinson-peter-mandelson-labour-deputy-leader-uk-politics-live-news-updates",
    "image": "https://media.guim.co.uk/a6ea2ece90b20af5d61e2c8a2de484f03c6dee4e/223_0_2094_1675/500.jpg",
    "summary": "Peter Kyle expressed that he was not troubled by the large far-right protest organized by Tommy Robinson. However, he condemned the violence directed towards the police during the event. Kyle's comments highlight a distinction between the protest itself and the unacceptable actions against law enforcement.",
    "published": "2025-09-14T10:21:42Z"
  }
]