[
  {
    "title": "Liverpool v Arsenal: Premier League updates – live",
    "url": "https://www.theguardian.com/football/live/2025/aug/31/liverpool-v-arsenal-premier-league-updates-live",
    "image": "https://media.guim.co.uk/3ac7f1dee16a1c1efc2a0d0e68b59ebce061f03c/201_0_2409_1928/500.jpg",
    "summary": "Will Unwin provides real-time updates and in-depth coverage of the standout match in the Premier League this weekend. Fans can stay informed with minute-by-minute reporting throughout the game. Key highlights and analysis will be available as the action unfolds.",
    "published": "2025-08-31T16:39:18Z"
  },
  {
    "title": "Superchargers cruise past Brave to clinch Women’s Hundred title",
    "url": "https://www.theguardian.com/sport/2025/aug/31/northern-superchargers-southern-brave-women-hundred-final-match-report",
    "image": "https://media.guim.co.uk/ba7a991c6832ed930ea4b72b94b7212fdd0adea4/349_0_4582_3666/500.jpg",
    "summary": "Northern Superchargers clinched the Women's Hundred title with a decisive seven-wicket victory over Southern Brave in the final held at Lord’s. This win marks a significant achievement for the Superchargers in the tournament. The match showcased impressive performances from the players, leading to a memorable championship victory.",
    "published": "2025-08-31T16:36:04Z"
  },
  {
    "title": "US Open tennis 2025: Jessica Pegula, Carlos Alcaraz, Aryna Sabalenka in action on day eight – live",
    "url": "https://www.theguardian.com/sport/live/2025/aug/31/us-open-tennis-2025-carlos-alcaraz-aryna-sabalenka-pegula-fritz-townsend-day-eight-live",
    "image": "https://media.guim.co.uk/0faac55241c851a097f26c93d7445d4667ada1b2/325_0_2560_2048/500.jpg",
    "summary": "The fourth round of singles matches is kicking off at Flushing Meadows. Fans and players are eager to follow the latest developments in the tournament. Excitement builds as the competition intensifies.",
    "published": "2025-08-31T16:35:49Z"
  },
  {
    "title": "John Cruickshank obituary",
    "url": "https://www.theguardian.com/world/2025/aug/31/john-cruickshank-obituary",
    "image": "https://media.guim.co.uk/3f92399f4e5c12c40c10ff03f16bf253f962733e/12_44_1475_1179/500.jpg",
    "summary": "The last surviving combatant who received the Victoria Cross for bravery during World War II has passed away. This individual was a symbol of courage and valor, representing the sacrifices made by many during the war. Their legacy and the stories of their heroism will continue to be honored and remembered.",
    "published": "2025-08-31T16:32:18Z"
  },
  {
    "title": "The Guardian view on the killing of Gaza’s journalists: Israel wants to stop the world from seeing what it’s doing | Editorial",
    "url": "https://www.theguardian.com/commentisfree/2025/aug/31/the-guardian-view-on-the-killing-of-gazas-journalists-israel-wants-to-stop-the-world-from-seeing-what-its-doing",
    "image": "https://media.guim.co.uk/a244372e6a7df604f08b8f6c95e382fb6c45c87c/436_0_5000_4000/500.jpg",
    "summary": "The editorial highlights the unprecedented risks faced by journalists in the current war, labeling it the most lethal period for media professionals in recent history. It underscores the alarming trend of a generation of reporters being lost due to violence and conflict. The situation raises concerns about the future of journalism and the safety of those who pursue it.",
    "published": "2025-08-31T16:30:34Z"
  }
]