[
  {
    "title": "Charlie Kirk shooting latest: FBI shares photos of person of interest after recovering rifle where suspect fled",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/11/charlie-kirk-shot-latest-news-updates-utah-university-donald-trump",
    "image": "https://media.guim.co.uk/76c0230ab358372bf02a0a59e55b7ea5d8ab10ca/0_399_1092_873/500.jpg",
    "summary": "The FBI discovered a high-powered bolt action rifle in a wooded area during their investigation. They indicated that the suspect may have blended into the surroundings and likely appears to be of college age. Authorities are continuing their search for this individual.",
    "published": "2025-09-11T16:37:59Z"
  },
  {
    "title": "Leicestershire promoted, Nottinghamshire beat Worcs: county cricket, day four – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/11/worcestershire-v-nottinghamshire-surrey-v-warwickshire-and-more-county-cricket-day-four-live",
    "image": "https://media.guim.co.uk/c9338ed7ff2603bb7eca744ca009251feff8c0e3/51_0_2250_1800/500.jpg",
    "summary": "Leicestershire has made a triumphant return to Division One after a 22-year absence. Updates on the final day of matches are being provided by Tanya Aldred. Fans can follow the rolling report for the latest developments.",
    "published": "2025-09-11T16:37:10Z"
  },
  {
    "title": "Judge allows Trump to cut more than $1bn in National Science Foundation grants ",
    "url": "https://www.theguardian.com/us-news/2025/sep/11/trump-national-science-foundation-grants-ruling",
    "image": "https://media.guim.co.uk/64ea72954b48c5ef4c6aa8fc678506e67240127d/0_0_4561_3648/500.jpg",
    "summary": "A court has refused to grant a preliminary injunction requested by scientists aiming to stop the cancellation of over 1,600 research grants. The case concerns the potential impact on scientific work and funding. The ruling allows the grant purges to proceed without immediate legal barriers.",
    "published": "2025-09-11T16:36:12Z"
  },
  {
    "title": "No 10 says Starmer found Mandelson’s emails to Epstein ‘reprehensible’ – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/11/peter-mandelson-keir-starmer-deputy-labour-leader-uk-politics-latest-news",
    "image": "https://media.guim.co.uk/c07d84b6f076607ac3574c51f6231bdbd5c70ef6/1437_592_5194_4154/500.jpg",
    "summary": "The Prime Minister's office has consistently refused to confirm whether the PM was misled by Peter Mandelson, even after multiple inquiries. This refusal has led to ongoing speculation and scrutiny regarding the nature of their communications. The situation highlights tensions within political discourse and transparency.",
    "published": "2025-09-11T16:33:57Z"
  },
  {
    "title": "Belarus frees 52 political prisoners, including foreigners, after visit by US delegation",
    "url": "https://www.theguardian.com/world/2025/sep/11/belarus-frees-political-prisoners-foreigners-us-visit",
    "image": "https://media.guim.co.uk/6e8a537607f4e4dc7415d556ec99e5b07e304fe3/168_0_1625_1300/500.jpg",
    "summary": "The recent government action is perceived as a strategy to gain favor with the United States and seek relief from sanctions. This move occurs amidst ongoing suppression of dissent within the country. Observers suggest it reflects the regime's attempt to navigate international relations while maintaining internal control.",
    "published": "2025-09-11T16:31:43Z"
  }
]