[
  {
    "title": "Gaza ceasefire live: Hamas says it will hand over another hostage body as tensions over truce continue",
    "url": "https://www.theguardian.com/world/live/2025/oct/20/gaza-ceasefire-israel-hamas-palestine-hostages-middle-east-crisis-live-news-updates",
    "image": "https://media.guim.co.uk/316802601e064216e8c1e9cbe24b44242eaaaa44/735_0_4583_3667/500.jpg",
    "summary": "A group has announced that it will release a body on Monday evening, amid growing outrage in Israel over delays in returning a hostage. The situation has sparked significant public and governmental anger. The decision aims to address the escalating tensions surrounding the hostage issue.",
    "published": "2025-10-20T15:17:42Z"
  },
  {
    "title": "No Chardins? No Leonardos? We’re lucky the Louvre raiders had dreadful taste in art",
    "url": "https://www.theguardian.com/artanddesign/2025/oct/20/louvre-art-thieves-royal-chardins-leonardos-dreadful-taste",
    "image": "https://media.guim.co.uk/fe85e34e004e732c87e75dc9d2d8f7b7b1495199/816_190_5089_4071/500.jpg",
    "summary": "Thieves targeted a museum but ignored its valuable treasures, opting instead for mundane royal artifacts. The French cultural minister referred to these items as having \"immeasurable cultural value.\" This statement raised eyebrows, questioning the true significance of the stolen goods.",
    "published": "2025-10-20T15:16:31Z"
  },
  {
    "title": "Proposed UK Islamophobia definition allows for right to criticise religion, source says",
    "url": "https://www.theguardian.com/news/2025/oct/20/proposed-uk-islamophobia-definition-free-speech-religion",
    "image": "https://media.guim.co.uk/c4e9b850a2176a326fe9309256d459c67ed5e25b/3230_1111_3490_2792/500.jpg",
    "summary": "A working group has adhered to the principle that any definitions established must not infringe upon freedom of speech. This emphasis reflects ongoing concerns about balancing regulation with individual rights. The discussions are part of broader efforts to address sensitive issues without compromising fundamental freedoms.",
    "published": "2025-10-20T15:11:44Z"
  },
  {
    "title": "Supreme court to hear case over law banning drug users from possessing guns – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/20/james-comey-donald-trump-charges-shutdown-albanese-politics-live-updates",
    "image": "https://media.guim.co.uk/9c46de837d5d17e463fae99d68c0195e902af133/241_0_2400_1921/500.jpg",
    "summary": "A court is set to examine a federal law that bans illegal drug users from possessing firearms. The review will focus on whether this restriction infringes on Second Amendment rights. The outcome could have significant implications for gun ownership and drug policy.",
    "published": "2025-10-20T15:11:44Z"
  },
  {
    "title": "Amazon Web Services outage: 6.5m reports of disruption as many websites and apps hit – business live",
    "url": "https://www.theguardian.com/business/live/2025/oct/20/china-economic-growth-gdp-low-house-prices-fall-stock-markets-ftse-business-live-news",
    "image": "https://media.guim.co.uk/c243af906d58094cf7e7337e109f67c64d00da26/492_0_4240_3393/500.jpg",
    "summary": "Several popular online services, including Fortnite, Roblox, SnapChat, Lloyds Bank, and Ring doorbells, experienced significant outages. Users reported disruptions in accessing these platforms and applications. The cause of the outages has not been confirmed as investigations are ongoing.",
    "published": "2025-10-20T15:11:10Z"
  }
]