[
  {
    "title": "Caerphilly byelection result live: Plaid Cymru beats challenge from Reform UK to win pivotal Welsh parliament vote",
    "url": "https://www.theguardian.com/politics/live/2025/oct/24/caerphilly-byelection-result-live-reform-plaid-cymru-labour-wales-welsh-government-senedd-latest-voting-news",
    "image": "https://media.guim.co.uk/878d59c2b9c9a6a5e62b56c4ff9c6d05f3ebeaf8/519_0_5608_4487/500.jpg",
    "summary": "Lindsay Whittle won the Senedd constituency, taking it from Labour. He successfully fended off a strong challenge from Reform UK. This victory marks a significant shift in the political landscape of the area.",
    "published": "2025-10-24T07:17:11Z"
  },
  {
    "title": "Retail sales in Great Britain hit highest since 2022, boosted by gold demand; Trump terminates US-Canada trade talks – business live",
    "url": "https://www.theguardian.com/business/live/2025/oct/24/retail-sales-gold-demand-trump-canada-trade-us-inflation-ftse-stock-markets-business-live-news",
    "image": "https://media.guim.co.uk/1fe2695c097e19551f1cb1918df1d324fbc4071c/329_0_5840_4672/500.jpg",
    "summary": "Stay updated with continuous coverage of the latest developments in the economy and financial markets. Key events and trends are highlighted as they unfold. This ongoing report aims to provide insights and analysis for investors and the general public.",
    "published": "2025-10-24T07:11:36Z"
  },
  {
    "title": "Sports quiz of the week: Arsenal, Ashes, Ange Postecoglou and a new season",
    "url": "https://www.theguardian.com/sport/2025/oct/24/sports-quiz-week-arsenal-ashes-ange-postecoglou-football-rugby-boxing-cricket",
    "image": "https://media.guim.co.uk/8f6ef7532bd6a676bb8ddcb72450d21552ab2d15/0_0_5000_4000/500.jpg",
    "summary": "Major developments are taking place in various sports, including football, rugby, gymnastics, boxing, cricket, and motor sport. Fans are encouraged to stay updated on the latest news and highlights. Coverage spans significant events, performances, and results across these disciplines.",
    "published": "2025-10-24T07:01:36Z"
  },
  {
    "title": "The epic three-way F1 title tussle at the Mexico Grand Prix … in 1964",
    "url": "https://www.theguardian.com/sport/2025/oct/24/the-epic-three-way-f1-title-tussle-at-the-mexico-grand-prix-in-1964",
    "image": "https://media.guim.co.uk/9d7e7fe116114ea76d1db20b3d60bed2a0bb7de8/555_0_4462_3570/500.jpg",
    "summary": "In an excerpt from his upcoming book, a Formula One correspondent reflects on a historic race featuring Graham Hill, John Surtees, and Jim Clark. He draws parallels between that memorable event and the current year's championship battle. The comparison highlights the enduring excitement and competitiveness of Formula One racing through the years.",
    "published": "2025-10-24T07:01:36Z"
  },
  {
    "title": "Grooming gang survivors risk becoming pawns in a political game that is no place for vulnerable people | Gaby Hinsliff",
    "url": "https://www.theguardian.com/commentisfree/2025/oct/24/grooming-gang-survivors-vulnerable-people-inquiry",
    "image": "https://media.guim.co.uk/76242c545ee97ffb0d747108270a5f807cd747b1/0_0_5000_4000/500.jpg",
    "summary": "Gaby Hinsliff highlights that the turmoil in the inquiry reflects a broader issue of diminishing trust in public institutions. She warns that such a lack of confidence, coupled with political maneuvering for advantage, results in governmental paralysis. This situation serves as a cautionary tale for the implications of eroding trust in public governance.",
    "published": "2025-10-24T07:00:37Z"
  }
]