[
  {
    "title": "Medvedev, Tsitsipas: why does anger keep boiling over at US Open?",
    "url": "https://www.theguardian.com/sport/2025/aug/30/anger-keeps-boiling-over-at-a-tempestuous-flushing-meadows",
    "image": "https://media.guim.co.uk/b54ee53a2b9b582f610c5b386ad436237387a19d/434_0_4339_3471/500.jpg",
    "summary": "At the U.S. Open in Flushing Meadows, players often experience heightened tempers due to the intense atmosphere and the pressure of the end-of-season stakes. The lively crowds in New York contribute to the emotional climate on the court. These factors combine to create an environment where tensions frequently rise among competitors.",
    "published": "2025-08-30T22:00:37Z"
  },
  {
    "title": "Pep Guardiola confident of good season for Manchester City after seeing improvement",
    "url": "https://www.theguardian.com/football/2025/aug/30/pep-guardiola-confident-of-good-season-for-manchester-city-after-seeing-improvement",
    "image": "https://media.guim.co.uk/0893d2608be4fd471e5b2c718723a776e0771e52/248_0_2490_1992/500.jpg",
    "summary": "Pep Guardiola expressed optimism about his Manchester City players' performance in training, noting their efforts to adopt his tactical approach. He feels encouraged by their dedication and progress. Guardiola's comments reflect his satisfaction with the team's readiness ahead of upcoming matches.",
    "published": "2025-08-30T21:30:11Z"
  },
  {
    "title": "US Open tennis 2025: Sinner survives, Gauff and Osaka set up last-16 meeting – as it happened",
    "url": "https://www.theguardian.com/sport/live/2025/aug/30/us-open-tennis-2025-gauff-sinner-osaka-day-seven-live",
    "image": "https://media.guim.co.uk/8ed068ceffbfe9d884edfeb9090173a6dba5e586/70_0_4864_3891/500.jpg",
    "summary": "Jannik Sinner emerged victorious after a challenging four-set match against Denis Shapovalov. Coco Gauff and Naomi Osaka also secured hard-fought wins in their respective matches. The players showcased resilience and determination in their performances.",
    "published": "2025-08-30T21:29:25Z"
  },
  {
    "title": "USA 31-31 Australia: 2025 Women’s Rugby World Cup – as it happened",
    "url": "https://www.theguardian.com/sport/live/2025/aug/30/usa-v-australia-live-2025-womens-rugby-world-cup-wallaroos-eagles-usa-vs-aus-latest-score-updates",
    "image": "https://media.guim.co.uk/6530e1e1ccef0046ea3776de8c691dcb735f39a7/876_0_4489_3592/500.jpg",
    "summary": "The Eagles and Wallaroos showcased an exciting match, each scoring five tries. This thrilling contest played a crucial role in maintaining both teams' quarter-final aspirations. The intense competition highlighted the resilience and skill of both sides.",
    "published": "2025-08-30T21:01:28Z"
  },
  {
    "title": "Australia and USA draw thriller to bring belated jeopardy to Rugby World Cup",
    "url": "https://www.theguardian.com/sport/2025/aug/30/usa-australia-womens-rugby-world-cup-match-report",
    "image": "https://media.guim.co.uk/033eef08f7146f3e56afd58dda2dd925feadec8d/399_0_3628_2903/500.jpg",
    "summary": "Australia and the USA played to a dramatic 31-31 draw in York, intensifying the race for quarter-final qualification in Pool A. The result leaves England in a strong position, while both teams now face uncertainty regarding their advance in the tournament. The outcome sets up a thrilling conclusion to the qualifying rounds.",
    "published": "2025-08-30T20:57:53Z"
  }
]