[
  {
    "title": "Donald Trump says rare earths dispute ‘settled’ after Xi Jinping meeting in South Korea – live updates",
    "url": "https://www.theguardian.com/world/live/2025/oct/30/donald-trump-xi-jinping-meeting-live-updates",
    "image": "https://media.guim.co.uk/bd1c513361c5ea2ab97bd963b56b8b81e60cde38/0_1161_5159_4127/500.jpg",
    "summary": "The recent summit on the sidelines of APEC marked the first meeting between US and Chinese leaders since 2019. This gathering follows a period of heightened tensions exacerbated by Trump's trade war. Both sides seek to address ongoing issues and improve relations.",
    "published": "2025-10-30T07:17:46Z"
  },
  {
    "title": "Australia news live: former Adelaide MP named new ALP president; Woolworths blames weak sales growth on being ‘distracted’ by inquiries",
    "url": "https://www.theguardian.com/australia-news/live/2025/oct/30/anthony-albanese-donald-trump-meeting-murray-watt-epbc-nature-laws-press-club-parliament-labor-coalition-sussan-ley-ntwnfb",
    "image": "https://media.guim.co.uk/0ad0b4444d3e1777ae560c0b40203796b0612dca/456_0_4560_3648/500.jpg",
    "summary": "I'm sorry, but I need more details about the specific news article or event you would like me to summarize. Please provide the content or context, and I'll be happy to help!",
    "published": "2025-10-30T07:15:29Z"
  },
  {
    "title": "Prisons across NSW in lockdown after thousands of guards walk off job over violent bashing",
    "url": "https://www.theguardian.com/australia-news/2025/oct/30/strike-nsw-prisons-lockdown",
    "image": "https://media.guim.co.uk/328db45c30db89405cf25f9b59f0312af63f5fd2/0_0_3416_2733/500.jpg",
    "summary": "A strike was initiated following a court ruling that declined to extend the sentence of an inmate convicted of seriously assaulting four prison officers. The decision has sparked outrage among prison staff and advocates for officer safety. The strike highlights ongoing concerns about inmate rights versus the safety of correctional workers.",
    "published": "2025-10-30T07:06:18Z"
  },
  {
    "title": "UK woman who booked Oslo flight but did not fly loses child benefit ‘because she emigrated’",
    "url": "https://www.theguardian.com/society/2025/oct/30/uk-woman-who-booked-oslo-flight-but-did-not-fly-loses-child-benefit-because-she-emigrated",
    "image": "https://media.guim.co.uk/ae0dbe6134a628495322bfda4502168c979f0c6f/500_0_2500_2001/500.jpg",
    "summary": "Lisa Morris-Almond was informed by HMRC that there was no record of her returning to the UK; however, she did not actually make the trip. This discrepancy raises questions about HMRC's record-keeping practices. The situation highlights potential issues in tracking individuals' travel data.",
    "published": "2025-10-30T07:00:57Z"
  },
  {
    "title": "Heart the Lover by Lily King review – a love story to treasure",
    "url": "https://www.theguardian.com/books/2025/oct/30/heart-the-lover-by-lily-king-review-a-love-story-to-treasure",
    "image": "https://media.guim.co.uk/191f43d930a57f24f688dba5af6c307bdff8f5ea/5_282_1007_805/500.jpg",
    "summary": "A companion novel to \"Writers & Lovers,\" this witty story explores the journey of college romance evolving into the complexities of midlife. The narrative balances humor with deeper emotional themes. Readers can expect a charming yet profound reflection on love and growth through different life stages.",
    "published": "2025-10-30T07:00:57Z"
  }
]