[
  {
    "title": "Going extinct ‘right under our noses’: the quiet plight of Australia’s rarest bird of prey",
    "url": "https://www.theguardian.com/environment/2025/oct/06/going-extinct-right-under-our-noses-the-quiet-plight-of-australias-rarest-bird-of-prey",
    "image": "https://media.guim.co.uk/f2f84e581592dc23cae0a1486e767065639f2f2a/208_130_1266_1013/500.jpg",
    "summary": "The red goshawk, now confined to Australia's tropical north, is facing significant decline due to climate change and habitat destruction. Its mysterious nature makes its reduction in numbers particularly concerning. Conservation efforts are urgently needed to protect this vulnerable species.",
    "published": "2025-10-06T04:19:23Z"
  },
  {
    "title": "News live: Australia and PNG sign defence treaty; Broncos double in market value after $50m grand final boost",
    "url": "https://www.theguardian.com/australia-news/live/2025/oct/06/australia-news-live-queensland-bushfire-danger-warnings-moreton-island-croydon-park-shooting-sydney-anthony-albanese-sussan-ley-andrew-hastie-labor-liberal-ntwnfb",
    "image": "https://media.guim.co.uk/d76a16ba695ef1814e4cf64bbeeb0394bf113bdd/312_0_3119_2496/500.jpg",
    "summary": "I'm sorry, but I cannot access live news updates. However, if you provide me with the content or key details of the news, I can help summarize it in three lines.",
    "published": "2025-10-06T04:18:50Z"
  },
  {
    "title": "OpenAI promises more ‘granular control’ to copyright owners after Sora 2 generates videos of popular characters",
    "url": "https://www.theguardian.com/technology/2025/oct/06/open-ai-promises-more-granular-control-copyright-owners-sora-2-generates-videos-popular-characters",
    "image": "https://media.guim.co.uk/ecbd1ba7d0a503e9aeb3bf8498f59154911f7430/758_0_4578_3662/500.jpg",
    "summary": "The company behind an AI video app has announced plans to collaborate with rights holders to block the use of specific characters from its platform upon request. This move aims to address concerns about copyright and intellectual property rights. The initiative highlights the company's commitment to respecting the rights of creators.",
    "published": "2025-10-06T04:10:05Z"
  },
  {
    "title": "MPs’ pay watchdog to give public more of a say on how politicians are funded",
    "url": "https://www.theguardian.com/politics/2025/oct/06/mps-pay-watchdog-ipsa-public-say-politicians-funded",
    "image": "https://media.guim.co.uk/4cf861fa34b646f822c91aa0770211bfeb463efe/107_0_4534_3628/500.jpg",
    "summary": "Ipsa's Karen Walker acknowledges recent significant changes to the system but believes there is still potential for further enhancements. She emphasizes the need for ongoing evaluation and adaptation. Walker encourages continued efforts to refine the system for better effectiveness.",
    "published": "2025-10-06T04:00:08Z"
  },
  {
    "title": "Solo trips abroad take off among women who seek break from work – and their families",
    "url": "https://www.theguardian.com/business/2025/oct/06/solo-trips-travel-women-break-work-family",
    "image": "https://media.guim.co.uk/83e2b4fcd25165a39e067c407379ac0377fb4313/1448_0_7240_5792/500.jpg",
    "summary": "UK travel companies are reporting an increase in solo travelers, distinguishing them from single individuals. This trend highlights a shift in customer demographics, with more people opting to travel alone for various reasons. The industry is adapting to cater to the unique needs of these solo adventurers.",
    "published": "2025-10-06T04:00:08Z"
  }
]