[
  {
    "title": "Gaza aid flotilla: more than a dozen vessels intercepted by Israeli forces; Greta Thunberg arrested – live",
    "url": "https://www.theguardian.com/world/live/2025/oct/01/israel-gaza-aid-global-sumud-flotilla-middle-east-crisis-latest-updates",
    "image": "https://media.guim.co.uk/1dc8eff7cd550ab162294c9a1525393e9bf0e162/107_0_705_564/500.jpg",
    "summary": "The Israeli foreign ministry shared a video of Greta Thunberg being arrested during a protest at sea. Approximately 500 activists were intercepted on vessels roughly 75 miles off the coast of the war-torn region. The incident highlights ongoing tensions and activism surrounding the situation in the area.",
    "published": "2025-10-02T07:18:08Z"
  },
  {
    "title": "Israel’s Gaza flotilla interception triggers protests, diplomatic expulsions and calls for strikes",
    "url": "https://www.theguardian.com/world/2025/oct/02/israels-gaza-flotilla-interception-triggers-protests-diplomatic-expulsions-and-calls-for-strikes",
    "image": "https://media.guim.co.uk/59c67179d303bb96ac6891127f808dfe8454bc05/0_0_5200_4160/500.jpg",
    "summary": "Thousands of demonstrators gathered in cities worldwide to protest after the interception of a flotilla and the arrest of activists, including Greta Thunberg. The marches aimed to highlight issues related to climate action and the rights of protesters. The global movement reflects growing frustration with governmental responses to climate change and activism.",
    "published": "2025-10-02T07:17:02Z"
  },
  {
    "title": "Thames Water creditors propose new rescue plan; Tesco ups profit outlook despite pressure on household budgets – business live",
    "url": "https://www.theguardian.com/business/live/2025/oct/02/thames-water-creditors-rescue-plan-tesco-profit-markets-business-live-news",
    "image": "https://media.guim.co.uk/55c7b125803beb3009c9c8c615dd2a3f85696bdd/458_0_4583_3667/500.jpg",
    "summary": "A rescue plan will address outstanding fines related to sewage spills, ensuring that these financial obligations are met. The initiative aims to improve environmental compliance and public health. This move reflects a commitment to rectify past infractions and promote responsible wastewater management.",
    "published": "2025-10-02T07:16:44Z"
  },
  {
    "title": "Afternoon Update: Erin Patterson to appeal convictions; PNG’s defence treaty with Australia; and Nirvana’s legal win",
    "url": "https://www.theguardian.com/australia-news/2025/oct/02/afternoon-update-thursday-ntwnfb",
    "image": "https://media.guim.co.uk/906658afbb87820cb0db4b1ffbed5be61924d62b/318_0_2985_2389/500.jpg",
    "summary": "Patterson's lawyer, Richard Edney, announced that she plans to appeal her case during a brief court session in Melbourne. The details of the appeal have not been provided. This development follows her previous legal proceedings.",
    "published": "2025-10-02T07:04:42Z"
  },
  {
    "title": "Deaths, disappearances and forced recruitment: refugees recount horrors of relentless war in Sudan",
    "url": "https://www.theguardian.com/world/2025/oct/02/refugees-recall-horrors-of-sudan-civil-war",
    "image": "https://media.guim.co.uk/0a49c0074de881b6f34705d7f7586a4f61f2e5fe/603_0_4368_3494/500.jpg",
    "summary": "Refugees fleeing from Darfur and Khartoum to South Sudan report fears of being targeted by both conflicting sides in the ongoing conflict. Their escape is driven by concerns for their safety amid escalating violence. Many are seeking refuge and security in South Sudan as the situation continues to deteriorate.",
    "published": "2025-10-02T07:00:43Z"
  }
]