[
  {
    "title": "Slavia Prague v Arsenal: Champions League – live",
    "url": "https://www.theguardian.com/football/live/2025/nov/04/slavia-prague-v-arsenal-champions-league-live",
    "image": "https://media.guim.co.uk/b0c2b5dd750021f1ab6ad389d8310c2899a1ae2b/85_0_4033_3226/500.jpg",
    "summary": "Niall McVeigh provides live updates as Arsenal aims to continue their winning streak while keeping a clean sheet. The team is focused on maintaining their strong defensive performance. Fans can follow the minute-by-minute report for all the latest developments.",
    "published": "2025-11-04T18:29:12Z"
  },
  {
    "title": "US elections 2025 live: Mamdani refuses to be ‘intimidated’ by Trump jibes as New York City, New Jersey, Virginia and California vote",
    "url": "https://www.theguardian.com/us-news/live/2025/nov/04/us-elections-2025-live-new-york-city-new-jersey-virginia-california-latest-news-updates-live",
    "image": "https://media.guim.co.uk/88a9be04ff4e347897e06aabd63cfa5e1dbf3434/293_0_2500_2000/500.jpg",
    "summary": "A New York mayoral candidate responded strongly after President Biden commented that any Jewish person voting for him would be \"a stupid person.\" The candidate emphasized the importance of diverse political choices within the Jewish community. The incident underscores tensions surrounding Jewish voting patterns and political affiliations.",
    "published": "2025-11-04T18:25:52Z"
  },
  {
    "title": "WTA Finals tennis: Sabalenka fends off Pegula; Gauff beats ailing Paolini – as it happened",
    "url": "https://www.theguardian.com/sport/live/2025/nov/04/wta-finals-tennis-coco-gauff-v-jasmine-paolini-aryna-sabalenka-v-jessica-pegula-live",
    "image": "https://media.guim.co.uk/18611c25f2c494f74c82b3c39fcaeb66b699a633/372_95_2847_2278/500.jpg",
    "summary": "Aryna Sabalenka overcame Jessica Pegula in a challenging match, winning 6-4, 2-6, 6-3. Meanwhile, Coco Gauff showcased her improved service game, defeating Jasmine Paolini 6-3, 6-2. Both players advanced to the next round of the tournament.",
    "published": "2025-11-04T18:12:08Z"
  },
  {
    "title": "Chelsea have £150m buffer against fines from FA, say football finance experts",
    "url": "https://www.theguardian.com/football/2025/nov/04/chelsea-have-150m-buffer-against-fines-from-fa-say-football-finance-experts",
    "image": "https://media.guim.co.uk/1b73a03d55c67d09da77bee8d1d4d8eb8d0930c9/0_0_4032_3226/500.jpg",
    "summary": "Recent revelations regarding violations during the Abramovich era suggest that points deductions or suspensions from competition could become more probable for the affected teams. The findings may lead to increased scrutiny and enforcement of penalties. The situation highlights the ongoing impact of past governance issues in the sport.",
    "published": "2025-11-04T18:09:50Z"
  },
  {
    "title": "NFL trade deadline: Colts land All-Pro corner Gardner from Jets in stunner",
    "url": "https://www.theguardian.com/sport/2025/nov/04/nfl-trade-deadline-colts-sauce-gardner-jets",
    "image": "https://media.guim.co.uk/8e9b2c1c16f5a323e5267db9eed10e80856c233b/912_0_4560_3648/500.jpg",
    "summary": "The Indianapolis Colts have acquired All-Pro cornerback Sauce Gardner by trading two first-round draft picks. This bold move signals their intent to make a strong push for the Super Bowl before the NFL trade deadline. Gardner's addition strengthens the Colts' defense as they aim for a championship.",
    "published": "2025-11-04T18:09:18Z"
  }
]