[
  {
    "title": "Arsenal v Manchester City: Premier League – live",
    "url": "https://www.theguardian.com/football/live/2025/sep/21/arsenal-v-manchester-city-premier-league-live-score-updates",
    "image": "https://media.guim.co.uk/a94120c03b6e67b194311a5cbdb80f4ea229284a/598_0_5000_4000/500.jpg",
    "summary": "Two title contenders face off in a crucial north London match. Rob Smyth provides a minute-by-minute report with all the latest updates. Stay tuned for highlights and key moments from the game.",
    "published": "2025-09-21T17:28:20Z"
  },
  {
    "title": "‘Nothing stops reporters’: Trump talks down Pentagon restrictions on journalists",
    "url": "https://www.theguardian.com/us-news/2025/sep/21/trump-pentagon-journalists",
    "image": "https://media.guim.co.uk/4afc710b28cecf5a60f44bdae3cbc17964f428e8/434_0_3790_3033/500.jpg",
    "summary": "The Department of Defense (DoD) has stated that journalists could lose their press passes if they refuse to sign a pledge agreeing not to disclose certain information. This move has raised concerns regarding press freedom and transparency. Critics argue that such restrictions could hinder journalistic reporting on military matters.",
    "published": "2025-09-21T17:27:04Z"
  },
  {
    "title": "Thousands gather at Charlie Kirk memorial in Arizona where Trump to pay tribute to slain organizer",
    "url": "https://www.theguardian.com/us-news/2025/sep/21/thousands-gather-at-charlie-kirk-memorial-in-arizona-where-trump-to-pay-tribute-to-slain-organizer",
    "image": "https://media.guim.co.uk/2cd9223062d8976240e0b534d940a39eed3ea688/679_0_4637_3709/500.jpg",
    "summary": "The US Secret Service is implementing a large security presence amid rising tensions. Conservatives are calling for consequences against individuals who criticized a prominent rightwing figure known for influencing youth. This situation reflects ongoing political polarization and clashes over free speech and accountability.",
    "published": "2025-09-21T17:24:11Z"
  },
  {
    "title": "Netanyahu calls UK’s Palestine recogniton ‘absurd prize for terrorism’",
    "url": "https://www.theguardian.com/world/2025/sep/21/netanyahu-uk-palestinian-recogniton-absurd-prize-terrorism",
    "image": "https://media.guim.co.uk/98327020f6d1b0bcd0bc20a82bde88bdd6da021f/250_0_1996_1597/500.jpg",
    "summary": "Opposition leader Yair Golan criticizes the government for its political recklessness amid the ongoing war in Gaza. He calls for an end to the conflict, highlighting the need for responsible governance. Golan's comments emphasize the urgency of addressing the humanitarian crisis.",
    "published": "2025-09-21T17:17:31Z"
  },
  {
    "title": "Charlie Kirk memorial latest updates: Trump and Vance to join tens of thousands of people at service for rightwing activist",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/21/charlie-kirk-funeral-memorial-time-updates-arizona",
    "image": "https://media.guim.co.uk/8f40b7af36fcf3d55bbb2ab16bd8d02e91a6811e/0_0_4355_3487/500.jpg",
    "summary": "A funeral is set to begin at 11 AM local time, with notable attendees including Erika Kirk and the President and Vice President of the United States. The event is expected to honor a significant individual. Further details about the funeral have not been disclosed.",
    "published": "2025-09-21T17:15:23Z"
  }
]