[
  {
    "title": "US Open quarter-finals: Alcaraz faces Lehecka after Pegula powers past Krejcikova – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/02/us-open-tennis-2025-pegula-alcaraz-quarter-finals-day-ten-live",
    "image": "https://media.guim.co.uk/36599a5c5aae00299ac78592ab5aba95ce82b57f/674_0_3372_2699/500.jpg",
    "summary": "Carlos Alcaraz is set to face Jiri Lehecka in an upcoming match at Flushing Meadows. This follows Jessica Pegula's victory over Barbora Krejcikova. As the tournament progresses, both players are looking to advance in the competition.",
    "published": "2025-09-02T17:30:29Z"
  },
  {
    "title": "University of Kentucky athlete charged after dead infant found hidden in closet",
    "url": "https://www.theguardian.com/us-news/2025/sep/02/university-kentucky-cheer-charged-dead-infant-closet",
    "image": "https://media.guim.co.uk/741d4c5fcc148a71b1c38d17189c4d4799e06c51/606_0_4561_3648/500.jpg",
    "summary": "Laken Ashlee Snelling, a 21-year-old cheerleader, has been charged with corpse abuse and evidence tampering. The charges stem from her involvement in a criminal investigation. Details about the case and the nature of the allegations have not been disclosed.",
    "published": "2025-09-02T17:25:59Z"
  },
  {
    "title": "Eight-year-old loses ‘significant amount of blood’ after shark bites him in Florida",
    "url": "https://www.theguardian.com/us-news/2025/sep/02/florida-key-largo-shark-bite",
    "image": "https://media.guim.co.uk/4e2969052ab8103107cd9a87ed1da0bc4c6a1457/335_0_4937_3948/500.jpg",
    "summary": "A boy was hospitalized after being bitten while snorkeling near Key Largo. Authorities reported that he survived the incident. Details on the specific circumstances of the bite have not been disclosed.",
    "published": "2025-09-02T17:25:17Z"
  },
  {
    "title": "‘Trump loses again’: California governor reacts to judge ruling that national guard in LA violated federal law – live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/02/congress-returns-government-shutdown-funding-trump-announcement-us-politics-live-latest-updates",
    "image": "https://media.guim.co.uk/ffae388bde73cc996494710c110907d41d92800c/467_224_3176_2541/500.jpg",
    "summary": "California Governor Gavin Newsom criticized former President Trump after a court confirmed that the deployment of the National Guard during immigration protests in Los Angeles was illegal. Newsom's comments underscore his ongoing opposition to Trump’s policies. The ruling highlights legal issues surrounding the federal government's response to immigration protests.",
    "published": "2025-09-02T17:18:37Z"
  },
  {
    "title": "Why trans art matters more than ever: ‘It reflects how people live and love’",
    "url": "https://www.theguardian.com/artanddesign/2025/sep/02/trans-art-artists",
    "image": "https://media.guim.co.uk/4a1d7d31a700c5fb3a0f7295072f1b41cc4dd688/350_371_2097_1677/500.jpg",
    "summary": "Following the backlash against Amy Sherald's portrait of a transgender Statue of Liberty, trans artists emphasize the significance of their art in representing current societal discussions. They argue that such works challenge traditional narratives and foster greater understanding of trans identities. The conversation highlights the crucial role of art in advocating for inclusivity and visibility in today's cultural landscape.",
    "published": "2025-09-02T17:12:00Z"
  }
]