[
  {
    "title": "We will confront Russian planes in Nato airspace, UK foreign secretary says, and warns Putin risks armed clash – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/sep/22/latest-europe-news-russia-estonia-un-united-nations-security-live-latest-updates",
    "image": "https://media.guim.co.uk/a034a60ee7b98731cd7869d36b73098b6855408f/488_0_4210_3368/500.jpg",
    "summary": "Yvette Cooper has condemned Russia for undermining the territorial integrity of sovereign nations through its incursions of fighter jets into European airspace. She highlighted the threat posed by these actions to national security and international stability. The comments underscore ongoing tensions between Russia and Europe regarding airspace violations.",
    "published": "2025-09-22T15:35:15Z"
  },
  {
    "title": "Reform UK’s immigration plans have ‘no basis in reality’, say Labour – politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/22/reform-labour-keir-starmer-nigel-farage-immigration-latest-uk-politics-updates",
    "image": "https://media.guim.co.uk/0ea9a207de8e6ff0be680ec4acab4cea10278326/625_0_4623_3698/500.jpg",
    "summary": "Nigel Farage asserts that his party could save £234 billion by eliminating the indefinite leave to remain policy. He argues that this change would significantly reduce immigration costs. The proposal aims to reshape the immigration landscape in the UK.",
    "published": "2025-09-22T15:33:36Z"
  },
  {
    "title": "Letter: Robert Redford obituary",
    "url": "https://www.theguardian.com/film/2025/sep/22/letter-robert-redford-obituary",
    "image": "https://media.guim.co.uk/717a6cb3df2ef387c04f23086bc02614363087b5/145_142_3786_3026/500.jpg",
    "summary": "Quentin Falk recalls a meeting with Robert Redford that took place over 30 years ago outside Slough. The mention highlights the long-standing connection between the two. Falk’s recollection serves as a nostalgic reminder of their earlier encounter.",
    "published": "2025-09-22T15:30:38Z"
  },
  {
    "title": "Lawmakers decry Trump’s pressure campaign on justice department to investigate his political opponents – live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/22/donald-trump-charlie-kirk-autism-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/654e1502c2ebbcd6a0e9e4aabe463a0b8d3143b8/677_0_7200_5760/500.jpg",
    "summary": "Republicans and Democrats have criticized Donald Trump's request for the attorney general to investigate political adversaries such as Letitia James, Adam Schiff, and James Comey. The bipartisan opposition highlights concerns about the politicization of the justice system. Lawmakers emphasize the potential dangers of using legal authority for personal vendettas.",
    "published": "2025-09-22T15:25:28Z"
  },
  {
    "title": "John Oliver: ‘Everyone knew the administration had it in for Kimmel’",
    "url": "https://www.theguardian.com/tv-and-radio/2025/sep/22/john-oliver-jimmy-kimmel-charlie-kirk-trump",
    "image": "https://media.guim.co.uk/dfc93968ed5f7a9fc8e84dea06c1d0683e707d79/240_0_1180_944/500.jpg",
    "summary": "In a recent segment, Last Week Tonight host John Oliver discussed the suspension of Jimmy Kimmel from his show, highlighting the potential implications for free speech and comedic expression in the U.S. Oliver raised concerns about the broader impacts on the media landscape and the chilling effects that such actions could have on entertainers and journalists. He emphasized the need to protect creative voices in a democratic society.",
    "published": "2025-09-22T15:21:41Z"
  }
]