[
  {
    "title": "New York mayor-elect Zohran Mamdani challenges Donald Trump in victory speech as Democrats win key US election races – live",
    "url": "https://www.theguardian.com/us-news/live/2025/nov/04/nyc-mayor-election-zohran-mamdani-andrew-cuomo-results-latest",
    "image": "https://media.guim.co.uk/a8a175efb88ab9a3e3fab71c8a0ee2e6bf4486ed/349_0_2972_2379/500.jpg",
    "summary": "In a recent speech, Mamdani criticized the rise of \"oligarchy and authoritarianism,\" directly addressing Trump. His remarks coincided with the Democratic Party's victories in the California redistricting vote and gubernatorial elections in New Jersey and Virginia. These wins reflect a significant political shift and potential implications for future elections.",
    "published": "2025-11-05T09:21:39Z"
  },
  {
    "title": "David Lammy to take PMQs after Reeves refuses to rule out tax rises in budget – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/nov/05/david-lammy-pmqs-rachel-reeves-tax-system-news-updates-uk-politics-live",
    "image": "https://media.guim.co.uk/ae4d07f9e23b661cba839160f2bcfe22a165d728/238_0_2578_2063/500.jpg",
    "summary": "The Deputy Prime Minister is stepping in for Keir Starmer, who is attending the Cop30 climate summit in Brazil. He will address the reactions to Reeve’s pre-budget speech from the previous day. This change in leadership highlights the government's ongoing focus on environmental issues.",
    "published": "2025-11-05T09:12:03Z"
  },
  {
    "title": "Asian chipmakers tumble in global stock sell-off amid worries over AI bubble – business live",
    "url": "https://www.theguardian.com/business/live/2025/nov/05/china-ends-tariffs-us-imports-soy-bean-levies-ms-profits-cyber-attack-business-live",
    "image": "https://media.guim.co.uk/ef313969412c0efbaaf739ff575ab84507d5bf13/268_0_4400_3521/500.jpg",
    "summary": "Deutsche Bank analysts are raising concerns about a potential equity market correction as market volatility increases. Meanwhile, China has announced the removal of tariffs on US imports, including farm products, although tariffs on soybeans remain in place. This shift in trade policy may impact economic relations and market dynamics between the two countries.",
    "published": "2025-11-05T09:10:00Z"
  },
  {
    "title": "Drones shut down Brussels airport overnight with further sightings reported over military airbases – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/nov/05/latest-europe-live-news-updates-brussels-drones-eu",
    "image": "https://media.guim.co.uk/48dd1461242e3df7968c537caedbbff535e85619/449_0_2771_2217/500.jpg",
    "summary": "Fighting has resumed in a conflict zone, but operations were interrupted on Wednesday morning. This pause is linked to a scheduled meeting of the Belgian security council. The outcomes of this meeting may influence the ongoing situation.",
    "published": "2025-11-05T09:07:05Z"
  },
  {
    "title": "Other People’s Fun by Harriet Lane review – darkly comic tale of envy and revenge in the Insta age",
    "url": "https://www.theguardian.com/books/2025/nov/05/other-peoples-fun-by-harriet-lane-review-darkly-comic-tale-of-envy-and-revenge-in-the-insta-age",
    "image": "https://media.guim.co.uk/135b98bb02ead876fae4172f15b7b095f670729c/116_954_2729_2184/500.jpg",
    "summary": "A school reunion reignites a fraught relationship between two women from different socioeconomic backgrounds. Their toxic friendship exposes the deep divide between the privileged and the less fortunate. Tensions rise as past grievances come to the forefront, challenging their bonds.",
    "published": "2025-11-05T09:00:21Z"
  }
]