[
  {
    "title": "Trump’s top media regulator says ‘I don’t think this is the last shoe to drop’ after Jimmy Kimmel’s show suspended – live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/18/jimmy-kimmel-charlie-kirk-comments-show-cancelled-suspended-monologue-trump-us-politics-live",
    "image": "https://media.guim.co.uk/ce548a40e0303a652eeab42785eb1e43085ae33c/312_0_3110_2489/500.jpg",
    "summary": "Brendan Carr criticized the indefinite suspension of Jimmy Kimmel’s late night show, arguing it reflects a broader trend of limiting the influence of U.S. media networks. He suggested that such actions undermine freedom of expression and the diversity of viewpoints in media. Carr's comments highlight concerns over editorial decisions and their impacts on public discourse.",
    "published": "2025-09-18T23:26:16Z"
  },
  {
    "title": "Australia news live: seven teenagers arrested over stabbing deaths of two Melbourne boys",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/19/australia-news-live-cheaper-energy-chris-bowen-climate-bush-search-crashed-plane-pilot-julie-bishop-ntwnfb",
    "image": "https://media.guim.co.uk/718ec7c0acd62e382d3e8cfbb999ef23d9923c9d/1009_0_5858_4687/500.jpg",
    "summary": "A major news event is currently unfolding, with updates being provided in real-time. Key developments are occurring rapidly, capturing significant public attention. Stay tuned for ongoing coverage and insights as the situation evolves.",
    "published": "2025-09-18T23:25:47Z"
  },
  {
    "title": "The Lady from the Sea review – Andrew Lincoln and Alicia Vikander make waves in magnificent rewrite",
    "url": "https://www.theguardian.com/stage/2025/sep/19/the-lady-from-the-sea-review-andrew-lincoln-alicia-vikander",
    "image": "https://media.guim.co.uk/71579d1213dd2e69669d146ce35eb5e41adce1ed/214_155_4469_3575/500.jpg",
    "summary": "Director Simon Stone's reinterpretation of Ibsen's 1888 play removes traditional elements like mysticism and mermaids, instead intensifying the psychological drama. The updated version emphasizes eco-conscious themes, reflecting contemporary concerns. This fresh take offers a more relevant perspective on the original work.",
    "published": "2025-09-18T23:01:27Z"
  },
  {
    "title": "Premier League: 10 things to look out for this weekend",
    "url": "https://www.theguardian.com/football/2025/sep/19/premier-league-10-things-to-look-out-for-this-weekend",
    "image": "https://media.guim.co.uk/32c4e46f0b2be9fe414d5b1fd92976c051217b2f/0_0_5000_4000/500.jpg",
    "summary": "Robertson appears to be a stronger option for the upcoming Merseyside derby, while Bournemouth faces a fresh challenge in their next match. Additionally, there have been protests at West Ham regarding various issues.",
    "published": "2025-09-18T23:00:28Z"
  },
  {
    "title": "Cryptic crossword No 29,804",
    "url": "https://www.theguardian.com/crosswords/cryptic/29804",
    "summary": "I'm unable to access specific content like crossword puzzles, including Cryptic crossword No 29,804. However, if you provide details or clues from it, I'd be happy to help summarize or discuss them!",
    "published": "2025-09-18T23:00:27Z"
  }
]