[
  {
    "title": "Women’s Cricket World Cup: Australia v New Zealand – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/01/womens-cricket-world-cup-live-australia-v-new-zealand",
    "image": "https://media.guim.co.uk/8248ba0f980cb50ec59536ed51c1470eed0d810b/263_0_2755_2204/500.jpg",
    "summary": "Australia begins their 50-over title defence at the Holkar Stadium in Indore. Megan Maurice is providing live updates on the match. Stay tuned for the latest developments.",
    "published": "2025-10-01T12:40:49Z"
  },
  {
    "title": "US government shutdown live: first closure since 2018 begins after funding bill fails",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/01/us-government-shutdown-update-2025-shutting-funding-trump-democrats-republicans-live-updates-latest-news",
    "image": "https://media.guim.co.uk/685443f5ce0b4b296a6b29873ed1b20e4a02d776/327_0_4844_3876/500.jpg",
    "summary": "In the Senate, competing bills were rejected as both Republicans and Democrats engaged in accusations of partisan politics. The standoff reflects deep divisions and a lack of collaboration between the parties. Efforts to advance legislation faced significant obstacles amidst the political tensions.",
    "published": "2025-10-01T12:36:23Z"
  },
  {
    "title": "Miliband vows to ban fracking, labels Reform ‘ideological extremists’ and tells Musk to ‘get the hell out of our politics’ – live",
    "url": "https://www.theguardian.com/politics/live/2025/oct/01/keir-starmer-labour-conference-nigel-farage-reform-uk-politics-latest-news-updates",
    "image": "https://media.guim.co.uk/342084aedda41105706a2e00f3ccc1823c4569fb/136_0_2330_1864/500.jpg",
    "summary": "Environmental groups have expressed support for the energy secretary's recent announcement regarding fracking. They see it as a positive step towards more sustainable energy practices. The decision reflects an acknowledgment of the environmental concerns associated with traditional energy extraction methods.",
    "published": "2025-10-01T12:35:40Z"
  },
  {
    "title": "Israeli minister says ‘last opportunity’ for Gaza City residents to flee – Middle East crisis live",
    "url": "https://www.theguardian.com/world/live/2025/oct/01/israel-gaza-offensive-benjamin-netanyahu-hamas-donald-trump-middle-east-crisis-live-news",
    "image": "https://media.guim.co.uk/5c74d93af9a3b45d92f3212627f646a7721700d4/325_0_4914_3933/500.jpg",
    "summary": "The Israeli military offensive in Gaza escalates, responding to ongoing hostilities with Hamas. Reports indicate that Hamas is planning to propose changes to former President Trump's Gaza plan. This evolving situation highlights the complexities and challenges in the region's peace efforts.",
    "published": "2025-10-01T12:32:46Z"
  },
  {
    "title": "UK fracking ban to be brought forward as Labour counters Reform promise",
    "url": "https://www.theguardian.com/environment/2025/oct/01/fracking-ban-uk-labour-counter-reform-promise",
    "image": "https://media.guim.co.uk/4c59a7c882994ee5cf6e30c5f1fd1dd56cb7ad71/133_0_1335_1068/500.jpg",
    "summary": "Ed Miliband has announced that the government will accelerate efforts to ban a controversial practice endorsed by Nigel Farage. The decision aims to address public concerns and political pressures surrounding the issue. This move aligns with the government's commitment to reform and regulatory changes.",
    "published": "2025-10-01T12:32:38Z"
  }
]