[
  {
    "title": "‘We feel betrayed’: Israeli families still seeking return of deceased hostages",
    "url": "https://www.theguardian.com/world/2025/oct/17/we-feel-betrayed-israeli-families-still-seeking-return-of-deceased-hostages",
    "image": "https://media.guim.co.uk/d6a9487f107d8792774511f04689c87c14d9808b/955_0_5000_4000/500.jpg",
    "summary": "Families of 19 missing Hamas hostages continue to experience unrelenting grief as they await news of their loved ones. The uncertainty surrounding the situation has left them in a prolonged emotional struggle. They emphasize that until all hostages are accounted for, their suffering will persist.",
    "published": "2025-10-17T15:17:25Z"
  },
  {
    "title": "‘A foot out in the cold’: leaders huddle at IMF as icy economic winds blow",
    "url": "https://www.theguardian.com/business/2025/oct/17/leaders-imf-private-credit-tax-bonds-tariff-washington",
    "image": "https://media.guim.co.uk/59672b932822b7a3bc614ccb17a9aa8d25393397/592_0_3627_2903/500.jpg",
    "summary": "At a recent meeting in Washington, concerns were raised about the state of private credit and the implications of tax and spending policies. Participants expressed anxiety over volatile bond markets and ongoing tariff issues. These factors are contributing to a complex economic landscape that requires careful navigation.",
    "published": "2025-10-17T15:14:32Z"
  },
  {
    "title": "Market sell-off calms as Trump says meeting with Xi is still on – business live",
    "url": "https://www.theguardian.com/business/live/2025/oct/17/us-dollar-worst-week-since-august-trade-tensions-stock-markets-bonds-business-live-news",
    "image": "https://media.guim.co.uk/e377b16e9d60276db23a73b8447d47e7d5b2dcec/500_0_5000_4000/500.jpg",
    "summary": "US regional bank shares rebounded from losses experienced on Thursday. This recovery coincided with former President Trump easing his previously stated threat of a 100% tariff on China. Investor sentiment improved as a result, stabilizing the banking sector.",
    "published": "2025-10-17T15:11:57Z"
  },
  {
    "title": "Postecoglou defends trophy record; Arteta backs Gyökeres, Palmer injury blow – football live",
    "url": "https://www.theguardian.com/football/live/2025/oct/17/premier-league-returns-with-liverpool-v-manchester-united-buildup-football-live",
    "image": "https://media.guim.co.uk/8dd0a07ae4a9d92cfbe69e0d8f6a283871ae11f6/0_0_3276_2621/500.jpg",
    "summary": "A rolling report is being published to provide updates and insights as the countdown begins for an action-packed weekend of football. Follow the writers for real-time coverage and analysis of the upcoming matches. Stay tuned for the latest developments in the football scene.",
    "published": "2025-10-17T15:08:36Z"
  },
  {
    "title": "‘Trump is killing poor people’: Caribbean village mourns victim of US strike",
    "url": "https://www.theguardian.com/world/2025/oct/17/trump-caribbean-venezuela-trinidad-boat-strikes",
    "image": "https://media.guim.co.uk/f903146573c57cdfeb053cef53b6dc9255f5a6b7/0_0_4505_3604/500.jpg",
    "summary": "Relatives of a Trinidadian man, believed to have been killed in a US military strike targeting an alleged drug boat, claim he was denied due process. They argue that the strike was unjustified and lacked legal accountability. The incident raises concerns about the implications of military actions in pursuit of drug-related offenses.",
    "published": "2025-10-17T15:05:04Z"
  }
]