[
  {
    "title": "US Open tennis 2025: Pegula eases past Li, Alcaraz and Sabalenka in action on day eight – live",
    "url": "https://www.theguardian.com/sport/live/2025/aug/31/us-open-tennis-2025-carlos-alcaraz-aryna-sabalenka-pegula-fritz-townsend-day-eight-live",
    "image": "https://media.guim.co.uk/3be8601df513c0f83c0b28d70f5f29c568e02379/1790_250_4332_3465/500.jpg",
    "summary": "The fourth round of singles matches is starting at Flushing Meadows, showcasing intense competition. Fans can stay updated on the latest developments and match results. Excitement builds as top players vie for a spot in the next stage of the tournament.",
    "published": "2025-08-31T18:39:25Z"
  },
  {
    "title": "Pep Guardiola says Manchester City ‘forgot to play’ in defeat at Brighton",
    "url": "https://www.theguardian.com/football/2025/aug/31/manchester-city-brighton-pep-guardiola",
    "image": "https://media.guim.co.uk/a66bd8f3ed1cf58d7976486b25d48514216a4cac/183_118_1345_1076/500.jpg",
    "summary": "Pep Guardiola expressed disappointment after Manchester City lost 2-1 to Brighton, stating his team \"forgot to play\" during the match. This defeat marks the first time the club has lost its first three league games in 21 years. The loss highlights significant struggles for the team early in the season.",
    "published": "2025-08-31T18:35:22Z"
  },
  {
    "title": "Police officer ‘punched in face’ as four arrested at London anti-asylum protest",
    "url": "https://www.theguardian.com/uk-news/2025/aug/31/police-officer-allegedly-punched-in-face-and-four-arrests-made-at-london-anti-asylum-protest",
    "image": "https://media.guim.co.uk/80b30a2cf83e95515abfdd944efe7d85c01c5fbc/433_0_5000_4000/500.jpg",
    "summary": "The Metropolitan Police reported a \"small number\" of aggressive masked protesters who disrupted a previously peaceful demonstration in the Isle of Dogs. Authorities are assessing the situation and ensuring public safety. No major incidents were reported during the event.",
    "published": "2025-08-31T18:18:32Z"
  },
  {
    "title": "Top FDA official demands removal of YouTube videos in which he criticized Covid vaccines",
    "url": "https://www.theguardian.com/us-news/2025/aug/31/fda-official-youtube-videos",
    "image": "https://media.guim.co.uk/be7750f0b599996aa2bf6d4a7688b18d98929079/462_0_4657_3725/500.jpg",
    "summary": "A new channel was established to document and preserve statements made by Trump officials during the pandemic. This initiative aims to provide a historical record of the administration's handling of the crisis. The effort reflects concerns over accountability and transparency related to the government's response.",
    "published": "2025-08-31T18:14:37Z"
  },
  {
    "title": "Former CDC official ‘only sees harm’ to public health under RFK Jr’s leadership",
    "url": "https://www.theguardian.com/us-news/2025/aug/31/cdc-demetre-daskalakis-rfk-jr-health",
    "image": "https://media.guim.co.uk/0163b0ac35ffe3e3f62334fc0538fefd79563d98/508_0_4511_3609/500.jpg",
    "summary": "Demetre Daskalakis resigned following the White House's dismissal of the CDC chief. In an interview with ABC, he warned against reversing vaccination efforts. His comments highlight concerns about potential setbacks in public health initiatives.",
    "published": "2025-08-31T17:59:35Z"
  }
]