[
  {
    "title": "Danish authorities say ‘professional actor’ responsible for airport drone attacks – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/sep/25/aalborg-airport-denmark-drones-oslo-sarkozy-meloni-news-updates-europe-live",
    "image": "https://media.guim.co.uk/4b081c645e55803d66fc7093707109bf3c7be644/532_0_3960_3168/500.jpg",
    "summary": "Denmark's Defence Minister stated that hybrid incidents are a persistent threat, following a second drone occurrence in the nation's airspace this week. In response, the country will enhance its military capabilities. These measures aim to bolster national security amid rising aerial surveillance concerns.",
    "published": "2025-09-25T08:47:05Z"
  },
  {
    "title": "Co-op reveals cyber-attack cost it £80m in profits so far; government ponders support for JLR suppliers – business live",
    "url": "https://www.theguardian.com/business/live/2025/sep/25/co-op-cyber-attack-cost-it-80m-profits-loss-government-support-jlr-suppliers-business-live-news",
    "image": "https://media.guim.co.uk/c655d5a52167670d2af5de42723cd3f8ecb6f950/588_0_4072_3257/500.jpg",
    "summary": "Co-op has reported that a recent cyberattack resulted in a loss of £206 million in revenue. The incident highlights ongoing concerns regarding cybersecurity in the retail sector. Rolling coverage will continue to monitor developments in the economic and financial landscape related to this incident.",
    "published": "2025-09-25T08:44:19Z"
  },
  {
    "title": "Nottinghamshire close on title against Warwickshire: county cricket final round – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/25/nottinghamshire-close-on-title-against-warwickshire-county-cricket-final-round-live",
    "image": "https://media.guim.co.uk/262a8e45cc6679c08f0d353e9dc445b0b4ad8200/12_0_2250_1800/500.jpg",
    "summary": "Tanya Aldred will provide real-time updates from various venues during the concluding rounds of the County Championship matches this season. Fans can expect insights and highlights as teams compete for final standings. Stay tuned for the latest developments in this thrilling conclusion to the cricket season.",
    "published": "2025-09-25T08:43:36Z"
  },
  {
    "title": "Ticketmaster forced to change how it advertises tickets after Oasis row",
    "url": "https://www.theguardian.com/music/2025/sep/25/ticketmaster-advertises-tickets-oasis-cma",
    "image": "https://media.guim.co.uk/eca4d5b12bf2a6bd269eaa54bd43c6b25f3fbfdb/485_0_6880_5504/500.jpg",
    "summary": "The UK's Competition and Markets Authority (CMA) has mandated that companies must provide clearer pricing information for fans purchasing tickets. It also emphasized the need to avoid \"misleading\" labels regarding ticket quality. The directive aims to enhance transparency and protect consumer rights in ticket sales.",
    "published": "2025-09-25T08:39:14Z"
  },
  {
    "title": "Steve Reed says Andy Burnham should stick to his Manchester job following leadership speculation – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/25/andy-burnham-steve-reed-keir-starmer-labour-news-updates-uk-politics-live",
    "image": "https://media.guim.co.uk/3d33381f6da48c2fca3926a72dc63bcfa12e069b/629_0_4303_3442/500.jpg",
    "summary": "The housing secretary expressed confidence that Manchester mayor Andy Burnham will remain committed to his position, despite reports of Labour MPs urging him to challenge Keir Starmer for leadership. This comes amid internal party discussions about leadership dynamics. Burnham's loyalty to his current role is being highlighted in light of these pressures.",
    "published": "2025-09-25T08:31:35Z"
  }
]