[
  {
    "title": "Manchester United v Chelsea: Premier League – live",
    "url": "https://www.theguardian.com/football/live/2025/sep/20/manchester-united-v-chelsea-premier-league-live",
    "image": "https://media.guim.co.uk/6f197007c28336db1801b854752935bc84a72d4d/232_158_2249_1798/500.jpg",
    "summary": "Scott Murray provides a detailed minute-by-minute report on the events unfolding at Old Trafford, highlighting a significant night for coach Ruben Amorim. The report captures key moments and developments during the game. Fans and followers are invited to stay updated on the action and Amorim's performance.",
    "published": "2025-09-20T17:26:01Z"
  },
  {
    "title": "Strictly Come Dancing: the launch show – live",
    "url": "https://www.theguardian.com/tv-and-radio/live/2025/sep/20/strictly-come-dancing-the-launch-show-live",
    "image": "https://media.guim.co.uk/afc3c2595039bacd2a2ca8b42af5ebb8752b030a/250_0_2500_2000/500.jpg",
    "summary": "The popular ballroom competition is set to return in 2025 with 15 new celebrity contestants. Fans are eager to see which professional dancers will be paired with the stars and how their performances will unfold. Anticipation builds as viewers wonder who will impress with their skills and who may struggle on the dance floor.",
    "published": "2025-09-20T17:23:48Z"
  },
  {
    "title": "Pentagon demands journalists sign pledge not to gather certain information",
    "url": "https://www.theguardian.com/us-news/2025/sep/20/pentagon-journalists-restrictions-pledge",
    "image": "https://media.guim.co.uk/63b9f11cdf0e3ab4a35c80dbfdf3a8a868fe829a/0_0_2351_1881/500.jpg",
    "summary": "The Pentagon has announced that press passes will be revoked for those who do not agree to imposed limitations, which include restrictions on movement within the building. This measure aims to enforce stricter control over press access. The ultimatum has sparked discussions about press freedoms and access to military information.",
    "published": "2025-09-20T16:55:46Z"
  },
  {
    "title": "France 17-35 England: Women’s Rugby World Cup 2025 semi-final – as it happened",
    "url": "https://www.theguardian.com/sport/live/2025/sep/20/france-v-england-womens-rugby-world-cup-2025-semi-final-live",
    "image": "https://media.guim.co.uk/3d1e1f634d0dba8ae59c2d9ec2d2ad472d64584a/0_0_4686_3749/500.jpg",
    "summary": "England's impressive bench strength and standout performance by Ellie Kildunne propelled the team to a final matchup against Canada. Kildunne's contributions proved crucial in securing their path to the final. The upcoming clash promises to be an exciting encounter.",
    "published": "2025-09-20T16:37:36Z"
  },
  {
    "title": "British couple detained by Taliban in Afghanistan return to UK",
    "url": "https://www.theguardian.com/uk-news/2025/sep/20/british-couple-detained-by-taliban-in-afghanistan-return-to-uk",
    "image": "https://media.guim.co.uk/d5aaeaf098e52c5019e21401e69ab61cd0d90dc9/264_95_1572_1258/500.jpg",
    "summary": "Barbie Reynolds, 76, and her husband Peter, 80, have been released after nearly eight months of detention without charge. Their prolonged captivity raised concerns about their treatment and legal rights. The couple’s release has sparked discussions on the circumstances surrounding their detention.",
    "published": "2025-09-20T16:32:40Z"
  }
]