[
  {
    "title": "Trump announces $1m ‘golden visa’ and raises fees for H-1B visas to $100,000 – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/19/donald-trump-jimmy-kimmel-suspension-abc-federal-reserve-lisa-cook-us-politics-live-news",
    "image": "https://media.guim.co.uk/5a1531ed739138c2fe7a34a193d4f74f0acaac24/443_0_3593_2874/500.jpg",
    "summary": "The US president has signed executive orders that increase costs for obtaining special skills visas. At the same time, the process is being expedited for applicants willing to pay higher fees. This move aims to prioritize wealthier applicants in the visa system.",
    "published": "2025-09-19T22:23:43Z"
  },
  {
    "title": "Australia’s fossil fuel earnings set to fall by $50bn a year by 2035",
    "url": "https://www.theguardian.com/business/2025/sep/20/australias-fossil-fuel-earnings-set-to-fall-by-50bn-a-year-by-2035",
    "image": "https://media.guim.co.uk/0b76d78b812ffd7e3c38050316f2f260b1d92507/611_0_6113_4891/500.jpg",
    "summary": "Australia could face a $60 billion economic loss by 2030 under any future emissions reduction scenario, according to modeling predictions. This significant decline is attributed to the impacts of climate policies and shifts in energy markets. The findings highlight the financial challenges associated with transitioning to a lower-emission economy.",
    "published": "2025-09-19T22:20:49Z"
  },
  {
    "title": "RFK Jr’s vaccine panel votes against recommending prescription for Covid vaccine, emphasizing personal choice",
    "url": "https://www.theguardian.com/us-news/2025/sep/19/acip-vote-no-prescription-covid-vaccine",
    "image": "https://media.guim.co.uk/df5d121a11d5154a81630ec718279a6fe55407ed/446_0_4458_3567/500.jpg",
    "summary": "Healthcare professionals and experts expressed confusion following a contentious meeting regarding the committee's recommendations. The lack of clarity left attendees unclear about the next steps in their decision-making process. Many are seeking further guidance to understand the implications of the committee's findings.",
    "published": "2025-09-19T22:06:35Z"
  },
  {
    "title": "Five Great Reads: madness on a mountain, James Cromwell, and the world’s biggest history podcast",
    "url": "https://www.theguardian.com/australia-news/2025/sep/20/five-great-reads-madness-mountain-james-cromwell-rest-is-history",
    "image": "https://media.guim.co.uk/f5f0bac2faefe953ee1b31ccd8de04f564ec3520/55_0_3698_2959/500.png",
    "summary": "Guardian Australia’s weekend wrap by Kris Swales highlights key articles and stories from the past week. It provides a curated selection of essential reads covering a range of topics. The wrap aims to inform readers about significant developments and issues in Australia and beyond.",
    "published": "2025-09-19T22:00:56Z"
  },
  {
    "title": "Eight-week-old baby among three people who died when triple zero calls failed during Optus network upgrade",
    "url": "https://www.theguardian.com/business/2025/sep/19/three-people-died-when-optus-network-upgrade-affected-triple-zero-calls-ceo-confirms",
    "image": "https://media.guim.co.uk/2a5c2347f73c4b19e0c95baad5148b8497b27ab7/768_0_5003_4003/500.jpg",
    "summary": "A telecommunications executive expressed deep regret after confirming the deaths of two individuals in South Australia and one in Western Australia. He offered his sincere apologies in response to the tragic incidents. Further details on the circumstances surrounding the deaths were not disclosed.",
    "published": "2025-09-19T21:42:15Z"
  }
]