[
  {
    "title": "New Zealand v England: third and final men’s T20 – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/23/new-zealand-v-england-third-final-mens-t20-cricket-live",
    "image": "https://media.guim.co.uk/a97c48fd67ca54cb60b56ab0ef1289f95756fc41/269_0_3102_2482/500.jpg",
    "summary": "England aims to secure a series victory in their match in Auckland. The over-by-over report will provide live updates and insights as the game progresses. Tim de Lisle will be covering the action to see if England can clinch the win.",
    "published": "2025-10-23T07:16:44Z"
  },
  {
    "title": "Australia v India: second men’s one-day international – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/23/australia-v-india-cricket-odi-live-scores-aus-vs-ind-scorecard-second-mens-one-day-international",
    "image": "https://media.guim.co.uk/f49dd9a052f0def62f9c06c5502e9ebb646a28fd/421_0_4601_3681/500.jpg",
    "summary": "Australia has the opportunity to clinch the three-match series with a win at Adelaide Oval. Live updates and commentary are being provided by the writers. Stay tuned for over-by-over reports as the match unfolds.",
    "published": "2025-10-23T07:15:32Z"
  },
  {
    "title": "Abbott says he ‘would be very happy’ for ADF personnel to be part of Gaza peace taskforce – as it happened",
    "url": "https://www.theguardian.com/australia-news/live/2025/oct/23/australia-news-live-pauline-hanson-barnaby-joyce-one-nation-nationals-weather-wind-damage-melbourne-sydney-ntwnfb",
    "image": "https://media.guim.co.uk/24d4d7dbbdc19d77b0d86c0069664f363ccbbb7b/820_0_6990_5592/500.jpg",
    "summary": "The blog has officially shut down and is no longer active. Readers are no longer able to access new content or updates. Thank you to all who followed and supported the blog.",
    "published": "2025-10-23T07:14:20Z"
  },
  {
    "title": "Kaye Adams yet to hear complaint two weeks after being taken off BBC Radio Scotland",
    "url": "https://www.theguardian.com/uk-news/2025/oct/23/kaye-adams-yet-to-hear-complaint-two-weeks-after-being-taken-off-bbc-radio-scotland",
    "image": "https://media.guim.co.uk/3292ac06efce979b057bc43c3fb2800724770fbf/0_67_3542_2833/500.jpg",
    "summary": "A broadcaster was removed from the air amid reports of a conduct complaint, according to BBC News. The specific details of the complaint have not been disclosed. The situation is still developing as investigations may be underway.",
    "published": "2025-10-23T07:10:38Z"
  },
  {
    "title": "Oil price jumps after US sanctions Russia’s Rosneft and Lukoil; White House considers software curbs on China – business live",
    "url": "https://www.theguardian.com/business/live/2025/oct/23/oil-price-us-sanctions-rosneft-lukoil-software-curbs-china-trade-war-business-live",
    "image": "https://media.guim.co.uk/4bc562560051b8f747672fea5d8ed7cbd30c260c/115_0_4477_3583/500.jpg",
    "summary": "This news provides ongoing updates on current economic and financial events, highlighting market trends, economic indicators, and significant developments affecting the global economy. It covers various sectors, including stocks, currencies, and commodities, offering insights and analysis from experts. The updates aim to keep readers informed about shifting economic conditions and their implications.",
    "published": "2025-10-23T07:09:18Z"
  }
]