[
  {
    "title": "WTA Finals tennis: Elena Rybakina v Ekaterina Alexandrova, Iga Swiatek v Amanda Anisimova – live",
    "url": "https://www.theguardian.com/sport/live/2025/nov/05/wta-finals-tennis-elena-rybakina-v-ekaterina-alexandrova-iga-swiatek-v-amanda-anisimova-live",
    "image": "https://media.guim.co.uk/3121b73faa21f9c40f4254b8d1dd649eb67f21af/31_25_3560_2848/500.jpg",
    "summary": "Taha Hashim will host coverage of the upcoming group-stage matches in the season-ending tournament. Fans can look forward to expert insights and analysis. Stay tuned for all the latest developments and highlights.",
    "published": "2025-11-05T14:18:02Z"
  },
  {
    "title": "Second accidental release of prisoner ‘utterly unacceptable’, No 10 says, as Lammy blames system left by Tories – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/nov/05/david-lammy-pmqs-rachel-reeves-tax-system-news-updates-uk-politics-live",
    "image": "https://media.guim.co.uk/fdddec341bf1868c4f613e50d0d23524f159030b/197_0_969_775/500.jpg",
    "summary": "During Prime Minister's Questions, David Lammy, representing Keir Starmer, sidestepped inquiries regarding the recent mistaken release of information. His evasion drew attention amid political scrutiny. The issue continues to raise concerns within the party.",
    "published": "2025-11-05T14:16:32Z"
  },
  {
    "title": "European markets down and Asian chipmakers tumble in global stock sell-off amid worries over AI bubble – business live",
    "url": "https://www.theguardian.com/business/live/2025/nov/05/china-ends-tariffs-us-imports-soy-bean-levies-ms-profits-cyber-attack-business-live",
    "image": "https://media.guim.co.uk/ef313969412c0efbaaf739ff575ab84507d5bf13/407_0_4400_3521/500.jpg",
    "summary": "Deutsche Bank warns of a potential equity correction amid increasing concerns in the market. Meanwhile, China has lifted tariffs on various U.S. imports, including farm products, but maintains tariffs on soybeans. This move aims to improve trade relations, yet uncertainties in equities persist.",
    "published": "2025-11-05T14:16:10Z"
  },
  {
    "title": "Democrat Zohran Mamdani sweeps to victory in New York City mayoral election and lays down challenge to Trump - live",
    "url": "https://www.theguardian.com/us-news/live/2025/nov/05/zohran-mamdani-new-york-nyc-donald-trump-mayor-election-california-new-jersey-virginia-latest-news-results",
    "image": "https://media.guim.co.uk/9617db453cbd1ef5e4a2edd8d8545ed087da9418/665_0_5000_4000/500.jpg",
    "summary": "A 34-year-old democratic socialist has won an election, achieving over 50% of the vote. This marks a significant milestone for progressive politics in the area. The victory highlights growing support for democratic socialism among voters.",
    "published": "2025-11-05T14:06:08Z"
  },
  {
    "title": "Zohran Mamdani victory shows how to defeat rightwing populism, says UK MP",
    "url": "https://www.theguardian.com/us-news/2025/nov/05/zohran-mamdani-victory-uk-labour-india-israel",
    "image": "https://media.guim.co.uk/e2dfd1f20728eca1fc7dc0beef290b085bd1d344/10_0_3736_2988/500.jpg",
    "summary": "Labour's Luke Charters and London Mayor Sadiq Khan praised a recent election result, highlighting its significance. In contrast, an Israeli minister expressed concern, stating that New York is \"walking into the abyss.\" The different reactions underscore a divide in perspectives regarding the implications of the electoral outcome.",
    "published": "2025-11-05T14:00:56Z"
  }
]