[
  {
    "title": "Strictly Come Dancing: week two – live",
    "url": "https://www.theguardian.com/tv-and-radio/live/2025/oct/04/strictly-come-dancing-week-two-live",
    "image": "https://media.guim.co.uk/3a925c7ab0c93d0f7d458d2239e5605a30e357c3/395_0_3953_3162/500.jpg",
    "summary": "Stefan Dennis showcases his dance moves, Thomas Skinner performs a salsa, and Ellie Goldstein waltzes to Ellie Goulding's music. The excitement builds as the competition progresses. Viewers are left wondering who will be eliminated next from the dancefloor.",
    "published": "2025-10-04T19:12:20Z"
  },
  {
    "title": "Woman shot by border patrol in Chicago amid immigration operation",
    "url": "https://www.theguardian.com/us-news/2025/oct/04/woman-shot-border-patrol-chicago",
    "image": "https://media.guim.co.uk/80ed7e704c0cf1b7b7d87183bb93072f59ef6a44/520_0_5200_4160/500.jpg",
    "summary": "The Illinois governor has accused the Trump administration of intensifying its aggressive policies towards the state's citizens and residents. He expressed concerns over the impact of these actions on the well-being of Illinoisans. The comments reflect growing tensions between state leadership and federal authorities.",
    "published": "2025-10-04T19:03:46Z"
  },
  {
    "title": "Ex-NFL player and Fox News star Mark Sanchez in critical condition after stabbing",
    "url": "https://www.theguardian.com/sport/2025/oct/04/nfl-mark-sanchez-stabbing-fox",
    "image": "https://media.guim.co.uk/d249bf28cbd54e3bdf9eb2c24d4505eef89e4207/395_0_6198_4960/500.jpg",
    "summary": "Details regarding the attack are still unclear, as reported by WTHR. A suspect has been detained in connection with the incident. The investigation is ongoing to clarify the circumstances.",
    "published": "2025-10-04T19:01:51Z"
  },
  {
    "title": "‘We were the ones on trial’: the torturous road to justice for three sisters abused by school principal Malka Leifer",
    "url": "https://www.theguardian.com/australia-news/2025/oct/05/surviving-malka-leifer-documentary-three-sisters-abused-adass-israel-school-ntwnfb",
    "image": "https://media.guim.co.uk/f082e47d5edd2756c4a45d1732b434c54a5ca31e/772_0_5833_4669/500.jpg",
    "summary": "The documentary \"Surviving Malka Leifer\" chronicles the journey of victims Nicole, Dassi, and Elly as they face their abuser in court. It aims to expose the challenges and demands placed on victims within Australia's justice system. The film sheds light on their struggle for justice and the broader implications for survivors of abuse.",
    "published": "2025-10-04T19:01:13Z"
  },
  {
    "title": "Malcolm McDowell: ‘I would be a total disaster as a spy – I do love to gossip’",
    "url": "https://www.theguardian.com/film/2025/oct/05/malcolm-mcdowell-interview-10-questions",
    "image": "https://media.guim.co.uk/8fa3de385ab8e3e56a5c13c4a86cd35cccae3b72/451_0_3748_2998/500.jpg",
    "summary": "The actor discusses perfecting Rupert Murdoch's accent and shares insights from collaborating with renowned director Stanley Kubrick. They also express nostalgia for the charm of traditional dinner parties. Overall, the interview highlights their experiences and reflections on the entertainment industry.",
    "published": "2025-10-04T19:00:17Z"
  }
]