[
  {
    "title": "Gaza ceasefire live: Israelis and Palestinians celebrate hostage and detainee releases as key truce issues remain ",
    "url": "https://www.theguardian.com/world/live/2025/oct/14/gaza-ceasefire-israel-hamas-palestine-hostages-detainees-truce-live-news-updates",
    "image": "https://media.guim.co.uk/5be2911711c669d7c6572cd223f0d8a43cf44200/961_0_6977_5582/500.jpg",
    "summary": "Unresolved issues surrounding Hamas's disarmament and the future governance of Gaza underline the tenuous nature of the current truce. The uncertainty raises concerns over the stability of the peace agreement. Ongoing dialogue is essential to address these critical challenges.",
    "published": "2025-10-14T09:12:13Z"
  },
  {
    "title": "US treasury secretary accuses Beijing of trying to damage global economy; silver hits record high – business live",
    "url": "https://www.theguardian.com/business/live/2025/oct/14/us-treasury-secretary-beijing-rare-earths-us-china-port-fees-imf-tariffs-business-live-news",
    "image": "https://media.guim.co.uk/cff322cf52c19005da82b58a1d3f3740392f6326/301_0_2500_2000/500.jpg",
    "summary": "Stay updated with real-time insights into the latest economic and financial developments. Key trends, market shifts, and expert analysis are provided as events unfold. This ongoing coverage keeps readers informed about significant changes impacting the economy.",
    "published": "2025-10-14T09:10:28Z"
  },
  {
    "title": "Zelenskyy to meet Trump in US this week – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/oct/14/france-lecornu-macron-ukraine-russia-zelenskyy-europe-latest-news-updates",
    "image": "https://media.guim.co.uk/c9ebb1393c4c89711f762cd8429170b4f5847fc6/44_0_4733_3786/500.jpg",
    "summary": "The Ukrainian leader voiced optimism regarding the potential for progress stemming from Trump's Gaza deal, indicating that it could foster greater hope for peace in various regions. This statement suggests a broader geopolitical context where peace initiatives are interconnected. The Ukrainian leader's comments reflect a desire for stability and positive developments in conflict areas.",
    "published": "2025-10-14T09:10:11Z"
  },
  {
    "title": "Starmer to face MPs amid continued pressure over collapse of China spying trial – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/oct/14/keir-starmer-china-national-security-spying-gaza-nigel-farage-uk-politics-live-news-updates",
    "image": "https://media.guim.co.uk/a38a7e41dc8aedf48a464acd736dd81c787e7998/1474_446_4026_3221/500.jpg",
    "summary": "The Prime Minister is set to address the Middle East situation and his recent trip to India. However, opposition MPs are expected to raise questions regarding allegations of government interference in a case related to China. Tensions surrounding the issue may dominate the statement.",
    "published": "2025-10-14T09:09:42Z"
  },
  {
    "title": "‘Once a fortnight would save people hundreds’: how to make your bike last longer, according to experts",
    "url": "https://www.theguardian.com/thefilter/2025/oct/14/how-to-make-bike-last-longer",
    "image": "https://media.guim.co.uk/df809d9fd889c708ed33298981ebc1537a928b77/0_0_5000_4000/500.jpg",
    "summary": "Mechanics recommend simple and affordable habits to maintain vehicles, such as avoiding overtightened bolts and regularly cleaning components. These practices can enhance vehicle performance and longevity. Implementing these tips can save money on repairs and improve safety.",
    "published": "2025-10-14T09:00:17Z"
  }
]