[
  {
    "title": "Cooper suggests asylum seekers could be moved into warehouses instead of hotels – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/02/cooper-reeves-starmer-green-party-leader-badenoch-devolution-latest-updates",
    "image": "https://media.guim.co.uk/8ee5a1769d35cd81cec92d15a8ed308a2c6e691e/328_0_3445_2756/500.jpg",
    "summary": "The Home Secretary announced the government's intention to reduce the size of the asylum system. Plans include exploring repurposing military and industrial sites to assist in this effort. The initiative is part of a broader strategy to streamline the process for handling asylum seekers.",
    "published": "2025-09-02T11:26:53Z"
  },
  {
    "title": "‘It was a present to myself’: Southport house for sale with ball pit off bedroom",
    "url": "https://www.theguardian.com/money/2025/sep/02/southport-house-for-sale-ball-pit",
    "image": "https://media.guim.co.uk/2c72562f310026ccf7be662dae36d4b78ecc9c3a/0_216_2258_1807/500.jpg",
    "summary": "A seller of a seven-bedroom house has drawn inspiration from model Cara Delevingne to design a tranquil and relaxing living space. The home features elements aimed at creating a serene atmosphere. The seller hopes potential buyers will appreciate the calming environment cultivated in the property.",
    "published": "2025-09-02T11:23:38Z"
  },
  {
    "title": "England v South Africa: first men’s one-day international – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/02/england-south-africa-first-mens-odi-cricket-live",
    "image": "https://media.guim.co.uk/787f9134dc034acd07ac45101a532d5e413f59a4/303_0_4980_3987/500.jpg",
    "summary": "England faces South Africa at Headingley in the opening match of a three-match ODI series. The game is being covered with an over-by-over report for live updates. Fans can join the writers for commentary and analysis.",
    "published": "2025-09-02T11:23:15Z"
  },
  {
    "title": "Congress returns after recess as threat of government shutdown looms – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/02/congress-returns-government-shutdown-funding-trump-announcement-us-politics-live-latest-updates",
    "image": "https://media.guim.co.uk/276e89e5bbfb1be132fdf4bccd4d9255d61cc01f/800_0_6388_5110/500.jpg",
    "summary": "Republicans and Democrats are in a standoff regarding funding decisions. Meanwhile, Donald Trump is scheduled to make an unspecified announcement from the Oval Office later today. The political landscape remains tense as both parties navigate their differences.",
    "published": "2025-09-02T11:21:51Z"
  },
  {
    "title": "UK long-term borrowing costs hit 27-year high amid ‘worldwide bond market rout’, in pre-budget blow for Labour – business live",
    "url": "https://www.theguardian.com/business/live/2025/sep/02/uk-long-term-borrowing-costs-27-year-high-gold-silver-inflation-business-live-news-updates",
    "image": "https://media.guim.co.uk/e33d07dd27d69afd62d493dfc3b45e781ee7d390/582_0_5839_4672/500.jpg",
    "summary": "UK 30-year bond yields have reached their highest level since 1998, indicating rising borrowing costs. Meanwhile, the British pound has declined in value. This marks a period of significant economic challenges in the UK.",
    "published": "2025-09-02T11:11:52Z"
  }
]