[
  {
    "title": "Pets on flights can be classed as baggage, top EU court rules",
    "url": "https://www.theguardian.com/law/2025/oct/16/pets-on-flights-can-be-classed-as-baggage-iberia",
    "image": "https://media.guim.co.uk/c37bbe9829b8a5be280ad6b9b690bfc93b564ef9/0_0_877_702/500.jpg",
    "summary": "The European Court of Justice has been requested to intervene in a case involving a lost dog during its journey from Buenos Aires to Barcelona. The situation highlights concerns over animal transport regulations and the responsibilities of companies involved. The outcome could set a precedent for similar cases in the future.",
    "published": "2025-10-16T15:17:33Z"
  },
  {
    "title": "Jimmy Kimmel: ‘Trump’s inner circle knows just how dangerous the incessant misinformation from Fox News can be’",
    "url": "https://www.theguardian.com/culture/2025/oct/16/jimmy-kimmel-trump-fox-news-young-republicans",
    "image": "https://media.guim.co.uk/2cf1f0bddbd15984cb28325a21fef28a8bfbe751/357_88_1962_1569/500.jpg",
    "summary": "Late-night hosts explore the strong influence Fox News has on Donald Trump amid his defense of deploying the National Guard to U.S. cities. They highlight the network's role in shaping his policies and public perception. The discussions underscore the intertwining of media and politics in contemporary America.",
    "published": "2025-10-16T15:15:17Z"
  },
  {
    "title": "IMF chief reveals worries about private credit market keep her awake at night – business live",
    "url": "https://www.theguardian.com/business/live/2025/oct/16/uk-gdp-economy-growth-august-reeves-budget-imf-business-live-news",
    "image": "https://media.guim.co.uk/fbe0df09a525d0892573d1fa9ae8f132475b51fc/375_0_3748_2998/500.jpg",
    "summary": "IMF Managing Director Kristalina Georgieva emphasizes the need for greater focus on non-bank financial institutions. She warns that the global financial system might be at risk, suggesting it has \"a foot out in the cold.\" Her comments highlight the importance of monitoring these institutions amid ongoing economic challenges.",
    "published": "2025-10-16T15:14:55Z"
  },
  {
    "title": "Johnson condemns leaked Young Republicans group chat messages and says Schumer declined vote on healthcare subsidies – live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/16/trump-latest-shutdown-vote-jd-vance-republicans-democrats",
    "image": "https://media.guim.co.uk/aba7d93795bedf7f9478ad278007b223febd0511/546_0_2753_2202/500.jpg",
    "summary": "The House speaker claims he was unaware of the members involved in a Young Republicans chat. He continues to deflect responsibility for the impending US government shutdown. His remarks indicate a lack of accountability as negotiations remain unresolved.",
    "published": "2025-10-16T15:10:29Z"
  },
  {
    "title": "Women’s Cricket World Cup: Australia storm to 10-wicket win over Bangladesh – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/16/womens-cricket-world-cup-australia-v-bangladesh-live",
    "image": "https://media.guim.co.uk/704d17f0c575ee1ba97754c7e21261b130524dad/1084_238_2689_2151/500.jpg",
    "summary": "Australia secured their position in the finals during the 50-over match in Visakhapatnam. The over-by-over report provides live updates on the game. Join the writers for in-depth commentary and analysis.",
    "published": "2025-10-16T15:10:23Z"
  }
]