[
  {
    "title": "Three Just Stop Oil activists cleared over Stonehenge protest",
    "url": "https://www.theguardian.com/environment/2025/oct/31/three-just-stop-oil-activists-cleared-over-stonehenge-protest",
    "image": "https://media.guim.co.uk/8c57e58886f853e000d04183a846f61d57dc2227/276_0_1054_843/500.jpg",
    "summary": "A trio defended their protest, which involved throwing orange powder, conducted a day before the 2024 solstice. They argued the action was justified due to the urgent attention needed for the climate emergency. The protest aimed to raise awareness about environmental issues.",
    "published": "2025-10-31T13:26:10Z"
  },
  {
    "title": "Arteta warns that clubs could pull out of cups amid fixture congestion: football news – live",
    "url": "https://www.theguardian.com/football/live/2025/oct/31/weekend-team-news-and-previews-football-live",
    "image": "https://media.guim.co.uk/37eda24d18a567a671c31eb159ff2f2f449dbbd6/0_0_6313_5051/500.jpg",
    "summary": "Join our team of writers for the latest updates and insights as the weekend football action approaches. Stay informed about key matches and player developments. Don't miss out on essential pre-game analysis!",
    "published": "2025-10-31T13:26:03Z"
  },
  {
    "title": "Illinois advocates sue over ‘torturous’ conditions at Chicago-area ICE facility",
    "url": "https://www.theguardian.com/us-news/2025/oct/31/chicago-ice-broadview-facility-lawsuit",
    "image": "https://media.guim.co.uk/b318e2d9cfb9e37dfa114b1d98b41b13b79389cc/500_0_5000_4000/500.jpg",
    "summary": "Agents at Broadview allegedly restricted detainees' access to private calls with their attorneys, compromising their legal rights. Furthermore, they reportedly obstructed lawmakers and journalists from visiting the facility. These actions have raised concerns about transparency and the treatment of individuals in custody.",
    "published": "2025-10-31T13:21:23Z"
  },
  {
    "title": "Trump calls for Senate to scrap filibuster in order to force end to month-long government shutdown – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/31/donald-trump-filibuster-shutdown-snap-food-refugees-drug-boats-latest-news-updates",
    "image": "https://media.guim.co.uk/e4fa98b006ecd4a9554d3cae08825d75d3582b91/915_0_4585_3669/500.jpg",
    "summary": "Snap food benefits will expire this weekend as a government shutdown looms, nearing the level seen during the 2018-2019 crisis. This situation raises concerns about food security for millions of Americans who rely on these benefits. The impending shutdown could exacerbate the challenges faced by vulnerable communities.",
    "published": "2025-10-31T13:20:46Z"
  },
  {
    "title": " UK housing market ‘resilient’ in October; Nvidia boss says selling chips in China is Trump’s call – business live",
    "url": "https://www.theguardian.com/business/live/2025/oct/31/uk-house-prices-rise-asian-stocks-mixed-tech-earnings-business-live-news",
    "image": "https://media.guim.co.uk/60944f899cc10b02cb5609c621a120d10fe98739/666_0_5798_4639/500.jpg",
    "summary": "The latest economic and financial news highlights ongoing developments in global markets, inflation trends, and central bank policies. Analysts are closely monitoring shifts in consumer behavior and investment patterns. Economic indicators suggest a mixed recovery, with some sectors showing resilience while others struggle amid increasing uncertainty.",
    "published": "2025-10-31T13:18:57Z"
  }
]