[
  {
    "title": "US appeals court rules most of Trump’s sweeping global tariffs illegal – live",
    "url": "https://www.theguardian.com/us-news/live/2025/aug/29/cdc-robert-f-kennedy-jr-donald-trump-federal-reserve-lisa-cook-latest-us-politics-news-live-updates",
    "image": "https://media.guim.co.uk/6bce69080a23d3223d079aa0d8e609bfdd276535/0_1463_3174_2537/500.jpg",
    "summary": "A ruling has confirmed a decision from a trade court regarding tariffs, despite the president's criticism of the appeals court as \"highly partisan.\" The president remains optimistic about ultimately winning the tariff dispute. The ongoing conflict highlights tensions between the administration and the judiciary.",
    "published": "2025-08-29T23:27:57Z"
  },
  {
    "title": "Singapore is worried about a rise in drug-laced vaping. What is happening, and what is the drug etomidate?",
    "url": "https://www.theguardian.com/world/2025/aug/30/singapore-is-worried-about-a-rise-in-drug-laced-vaping-what-is-happening-and-what-is-the-drug-etomidate",
    "image": "https://media.guim.co.uk/fb96dfba07982249649eb8d8336fa26f5a9621ea/0_0_3895_3117/500.jpg",
    "summary": "Vaping has been prohibited since 2018, yet authorities are reporting an increase in young people using vape devices to consume an anesthetic agent. This trend raises concerns about the potential health risks associated with inhaling such substances. Officials are emphasizing the need for renewed efforts to combat this emerging issue.",
    "published": "2025-08-29T23:25:40Z"
  },
  {
    "title": "Most of Trump’s tariffs are illegal, federal court rules",
    "url": "https://www.theguardian.com/us-news/2025/aug/29/trump-tariffs-illegal-appeal-court-ruling",
    "image": "https://media.guim.co.uk/5f6de30e8ecd826706e5f0681ba5d3b5f04b46ac/310_0_5001_4000/500.jpg",
    "summary": "A court has determined that Donald Trump overstepped his authority with his tariff policies during his presidency. In response, Trump has accused the court of political bias against him. This ruling highlights ongoing legal challenges faced by the former president.",
    "published": "2025-08-29T23:01:45Z"
  },
  {
    "title": "Women’s Super League 2025-26 previews No 6: Leicester",
    "url": "https://www.theguardian.com/football/2025/aug/30/womens-super-league-2025-26-previews-no-6-leicester",
    "image": "https://media.guim.co.uk/6f38b3845af3f6647810ebed07ab12f1fcf80271/185_0_4640_3712/500.jpg",
    "summary": "Amandine Miquel's unexpected exit has prompted the club to seek a new manager. Additionally, several seasoned players have also left the team. The situation is creating uncertainty for the club's future direction.",
    "published": "2025-08-29T23:01:44Z"
  },
  {
    "title": "Prize crossword No 29,787",
    "url": "https://www.theguardian.com/crosswords/prize/29787",
    "summary": "I'm sorry, but I can't provide a summary without specific content related to Prize crossword No 29,787. If you can share details or context about the news, I'd be happy to help summarize it!",
    "published": "2025-08-29T23:00:45Z"
  }
]