[
  {
    "title": "Senate fails to pass stopgap funding bill as government heads for midnight shutdown – follow live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/30/us-government-shutdown-funding-trump-vance-portland-hegseth-latest-updates",
    "image": "https://media.guim.co.uk/fe3316a2e58c91fcece6a306a293024b18b14d3d/287_0_2881_2304/500.jpg",
    "summary": "A resolution to maintain current funding levels until November 21 did not secure the 60 votes required for approval. This failure raises concerns about potential government funding disruptions. Lawmakers may need to explore alternative strategies to avoid a shutdown.",
    "published": "2025-10-01T03:07:40Z"
  },
  {
    "title": "Australia news live: Queensland’s biggest coal power station may close early; police find small footprint in search for missing SA four-year-old",
    "url": "https://www.theguardian.com/australia-news/live/2025/oct/01/australia-news-live-nicole-kidman-divorce-keith-urban-sussan-ley-coalition-andrew-hastie-anthony-albanese-housing-ntwnfb",
    "image": "https://media.guim.co.uk/bbd4fe2a24cb5843f9c30816249c8ddba493b98d/0_0_2664_2131/500.jpg",
    "summary": "I'm sorry, but I need more information or context about the news you want summarized. Could you please provide details or specify the topic?",
    "published": "2025-10-01T03:05:48Z"
  },
  {
    "title": "‘Dominant on the river’: 32 Chunk crowned champion in ‘biggest Fat Bear Week yet’",
    "url": "https://www.theguardian.com/us-news/2025/sep/30/fat-bear-week-winner-32-chunk",
    "image": "https://media.guim.co.uk/e3546a434166efb62b184cbc18105b0bf7e5f29a/147_0_4860_3888/500.jpg",
    "summary": "A brown bear has won an election with nearly 100,000 votes, securing his victory despite enduring a broken jaw for much of the season. The bear's impressive resilience and support from voters contributed to his success. This unique event highlights the community's affection for the bear amid his challenges.",
    "published": "2025-10-01T02:34:09Z"
  },
  {
    "title": "Taiwan now biggest importer of Russian naphtha despite being Ukraine ally",
    "url": "https://www.theguardian.com/world/2025/oct/01/taiwan-biggest-importer-russian-naphtha-despite-ukraine-ally-report",
    "image": "https://media.guim.co.uk/5cceeb0100ee11e3ce28d433e2038ae9e9a6bd40/417_0_4167_3333/500.jpg",
    "summary": "In the first half of 2025, the island imported $1.3 billion worth of crude oil products, despite having joined sanctions against Moscow. This development raises questions about the effectiveness of the sanctions. The report highlights continued trade links that could undermine the intended impact of the sanctions.",
    "published": "2025-10-01T02:00:59Z"
  },
  {
    "title": "News Corp embraces fantasy genre by turning climate crisis into ‘laughable’ science fiction | Graham Readfearn",
    "url": "https://www.theguardian.com/environment/commentisfree/2025/oct/01/news-corp-daily-telegraph-calls-climate-crisis-science-fiction",
    "image": "https://media.guim.co.uk/b61a2b2ea4c5952868cfc590136e7126c3895938/298_0_4343_3474/500.jpg",
    "summary": "The Daily Telegraph criticizes the National Climate Risk Assessment, highlighting concerns about the impact of wind turbines on firefighting efforts. Additionally, solar panels are reported to contribute significantly to landfill waste. This raises questions regarding the effectiveness and sustainability of these renewable energy sources.",
    "published": "2025-10-01T02:00:59Z"
  }
]