[
  {
    "title": "‘My first barricade’: latest French protests unite people from variety of backgrounds",
    "url": "https://www.theguardian.com/world/2025/sep/10/my-first-barricade-latest-french-protests-unite-people-from-variety-of-backgrounds",
    "image": "https://media.guim.co.uk/ba3e37586c7e8d4e3d4fba5b75621c6d0c4cf168/372_0_3049_2440/500.jpg",
    "summary": "Various groups, including students, health workers, and children of gilets jaunes protesters, participated in the \"Block Everything\" rallies. The protests aimed to address social and economic grievances in France. Demonstrators emphasized the need for change and better representation in response to ongoing hardships.",
    "published": "2025-09-10T16:41:25Z"
  },
  {
    "title": "Snapchat allowing drug dealers to operate openly on platform, says Danish research body",
    "url": "https://www.theguardian.com/technology/2025/sep/10/snapchat-allowing-drug-dealers-to-operate-openly-on-platform-says-danish-research-body",
    "image": "https://media.guim.co.uk/d39ecaa1b8cf252330f1c1ea33f16ce20c0ca5cb/678_0_2340_1873/500.jpg",
    "summary": "A social media platform is facing criticism for not adequately filtering prohibited usernames such as 'coke', 'weed', and 'molly'. Critics argue this oversight poses risks related to inappropriate content and user safety. The platform acknowledges the issue and is working on improvements to its moderation systems.",
    "published": "2025-09-10T16:41:23Z"
  },
  {
    "title": "Starmer says he has confidence in Peter Mandelson amid calls to sack him over Epstein ties – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/10/keir-starmer-isaac-herzog-pmqs-labour-kemi-badenoch-uk-politics-live-news-updates",
    "image": "https://media.guim.co.uk/c07d84b6f076607ac3574c51f6231bdbd5c70ef6/1983_76_3813_3050/500.jpg",
    "summary": "Prime Minister faced tough questioning from Kemi Badenoch regarding Peter Mandelson's suitability for the role of US ambassador. The inquiry raised concerns about Mandelson's qualifications and past controversies. The discussion highlights ongoing debates over key diplomatic appointments.",
    "published": "2025-09-10T16:40:53Z"
  },
  {
    "title": "Leaked files cast doubt on source of £2.6m in Tory donations",
    "url": "https://www.theguardian.com/uk-news/2025/sep/10/boris-johnson-files-tory-donations-wafic-rosemary-said",
    "image": "https://media.guim.co.uk/314eeaad5089d6a921df41b29018f616a80e42c9/0_0_3750_3000/500.jpg",
    "summary": "Official logs indicate a meeting with Wafic Saïd, a Canadian citizen and notable donor. His British wife has also contributed to the party. The details of the meeting are part of ongoing scrutiny regarding donations and political ties.",
    "published": "2025-09-10T16:38:52Z"
  },
  {
    "title": "Government to make grassroots funding dependent on equality between boys and girls",
    "url": "https://www.theguardian.com/sport/2025/sep/10/government-to-make-grassroots-funding-dependent-on-equality-between-boys-and-girls",
    "image": "https://media.guim.co.uk/bde44dab839e99d4805e5fbee2cb3051a91d385e/2155_1038_4483_3587/500.jpg",
    "summary": "Culture Secretary Lisa Nandy emphasizes the need for equal access for girls' sports teams. She indicates that future funding will be contingent on compliance with this equality mandate. The initiative aims to promote fairness and inclusivity in youth sports.",
    "published": "2025-09-10T16:37:16Z"
  }
]