[
  {
    "title": "Tottenham v Fulham: Premier League – live",
    "url": "https://www.theguardian.com/football/live/2025/nov/29/tottenham-v-fulham-premier-league-live",
    "image": "https://media.guim.co.uk/b98c0c98563ad35b28ea505bc6c6aa708ed08064/1055_0_3018_2415/500.jpg",
    "summary": "In a minute-by-minute report, Thomas Frank's Spurs aim to recover from two recent losses as they face Marco Silva's team. The match promises to be a test of resilience for Spurs. Scott Murray provides live updates on the unfolding action.",
    "published": "2025-11-29T20:21:50Z"
  },
  {
    "title": "Strictly Come Dancing: week 10 – live",
    "url": "https://www.theguardian.com/tv-and-radio/live/2025/nov/29/strictly-come-dancing-week-10-live",
    "image": "https://media.guim.co.uk/5a28522e7f74e6e68d8798508147cd93c12b0c6e/0_311_2841_2271/500.jpg",
    "summary": "Couples at Elstree Studios are taking on the inaugural Instant Dance challenge, featuring routines set to music by Lady Gaga, Frank Sinatra, and Tina Turner. The competition heats up as they strive to impress the judges. It remains to be seen who will emerge as the standout performer of the night.",
    "published": "2025-11-29T20:21:15Z"
  },
  {
    "title": "Your Party’s first conference shows little sign of achieving fresh start",
    "url": "https://www.theguardian.com/politics/2025/nov/29/your-partys-first-conference-shows-little-sign-of-achieving-fresh-start",
    "image": "https://media.guim.co.uk/39d3ad37b64492e2c3b9a5b13cab2a0f6c1540f9/373_0_3750_3000/500.jpg",
    "summary": "Zarah Sultana and Jeremy Corbyn are in disagreement over the inclusion of Socialist Workers members in their political activities. This conflict is leading to ongoing disputes and tensions within their party. The rift suggests that internal feuding is expected to persist.",
    "published": "2025-11-29T20:07:11Z"
  },
  {
    "title": "Tom Stoppard, playwright of dazzling wit and playful erudition, dies aged 88 ",
    "url": "https://www.theguardian.com/stage/2025/nov/29/tom-stoppard-playwright-of-dazzling-wit-and-playful-erudition-dies-aged-88",
    "image": "https://media.guim.co.uk/426c88b5d2e3d0fb998c221f66a0ad576b337a47/493_0_4989_3992/500.jpg",
    "summary": "Tom Stoppard, a celebrated playwright known for his influential works like \"Arcadia,\" \"The Real Thing,\" and \"Leopoldstadt,\" has captivated audiences since the 1960s. In addition to his acclaimed stage plays, he also achieved significant recognition as a screenwriter. His contributions to theater and film have made him a prominent figure in the arts.",
    "published": "2025-11-29T20:03:31Z"
  },
  {
    "title": "England v Brazil? This World Cup draw must offer us glimpses of glory not the grotesque | Jonathan Wilson",
    "url": "https://www.theguardian.com/football/2025/nov/29/england-v-brazil-this-world-cup-draw-must-offer-us-glimpses-of-glory-not-the-grotesque",
    "image": "https://media.guim.co.uk/dcece4aecb61c8da39e8f03c7af561a7b8d3b974/602_0_3451_2761/500.jpg",
    "summary": "FIFA's decision for top-four seeding is seen as prioritizing marketing over the integrity of the sport. Critics argue that such plans may backfire despite careful intentions. The controversy raises questions about the balance between commercialization and fair competition in football.",
    "published": "2025-11-29T20:00:45Z"
  }
]