[
  {
    "title": "Australia news live: Ley says she is not worried about a Hastie leadership tilt; three charged after WA man’s body found",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/29/australia-news-live-optus-suffers-fresh-triple-zero-glitch-labors-first-deficit-not-as-bad-as-feared",
    "image": "https://media.guim.co.uk/6beeccb9a38d9f60531f4db8fb1389a863900215/628_0_5685_4548/500.jpg",
    "summary": "I apologize, but I can't access or follow live news. However, if you provide me with the details or the main points of the news, I can help you summarize it in three lines.",
    "published": "2025-09-29T04:22:59Z"
  },
  {
    "title": "Leaky roofs, collapsed walls, mega debts: when Donald Judd, art’s master minimalist, tried architecture",
    "url": "https://www.theguardian.com/artanddesign/2025/sep/29/donald-judd-arts-master-minimalist-architecture-marfa",
    "image": "https://media.guim.co.uk/beb385c00c45d88ce4ffa9e7a10fef5bc18b46ac/62_0_1875_1500/500.jpg",
    "summary": "An artist disillusioned with the New York scene shifted his focus to architecture in a small Texas town by purchasing multiple properties. His enthusiasm for renovation and creativity in Marfa led to an expansive collection of projects. A recent tour showcases his unique artistic contributions to the town.",
    "published": "2025-09-29T04:00:33Z"
  },
  {
    "title": "Stop blaming migrants and tackle UK’s real problems, 100 charities tell home secretary",
    "url": "https://www.theguardian.com/politics/2025/sep/29/stop-blaming-migrants-and-tackle-uks-real-problems-100-charities-tell-home-secretary",
    "image": "https://media.guim.co.uk/51d27f1c92f81baa0b52782ee2cf2e7e0c6501b5/877_0_4560_3648/500.jpg",
    "summary": "A letter has been sent to Shabana Mahmood, cautioning her that targeting refugees will not effectively address issues related to housing and the NHS. The correspondence emphasizes the need for comprehensive solutions rather than scapegoating vulnerable populations. The authors argue that such actions could detract from constructive discussions about improving public services.",
    "published": "2025-09-29T04:00:30Z"
  },
  {
    "title": "One lap, 400 miles, seven days: GP aims to set record on Cornwall perimeter run",
    "url": "https://www.theguardian.com/uk-news/2025/sep/29/elsey-davis-gp-cornwall-perimeter-run-fastest-known-time",
    "image": "https://media.guim.co.uk/c7a5a51c149e839e946d870c52f0b1242460244d/375_0_3750_3000/500.jpg",
    "summary": "Elsey Davis is undertaking a 400-mile run with an elevation gain of 18,000 meters to raise awareness for young-onset Alzheimer's disease. The challenging journey aims to highlight the struggles faced by younger individuals diagnosed with the condition. Davis's initiative seeks to inspire support and understanding for those affected.",
    "published": "2025-09-29T04:00:30Z"
  },
  {
    "title": "Environmental damage is putting European way of life at risk, says report",
    "url": "https://www.theguardian.com/environment/2025/sep/29/environmental-damage-is-putting-european-way-of-life-at-risk-says-report",
    "image": "https://media.guim.co.uk/45f3d6c678727244eebd1da5f0cb70ab1891d259/461_286_3742_2994/500.jpg",
    "summary": "EU officials have issued a warning that climate change and wildlife loss are severely damaging ecosystems that support the economy. They emphasize the urgent need for action to address these environmental crises. The officials stress that the health of natural systems is vital for economic stability and sustainability.",
    "published": "2025-09-29T04:00:30Z"
  }
]