[
  {
    "title": "Australia news live: Erin Patterson’s mushroom murders sentence to be handed down",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/08/australia-news-live-erin-patterson-mushroom-murders-trial-sentencing-blood-moon-pictures-shark-net-beach-ntwnfb",
    "image": "https://media.guim.co.uk/04838a9b4094c5755921943fe237336947071ca1/0_0_2500_2000/500.jpg",
    "summary": "I apologize, but I need more context or specific news details to provide a summary. Please provide the content or topic you'd like summarized.",
    "published": "2025-09-07T23:26:14Z"
  },
  {
    "title": "Jade: That’s Showbiz Baby! review – former Little Mix star thrives in chaos on an idiosyncratic debut",
    "url": "https://www.theguardian.com/music/2025/sep/08/jade-thats-showbiz-baby-review-former-little-mix-star-thrives-in-chaos-on-an-idiosyncratic-debut",
    "image": "https://media.guim.co.uk/d6623ca781836aaee41fdd10ae879369f577bbc3/179_0_6684_5350/500.jpg",
    "summary": "Jade Thirlwall's new music features a mix of electroclash, Eurovision flair, and emotive synth-pop. While the journey is engaging, she struggles to sustain the energy and coherence throughout an entire album. Overall, the project showcases her versatility but lacks consistency.",
    "published": "2025-09-07T23:01:34Z"
  },
  {
    "title": "UK advertising watchdog accused of breaking rules in its own ad campaign",
    "url": "https://www.theguardian.com/media/2025/sep/08/uk-advertising-watchdog-accused-of-breaking-rules-in-its-own-ad-campaign",
    "image": "https://media.guim.co.uk/b61944a15b3724e1771bd21c18a1ff4ec51363ff/48_48_1131_905/500.jpg",
    "summary": "A complaint has been filed requesting the Advertising Standards Authority (ASA) to investigate claims associated with a promotional campaign involving well-known household brands. The complaint raises concerns about the accuracy and truthfulness of the promotional claims. The outcome of the investigation could impact future advertising practices for these brands.",
    "published": "2025-09-07T23:01:33Z"
  },
  {
    "title": "Londoners buying lowest share of property outside capital since 2013",
    "url": "https://www.theguardian.com/business/2025/sep/08/londoners-buying-lowest-share-of-property-outside-capital-since-2013",
    "image": "https://media.guim.co.uk/8e2594f6b341a961cec72627584e67a14ecad0b6/1158_33_3854_3084/500.jpg",
    "summary": "Experts warn that stagnant house prices and a resurgence of in-person office work are limiting people's options to relocate from cities. This trend may hinder mobility and alter residential patterns. The implications could affect urban development and housing markets.",
    "published": "2025-09-07T23:01:33Z"
  },
  {
    "title": "Revealed: the huge growth of Myanmar scam centres that may hold 100,000 trafficked people",
    "url": "https://www.theguardian.com/global-development/2025/sep/08/myanmar-military-junta-scam-centres-trafficking-crime-syndicates-kk-park",
    "image": "https://media.guim.co.uk/2ea3448dc3ccc4bb2d7a6ca44ea38d37c57ca5c3/894_0_5000_4000/500.jpg",
    "summary": "Crime syndicates, supported by the military junta, have led to a doubling of large complexes like KK Park along the Thai-Myanmar border since 2021. These developments are linked to illicit activities in the region. The expansion reflects the growing influence of organized crime in the area.",
    "published": "2025-09-07T23:01:33Z"
  }
]