[
  {
    "title": "White House gives platform to conservative influencers to air grievances during ‘antifa roundtable’ – live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/08/donald-trump-james-comey-justice-department-national-guard-chicago-antifa-government-shutdown-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/e98a840458f5c01a13c2a0283df99f33a44cef7a/613_0_6683_5349/500.jpg",
    "summary": "Witnesses at the White House reported being assaulted by left-wing protesters. However, they did not acknowledge that they frequently confront these protesters and film the reactions they provoke. This selective reporting raises questions about the full context of the incidents.",
    "published": "2025-10-08T22:11:25Z"
  },
  {
    "title": "Australia politics live: Ley says she welcomes ‘contest of ideas’ amid Liberal infighting; judges to rule on Palestine protest",
    "url": "https://www.theguardian.com/australia-news/live/2025/oct/09/australia-politics-live-opera-house-rally-palestine-gaza-parliament-senate-estimates-anthony-albanese-sussan-ley-question-time-ntwnfb",
    "image": "https://media.guim.co.uk/656460677d7674a0fedbc22788e3898ade5def6a/819_277_5956_4767/500.jpg",
    "summary": "I'm sorry, but I need more information or context about the specific news you would like summarized. Please provide some details or the main points of the news article.",
    "published": "2025-10-08T22:07:52Z"
  },
  {
    "title": "Gaza ceasefire talks live: Trump may travel to Middle East at the weekend as he hails progress of negotiations",
    "url": "https://www.theguardian.com/world/live/2025/oct/08/gaza-ceasefire-talks-israel-hamas-trump-us-qatar-turkey-egypt-live-news-updates",
    "image": "https://media.guim.co.uk/7edff8dee2afbac3984dcf086ad40564c666668a/262_0_3078_2463/500.jpg",
    "summary": "The US president announced that negotiators are nearing a potential peace agreement in the Middle East. He expressed optimism about the progress being made in the discussions. The details of the agreement remain unspecified, but it signifies a hopeful development in the region.",
    "published": "2025-10-08T21:57:46Z"
  },
  {
    "title": "Arizona House Democrats press Mike Johnson to swear in Adelita Grijalva",
    "url": "https://www.theguardian.com/us-news/2025/oct/08/mark-kelly-ruben-gallego-adelita-grijalva-mike-johnson",
    "image": "https://media.guim.co.uk/effe0a4c06f89d435e20552a348ead359f4fa873/267_0_4310_3448/500.jpg",
    "summary": "Mark Kelly and Ruben Gallego held a press conference at the speaker's office to address the refusal to swear in a new Democratic member. They expressed concerns about the implications of this decision for the party and democratic processes. The event highlighted ongoing tensions within the political landscape regarding party representation.",
    "published": "2025-10-08T21:50:13Z"
  },
  {
    "title": "Kristi Noem compares antifa to MS-13, Hamas, Hezbollah and the Islamic State",
    "url": "https://www.theguardian.com/us-news/2025/oct/08/kristi-noem-antifa",
    "image": "https://media.guim.co.uk/931dec85e2e316d978b810b2bfcdf2cf91f7f0da/1059_0_4663_3731/500.jpg",
    "summary": "The Homeland Security Secretary has labeled a loosely connected network of anti-fascist street activists as \"just as dangerous\" as other extremist groups. This statement highlights increasing concerns about domestic extremism. The declaration reflects a broader effort to address violence and radical ideology in the U.S.",
    "published": "2025-10-08T21:30:45Z"
  }
]