[
  {
    "title": "Sheffield Wednesday deducted 12 points, Slot backs Salah to find form: football – live",
    "url": "https://www.theguardian.com/football/live/2025/oct/24/premier-league-news-europa-league-reaction-and-more-weekend-football-countdown-live",
    "image": "https://media.guim.co.uk/3483f003cac9452d1c37249d9acb0b09e598409c/593_109_3867_3093/500.jpg",
    "summary": "A team of writers is set to cover a busy weekend filled with league action. They will provide ongoing updates and insights as the games unfold. Stay tuned for comprehensive coverage of all the league events.",
    "published": "2025-10-24T13:28:39Z"
  },
  {
    "title": "Nigel Farage seeks influence over Bank of England in same vein as Trump and US Federal Reserve",
    "url": "https://www.theguardian.com/business/2025/oct/24/nigel-farage-bank-of-england-governor",
    "image": "https://media.guim.co.uk/647111c799389a37fded2affc215ad311992253a/150_0_4548_3640/500.jpg",
    "summary": "Reform UK leader has indicated that he would consider replacing the governor of the Bank of England if he assumes the role of prime minister. This statement reflects his criticism of current economic policies. The move could signal a significant shift in monetary policy direction if realized.",
    "published": "2025-10-24T13:28:31Z"
  },
  {
    "title": "US inflation rises to 3%, lower than forecast; business conditions ‘starting to improve’ in UK economy – business live",
    "url": "https://www.theguardian.com/business/live/2025/oct/24/retail-sales-gold-demand-trump-canada-trade-us-inflation-ftse-stock-markets-business-live-news",
    "image": "https://media.guim.co.uk/df2f852515ef03ff544f20be2af3fe281738c24b/527_0_5271_4217/500.jpg",
    "summary": "US consumer prices increased at a slower rate than anticipated last month. This news comes as markets analyze the outcomes of recent trade discussions between the US and Canada. Economists are closely monitoring these developments for potential economic implications.",
    "published": "2025-10-24T13:26:34Z"
  },
  {
    "title": "US secretary of state Marco Rubio says ‘Hamas cannot be involved in governing Gaza’ – Middle East live ",
    "url": "https://www.theguardian.com/world/live/2025/oct/24/aid-gaza-israel-palestine-benjamin-netanyahu-hamas-ceasefire-west-bank-middle-east-live-news",
    "image": "https://media.guim.co.uk/3055b1a68df597c2126fa87f5132fe9e1b654961/460_0_4580_3666/500.jpg",
    "summary": "Rubio stated that the UN agency for Palestinian refugees (Unrwa) cannot have a future role in Gaza. He characterized Unrwa as a \"subsidiary of Hamas.\" This statement reflects ongoing tensions around the agency's operations amid the Gaza conflict.",
    "published": "2025-10-24T13:26:22Z"
  },
  {
    "title": "Zelenskyy at Downing Street for talks with Starmer and ‘coalition of willing’ after meeting King Charles – Europe live ",
    "url": "https://www.theguardian.com/world/live/2025/oct/24/volodmyr-zelenskyy-ukraine-russia-vladimir-putin-sanctions-keir-starmer-coalition-of-the-willing-military-support-europe-live-news",
    "image": "https://media.guim.co.uk/9da616bf2cdf016b7b9206117a734001ec6769f7/749_51_2094_1675/500.jpg",
    "summary": "Ukrainian President Volodymyr Zelenskyy is advocating for the utilization of frozen Russian assets to support Ukraine's defense efforts. He aims to push this initiative forward in international discussions. The move highlights Ukraine's ongoing struggle against Russian aggression and the need for financial resources.",
    "published": "2025-10-24T13:24:48Z"
  }
]