[
  {
    "title": "Australia news live: Albanese rules out holding republic referendum; Cash praises Netanyahu’s ‘moral clarity’",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/28/australia-news-live-albanese-king-charles-afl-brisbane-coalition-liberals-western-australia-gst-queensland-nsw-victoria-labor-ntwnfb",
    "image": "https://media.guim.co.uk/802a449c8d7be5a54293ddfa334626e100f9f3e6/1611_455_2205_1763/500.jpg",
    "summary": "Please provide the specific news content you'd like summarized, and I'll be happy to help!",
    "published": "2025-09-28T01:39:57Z"
  },
  {
    "title": "Trump news at a glance: Trump orders deployment of national guard to ‘war ravaged’ Portland",
    "url": "https://www.theguardian.com/us-news/2025/sep/28/trump-administration-news-updates-today",
    "image": "https://media.guim.co.uk/aad2f66553a277d987e11c51f1bdc8522f90e8f3/1188_7_2646_2118/500.jpg",
    "summary": "Officials in Portland have expressed strong opposition to the announcement regarding the deployment of military troops, asserting that there is \"no need\" for such measures. This stance reflects ongoing tensions and differing perspectives on law enforcement strategies. The situation highlights broader discussions related to US political dynamics and public safety.",
    "published": "2025-09-28T00:58:27Z"
  },
  {
    "title": "Keegan Bradley defends US Ryder Cup fans as just ‘passionate’ amid chaos ",
    "url": "https://www.theguardian.com/sport/2025/sep/28/keegan-bradley-us-ryder-cup-fans-passionate-chaos",
    "image": "https://media.guim.co.uk/f408d9786a038daa14d2fd7e2e8617fb3a64e981/361_0_2405_1924/500.jpg",
    "summary": "Keegan Bradley declined to criticize American Ryder Cup fans despite the troubling behavior observed as his team fell behind with an 11 ½-4 ½ score. He acknowledged the disappointing performance but focused on rallying support for the team. The atmosphere among fans remained a point of concern during the event.",
    "published": "2025-09-28T00:48:52Z"
  },
  {
    "title": "Vast and spectacular: a five-day hike to Smitt Rock and Eighth Gorge in Nitmiluk national park",
    "url": "https://www.theguardian.com/travel/2025/sep/28/smitt-rock-eighth-gorge-nitmiluk-national-park-five-day-hike-northern-territory-spectacular",
    "image": "https://media.guim.co.uk/23d9af7cc3366eca3097951066e8215eaa65b8de/174_0_1159_927/500.jpg",
    "summary": "Tegan Forder explores the rugged and remote terrain of Northern Territory, discovering lush ravines and undulating trails. She encounters delicate native flowers along her journey. The experience is complemented by stunning sunsets.",
    "published": "2025-09-28T00:00:05Z"
  },
  {
    "title": "Powerful lithium batteries in written-off EVs now hot property at salvage auctions",
    "url": "https://www.theguardian.com/environment/2025/sep/28/australia-batteries-in-written-off-evs-electric-vehicles-demand-for-solar",
    "image": "https://media.guim.co.uk/8ca30e0a113e6b14984e1c8ca49a5919bc681343/338_0_4551_3640/500.jpg",
    "summary": "Demand for secondhand electric vehicle batteries in Australia is rapidly increasing, as buyers utilize them for various applications, including solar energy storage and off-grid power systems. This trend reflects a growing interest in sustainable energy solutions and resource repurposing. The rising interest highlights the potential for secondhand batteries to contribute to renewable energy initiatives.",
    "published": "2025-09-28T00:00:04Z"
  }
]