[
  {
    "title": "Denmark summons US charge d’affaires over alleged attempts to interfere with Greenland’s status – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/aug/27/volodymyr-zelenskyy-substantive-talks-eu-us-security-guarantees-ukraine-europe-latest-updates-news",
    "image": "https://media.guim.co.uk/bf28ad6adfac60e4a982aa9dd07dba4d7df6509c/567_0_3333_2666/500.jpg",
    "summary": "Danish Foreign Minister Lars Løkke Rasmussen has declared that interference in Denmark's internal affairs will not be tolerated. His statement underscores the country's stance on maintaining sovereignty and independence. This assertion comes amidst rising concerns over external pressures on domestic matters.",
    "published": "2025-08-27T14:35:23Z"
  },
  {
    "title": "Isabelle Huppert to headline 2026 Adelaide festival in ‘astounding’ role as Mary, Queen of Scots",
    "url": "https://www.theguardian.com/culture/2025/aug/28/adelaide-festival-2026-isabelle-huppert",
    "image": "https://media.guim.co.uk/a9d6e43aeeb5e3fa12e01c801b74d9971d802283/0_895_3695_2956/500.jpg",
    "summary": "French screen and stage legend will headline \"Mary Said What She Said,\" a one-woman show by the late theater icon Robert Wilson. The performance is set to take place in March. This marks a significant return to the stage for the celebrated artist.",
    "published": "2025-08-27T14:31:05Z"
  },
  {
    "title": "Scottish government trial of four-day week improves productivity and staff wellbeing",
    "url": "https://www.theguardian.com/business/2025/aug/27/scottish-government-trial-of-four-day-week-improves-productivity-and-staff-wellbeing",
    "image": "https://media.guim.co.uk/bcb73a7c2bf1d290190668a4a7317e97945088cb/403_238_4717_3774/500.jpg",
    "summary": "Employees at two public bodies have experienced a reduction in work-related stress, contributing to a healthier workplace environment. One of the organizations reported a notable decrease in sick days taken by staff. These positive trends suggest improvements in employee well-being and productivity.",
    "published": "2025-08-27T14:30:25Z"
  },
  {
    "title": "Suspect in murder of comedian Reggie Carroll was reportedly Katt Williams’s security guard",
    "url": "https://www.theguardian.com/us-news/2025/aug/27/reggie-carroll-murder-suspect-katt-williams-security",
    "image": "https://media.guim.co.uk/9297892b6c30d06a057424b73ff3542691be468d/500_0_5000_4000/500.jpg",
    "summary": "Standup comic Carroll was shot and killed in Southaven, Mississippi, shortly after completing a tour with another comedian. The incident has raised concerns about safety in the entertainment community. Details surrounding the shooting remain under investigation.",
    "published": "2025-08-27T14:28:48Z"
  },
  {
    "title": "Sandwich surprise! 12 delicious – and diabolical – ways to sweeten your sarnie",
    "url": "https://www.theguardian.com/food/2025/aug/27/sandwich-surprise-12-delicious-and-diabolical-ways-to-sweeten-your-sarnie",
    "image": "https://media.guim.co.uk/e6b94273ced5370b09d62c1b2748e682fa93adcd/680_458_4825_3860/500.jpg",
    "summary": "Sweet sandwiches have gained popularity in shops this summer. Recipes include delightful options like strawberries and cream, as well as apple pie panini. Learn how to create these tasty treats at home!",
    "published": "2025-08-27T14:28:13Z"
  }
]