[
  {
    "title": "Troubled New Zealand wildlife park euthanizes two lions, fate of five more unclear",
    "url": "https://www.theguardian.com/world/2025/nov/06/new-zealand-wildlife-park-euthanizes-two-lions",
    "image": "https://media.guim.co.uk/aa2c6e10ccd062fc0cab6075d730f6156457350d/31_0_5023_4019/500.jpg",
    "summary": "Members of the public are urging for the protection of the last lions at a sanctuary facing potential euthanasia. Former staff are also advocating for a reconsideration of the decision to put the lions down. The situation has sparked widespread concern and calls for intervention.",
    "published": "2025-11-06T01:31:59Z"
  },
  {
    "title": "Australia politics live: new rules to tackle ‘misleading and dishonest’ real estate underquoting in Victoria; Lehrmann and lawyer a no-show at court hearing",
    "url": "https://www.theguardian.com/australia-news/live/2025/nov/06/australia-politics-live-wfh-working-from-home-banks-net-zero-nationals-liberals-coalition-sussan-ley-anthony-albanese-labor-question-time-ntwnfb",
    "image": "https://media.guim.co.uk/85b6ef6928dfe8bad88197c0c829de28eac7a9f4/631_0_6306_5045/500.jpg",
    "summary": "I'm sorry, but I need more context or specific information about the news you'd like summarized. Could you please provide more details or the content of the news?",
    "published": "2025-11-06T01:28:54Z"
  },
  {
    "title": "US to cut airline traffic by 10% due to shutdown, Trump transport chief says",
    "url": "https://www.theguardian.com/us-news/2025/nov/05/government-shutdown-duffy-airspace-closures",
    "image": "https://media.guim.co.uk/9f0085b20564bf3f79ca0f38bf2c5fcb2f4899f6/436_0_2554_2043/500.jpg",
    "summary": "Sean Duffy announced that cuts at 40 locations to alleviate stress on air traffic controllers will begin on Friday if no solution is reached. The measure aims to address ongoing issues within the air traffic control system. Duffy emphasized the urgency of finding a resolution to prevent these cuts.",
    "published": "2025-11-06T01:21:32Z"
  },
  {
    "title": "Kentucky plane crash: death toll rises to 12 as officials investigate how engine detached",
    "url": "https://www.theguardian.com/us-news/2025/nov/05/ups-plane-crash-louisville-investigation",
    "image": "https://media.guim.co.uk/5065ef2a25da9a9a598623d0d71c744f29d20e79/632_0_6318_5055/500.jpg",
    "summary": "NTSB agents have arrived in Louisville to investigate the incident involving a UPS cargo plane that experienced engine detachment and a fire on its left wing. The investigation aims to determine the cause of the malfunctions during flight. The safety of cargo operations and the handling of such emergencies will be assessed as part of the inquiry.",
    "published": "2025-11-06T01:11:29Z"
  },
  {
    "title": "Trump goes on posting frenzy a day after Democrats win key elections",
    "url": "https://www.theguardian.com/us-news/2025/nov/05/trump-truth-social-posts",
    "image": "https://media.guim.co.uk/1ddbb42f4c80913f9ca408ee1b94ab1e1101b5fb/500_0_5000_4000/500.jpg",
    "summary": "President shares over 30 posts on Truth Social in just a few hours, featuring a mix of content. Among these are a series of strange AI-generated videos that garnered attention. The rapid posting raises questions about the nature and intent behind the shared content.",
    "published": "2025-11-06T01:07:37Z"
  }
]