[
  {
    "title": "Pentagon is shifting weapons purchases to ‘a wartime footing’, Hegseth announces - live",
    "url": "https://www.theguardian.com/us-news/live/2025/nov/07/donald-trump-government-shutdown-air-traffic-flights-snap-viktor-orban-hungary-ukraine-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/f5a436a69ac84c2a2b267c43126d47630f13b4af/650_0_5043_4034/500.jpg",
    "summary": "In a recent speech, Hegesth declared that the current defense acquisitions system is obsolete. He addressed industry leaders, military commanders, and officials, emphasizing the need for significant changes. This statement reflects ongoing concerns about the effectiveness and efficiency of defense procurement processes.",
    "published": "2025-11-07T21:10:10Z"
  },
  {
    "title": "Democrats unveil offer to end shutdown with one-year healthcare subsidies extension",
    "url": "https://www.theguardian.com/us-news/2025/nov/07/government-shutdown-vote-latest-senate",
    "image": "https://media.guim.co.uk/22d92e4fb72d1f8761e45b2e32d4c2492c338ac9/0_0_3334_2667/500.jpg",
    "summary": "Chuck Schumer proposed a plan to Republicans aimed at resolving the ongoing government shutdown, which has become the longest in U.S. history. This proposal seeks to facilitate a bipartisan agreement to reopen the government. The situation underscores the ongoing tensions and challenges in reaching a consensus on fiscal matters.",
    "published": "2025-11-07T21:04:10Z"
  },
  {
    "title": "Interviews with Anthony Hopkins, Helen Garner and Paul McCartney",
    "url": "https://www.theguardian.com/australia-news/2025/nov/08/five-great-reads-interviews-anthony-hopkins-helen-garner-paul-mccartney",
    "image": "https://media.guim.co.uk/1f28cc5e24aed6f47d766fc69a28a6d238200355/760_107_6170_4937/500.jpg",
    "summary": "Guardian Australia summarizes key news from the past week, curated by Imogen Dewey. The wrap covers significant events and highlights essential reads for readers. It provides a concise overview of important developments in various sectors.",
    "published": "2025-11-07T21:00:44Z"
  },
  {
    "title": "Corrections and clarifications",
    "url": "https://www.theguardian.com/news/2025/nov/07/corrections-and-clarifications",
    "summary": "A new oyster project is underway to enhance marine ecosystems and promote sustainability. Additionally, plans are being developed for a soldier’s cemetery to honor and memorialize fallen servicemen and women. Both initiatives aim to enrich the local community and preserve important environmental and historical legacies.",
    "published": "2025-11-07T21:00:43Z"
  },
  {
    "title": "WTA Finals tennis: Sabalenka beats Anisimova to set up final with Rybakina – as it happened",
    "url": "https://www.theguardian.com/sport/live/2025/nov/07/wta-finals-tennis-rybakina-pegula-sabalenka-anisimova-live",
    "image": "https://media.guim.co.uk/6c44a8bf57b61b4aeee0439495c3b78334238f00/548_110_2878_2302/500.jpg",
    "summary": "Aryna Sabalenka secured her place in the final after a thrilling three-set match against Amanda Anisimova. She will compete against Elena Rybakina in Saturday's championship match. The contest showcased Sabalenka's resilience and skill as she triumphed in a closely fought encounter.",
    "published": "2025-11-07T20:53:36Z"
  }
]