[
  {
    "title": "Hurricane Melissa latest updates: extensive damage reported in Jamaica’s St Elizabeth parish; Cuba braces for landfall ",
    "url": "https://www.theguardian.com/world/live/2025/oct/28/hurricane-melissa-live-updates-category-5-storm-jamaica-landfall-latest-news",
    "image": "https://media.guim.co.uk/8effd8ff437b97e0732e8a18ab7c894ae435c07e/520_0_4348_3478/500.jpg",
    "summary": "A powerful hurricane struck Jamaica as a category 5 storm, causing significant property damage and uprooting trees. It later weakened to a category 3 cyclone but remained dangerous. Recovery efforts are underway as the region assesses the impact of the storm.",
    "published": "2025-10-29T03:14:33Z"
  },
  {
    "title": "Australia politics live: Sussan Ley claims Labor ‘economic vandalism’ behind rise in inflation as question time under way",
    "url": "https://www.theguardian.com/australia-news/live/2025/oct/29/federal-politics-parliament-victoria-queensland-bom-labor-coalition-anthony-albanese-sussan-ley-abs-inflation-apec-summit-afp-press-club-ntwnfb",
    "image": "https://media.guim.co.uk/17d32ce68e9c99a5408c96f8d7ac30411ac23820/381_0_4508_3608/500.jpg",
    "summary": "I'm sorry, but I cannot access live updates or external content. However, if you provide me with specific news details, I'll be happy to summarize it for you!",
    "published": "2025-10-29T03:14:03Z"
  },
  {
    "title": "New Zealand v England: second men’s cricket one-day international – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/29/new-zealand-v-england-second-cricket-one-day-international-live",
    "image": "https://media.guim.co.uk/cbbffdd7221525aceeeaac6fbb585939b916c77c/244_0_2775_2221/500.jpg",
    "summary": "The second one-day international between New Zealand and England is taking place in Hamilton. An over-by-over report is being provided by the writers for real-time updates on the match. Fans can follow the action closely as the game progresses.",
    "published": "2025-10-29T03:07:29Z"
  },
  {
    "title": "Tanzanian president poised to retain power as rivals barred from election",
    "url": "https://www.theguardian.com/world/2025/oct/29/tanzania-election-president-samia-suluhu-hassan-poised-to-retain-power",
    "image": "https://media.guim.co.uk/371564595dbd8742c1208ab9c66f658c7ccd6fbe/340_0_2169_1735/500.jpg",
    "summary": "In the lead-up to the elections, critics of the government have been abducted, killed, or arrested, raising concerns over political freedom in Tanzania. President Samia Suluhu Hassan is facing her first electoral test amid these troubling events. The situation highlights increasing tensions as the country approaches its voting date.",
    "published": "2025-10-29T03:00:30Z"
  },
  {
    "title": "Woman denies gas supply sabotage as police investigate death of elderly man at Sutherland hospital",
    "url": "https://www.theguardian.com/australia-news/2025/oct/29/sutherland-hospital-gas-supply-nsw-police-investigating-death-ntwnfb",
    "image": "https://media.guim.co.uk/7730c90f24c88885148e32d77528bf21ffc9c550/437_0_7857_6286/500.jpg",
    "summary": "NSW police are investigating the death of a man at Sutherland Hospital. Vanessa Moulton, 42, has denied charges of sabotage in connection with the incident. Further details about the investigation have not been disclosed.",
    "published": "2025-10-29T02:43:43Z"
  }
]