[
  {
    "title": "TV tonight: Nicôle Lecky’s blood-soaked private school drama ",
    "url": "https://www.theguardian.com/tv-and-radio/2025/nov/15/tv-tonight-nicole-leckys-blood-soaked-private-school-drama",
    "image": "https://media.guim.co.uk/947b939c02cbf3b2ca3bc080df8df7316b3c97c0/640_0_3795_3036/500.jpg",
    "summary": "The Bafta-winning writer critiques the wealthy elite in the new series \"Wild Cherry,\" which has a Gossip Girl vibe. Additionally, Alan Carr makes a welcome return to television. Viewers have a fresh lineup of entertaining shows to enjoy tonight.",
    "published": "2025-11-15T06:15:01Z"
  },
  {
    "title": "305 best Christmas gifts for 2025: truly brilliant presents tried, tested and handpicked by the Filter UK",
    "url": "https://www.theguardian.com/thefilter/2025/nov/15/best-christmas-gifts-ideas-filter-uk-2025",
    "image": "https://media.guim.co.uk/19f6f7d88d02f9fc2ceea422363d9aefc80cf56e/0_0_4000_3199/500.jpg",
    "summary": "The ultimate Christmas gift guide features over 300 curated presents, including popular items like must-have Lego and smoky mezcal. It also highlights Meera Sodha’s favorite knife among various unique gift options. This comprehensive selection aims to help find the perfect gifts for the holiday season.",
    "published": "2025-11-15T06:00:09Z"
  },
  {
    "title": "‘Not for the faint-hearted’: is running the BBC an impossible job?",
    "url": "https://www.theguardian.com/media/ng-interactive/2025/nov/15/is-running-the-bbc-an-impossible-job",
    "image": "https://media.guim.co.uk/8fe093400120fc9f8c081d156023f8ec26fc428e/2360_107_3946_3157/500.jpg",
    "summary": "Tim Davie's resignation leaves the BBC with challenges as the next director general will contend with internal conflicts and external pressures. The incoming leader will also navigate critical discussions concerning the corporation's future and its role. The situation indicates a tumultuous period ahead for the BBC.",
    "published": "2025-11-15T06:00:07Z"
  },
  {
    "title": "Blind date: ‘She friend-zoned me over text before the night was through’",
    "url": "https://www.theguardian.com/lifeandstyle/2025/nov/15/blind-date-alex-rachel",
    "image": "https://media.guim.co.uk/696ef97d5e40ec42d725fb808ae6f805007e2a5f/0_0_5000_4000/500.jpg",
    "summary": "Alex, a 31-year-old academic, has met Rachel, a 28-year-old university caseworker. Their professional backgrounds could lead to interesting discussions and collaborations. This encounter marks the beginning of a potentially meaningful connection between the two.",
    "published": "2025-11-15T06:00:07Z"
  },
  {
    "title": "Avanti accused of ‘virtue signalling without virtue’ over wheelchair user art",
    "url": "https://www.theguardian.com/uk-news/2025/nov/15/avanti-accused-of-virtue-signalling-without-virtue-over-wheelchair-user-art",
    "image": "https://media.guim.co.uk/aa582948ee4dc2e6eefb45a991d6a45e3c0c7bad/261_0_1747_1399/500.jpg",
    "summary": "Campaigners argue that a train image featuring two wheelchair users unfairly represents the availability of space, as standard class typically only offers a single wheelchair space. They highlight the need for more accurate depictions to reflect the actual travel conditions for disabled passengers. The image has sparked discussions about accessibility on public transport.",
    "published": "2025-11-15T06:00:06Z"
  }
]