[
  {
    "title": "Liverpool’s WSL match postponed after Matt Beard’s death, Premier League buildup and more – matchday live",
    "url": "https://www.theguardian.com/football/live/2025/sep/21/arsenal-v-manchester-city-buildup-rome-derby-and-wsl-action-matchday-live",
    "image": "https://media.guim.co.uk/ad69df3a72ede1532389533381287f13a36d2488/183_0_4160_3328/500.jpg",
    "summary": "Join our team of writers as they anticipate an exciting day filled with thrilling football action. Stay tuned for insights and coverage of the day's events. Don't miss out on the excitement!",
    "published": "2025-09-21T09:23:47Z"
  },
  {
    "title": "Keir Starmer set to announce UK recognition of Palestine later today - UK politics live ",
    "url": "https://www.theguardian.com/politics/live/2025/sep/21/keir-starmer-palestine-recognition-announcement-gaza-uk-politics-live",
    "image": "https://media.guim.co.uk/4b97cc6b081483fb8c46eaac32defe55d8031476/0_0_4164_3333/500.jpg",
    "summary": "The prime minister is set to make an announcement this afternoon, amid ongoing tensions and opposition from Israeli officials. The specifics of the announcement remain unclear, but it is anticipated to address significant political matters. This development comes as the region navigates a complex landscape of conflict and diplomacy.",
    "published": "2025-09-21T09:13:39Z"
  },
  {
    "title": "Why Marie Antoinette, the French queen of court-ure, is having a style moment – again",
    "url": "https://www.theguardian.com/fashion/2025/sep/21/marie-antoinette-style-victoria-albert-london-exhibition-fashion",
    "image": "https://media.guim.co.uk/6203270f6d670110eec4708a76bd0213c258932b/0_0_1998_1598/500.jpg",
    "summary": "A new exhibition on Marie Antoinette is opening at London's V&A, highlighting her enduring influence as a fashion icon. The revival of interest in her life and style coincides with the ruling class showcasing extravagant wealth. This trend raises questions about the reasons behind her sudden resurgence in popularity.",
    "published": "2025-09-21T09:00:38Z"
  },
  {
    "title": "‘I can’t listen to music during sex - I start to wonder what mic they used on the snare’: Mark Ronson’s honest playlist",
    "url": "https://www.theguardian.com/music/2025/sep/21/mark-ronson-honest-playlist-night-people-uptown-funk",
    "image": "https://media.guim.co.uk/2349681c285eb6e53f962bd63cd1a0049a0ccd00/682_897_4087_3268/500.jpg",
    "summary": "The superstar DJ and producer enjoys partying to Candi Staton and secretly has a fondness for Pantera. He also reveals that he finds a particular Brian Eno epic to be the perfect soundtrack for romance. This combination highlights his diverse musical tastes and unique perspective on love.",
    "published": "2025-09-21T08:00:37Z"
  },
  {
    "title": "Optus admits process not followed after it missed at least five warnings of triple zero outage",
    "url": "https://www.theguardian.com/business/2025/sep/21/abhorrent-behaviour-call-for-optus-to-face-stiff-penalties-after-triple-zero-outage-deaths",
    "image": "https://media.guim.co.uk/6a6acb5a1bb3a224452cdca6fd2229ce02bc2b89/539_0_4931_3945/500.jpg",
    "summary": "The Albanese government faces mounting pressure to enforce strict penalties after the emergency management minister criticized a telecommunications company as \"absolutely disgraceful.\" This response follows incidents highlighting inadequate support during emergencies. Calls for accountability are intensifying as the government navigates the issue.",
    "published": "2025-09-21T07:38:32Z"
  }
]