[
  {
    "title": "Reeves refuses to say she will stick to manifesto pledge on tax rises and insists she must face world ‘as it is’ – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/nov/04/rachel-reeves-speech-tax-budget-labour-keir-starmer-latest-politics-news-live",
    "image": "https://media.guim.co.uk/7ebd2ee66722401ff1d8a55b51fe33ca1c924190/363_0_3411_2729/500.jpg",
    "summary": "In her pre-budget speech, the Chancellor emphasized her commitment to addressing the priorities of the British public. She signaled that tax increases are likely to be introduced in the upcoming budget. The remarks set the stage for a financial plan that reflects the government's focus on pressing national issues.",
    "published": "2025-11-04T10:22:56Z"
  },
  {
    "title": "US elections 2025 live: Americans go to the polls, with elections in New York City, New Jersey, Virginia and California",
    "url": "https://www.theguardian.com/us-news/live/2025/nov/04/us-elections-2025-live-new-york-city-new-jersey-virginia-california-latest-news-updates-live",
    "image": "https://media.guim.co.uk/0965b087be591a2ae6e1804d1ce1af3e63bad4df/1131_49_3758_3005/500.jpg",
    "summary": "The upcoming mayoral race in New York is garnering significant attention both domestically and internationally. Democratic candidate Zohran Mamdani will be competing against former Governor Andrew Cuomo and incumbent Curtis Sliwa. The election is seen as a pivotal moment in local politics, drawing interest from various stakeholders.",
    "published": "2025-11-04T10:22:35Z"
  },
  {
    "title": "Pound hits lowest since April as investors anticipate budget tax rises after Reeves speech – business live",
    "url": "https://www.theguardian.com/business/live/2025/nov/04/tax-rises-inevitable-rachel-reeves-budget-speech-borrowing-pound-stock-markets-business-live-news",
    "image": "https://media.guim.co.uk/68cf1b7ab2dd0c1dd2b4e0289b9527a034ab841e/410_0_3501_2802/500.jpg",
    "summary": "Rolling coverage highlights that the chancellor's recent speech suggests potential tax increases and stricter budget measures on the horizon. This has raised concerns about future economic policies. Speculation continues as the impacts on financial markets are monitored.",
    "published": "2025-11-04T10:20:41Z"
  },
  {
    "title": " See the light: the beautiful, and radical, art of Anna Ancher",
    "url": "https://www.theguardian.com/artanddesign/2025/nov/04/anna-ancher-painting-light-review-dulwich-picture-gallery",
    "image": "https://media.guim.co.uk/d0e181235a471f59c55521e196717d2e9b06cf2c/271_0_7636_6108/500.jpg",
    "summary": "A new solo exhibition showcases the work of a Danish painter from Skagen, highlighting her artistic tenderness and vision. The exhibition emphasizes her unique contributions to the art world, set against the backdrop of the remote northern Danish landscape. Visitors can experience her captivating artistry that reflects both emotional depth and beauty.",
    "published": "2025-11-04T10:09:49Z"
  },
  {
    "title": "BP signals more cost cuts on way after fall in profits",
    "url": "https://www.theguardian.com/business/2025/nov/04/bp-asset-sales-fall-in-profits-oil-gas",
    "image": "https://media.guim.co.uk/ef0958cef70b0fd8eca7e0b7b2fcab588461be99/671_0_6711_5369/500.jpg",
    "summary": "An oil and gas company announced plans to review its portfolio and expedite the sale of assets. This strategic move aims to optimize operations and enhance financial performance. The decision reflects a response to evolving market conditions and stakeholder expectations.",
    "published": "2025-11-04T10:09:11Z"
  }
]