[
  {
    "title": "Europa League: Aston Villa v Maccabi Tel Aviv, Rangers v Roma, and more – live",
    "url": "https://www.theguardian.com/football/live/2025/nov/06/europa-league-aston-villa-v-maccabi-tel-aviv-rangers-v-roma-and-more-live",
    "image": "https://media.guim.co.uk/c832efd26b81e22fb658dfba1482045e4cb8d90a/0_0_5000_4000/500.jpg",
    "summary": "Aston Villa will face Maccabi Tel Aviv in the Europa League, while Rangers take on a challenging matchup against Roma. Michael Butler will be covering these exciting matches. Both games present key opportunities for the teams as they aim to advance in the tournament.",
    "published": "2025-11-06T19:15:01Z"
  },
  {
    "title": "Lammy says he was right not to discuss mistakenly freed prisoner at PMQs",
    "url": "https://www.theguardian.com/society/2025/nov/06/lammy-says-he-was-right-not-to-discuss-mistakenly-freed-prisoner-at-pmqs",
    "image": "https://media.guim.co.uk/69aa4ba3da26d6774cc4fee5aa4f4448e9e5b436/454_0_5000_4000/500.jpg",
    "summary": "The justice secretary admitted lacking complete information during a recent discussion about the prisons crisis. He acknowledged the significant challenges ahead in addressing the issues within the prison system. Urgent reforms and solutions are needed to improve the situation.",
    "published": "2025-11-06T19:14:21Z"
  },
  {
    "title": "Trump defends tariffs as matter of ‘national security’, saying a supreme court ruling against them would be ‘somewhat catastrophic’ - live",
    "url": "https://www.theguardian.com/us-news/live/2025/nov/06/donald-trump-government-shutdown-venezuela-senate-vote-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/4ec6b889773d1d5bcb5c8deadafe905a500e4189/217_0_3333_2667/500.jpg",
    "summary": "President asserts that tariffs play a crucial role in the economy, suggesting they determine whether businesses succeed or fail. He provides no supporting evidence for this claim. Critics question the validity of his statement, highlighting the need for factual backing.",
    "published": "2025-11-06T19:13:48Z"
  },
  {
    "title": "Nancy Pelosi, a force on Capitol Hill for decades, to retire from Congress ",
    "url": "https://www.theguardian.com/us-news/2025/nov/06/nancy-pelosi-retire-congress",
    "image": "https://media.guim.co.uk/7085d8247203b2015b8431579c0b2e24fcb2f3ed/433_0_5001_4000/500.jpg",
    "summary": "The historic 20-term congressional career of the first woman to serve as House Speaker comes to an end with her recent decision. This marks a significant milestone in U.S. political history. Her legacy includes numerous legislative achievements and a commitment to public service.",
    "published": "2025-11-06T19:10:21Z"
  },
  {
    "title": "Nandy apologises to No 10 for breaching code in regulator appointment",
    "url": "https://www.theguardian.com/politics/2025/nov/06/lisa-nandy-apologises-keir-starmer-football-regulator-governance-code",
    "image": "https://media.guim.co.uk/fb94184365938d42fd9871b2a68e7f828628b8ca/271_0_3473_2779/500.jpg",
    "summary": "The culture secretary has expressed deep regret after an inquiry revealed that there were failures in declaring past donations related to a nominee for a watchdog position. The inquiry highlighted gaps in transparency and accountability in the nomination process. Steps to address these issues and improve future practices are expected to follow.",
    "published": "2025-11-06T19:08:09Z"
  }
]