[
  {
    "title": "Minister says police and crime commissioners will be abolished in 2028 because system has failed – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/nov/13/ed-miliband-wes-streeting-keir-starmer-briefing-news-updates-uk-politics-live",
    "image": "https://media.guim.co.uk/c4d5106752aa415b258d5f842a10f258c60026db/358_0_7207_5768/500.jpg",
    "summary": "Elected policing roles in England will be gradually eliminated, with their powers being shifted to mayors. This restructuring aims to streamline governance and improve efficiency. The change is projected to save around £100 million.",
    "published": "2025-11-13T12:43:01Z"
  },
  {
    "title": "Cop30 live: calls for ‘just transition’ plan grow as report warns world on track for 2.6C of heating",
    "url": "https://www.theguardian.com/environment/live/2025/nov/13/cop30-live-calls-for-just-transition-plan-grow-as-report-warns-world-on-track-for-26c-of-heating",
    "image": "https://media.guim.co.uk/9379041f82b328b6f0e3a5ddee4dbd850b238abb/259_0_2949_2359/500.jpg",
    "summary": "The Climate Action Tracker's recent report reveals that pledges made over the past year have failed to reduce the predicted increase in global temperatures. Despite commitments, the report indicates that they remain insufficient to address climate change effectively. Urgent action is necessary to meet global climate goals and mitigate heating impacts.",
    "published": "2025-11-13T12:42:33Z"
  },
  {
    "title": "UK exports to US hit lowest level since January 2022 as tariffs bite – business live",
    "url": "https://www.theguardian.com/business/live/2025/nov/13/uk-gdp-report-economy-growth-jlr-hack-stock-markets-pound-bonds-business-live-news",
    "image": "https://media.guim.co.uk/9289bb80afc5d14bc9352054d1fcd52fc58df771/338_0_4099_3280/500.jpg",
    "summary": "Recent economic data reveals a decline in UK exports to the US, coinciding with a contraction in Britain's economy during September. This drop indicates ongoing challenges faced by the UK economy amidst shifting global trade dynamics. Analysts suggest these trends could impact future economic growth prospects.",
    "published": "2025-11-13T12:39:37Z"
  },
  {
    "title": "Germany expects Ukraine to ‘vigorously pursue the fight against corruption’, says Merz – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/nov/13/volodymyr-zelenskyy-ukraine-russia-corruption-brussels-news-updates-europe-live",
    "image": "https://media.guim.co.uk/c55fc0218260140af6b7da461e8c4bf39941b1ff/238_0_4167_3333/500.jpg",
    "summary": "German Chancellor and Ukrainian President Zelenskyy addressed recent corruption allegations involving former members of the Ukrainian cabinet during a morning phone call. They likely discussed the implications for Ukraine's governance and reforms. Both leaders emphasized the importance of transparency and accountability in tackling corruption.",
    "published": "2025-11-13T12:38:51Z"
  },
  {
    "title": "US government reopens after longest-ever shutdown; House to vote on Epstein files next week – live",
    "url": "https://www.theguardian.com/us-news/live/2025/nov/13/donald-trump-jeffrey-epstein-files-us-government-shutdown-latest-news-updates",
    "image": "https://media.guim.co.uk/c5520906f48617f66ef64a541116a6f7a14d1b54/459_0_4566_3655/500.jpg",
    "summary": "Federal workers are instructed to return to the office following the end of the government shutdown. House Speaker Mike Johnson, who is against the Epstein bill, has committed to holding a full vote on the legislation next week. This move signifies a shift towards normalcy after the shutdown.",
    "published": "2025-11-13T12:35:32Z"
  }
]