[
  {
    "title": "Trump’s call to freeze Ukraine conflict at current frontlines is ‘good compromise’, says Zelenskyy – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/oct/22/russia-ukraine-war-kyiv-attack-latest-news-updates-europe",
    "image": "https://media.guim.co.uk/a7c5520b23006e06e8f0db5c581a58593bbecd97/93_167_792_634/500.jpg",
    "summary": "The Ukrainian president made comments amidst the suspension of a planned summit between the US and Russia. This follows renewed attacks on Kyiv, heightening tensions in the region. The situation reflects ongoing conflicts and diplomatic challenges surrounding Ukraine.",
    "published": "2025-10-22T10:21:22Z"
  },
  {
    "title": "Australia v England: Women’s Cricket World Cup – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/22/australia-v-england-womens-cricket-world-cup-live",
    "image": "https://media.guim.co.uk/082f19ee28f9f86f95034c1c6aca6acf83dddc89/500_0_5000_4000/500.jpg",
    "summary": "In Indore, two unbeaten teams in the competition are set to face off. Writers provide live updates on the match as it unfolds. Fans can follow the action as it develops over the overs.",
    "published": "2025-10-22T10:20:05Z"
  },
  {
    "title": "Gaza ceasefire could lead to more Israeli alliances in Middle East, Vance says at Netanyahu meeting – live",
    "url": "https://www.theguardian.com/world/live/2025/oct/22/israel-gaza-ceasefire-jd-vance-netanyahu-hamas-hostages-middle-east-latest-news-updates",
    "image": "https://media.guim.co.uk/4e3e52f613ff6dfe5e4036fa96bd1ff899e6867b/527_0_4870_3896/500.jpg",
    "summary": "The US Vice President is meeting with the Israeli Prime Minister during a delicate ceasefire in Gaza. This visit highlights the ongoing efforts to stabilize the region amid tensions. The discussions focus on fostering peace and addressing humanitarian concerns.",
    "published": "2025-10-22T10:13:38Z"
  },
  {
    "title": "Chain Reactions review – famous fans of Texas Chain Saw Massacre go deep into the legendary slasher",
    "url": "https://www.theguardian.com/film/2025/oct/22/chain-reactions-review-stephen-king-takashi-miike-patton-oswalt-texas-chain-saw-massacre",
    "image": "https://media.guim.co.uk/0ae5dd9d9d7cd74a8ffce2e537098d7ae63241ba/411_0_1349_1080/500.jpg",
    "summary": "A new documentary features contributions from renowned filmmakers Stephen King, Takashi Miike, and Karyn Kusama, exploring Tobe Hooper's iconic 1974 horror film. The film seeks to delve into the legacy and impact of Hooper's work. It highlights the influence this masterpiece has had on the horror genre.",
    "published": "2025-10-22T10:00:50Z"
  },
  {
    "title": "Flooding and droughts drove them from their homes. Now they’re seeking a safe haven in New York",
    "url": "https://www.theguardian.com/environment/2025/oct/22/climate-disasters-migration-new-york",
    "image": "https://media.guim.co.uk/813421a31c7d78e263779ec187e1e356b03c78ee/1047_0_5602_4480/500.jpg",
    "summary": "Data analysis reveals that migration to the U.S. has increased significantly from regions in Guatemala, Bangladesh, and Senegal affected by frequent climate disasters. The findings highlight the impact of environmental factors on migration patterns. This trend underscores the urgent need for addressing climate-related challenges in these vulnerable areas.",
    "published": "2025-10-22T10:00:50Z"
  }
]