[
  {
    "title": "Mamdani and Cuomo spar in New York mayoral debate – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/16/trump-latest-shutdown-vote-jd-vance-republicans-democrats",
    "image": "https://media.guim.co.uk/45ef700328050322541ef5a1a4775eeefe7e78c2/265_0_2645_2116/500.jpg",
    "summary": "During a recent candidates' debate, topics covered included Donald Trump, the Gaza conflict, and issues specific to New York. Additionally, John Bolton has been indicted by a federal grand jury. The debate highlighted both national and local concerns amidst significant legal developments.",
    "published": "2025-10-17T01:25:52Z"
  },
  {
    "title": "Australia news live: Hume accused of painting regional people as ‘slow-talking drongos’; inner-city Sydney council blocks McDonald’s ",
    "url": "https://www.theguardian.com/australia-news/live/2025/oct/17/australia-news-live-sussan-ley-anthony-albanese-trump-meeting-foi-climate-laws-ntwnfb",
    "image": "https://media.guim.co.uk/527a75fe9ebc3f1fbbbff510623e2660950d5a85/548_0_6272_5018/500.jpg",
    "summary": "I'm unable to access or summarize live news updates at the moment. Please provide specific content or details for me to summarize!",
    "published": "2025-10-17T01:24:53Z"
  },
  {
    "title": "What are rare earths and critical minerals – explained in 30 seconds",
    "url": "https://www.theguardian.com/world/2025/oct/17/rare-earths-critical-minerals-explained",
    "image": "https://media.guim.co.uk/85a1d80399c102d63b3a397f901df050bae51cc0/1_0_2499_2000/500.jpg",
    "summary": "Rare earths are essential critical minerals vital for defense, automotive, and electronics sectors. Their strategic importance has intensified tensions in diplomatic relations and global trade. As demand rises, nations are vying for control over these resources.",
    "published": "2025-10-17T00:51:35Z"
  },
  {
    "title": "‘Wailing ghosts through loudspeakers’: Cambodia accuses Thailand of psychological warfare along border",
    "url": "https://www.theguardian.com/world/2025/oct/17/cambodia-accuses-thailand-psychological-warfare-border",
    "image": "https://media.guim.co.uk/aadc7409a9f5bb2ca0175c83b3d4e77efe9ad08b/402_0_4512_3609/500.jpg",
    "summary": "Cambodia’s rights commission has warned that \"intense, high-pitched noises\" emitted by Thai soldiers near the disputed border could escalate tensions between the two countries. The commission expressed concerns about the potential for increased conflict resulting from these broadcasts. Diplomatic relations may be strained as Cambodia reacts to this provocative action.",
    "published": "2025-10-17T00:38:20Z"
  },
  {
    "title": "Australia Post incorrectly charged tariffs on items ordered online being returned to the US",
    "url": "https://www.theguardian.com/business/2025/oct/17/australia-post-incorrect-tariffs-us-online-returns",
    "image": "https://media.guim.co.uk/1f9ddd8ede45ec8eb059c0986d382e47bf21e667/0_0_5743_4595/500.jpg",
    "summary": "Trump tariffs will not be imposed on returned goods that were originally manufactured in the United States. This policy aims to support domestic manufacturers by exempting certain returned items from tariff regulations. The clarification ensures that U.S. businesses can effectively manage their inventory without facing additional costs.",
    "published": "2025-10-17T00:26:05Z"
  }
]