[
  {
    "title": "Pound dips after UK economy grinds to a halt in July with no growth in GDP – business live",
    "url": "https://www.theguardian.com/business/live/2025/sep/12/uk-gdp-report-economy-july-tariffs-inflation-consumer-confidence-business-live",
    "image": "https://media.guim.co.uk/c6be9b8c1d79a51bd79ae817a30de8a7c44a0aad/166_0_4934_3948/500.jpg",
    "summary": "The UK economy remains stagnant, with the Treasury spokesperson acknowledging a feeling of being \"stuck\" after the GDP showed no change in July. This lack of growth raises concerns about the country's economic vitality. The situation highlights ongoing challenges faced by the UK economy amid global uncertainties.",
    "published": "2025-09-12T07:25:35Z"
  },
  {
    "title": "Charlie Kirk’s killer still at large as video of suspect released – live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/12/charlie-kirk-shooter-suspect-latest-news-updates-donald-trump-utah",
    "image": "https://media.guim.co.uk/ca8554f3ef7bb4b9452f7942dced10abb093acdf/58_0_6000_4800/500.jpg",
    "summary": "Utah's governor emphasized the importance of public assistance in ongoing investigations, stating that the FBI has received over 7,000 leads and tips. This collaboration is critical for law enforcement to effectively carry out their duties. The call for public cooperation highlights the need for community involvement in crime-solving efforts.",
    "published": "2025-09-12T07:25:18Z"
  },
  {
    "title": "UK economy flatlines in July in grim news for Rachel Reeves",
    "url": "https://www.theguardian.com/business/2025/sep/12/uk-economy-flatlines-july-grim-news-rachel-reeves",
    "image": "https://media.guim.co.uk/9dbc53185d463216ebec7b22bb8e22ca5f3136b1/259_0_5028_4024/500.jpg",
    "summary": "Official GDP figures show a confirmed slowdown in economic growth, following a strong expansion in the first half of the year. Analysts anticipated this shift, reflecting changes in market conditions. The latest data underscores shifting economic dynamics as growth normalizes.",
    "published": "2025-09-12T07:18:00Z"
  },
  {
    "title": "Australia news live: health ministers agree to new fertility sector accreditation regime after IVF bungles",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/12/anthony-albanese-pacific-islands-forum-woodside-north-west-shelf-decision-sussan-ley-labor-coalition-ntwnfb",
    "image": "https://media.guim.co.uk/596ddfa76d3e874c10ec766aeabe25a63b33a42b/854_0_6273_5018/500.jpg",
    "summary": "I'm sorry, but I need more context or content from the news article you'd like summarized. Please provide the details you'd like me to summarize!",
    "published": "2025-09-12T07:17:17Z"
  },
  {
    "title": "The Wrong Paris review – Netflix Bachelor romcom makes few right choices",
    "url": "https://www.theguardian.com/film/2025/sep/12/wrong-paris-movie-review-netflix",
    "image": "https://media.guim.co.uk/0272e4351107eaeca67334989029382c6170a951/435_3_2063_1651/500.jpg",
    "summary": "Miranda Cosgrove stars in a new series centered around a woman's experience with reality show drama. The show is noted for being another low-quality entry among the streaming platform's offerings. Viewers seeking light entertainment might find it worth a watch despite its shortcomings.",
    "published": "2025-09-12T07:01:28Z"
  }
]