[
  {
    "title": "A California Gold Rush town was like ‘going back in time’. Then came a wildfire",
    "url": "https://www.theguardian.com/us-news/2025/sep/04/a-california-gold-rush-town-was-like-going-back-in-time-then-came-a-wildfire",
    "image": "https://media.guim.co.uk/2db65a9b50706da1b397bdf8f47210d963fb5297/481_0_4821_3856/500.jpg",
    "summary": "A historic 19th-century settlement, originally established by Chinese miners and known for its association with the outlaw Black Bart, was recently ravaged by a fire. The blaze caused significant destruction to the community's remnants. Efforts to assess the damage and recover from the incident are underway.",
    "published": "2025-09-04T21:26:13Z"
  },
  {
    "title": "Australia news live: Albanese holds ‘constructive’ phone call with Trump; two die on road trying to save animal",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/05/australia-news-live-albanese-trump-tariffs-meeting-porepunkah-police-officer-funerals-ntwnfb",
    "image": "https://media.guim.co.uk/a67e7b107aeb1936688d9fcfe28d8854802b053c/0_1_5000_3998/500.jpg",
    "summary": "It seems like you may have wanted to provide a specific news article or details for summarization. Please share the content you'd like summarized, and I'll be happy to assist!",
    "published": "2025-09-04T21:22:24Z"
  },
  {
    "title": "President of Northwestern University quits amid layoffs forced by Trump cuts",
    "url": "https://www.theguardian.com/us-news/2025/sep/04/northwestern-university-president-resigns-trump-cuts",
    "image": "https://media.guim.co.uk/f50a5ce6c12c1354441f99024e7b3e2e5e7d1826/250_0_2501_2001/500.jpg",
    "summary": "Michael H. Schill, who served as the president of the institution for three years, faced significant budget challenges as the Trump administration cut nearly $800 million in funding. His leadership coincided with these financial pressures, impacting the institution's operations. The announcement highlights the challenges faced by educational leaders during politically turbulent times.",
    "published": "2025-09-04T21:10:22Z"
  },
  {
    "title": "Fired health official offers to testify under oath after RFK Jr accused her of lying in heated Senate hearing – live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/04/donald-trump-tariffs-immigration-technology-epstein-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/3b26904f7b22257a97a56722544fab5915e691d1/500_0_5000_4000/500.jpg",
    "summary": "The former CDC director, who faced accusations of dishonesty from Robert F. Kennedy Jr., has stated her willingness to testify regarding the pressure she received to approve a panel that included individuals with anti-vaccine perspectives. She aims to clarify the circumstances surrounding the decision. The situation highlights ongoing tensions between public health officials and vaccine skeptics.",
    "published": "2025-09-04T21:08:53Z"
  },
  {
    "title": "Trump set to host US tech leaders at Rose Garden – minus Elon Musk",
    "url": "https://www.theguardian.com/technology/2025/sep/04/trump-rose-garden-tech-dinner-elon-musk",
    "image": "https://media.guim.co.uk/c01c46966109a833cd888e19467adfccceb718b4/150_0_4239_3390/500.jpg",
    "summary": "Tesla CEO Elon Musk's absence from the White House highlights a significant shift from his frequent presence during the early days of the Trump administration. This change underscores a potential shift in priorities and engagement with the current government. Musk's relationship with the administration appears to have cooled compared to previous interactions.",
    "published": "2025-09-04T21:08:04Z"
  }
]