[
  {
    "title": "Serbia v England: World Cup 2026 qualifying Group K – live",
    "url": "https://www.theguardian.com/football/live/2025/sep/09/serbia-v-england-world-cup-2026-qualifying-group-k-live",
    "image": "https://media.guim.co.uk/010f47c41e7a308b4ea5a03a0c83485aa464eefe/1414_684_3925_3139/500.jpg",
    "summary": "Thomas Tuchel's team aims to continue their perfect record in Group K. Rob Smyth provides a minute-by-minute report on the match. Fans are eager to see if they can secure another victory.",
    "published": "2025-09-09T19:23:48Z"
  },
  {
    "title": "Trump spokesperson calls strike on Qatar ‘unfortunate’ after Israel targets Hamas leaders in Doha – live updates",
    "url": "https://www.theguardian.com/world/live/2025/sep/09/israel-gaza-city-evacuation-order-idf-military-offensive-live-updates-middle-east-crisis-latest-news",
    "image": "https://media.guim.co.uk/194b78f6b7777ba65dde174e77716e009ae0bbba/117_0_1849_1479/500.jpg",
    "summary": "Trump's press secretary stated that the attack on Hamas leaders does not further Israel or America's objectives. She characterized Qatar as a strong ally and friend of the United States. The remarks highlight the complex dynamics in U.S. foreign policy in the Middle East.",
    "published": "2025-09-09T19:21:03Z"
  },
  {
    "title": "White House denies that Trump wrote Epstein letter and calls investigation a Democrat ‘hoax’ – live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/09/donald-trump-jeffrey-epstein-birthday-note-letter-latest-live-us-politics-news",
    "image": "https://media.guim.co.uk/b0e5d7e8b7aa33fd498746bbd3662c425557d965/603_29_1913_1531/500.jpg",
    "summary": "The White House press secretary has refuted claims that President Biden sent convicted sex trafficker Jeffrey Epstein a card featuring an outline of a woman's body for his 50th birthday. The statement was made in response to recent allegations circulating in the media. The press secretary emphasized the inaccuracy of these claims.",
    "published": "2025-09-09T19:17:10Z"
  },
  {
    "title": "Starmer condemns Israel airstrike on Qatar as No 10 denies prior knowledge of attack",
    "url": "https://www.theguardian.com/politics/2025/sep/09/starmer-condemns-israel-airstrike-on-qatar-as-no-10-denies-prior-knowledge-of-attack",
    "image": "https://media.guim.co.uk/daf3c614a400d5dbb5c68a8e8482c840ac4d7b48/185_0_2917_2333/500.jpg",
    "summary": "The Prime Minister stated that an immediate ceasefire, the release of hostages, and a significant increase in aid to Gaza are essential for achieving peace. This statement emphasizes the need for urgent humanitarian interventions amid ongoing conflict. The call reflects a focused approach to address the crisis and facilitate stability in the region.",
    "published": "2025-09-09T19:16:18Z"
  },
  {
    "title": "Brazil: first judge in Jair Bolsonaro coup plot trial votes to convict",
    "url": "https://www.theguardian.com/world/2025/sep/09/brazil-jair-bolsonaro-trial",
    "image": "https://media.guim.co.uk/066af62a5e473c0ede0aa7803097460b8d2613c3/109_0_3445_2756/500.jpg",
    "summary": "Four additional Supreme Court justices are set to cast their votes soon, with a final verdict anticipated by Thursday or Friday. The decision will conclude ongoing deliberations among the justices. The outcome remains closely watched.",
    "published": "2025-09-09T19:12:06Z"
  }
]