[
  {
    "title": "Australia news live: NSW government should be ‘ashamed’ by record deaths in custody, Aboriginal Legal Service head says",
    "url": "https://www.theguardian.com/australia-news/live/2025/oct/15/australia-news-live-liberals-infighting-james-paterson-sussan-ley-andrew-hastie-superannuation-jim-chalmers-ntwnfb",
    "image": "https://media.guim.co.uk/e58670cf9a4fcfdb9a727cbab765acb5cb7ba58c/856_0_5600_4480/500.jpg",
    "summary": "Sure, please provide the news you'd like summarized in three lines.",
    "published": "2025-10-14T22:12:29Z"
  },
  {
    "title": "No jeopardy in Riga: the real tests for Thomas Tuchel’s England lie ahead | Jacob Steinberg",
    "url": "https://www.theguardian.com/football/2025/oct/14/no-jeopardy-in-riga-the-real-tests-for-thomas-tuchels-england-lie-ahead",
    "image": "https://media.guim.co.uk/2497eec10008c9057b052a4c2777e05f7ba53415/341_0_3411_2729/500.jpg",
    "summary": "The team's qualification process has been relatively straightforward, raising doubts about their readiness to compete against stronger opponents at the World Cup. This lack of challenging matches may not accurately reflect their capabilities. Concerns exist regarding their performance in high-stakes situations.",
    "published": "2025-10-14T22:01:51Z"
  },
  {
    "title": "Israel limits aid into Gaza in dispute over hostage remains as ceasefire faces test",
    "url": "https://www.theguardian.com/world/2025/oct/14/israel-limits-aid-keeps-rafah-crossing-closed-dispute-hostage-remains",
    "image": "https://media.guim.co.uk/faa7560e592b3de0acee51d63f6493373aa4f60a/928_0_4800_3840/500.jpg",
    "summary": "Hamas has been accused of violating an agreement by withholding the bodies of hostages, which has raised tensions. Palestinian militants contend they are encountering challenges in retrieving the remains. The situation highlights ongoing difficulties in the negotiations and the humanitarian crisis in the region.",
    "published": "2025-10-14T21:58:05Z"
  },
  {
    "title": "Trump posthumously awards Charlie Kirk the Presidential Medal of Freedom",
    "url": "https://www.theguardian.com/us-news/2025/oct/14/charlie-kirk-presidential-medal-of-freedom-trump",
    "image": "https://media.guim.co.uk/21191bdaae0bc783b2b94b6d74fe34f1d74afbbf/319_0_4001_3200/500.jpg",
    "summary": "On what would have been far-right commentator Kirk's 32nd birthday, the President honored his memory by presenting an award to his widow, Erika. The gesture highlighted the impact of Kirk's work and his legacy. The event served as a moment of recognition and tribute to his life and contributions.",
    "published": "2025-10-14T21:55:16Z"
  },
  {
    "title": "Trump calls Charlie Kirk a martyr and boasts about 2024 election at posthumous medal ceremony – live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/14/donald-trump-government-shutdown-national-guard-javier-milei-charlie-kirk-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/b77efdf1af9a6bc9ba018e1f93014bc8b290d25c/355_0_3968_3174/500.jpg",
    "summary": "President honors Charlie Kirk during a Medal of Freedom ceremony, celebrating his contributions. The award was presented posthumously to his widow, Erika Kirk. The event highlights Kirk's impact and legacy.",
    "published": "2025-10-14T21:53:07Z"
  }
]