[
  {
    "title": "China’s trade surplus hits $1tn for first time despite Trump’s tariffs – business live",
    "url": "https://www.theguardian.com/business/live/2025/dec/08/china-trade-surplus-trump-tariffs-stock-market-ftse-pound-business-live-latest-news",
    "image": "https://media.guim.co.uk/a8a8e884064b63796db597744e3dfe86e6aa72a1/166_0_2880_2304/500.jpg",
    "summary": "In November, China's exports exceeded forecasts, reflecting strong demand, particularly from non-US markets. This surge indicates resilience in China's trade despite ongoing global economic challenges. The data suggests a shift in trade dynamics as China diversifies its export destinations.",
    "published": "2025-12-08T09:25:30Z"
  },
  {
    "title": "Labour Together reportedly canvassing party members on leadership candidates – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/dec/08/labour-leadership-keir-starmer-conservatives-live-updates",
    "image": "https://media.guim.co.uk/a3a7b99876850d5f39f3350792b8d926dc5f803b/285_0_5000_4000/500.jpg",
    "summary": "Keir Starmer is facing scrutiny following reports that local Labour groups have been solicited for opinions on potential leaders for the party ahead of the next election. This move has raised questions about confidence in Starmer's leadership and the party's direction. Critics view this as an indication of instability within Labour as they prepare for future electoral challenges.",
    "published": "2025-12-08T09:21:44Z"
  },
  {
    "title": "Trump warns Netflix’s $83bn deal for Warner Bros poses competition concerns",
    "url": "https://www.theguardian.com/media/2025/dec/08/trump-netflix-warner-bros-takeover-deal-competition-concerns",
    "image": "https://media.guim.co.uk/a388fe5fa4dc9ec484e58f345989bbbb96e4b0c1/250_0_2500_2000/500.jpg",
    "summary": "President commits to personally overseeing a controversial takeover, which has been labeled 'unprecedented' by a former regulatory head. The move indicates heightened government interest and potential scrutiny over the acquisition. Further details on the takeover's implications are expected as discussions unfold.",
    "published": "2025-12-08T09:15:24Z"
  },
  {
    "title": "Ukraine war live: Zelenskyy to meet Starmer, Macron and Merz in London over peace push",
    "url": "https://www.theguardian.com/world/live/2025/dec/08/ukraine-zelenskyy-starmer-merz-macron-london-trump-russia-europe-news-latest-updates",
    "image": "https://media.guim.co.uk/e806c48978a5ab3e063f3a525e239ab3eec4d24f/0_0_4708_3766/500.jpg",
    "summary": "Ukrainian President's talks with leaders of the UK, France, and Germany follow unsuccessful discussions between the US and Ukraine in Florida. The meetings aim to seek support amidst ongoing geopolitical tensions. The situation underscores the urgency for diplomatic efforts to address Ukraine's challenges.",
    "published": "2025-12-08T09:12:37Z"
  },
  {
    "title": "The Tale of Silyan review – farmer adopts stork in delightfully cockle-warming mud-caked folk tale ",
    "url": "https://www.theguardian.com/film/2025/dec/08/the-tale-of-silyan-review-farmer-adopts-stork-in-delightfully-cockle-warming-mud-caked-folk-tale",
    "image": "https://media.guim.co.uk/65f4dfd56c3343b7639c40624138b065f3f70aa2/241_0_2116_1694/500.jpg",
    "summary": "In North Macedonia, a heartwarming family film features non-professional actors portraying aging farmers. The story highlights their struggles and resilience as they navigate the challenges of rural life. The film captures the warmth and camaraderie within the farming community.",
    "published": "2025-12-08T09:00:46Z"
  }
]