[
  {
    "title": "World Athletics Championships 2025: Lyles lays down 200m marker as Gout exits, 400m finals – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/18/world-athletics-championships-2025-400m-finals-200m-semis-and-more-live",
    "image": "https://media.guim.co.uk/aa758ae72da57f2b48e1a5b52e4221de5634e7e3/366_0_3513_2810/500.jpg",
    "summary": "Daniel Harris will provide updates from night six in Tokyo, where medals in both the men's and women's 400m events are on the line. The competition is heating up as athletes compete for top honors. Stay tuned for live updates on the exciting races.",
    "published": "2025-09-18T13:19:30Z"
  },
  {
    "title": "Surrey v Nottinghamshire, Somerset v Hampshire, and more: county cricket, day four – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/18/surrey-v-nottinghamshire-somerset-v-hampshire-and-more-county-cricket-day-four-live",
    "image": "https://media.guim.co.uk/c05c1e0a91abc803fa8b8879d58806d56c163b65/269_0_4546_3636/500.jpg",
    "summary": "Tanya Aldred provides updates on the concluding day of the current County Championship matches. Key highlights and developments from the games will be covered. Stay tuned for the latest results and performances from the teams.",
    "published": "2025-09-18T13:18:14Z"
  },
  {
    "title": "Him review – Jordan Peele-produced football horror is a disappointing fumble",
    "url": "https://www.theguardian.com/film/2025/sep/18/him-jordan-peele-film-review",
    "image": "https://media.guim.co.uk/b2ffcb728ec63a5a68f5764319b8683aef4277bf/495_185_2349_1880/500.jpg",
    "summary": "Marlon Wayans stars as a quarterback in a comedic take that critiques the flawed sports system. The film emphasizes the search for the next \"Greatest of All Time\" (Goat) but does so in a tongue-in-cheek manner. It blends humor with social commentary, highlighting the absurdities of competitiveness in sports.",
    "published": "2025-09-18T13:13:40Z"
  },
  {
    "title": "Trump celebrates Jimmy Kimmel suspension as some networks replace show with Charlie Kirk tribute – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/18/jimmy-kimmel-charlie-kirk-comments-show-cancelled-suspended-monologue-trump-us-politics-live",
    "image": "https://media.guim.co.uk/2d731b09c5ef58a420c26fcedc65713f29b77eb9/578_0_1106_886/500.jpg",
    "summary": "Jamie Lee Curtis and Ben Stiller have voiced their concerns regarding the indefinite cancellation of \"Jimmy Kimmel Live!\" Senate Democratic leader suggests that the issue might need to be resolved in court. The situation has sparked significant public and political debate.",
    "published": "2025-09-18T13:13:18Z"
  },
  {
    "title": "Bank of England governor says UK ‘not out of the woods’ on inflation, after leaving interest rates on hold – business live",
    "url": "https://www.theguardian.com/business/live/2025/sep/18/bank-of-england-uk-interest-rates-bond-selling-qt-programme-andrew-bailey-business-live",
    "image": "https://media.guim.co.uk/1569d81fc094ab2948d99c38fcb53b3898d72b72/610_0_4591_3674/500.jpg",
    "summary": "The Bank of England (BoE) has decided to reduce its stock of government bonds at a slower rate in the coming year. This move is part of its ongoing monetary policy adjustments. The decision reflects the central bank's aim to support the economy while managing inflation.",
    "published": "2025-09-18T13:09:42Z"
  }
]