[
  {
    "title": "England v South Africa: first men’s one-day international – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/02/england-south-africa-first-mens-odi-cricket-live",
    "image": "https://media.guim.co.uk/c4f0efbc841208a436287c4806ff0e4d170cfc5c/592_30_5440_4352/500.jpg",
    "summary": "England faces South Africa in the first match of a three-match ODI series at Headingley. The match will be reported on an over-by-over basis. Join the writers for live updates and commentary.",
    "published": "2025-09-02T15:36:25Z"
  },
  {
    "title": "Belgium to recognise Palestinian state at UN and sanction Israel – Middle East crisis live",
    "url": "https://www.theguardian.com/world/live/2025/sep/02/middle-east-crisis-israel-gaza-palestine-un-belgium-live-news-updates",
    "image": "https://media.guim.co.uk/6e91d70261e19e5f28df210b67e6d327ed450be9/192_0_1666_1333/500.jpg",
    "summary": "The Foreign Minister clarified that the recent actions taken are not directed against the Israeli people. Instead, the focus is on ensuring that the Israeli government adheres to international and humanitarian law. This statement underscores a commitment to uphold legal standards in the region.",
    "published": "2025-09-02T15:36:02Z"
  },
  {
    "title": "US Open 2025: Pegula and Alcaraz in quarter-final action on day 10 – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/02/us-open-tennis-2025-pegula-alcaraz-quarter-finals-day-ten-live",
    "image": "https://media.guim.co.uk/c5a6f63a74052734b73c46da9ef2582dcbfae0bb/131_0_4800_3840/500.jpg",
    "summary": "Daniel Harris provides live updates on day ten of the US Open, featuring Carlos Alcaraz competing against Jiri Lehecka and Jessica Pegula facing Barbora Krejcikova. Fans can expect thrilling matches as top players vie for advancement in the tournament. Stay tuned for real-time commentary and insights.",
    "published": "2025-09-02T15:35:27Z"
  },
  {
    "title": "‘Crisis on top of crisis’: Scotland faces threat from dangerous form of opioids, experts warn",
    "url": "https://www.theguardian.com/uk-news/2025/sep/02/scotland-drugs-death-opioids",
    "image": "https://media.guim.co.uk/27963326f2f00e9434b7c8daedd4ada92d032a62/657_0_6571_5256/500.jpg",
    "summary": "Synthetic opioids like nitazene are associated with over 100 fatalities and can be up to 100 times more potent than traditional opioids. This increased strength poses significant risks for users and complicates addiction treatment efforts. The emergence of such substances highlights the ongoing opioid crisis and the need for enhanced public health measures.",
    "published": "2025-09-02T15:34:30Z"
  },
  {
    "title": "Portobello review – Marco Bellocchio’s glorious saga of TV stars, mafia prisoners and lace doilies",
    "url": "https://www.theguardian.com/film/2025/sep/02/portobello-review-marco-bellocchio-enzo-tortora",
    "image": "https://media.guim.co.uk/cc2cd51ad6f4c6e54a69f0f8192d3a6c086679e9/605_0_5033_4024/500.jpg",
    "summary": "The new six-part series highlights the rise of 80s primetime host Enzo Tortora, juxtaposed with the chaotic situation of a mob secretary who entangles him and his parrot in a drug trafficking scandal. The first two episodes creatively weave these narratives together. This intriguing plot sets the stage for exploring Tortora's fall from grace amidst the allegations.",
    "published": "2025-09-02T15:33:49Z"
  }
]