[
  {
    "title": "Trump says ‘drug-carrying submarine’ was target of latest strike in the Caribbean – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/17/donald-trump-john-bolton-volodymyr-zelenskyy-us-politics-latest-news-updates",
    "image": "https://media.guim.co.uk/9bdfbd48afa99b834045461aeef122b0d9b2b99a/123_0_1788_1431/500.jpg",
    "summary": "The U.S. president reported that a boat was intercepted while carrying a significant quantity of drugs. Senator Marco Rubio indicated that further details about the incident will be released later today. The situation highlights ongoing issues related to drug trafficking.",
    "published": "2025-10-17T18:24:20Z"
  },
  {
    "title": "Donald Trump hesitant on supplying Ukraine with Tomahawk missiles Zelenskyy is pushing for – live",
    "url": "https://www.theguardian.com/world/live/2025/oct/17/viktor-orban-vladimir-putin-volodymyr-zelenskyy-donald-trump-europe-latest-news-updates-russia-ukraine-war",
    "image": "https://media.guim.co.uk/260c5a1da7d86ee995515bf468e5a578e4cd4d02/448_0_3262_2611/500.jpg",
    "summary": "Ukrainian President Volodymyr Zelensky continues to urge for increased military aid from the U.S. amid ongoing conflict with Russia. In contrast, U.S. President Joe Biden emphasizes that Russian President Vladimir Putin seeks to conclude the war. This divergence highlights differing perspectives on the situation and strategies in response to the conflict.",
    "published": "2025-10-17T18:13:31Z"
  },
  {
    "title": "No Kings: what to know about the anti-Trump protests attracting millions",
    "url": "https://www.theguardian.com/us-news/2025/oct/17/no-kings-protests-millions-trump",
    "image": "https://media.guim.co.uk/180b5465484340aeef38786c1f7cd1aa7cf295c8/998_0_5018_4016/500.jpg",
    "summary": "Over 2,500 rallies are set to take place across all 50 US states, with protesters advocating for limitations on presidential authority. The demonstrations aim to highlight concerns about the extent of executive power. Organizers are encouraging widespread participation to amplify their message.",
    "published": "2025-10-17T18:09:56Z"
  },
  {
    "title": "California Democrat to run for congressional seat held by Nancy Pelosi",
    "url": "https://www.theguardian.com/us-news/2025/oct/17/scott-wiener-nancy-pelosi-congress",
    "image": "https://media.guim.co.uk/acbf7a05296684b802a78a3e5b4a25ea12c5f775/308_151_2869_2295/500.jpg",
    "summary": "California state senator Scott Wiener is expected to announce his candidacy for a new political position in the upcoming weeks. His decision is generating interest and anticipation within the political landscape. Further details about his campaign and objectives are likely to be revealed during the announcement.",
    "published": "2025-10-17T18:05:24Z"
  },
  {
    "title": "Premier League team news: predicted lineups for the weekend action",
    "url": "https://www.theguardian.com/sport/2025/oct/17/premier-league-team-news-predicted-lineups-for-the-weekend-action",
    "image": "https://media.guim.co.uk/d86e92630afbb81e126267e21315b80b30e07ff0/1274_96_4114_3292/500.jpg",
    "summary": "Liverpool, struggling with form, will face off against Manchester United on Sunday. Meanwhile, Arsenal, currently at the top of the league, will visit Fulham on Saturday evening. Both matches are key fixtures in the ongoing season.",
    "published": "2025-10-17T18:04:46Z"
  }
]