[
  {
    "title": "England set Sri Lanka 254 to win after Nat Sciver-Brunt century: Women’s Cricket World Cup – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/11/england-v-sri-lanka-womens-cricket-world-cup-live",
    "image": "https://media.guim.co.uk/d91544b1b67b0b058af9a9bac5d2d421958d329b/488_0_3302_2641/500.jpg",
    "summary": "Nat Sciver-Brunt's team is competing against Sri Lanka in a crucial match. Live updates and commentary are being provided in an over-by-over format. Follow along for the latest developments and highlights from the game.",
    "published": "2025-10-11T16:20:19Z"
  },
  {
    "title": "Hull KR v Wigan Warriors: Super League Grand Final – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/11/rugby-league-hull-kr-wigan-warriors-super-league-grand-final-live",
    "image": "https://media.guim.co.uk/dfda5a3065c0a272b25114efa65d33af494c2d21/222_0_5000_4000/500.jpg",
    "summary": "The league leaders are set to face the reigning champions in a highly anticipated match. Both teams are striving for historical milestones as they compete for dominance. Luke McLaughlin will provide a minute-by-minute report of the game.",
    "published": "2025-10-11T16:20:05Z"
  },
  {
    "title": "Before Trump, ‘Dreamers’ were shielded from deportation. Here’s what’s changed",
    "url": "https://www.theguardian.com/us-news/2025/oct/11/trump-immigration-dreamers-daca",
    "image": "https://media.guim.co.uk/83fbac16aee1df1683a89d7b938ea41016bd34ce/539_0_3708_2967/500.jpg",
    "summary": "DACA, a program that enabled undocumented immigrants who arrived in the U.S. as children to live and work legally, has faced significant legal challenges. Recent developments suggest that the program's future is uncertain, raising concerns for its recipients. Advocates continue to push for legislative solutions to protect these individuals from deportation.",
    "published": "2025-10-11T16:00:27Z"
  },
  {
    "title": "Georgia’s story: how a domestic abuse victim’s suicide was ruled an unlawful killing by her partner",
    "url": "https://www.theguardian.com/society/ng-interactive/2025/oct/11/georgias-story-how-a-domestic-abuse-victims-suicide-was-ruled-an-unlawful-killing-by-her-partner",
    "image": "https://media.guim.co.uk/2d0c4effd596b02fe3d173f829b9d52ce7c6ddf7/1_0_4998_4000/500.jpg",
    "summary": "A London coroner ruled that Georgia Barter's death resulted from prolonged violence and coercive control by Thomas Bignell. Her family seeks justice, but the Crown Prosecution Service has opted not to charge him, and police are unable to locate him. This situation highlights the challenges in addressing domestic violence cases.",
    "published": "2025-10-11T16:00:27Z"
  },
  {
    "title": "Hamas official says disarmament ‘out of the question’; Israel prepares prisoners for exchange – live",
    "url": "https://www.theguardian.com/world/live/2025/oct/11/israel-gaza-ceasefire-hamas-hostages-netanyahu-trump-middle-east-latest-news-updates",
    "image": "https://media.guim.co.uk/373bb91e694a157d575f69e59bb39001116b511f/704_0_6250_5000/500.jpg",
    "summary": "Israel has agreed to a truce deal that involves releasing prisoners, including those serving life sentences for serious attacks, in exchange for hostages. This agreement aims to ease tensions and secure the release of individuals held captive. The deal reflects ongoing efforts to negotiate a peaceful resolution amid conflict.",
    "published": "2025-10-11T15:58:16Z"
  }
]