[
  {
    "title": "Australia news live: Ley calls for inquiry into ‘entire triple-zero ecosystem’; DV offenders in NSW could be forced to report dating app profiles",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/29/australia-news-live-optus-suffers-fresh-triple-zero-glitch-labors-first-deficit-not-as-bad-as-feared",
    "image": "https://media.guim.co.uk/6beeccb9a38d9f60531f4db8fb1389a863900215/628_0_5685_4548/500.jpg",
    "summary": "Could you please provide the specific news article or details you would like me to summarize?",
    "published": "2025-09-29T03:01:18Z"
  },
  {
    "title": "Storm star trains sights on ‘stuck up’ Broncos as grand final contenders eye vacant NRL throne",
    "url": "https://www.theguardian.com/sport/2025/sep/29/nrl-stefano-utoikamanu-melbourne-storm-player-calls-brisbane-broncos-team-stuck-up",
    "image": "https://media.guim.co.uk/4286ded0693e26abf96e0503466f9fcbddd519dc/436_0_2562_2050/500.jpg",
    "summary": "Stefano Utoikamanu expressed his dissatisfaction with several members of the Brisbane team, indicating there are numerous players he doesn't like. His comments highlight a divide or tension within the team's dynamics. This revelation may impact team cohesion as they move forward.",
    "published": "2025-09-29T02:58:47Z"
  },
  {
    "title": "Waiting for Godot review – Keanu Reeves and Alex Winter’s unlikely reunion",
    "url": "https://www.theguardian.com/stage/2025/sep/29/waiting-for-godot-keanu-reeves-alex-winter-broadway-review",
    "image": "https://media.guim.co.uk/47e44260c92e135ea0a4fb5de42f237ab344bb1b/595_0_5953_4763/500.jpg",
    "summary": "The stars of \"Bill & Ted\" are making their Broadway debut in Jamie Lloyd's unconventional adaptation of Samuel Beckett's classic play. The production is noted for its disorienting style and moments of engagement, offering a fresh interpretation of the iconic work. Audience reactions are mixed as the adaptation challenges traditional expectations.",
    "published": "2025-09-29T02:00:27Z"
  },
  {
    "title": "At least four dead and eight injured after shooting at Mormon church in Michigan",
    "url": "https://www.theguardian.com/us-news/2025/sep/28/mass-shootings-north-carolina-texas-new-orleans",
    "image": "https://media.guim.co.uk/900f933af20eedf9a430f10167e0d76671cadc47/1278_0_6500_5203/500.jpg",
    "summary": "A church was reportedly set on fire by a gunman over the weekend, coinciding with shooting attacks in North Carolina, Texas, and New Orleans. Authorities are investigating the incidents as part of a broader trend of violence. The motives behind these attacks remain unclear as the community grapples with the aftermath.",
    "published": "2025-09-29T01:10:53Z"
  },
  {
    "title": "Threatened kārearea falcon wins New Zealand’s 2025 bird of the year",
    "url": "https://www.theguardian.com/world/2025/sep/29/new-zealand-bird-of-the-year-2025-karearea-falcon-nz-winner",
    "image": "https://media.guim.co.uk/fe5f3a2ed038c3fe56c328fdac5f9abb7eb4162a/266_0_3522_2818/500.jpg",
    "summary": "The country's fastest bird has won the top prize in this year's annual poll. The event was marked by a lack of scandals, contributing to a smooth competition. This success highlights the bird's impressive abilities and the integrity of the voting process.",
    "published": "2025-09-29T00:47:46Z"
  }
]