[
  {
    "title": "Australia news live: US critical minerals deal will be reached ‘one of these days’, Don Farrell says",
    "url": "https://www.theguardian.com/australia-news/live/2025/oct/12/australia-news-live-pro-palestine-rally-sydney-optus-anthony-albanese-sussan-ley",
    "image": "https://media.guim.co.uk/effd25cbc8e0d226406cf3f02437bb0257d66cfc/322_61_2919_2335/500.jpg",
    "summary": "Please provide the news article or content you'd like summarized, and I'll be happy to help!",
    "published": "2025-10-12T01:32:51Z"
  },
  {
    "title": "Trump news at a glance: US troops will be paid despite shutdown, president claims",
    "url": "https://www.theguardian.com/us-news/2025/oct/12/trump-administration-news-updates-today",
    "image": "https://media.guim.co.uk/dbb5363bd94260dc1f45402ea80021b23ce3b793/2315_0_5877_4704/500.jpg",
    "summary": "Donald Trump has instructed the Defense Secretary to release specific funds on October 15. The announcement is part of ongoing developments in U.S. politics. Key political stories from October 11 continue to shape the landscape.",
    "published": "2025-10-12T01:16:12Z"
  },
  {
    "title": "Rolling Stones’s Ronnie Wood says he is working on new songs with Rod Stewart",
    "url": "https://www.theguardian.com/music/2025/oct/12/ronnie-wood-and-rod-stewart-working-together-on-songs-again-rolling-stone-says",
    "image": "https://media.guim.co.uk/aa3a3870e19578ed3b350480bf794283630d95fd/156_0_1567_1253/500.jpg",
    "summary": "On \"Desert Island Discs,\" a guitarist from the band Faces, active in the 1960s, stated that he and his bandmate have a substantial collection of songs together. He expressed pride in their musical partnership and the work they’ve created. Their shared history continues to inspire their current collaborations.",
    "published": "2025-10-11T23:01:35Z"
  },
  {
    "title": "‘Uneasy alliance’: why Brisbane’s Olympics has a former LNP premier and Greens radical fighting on the same side",
    "url": "https://www.theguardian.com/sport/2025/oct/12/queensland-brisbane-olympics-former-lnp-premier-greens-radical-same-side",
    "image": "https://media.guim.co.uk/ae5d8e01aef019afbfcd6d45033cf5bc03340670/126_0_3740_2992/500.jpg",
    "summary": "The Queensland government's proposal to construct the main stadium for the 2032 Games at Victoria Park has sparked significant opposition, bringing together a diverse coalition of protesters. These groups express concerns over potential environmental impacts and community disruption. The controversy highlights tensions between development ambitions and public sentiment regarding urban spaces.",
    "published": "2025-10-11T23:00:36Z"
  },
  {
    "title": "The dream of turning empty office blocks into apartments appears over. What went wrong?",
    "url": "https://www.theguardian.com/australia-news/2025/oct/12/converting-empty-office-blocks-apartments-appears-over",
    "image": "https://media.guim.co.uk/f24d52674b94b438e5674b23e3617c66f33c17d8/386_0_2699_2160/500.jpg",
    "summary": "Strict planning regulations and rising refurbishment costs are discouraging landlords and developers from investing in housing, exacerbating the housing shortage. There are increasing demands for government action to address this crisis. Stakeholders argue that easing these constraints could help improve the housing situation.",
    "published": "2025-10-11T23:00:36Z"
  }
]