[
  {
    "title": "Australia news live: ACT Liberal leader and deputy step down after fortnight of controversy; ANZ workers having ‘panic attacks’ amid 1,000 job cuts",
    "url": "https://www.theguardian.com/australia-news/live/2025/nov/10/australia-news-live-john-laws-radio-social-media-age-ban-reserve-bank-pauline-hanson-sussan-ley-anthony-albanese-net-zerontwnfb",
    "image": "https://media.guim.co.uk/9de728b7e47828903806922767f68046ff8272b0/762_636_6085_4868/500.jpg",
    "summary": "Please provide the news article or details you would like summarized, and I’ll be happy to help!",
    "published": "2025-11-10T03:12:46Z"
  },
  {
    "title": "Female NSW MPs Allegra Spender and Kellie Sloane report death and rape threats after condemning neo-Nazi rally in Sydney",
    "url": "https://www.theguardian.com/australia-news/2025/nov/10/neo-nazi-rally-sydney-female-nsw-mps-allegra-spender-kellie-sloane-death-rape-threats",
    "image": "https://media.guim.co.uk/14390f74f0661aebdd752a130a2328c4a6b72cb9/0_0_5000_4000/500.jpg",
    "summary": "Allegra Spender and Kellie Sloane have reported receiving threats to the police. In response, the premier announced that the government is looking into the possibility of expanding the ban on Nazi symbols. This move comes amid growing concerns about hate speech and extremist symbols in the community.",
    "published": "2025-11-10T02:17:28Z"
  },
  {
    "title": "Rewarding mediocrity or providing new hope? AFL confirms divisive finals wildcard plan ",
    "url": "https://www.theguardian.com/sport/2025/nov/10/rewarding-mediocrity-or-providing-new-hope-afl-confirms-dildcard-plan-divides-opinion",
    "image": "https://media.guim.co.uk/b80d3715eee1e3a7b6741c2cdd4063ffd9999883/763_0_3760_3007/500.jpg",
    "summary": "The AFL has announced a controversial expansion of its finals series to include 10 teams, introducing a new 'wildcard round' starting next season. The decision has sparked mixed reactions among fans and analysts. Despite the debate, the league stands by its choice, aiming to enhance competitive excitement.",
    "published": "2025-11-10T01:36:28Z"
  },
  {
    "title": "Ukraine war briefing: Lavrov reappears, ready to offer Marco Rubio same demands",
    "url": "https://www.theguardian.com/world/2025/nov/10/ukraine-war-briefing-lavrov-reappears-ready-to-offer-marco-rubio-same-demands",
    "image": "https://media.guim.co.uk/5ebe787a6d7cf853ad599d22be49ca18b1e4ede7/941_0_4689_3753/500.jpg",
    "summary": "Ukraine has retaliated against Russian strikes targeting its energy grid, emphasizing its resilience. President Zelenskyy shared insights with the Guardian about how King Charles helped ease tensions during Trump's presidency. This update marks day 1,356 of the ongoing conflict.",
    "published": "2025-11-10T01:29:05Z"
  },
  {
    "title": "Manchester United prodigy James Overy in frame for Socceroos World Cup squad",
    "url": "https://www.theguardian.com/football/2025/nov/10/manchester-united-player-james-overy-australia-socceroos-world-cup-chances",
    "image": "https://media.guim.co.uk/cbd278c38fb8747ada2494967a94f410bbbc65c1/531_103_1825_1459/500.jpg",
    "summary": "An 18-year-old player is being considered for Australia's World Cup squad next year, despite not having participated in any competitive senior matches. His potential promise has caught the attention of selectors. The announcement reflects the team's focus on emerging talent for the tournament.",
    "published": "2025-11-10T01:26:44Z"
  }
]