[
  {
    "title": "Attorney investigating Trump critics set to resign, reports say, shortly after president calls for him to be sacked – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/19/donald-trump-jimmy-kimmel-suspension-abc-federal-reserve-lisa-cook-us-politics-live-news",
    "image": "https://media.guim.co.uk/5a1531ed739138c2fe7a34a193d4f74f0acaac24/443_0_3593_2874/500.jpg",
    "summary": "Donald Trump expressed his desire for Erik Siebert to be removed from his role investigating New York Attorney General Letitia James and former FBI Director James Comey. Trump's comments indicate dissatisfaction with Siebert's handling of the investigations. This highlights ongoing tensions between Trump and the legal scrutiny from state and federal officials.",
    "published": "2025-09-19T23:19:34Z"
  },
  {
    "title": "Federal agents use teargas and pepper balls to break up Chicago Ice protest",
    "url": "https://www.theguardian.com/us-news/2025/sep/19/ice-protest-chicago-police",
    "image": "https://media.guim.co.uk/d1c37414d4a176cb47ca8d59d673dec3cd9c9d47/563_0_3424_2739/500.jpg",
    "summary": "At least two protesters were arrested during a demonstration where a Democratic congressional candidate denounced what they described as \"violent abuse of power.\" The incident highlights ongoing tensions surrounding political protests. The candidate's remarks aim to draw attention to issues of authority and civil rights.",
    "published": "2025-09-19T23:02:53Z"
  },
  {
    "title": "The Weir review – a riveting return for Conor McPherson’s lonesome barflies",
    "url": "https://www.theguardian.com/stage/2025/sep/20/the-weir-review-harold-pinter-theatre-london",
    "image": "https://media.guim.co.uk/60e5a2c44677f99937564e6e972eb81e4150a80c/1878_332_2221_1776/500.jpg",
    "summary": "An Irish playwright's nearly 30-year-old intimate drama blends painful memories with comedy. The production features a flawless cast, enhancing its emotional impact. The performance has been praised for its impressive execution and artistry.",
    "published": "2025-09-19T23:01:58Z"
  },
  {
    "title": "Quarter of UK university physics departments at risk of closing, survey finds",
    "url": "https://www.theguardian.com/education/2025/sep/20/quarter-of-uk-university-physics-departments-at-risk-of-closing-survey-finds",
    "image": "https://media.guim.co.uk/1f4aabc0882bc72e69c776c5399db6a5a9e02d7f/499_0_5018_4016/500.jpg",
    "summary": "A recent survey indicates that four out of five companies are implementing staff cuts, raising alarms among physicists regarding the implications for the UK's leadership in key scientific fields. Experts express \"great concern\" about the potential impact of these reductions on research and innovation. The situation highlights urgent challenges for maintaining the UK's position in critical areas of science and technology.",
    "published": "2025-09-19T23:01:57Z"
  },
  {
    "title": "Weekend crossword No 767",
    "url": "https://www.theguardian.com/crosswords/weekend/767",
    "summary": "I don't have access to specific articles or databases, including \"Weekend crossword No 767.\" However, if you provide me with details or key points from the news, I can help you summarize it in three lines!",
    "published": "2025-09-19T23:00:58Z"
  }
]