[
  {
    "title": "Australia politics live: Senate hearing told Optus sent notification about triple-zero outages to wrong email; new AFP boss flags tougher hate crimes laws",
    "url": "https://www.theguardian.com/australia-news/live/2025/oct/08/australia-politics-live-gaza-rally-parliament-anthony-albanese-sussan-ley-question-time-andrew-hastie-ntwnfb",
    "image": "https://media.guim.co.uk/bb15a89f205a28f107da574dfa05fff90f9d783b/2311_782_4941_3953/500.jpg",
    "summary": "I'm sorry, but I need more context or content to summarize the news story you're referring to. Please provide details or a link!",
    "published": "2025-10-08T01:23:30Z"
  },
  {
    "title": "Dolly Parton ‘going to be just fine’ says singer’s sister as she calls for prayers amid health problems",
    "url": "https://www.theguardian.com/music/2025/oct/08/dolly-parton-health-problems-sister-prayers-going-to-be-just-fine",
    "image": "https://media.guim.co.uk/9301399dbef0dce5b8480184107f9cf70eaa7771/181_0_3474_2778/500.jpg",
    "summary": "Freida Parton has been staying up all night praying as she supports a singer facing ongoing health challenges. The specific nature of these health issues has not been disclosed. Parton’s comments highlight a sense of concern and hope for the individual affected.",
    "published": "2025-10-08T01:21:12Z"
  },
  {
    "title": "Alleged ‘kill team’ charged after arrest en route to hit near Sydney daycare",
    "url": "https://www.theguardian.com/australia-news/2025/oct/08/alleged-kill-team-charged-after-arrest-en-route-to-hit-near-sydney-daycare",
    "image": "https://media.guim.co.uk/4039ec071c4857f9eee666ed9ffab320483e02b1/230_0_1114_892/500.jpg",
    "summary": "Police have reported that they identified a group of three individuals allegedly planning to kill a man near a childcare center in the southwest of the city. The trio was said to be \"mobilising\" for the attack. Authorities are taking the threat seriously due to the proximity to a children’s facility.",
    "published": "2025-10-08T01:07:16Z"
  },
  {
    "title": "New Zealand oceans warming 34% faster than global average, putting homes and industry at risk, report finds",
    "url": "https://www.theguardian.com/world/2025/oct/08/new-zealand-oceans-warming-34-per-cent-faster-than-global-average",
    "image": "https://media.guim.co.uk/7c22179d51af82b41a35bf0a66de06bce99a4cd0/54_0_5392_4314/500.jpg",
    "summary": "A new government report reveals that New Zealand faces significant risks from flooding and storm damage, with NZ$180 billion worth of housing and NZ$26 billion in infrastructure at stake. The findings highlight the urgent need for resilience planning and investment to protect these assets. Authorities are called to take proactive measures to mitigate the impacts of climate change-related threats.",
    "published": "2025-10-08T00:57:22Z"
  },
  {
    "title": "Victorians to get free weekend public transport over summer",
    "url": "https://www.theguardian.com/australia-news/2025/oct/08/victoria-free-weekend-public-transport-summer",
    "image": "https://media.guim.co.uk/3570dc104341410ad1fa2e3bdf332586bbfa8a9c/364_0_5219_4175/500.jpg",
    "summary": "Fares will be waived for weekend trams, trains, and buses for two months due to ongoing disruptions caused by the Metro Tunnel project. This initiative aims to encourage public transport use and alleviate the impact of prolonged construction. The fare exemption is a response to commuter frustrations over years of service interruptions.",
    "published": "2025-10-08T00:54:29Z"
  }
]