[
  {
    "title": "Australia v England: Ashes second Test, day three – live",
    "url": "https://www.theguardian.com/sport/live/2025/dec/06/australia-vs-england-live-ashes-second-2nd-test-day-three-aus-v-eng-cricket-scores-updates-gabba-brisbane",
    "image": "https://media.guim.co.uk/02f0953adbf9b1085c28bae339972bb178197ced/168_0_2583_2068/500.jpg",
    "summary": "The hosts aim to extend their first-innings lead as play continues at the Gabba. An over-by-over report will provide ongoing updates. Writers will join to cover the action.",
    "published": "2025-12-06T07:17:19Z"
  },
  {
    "title": "‘The only idea around’: will Labour return to a customs union with the EU?",
    "url": "https://www.theguardian.com/politics/2025/dec/06/the-only-idea-around-will-labour-return-to-a-customs-union-with-the-eu",
    "image": "https://media.guim.co.uk/efb2776097987ccef8537ed4dabaa52b50f0a917/0_716_4000_3200/500.jpg",
    "summary": "The pressing need for economic growth is prompting the political party to address a previously taboo topic. This shift indicates a willingness to engage with issues that may have been avoided in the past. The party's actions reflect the urgency of the economic situation and the need for proactive solutions.",
    "published": "2025-12-06T07:00:50Z"
  },
  {
    "title": "Nick Cave’s Veiled World: the starry tale of how sometimes the devil doesn’t have the best tunes",
    "url": "https://www.theguardian.com/tv-and-radio/2025/dec/06/nick-cave-veiled-world-starry-tale-devil-doesnt-have-best-tunes",
    "image": "https://media.guim.co.uk/5ab1ec035c9c28498fd4224065c723a817e2b06b/96_31_2544_2034/500.jpg",
    "summary": "The documentary explores the life and music of the artist through interviews with a diverse range of individuals, including Flea and Rowan Williams. It provides a reflective perspective on the intersection of his songs and Christian themes. The film delves into the deeper meanings behind his work and influences.",
    "published": "2025-12-06T07:00:49Z"
  },
  {
    "title": "Where the real Rudolph lives: reindeer herding with the Sami people in Sweden’s wild west",
    "url": "https://www.theguardian.com/travel/2025/dec/06/reindeer-herding-holiday-sami-people-west-sweden",
    "image": "https://media.guim.co.uk/9a34c7199898eeb4d259fc1ddb5ce634dd174ce6/0_0_3780_3024/500.jpg",
    "summary": "In the snowy mountains of Grövelsjön, visitors can experience a unique traditional lifestyle. They have the opportunity to stay in a tipi and enjoy night skies filled with stars. This offers a rare glimpse into a fascinating cultural experience amidst nature.",
    "published": "2025-12-06T07:00:49Z"
  },
  {
    "title": "What links Amy Adams, Teri Hatcher and Margot Kidder? The Saturday quiz",
    "url": "https://www.theguardian.com/lifeandstyle/2025/dec/06/what-links-amy-adams-teri-hatcher-margot-kidder-saturday-quiz",
    "image": "https://media.guim.co.uk/5aad831d2d7b7fcc160f368d2bf6971e7994de77/0_205_3000_2399/500.jpg",
    "summary": "The Saturday quiz features a variety of topics, including characters like Cecil from Waitrose and Slinky from Tesco. It also highlights an innovative app that is intended for deletion after use. Test your knowledge with this engaging quiz!",
    "published": "2025-12-06T07:00:49Z"
  }
]