[
  {
    "title": "Cop30 live: standoff over inclusion of fossil fuel phaseout in final text escalates",
    "url": "https://www.theguardian.com/world/live/2025/nov/21/cop30-live-fossil-fuel-phaseout-final-text-brazil-belem-latest-news-updates",
    "image": "https://media.guim.co.uk/8f0c87b1a283384ac4430efd8389186bec80fb4e/444_0_4436_3549/500.jpg",
    "summary": "A dramatic fire occurred yesterday during the climate summit, which is set to conclude this evening. However, significant disagreements over the final text remain unresolved. The situation has raised concerns about reaching a consensus before the summit ends.",
    "published": "2025-11-21T13:28:20Z"
  },
  {
    "title": "Palmer breaks toe in mishap; Celtic AGM cut short amid jeers; Liverpool injuries: football news – live",
    "url": "https://www.theguardian.com/football/live/2025/nov/21/premier-league-returns-wolves-to-unveil-edwards-and-more-football-news-live",
    "image": "https://media.guim.co.uk/46b501b8f0d15a767e18e8006e9b082f48496244/368_0_3791_3033/500.jpg",
    "summary": "Our writers provide the latest updates and insights as we approach a packed weekend of domestic football matches. Stay informed on team news, key matchups, and player performances. Don't miss out on all the excitement in the world of football!",
    "published": "2025-11-21T13:27:49Z"
  },
  {
    "title": "Starmer, Merz and Macron confirm full support for Ukraine after call with Zelenskyy about US plan – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/nov/21/europe-latest-news-russia-ukraine-war-updates-zelenskyy-putin-g20",
    "image": "https://media.guim.co.uk/22d41e84ce50c0acae790fe2acf0a82ae98e8fe9/564_0_3480_2784/500.jpg",
    "summary": "Germany's leaders have expressed support for US initiatives aimed at resolving the ongoing war. However, they emphasized that the existing communication channels should serve only as a starting point for negotiations. The call for broader discussions highlights the need for a more comprehensive approach to peace talks.",
    "published": "2025-11-21T13:18:48Z"
  },
  {
    "title": "Battle of the Sexes review – tennis’s most famous match becomes kitschy, pacey opera",
    "url": "https://www.theguardian.com/music/2025/nov/21/battle-of-the-sexes-philharmonia-alsop-review-royal-festival-hall-london",
    "image": "https://media.guim.co.uk/36e00943158b9c5cf67da6d096dd9b50f04332fe/515_33_3860_3088/500.jpg",
    "summary": "Tenor Nicky Spence took the lead as the comedic ringleader in a vibrant, theatrical production. The performance featured a blend of singing and dancing, showcasing a Hollywood-inspired flair. Despite its energetic presentation, the work was noted for lacking subtlety.",
    "published": "2025-11-21T13:14:31Z"
  },
  {
    "title": "Reeves ‘not even sure what the popular path is’ on the budget – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/nov/21/uk-politics-latest-news-labour-conservatives-keir-starmer-g20",
    "image": "https://media.guim.co.uk/32d65d64827809daa41b207e1da183366e166ae2/1182_165_4672_3738/500.jpg",
    "summary": "The Chancellor emphasized the need for decisive action rather than continuing to \"muddle through\" the current situation. He stated that important decisions are necessary to shift toward a more effective direction. This call for change highlights the urgency for a new approach to address ongoing challenges.",
    "published": "2025-11-21T13:13:52Z"
  }
]