[
  {
    "title": "Australia news live: Queensland’s biggest coal-fired power station may close early; home buyers scheme to have ‘minimal impact’ on prices",
    "url": "https://www.theguardian.com/australia-news/live/2025/oct/01/australia-news-live-nicole-kidman-divorce-keith-urban-sussan-ley-coalition-andrew-hastie-anthony-albanese-housing-ntwnfb",
    "image": "https://media.guim.co.uk/bbd4fe2a24cb5843f9c30816249c8ddba493b98d/0_0_2664_2131/500.jpg",
    "summary": "I'm sorry, but I need more context or the specific news article you'd like summarized. Could you please provide the text or details?",
    "published": "2025-10-01T01:40:22Z"
  },
  {
    "title": "Government ‘deeply concerned’ about safety of Australians aboard Gaza flotilla",
    "url": "https://www.theguardian.com/world/2025/oct/01/government-deeply-concerned-about-safety-australians-aboard-gaza-flotilla-reports-interception",
    "image": "https://media.guim.co.uk/fa0d945202c8bbb7b6388d5d30ac3395aabfc2a0/792_0_4560_3648/500.jpg",
    "summary": "The Global Sumud Flotilla is organizing to challenge Israel's blockade of Gaza by delivering essential aid. This initiative seeks to provide humanitarian support to the region, emphasizing the need for assistance. The flotilla's efforts highlight ongoing tensions and the plight of those impacted by the blockade.",
    "published": "2025-10-01T01:30:42Z"
  },
  {
    "title": "Senate fails to pass stopgap funding bill as government heads for midnight shutdown – follow live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/30/us-government-shutdown-funding-trump-vance-portland-hegseth-latest-updates",
    "image": "https://media.guim.co.uk/fe3316a2e58c91fcece6a306a293024b18b14d3d/287_0_2881_2304/500.jpg",
    "summary": "A resolution to maintain current funding levels until November 21 did not secure the required 60 votes for approval. This setback may lead to potential funding challenges. Lawmakers will need to negotiate alternative solutions to avoid a funding crisis.",
    "published": "2025-10-01T01:30:40Z"
  },
  {
    "title": "Kyle & Jackie O Show’s repeated ‘vulgar’ and ‘deeply offensive’ content prompts Acma warning to Kiis",
    "url": "https://www.theguardian.com/media/2025/oct/01/kyle-jackie-o-show-kiis-radio-licence-vulgar-deeply-offensive-content",
    "image": "https://media.guim.co.uk/74dc5fad48c6142f783a9add5be9d50e4790f452/0_0_4062_3250/500.jpg",
    "summary": "The Australian Communications and Media Authority may suspend or cancel a network's broadcast license due to unspecified concerns. The potential action raises questions about the network's compliance with regulatory standards. Further details on the situation are yet to be released.",
    "published": "2025-10-01T01:23:06Z"
  },
  {
    "title": "US on brink of government shutdown after Senate rejects funding plans",
    "url": "https://www.theguardian.com/us-news/2025/sep/30/us-government-shutdown-congress-trump-republicans",
    "image": "https://media.guim.co.uk/e8b92767da838dbed8552f550c8c72274fb25278/406_0_4380_3506/500.jpg",
    "summary": "The Senate failed to pass proposals from both Democrats and Republicans to extend government funding and prevent a shutdown after midnight. As a result, the government faces the possibility of a shutdown due to a lack of agreement on budget measures. Lawmakers continue to negotiate, but time is running out to reach a resolution.",
    "published": "2025-10-01T01:14:18Z"
  }
]