[
  {
    "title": "Triple Trouble: Fairey, Hirst, Invader review – the most revolting visual soup imaginable",
    "url": "https://www.theguardian.com/artanddesign/2025/oct/11/triple-trouble-shepard-fairey-damien-hirst-invader-review-newport-street-gallery-london",
    "image": "https://media.guim.co.uk/56246de6dda2456b976c44c1fe0194d0b1eba21c/193_0_2899_2319/500.jpg",
    "summary": "Artists Shepard Fairey, Damien Hirst, and Invader have collaborated on a new exhibition that has received overwhelmingly negative critiques. Critics describe the experience as unsettling, akin to \"walking in on a crime scene.\" The exhibit's disappointing reception highlights the varying tastes and standards in contemporary art.",
    "published": "2025-10-11T06:00:19Z"
  },
  {
    "title": "Who founded the Royal Ballet School in 1926? The Saturday quiz",
    "url": "https://www.theguardian.com/lifeandstyle/2025/oct/11/who-founded-the-royal-ballet-school-in-1926-the-saturday-quiz",
    "image": "https://media.guim.co.uk/8849dd6e844359f13265e760f160aa645bdfae15/647_0_4825_3860/500.jpg",
    "summary": "The Saturday quiz challenges participants on topics ranging from Anne Boleyn's ghost to a three-volume novel by a female author. It invites readers to test their literary and historical knowledge. The quiz aims to engage those interested in both fiction and history in a fun and informative way.",
    "published": "2025-10-11T06:00:18Z"
  },
  {
    "title": "Who are the 20 hostages believed alive and expected to be freed from Gaza?",
    "url": "https://www.theguardian.com/world/2025/oct/11/hostages-gaza-israel-profiles",
    "image": "https://media.guim.co.uk/ca410a92dbf87716b9b74065398cb0a80f65be55/0_76_3932_3146/500.jpg",
    "summary": "A ceasefire deal has been reached that could conclude over 700 days of captivity for hostages taken during the attacks on October 7, 2023. This agreement may provide relief for those held since the assaults. The potential resolution follows extensive negotiations and international attention.",
    "published": "2025-10-11T06:00:18Z"
  },
  {
    "title": "What price loyalty? UK supermarket cards rated",
    "url": "https://www.theguardian.com/money/2025/oct/11/uk-supermarket-loyalty-cards-prices-rated-clubcard-nectar",
    "image": "https://media.guim.co.uk/9e579a8aa4523cc0361450eed1807e35b515987e/385_0_3172_2538/500.jpg",
    "summary": "Amid rising prices, an analysis is underway to evaluate the effectiveness of loyalty schemes like Tesco's Clubcard and Sainsbury's Nectar. Consumers are questioning if these programs still provide significant savings. The outcome could impact future shopping habits and customer loyalty.",
    "published": "2025-10-11T06:00:18Z"
  },
  {
    "title": "Tony Blair and Nick Clegg hosted dinner giving tech bosses access to UK minister",
    "url": "https://www.theguardian.com/politics/2025/oct/11/tony-blair-and-nick-clegg-hosted-dinner-giving-tech-bosses-access-to-uk-minister",
    "image": "https://media.guim.co.uk/434dd38a2c55d678523509a3156a4320f26e5122/0_0_1678_1343/500.jpg",
    "summary": "Six prominent tech leaders met with the investment minister, highlighting the increasing sway of a consultancy led by a former prime minister. Documents pertaining to the dinner suggest a potential intertwining of business interests and government influence. This meeting underscores the significant role of tech executives in shaping investment strategies.",
    "published": "2025-10-11T06:00:18Z"
  }
]