[
  {
    "title": "News live: Bragg can’t imagine Australia leaving Paris agreement; NSW to ban bread tags under next phase of plastics plan",
    "url": "https://www.theguardian.com/australia-news/live/2025/nov/09/australia-news-live-sunday-politics-nsw-parliament-royal-tour-weather-ntwnfb",
    "image": "https://media.guim.co.uk/5887a2e0b05bb429cf8bd6480c4311dc7dd45600/812_359_5699_4562/500.jpg",
    "summary": "I'm unable to access live news feeds directly. However, if you provide specific details or headlines from today's news, I'd be happy to help you summarize them in three lines!",
    "published": "2025-11-09T01:40:26Z"
  },
  {
    "title": "Malo Gusto’s first professional goal sets up Chelsea cruise past winless Wolves",
    "url": "https://www.theguardian.com/football/2025/nov/08/chelsea-wolves-premier-league-match-report",
    "image": "https://media.guim.co.uk/926579f5921eb0304f788f0f358157ba444229da/614_549_3342_2673/500.jpg",
    "summary": "Chelsea secured a commanding 3-0 victory over Wolves in the Premier League, with João Pedro and Pedro Neto scoring goals against their former club. The win strengthens Chelsea's position in the league standings. The match showcased a strong performance from Chelsea at home.",
    "published": "2025-11-09T01:31:15Z"
  },
  {
    "title": "Border patrol chief reprimanded for lying claims shots were fired at immigration officers in Chicago",
    "url": "https://www.theguardian.com/us-news/2025/nov/08/border-patrol-gregory-bovino-chicago",
    "image": "https://media.guim.co.uk/44fe531cdc16622d2adc8a98968bd2f31447956d/175_11_2484_1988/500.jpg",
    "summary": "Gregory Bovino faced courtroom scrutiny after a judge accused him of fabricating claims about being assaulted by a protester. This confrontation occurred just two days prior to the latest developments in his case. The incident highlights the ongoing tensions surrounding protest-related conflicts.",
    "published": "2025-11-09T00:35:55Z"
  },
  {
    "title": "Premier League top scorers 2025-26: who is leading race for golden boot?",
    "url": "https://www.theguardian.com/football/2025/sep/15/premier-league-top-scorers-2025-26-who-is-leading-race-for-golden-boot",
    "image": "https://media.guim.co.uk/7467a90a5a415f45959903d6d1b0c6942de5a2ce/1263_152_3876_3100/500.jpg",
    "summary": "The English Premier League features several standout players dominating the goalscoring charts this season. Fans can track the top scorers as they compete for the Golden Boot. Football enthusiasts are excited to see how the race unfolds as the season progresses.",
    "published": "2025-11-09T00:14:58Z"
  },
  {
    "title": "‘Loophole’ in sanctions allowing Russian oil to be imported to Australia through port part-owned by Macquarie Bank",
    "url": "https://www.theguardian.com/australia-news/2025/nov/09/loophole-russian-sanctions-oil-imported-to-australia",
    "image": "https://media.guim.co.uk/a87874c5699975d2a834f16cdd526f1c1c765205/131_0_2027_1622/500.jpg",
    "summary": "Australia ceased direct fuel purchases from Russia following its invasion of Ukraine. However, it has imported over 3 million tonnes of Russian oil products in 2023. This ongoing importation raises questions about compliance with sanctions and international energy policies.",
    "published": "2025-11-08T23:00:15Z"
  }
]