[
  {
    "title": "Australia politics live: Price says leaks risk Liberals looking like ‘clown show’; police warn of potential ‘disaster’ at Gaza rally",
    "url": "https://www.theguardian.com/australia-news/live/2025/oct/08/australia-politics-live-gaza-rally-parliament-anthony-albanese-sussan-ley-question-time-andrew-hastie-ntwnfb",
    "image": "https://media.guim.co.uk/a94ba0ad8904baa805d6123ddd74f00c0c086b10/295_62_2354_1884/500.jpg",
    "summary": "I’m unable to access live news updates or specific articles. If you provide the content or main points from the news, I'd be happy to help summarize it in three lines!",
    "published": "2025-10-08T02:54:28Z"
  },
  {
    "title": "Oregon’s governor says she told Kristi Noem ‘there is no insurrection in Oregon’ – as it happened",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/07/donald-trump-national-guard-pam-bondi-mark-carney-government-shutdown-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/ce2d02a899104554aaec733305cd5c424543c446/380_0_5417_4335/500.jpg",
    "summary": "Oregon Governor Tina Kotek requested a meeting with the Homeland Security Secretary prior to their visit to the ICE field office in Portland. This statement underscores her proactive approach to addressing immigration and security concerns in the state. The engagement reflects Kotek's commitment to state-federal collaboration on these issues.",
    "published": "2025-10-08T02:06:57Z"
  },
  {
    "title": "Dolly Parton ‘going to be just fine’, singer’s sister says as she calls for prayers amid health problems",
    "url": "https://www.theguardian.com/music/2025/oct/08/dolly-parton-health-problems-sister-prayers-going-to-be-just-fine",
    "image": "https://media.guim.co.uk/9301399dbef0dce5b8480184107f9cf70eaa7771/181_0_3474_2778/500.jpg",
    "summary": "Freida Parton has reportedly been staying up all night in prayer for her singer sibling, who is facing unknown health challenges. The situation has raised concern among fans and family alike. Details about the specific health issues have not been disclosed.",
    "published": "2025-10-08T01:21:12Z"
  },
  {
    "title": "Alleged ‘kill team’ charged after arrest en route to hit near Sydney daycare",
    "url": "https://www.theguardian.com/australia-news/2025/oct/08/alleged-kill-team-charged-after-arrest-en-route-to-hit-near-sydney-daycare",
    "image": "https://media.guim.co.uk/4039ec071c4857f9eee666ed9ffab320483e02b1/230_0_1114_892/500.jpg",
    "summary": "Police have apprehended three individuals accused of plotting to murder a man near a childcare center in the city's southwest. Authorities claim to have evidence of their mobilization for the attack. Investigations are ongoing as the situation raises concerns about public safety.",
    "published": "2025-10-08T01:07:16Z"
  },
  {
    "title": "New Zealand oceans warming 34% faster than global average, putting homes and industry at risk, report finds",
    "url": "https://www.theguardian.com/world/2025/oct/08/new-zealand-oceans-warming-34-per-cent-faster-than-global-average",
    "image": "https://media.guim.co.uk/7c22179d51af82b41a35bf0a66de06bce99a4cd0/54_0_5392_4314/500.jpg",
    "summary": "A new government report reveals that NZ$180 billion worth of housing and NZ$26 billion in infrastructure in New Zealand are at risk of flooding and storm damage. The findings highlight the significant vulnerability of these assets to climate-related threats. This underscores the urgent need for enhanced resilience measures to protect infrastructure and housing investments.",
    "published": "2025-10-08T00:57:22Z"
  }
]