[
  {
    "title": "Manchester United v Arsenal: Women’s Super League – live",
    "url": "https://www.theguardian.com/football/live/2025/sep/21/manchester-united-v-arsenal-womens-super-league-live",
    "image": "https://media.guim.co.uk/0e8234af7a3a7206677bcc5fb2aa01de253e0926/126_0_2020_1615/500.jpg",
    "summary": "Emillia Hawkins is providing live updates on a significant event in Leigh, where two WSL records are set to be challenged. The report highlights the excitement surrounding these potential record-breaking moments. Keep an eye on the unfolding action as the event progresses.",
    "published": "2025-09-21T14:29:18Z"
  },
  {
    "title": "Bournemouth v Newcastle United: Premier League – live",
    "url": "https://www.theguardian.com/football/live/2025/sep/21/bournemouth-v-newcastle-united-premier-league-live",
    "image": "https://media.guim.co.uk/26b39d2f2bbf6d880137f1b5e38a63ed0647c09e/315_0_2976_2381/500.jpg",
    "summary": "Simon Burnton provides a live report on the latest updates as the Magpies head to the south coast for their match. Follow along for minute-by-minute coverage and insights. Stay tuned for all the action and developments during the game.",
    "published": "2025-09-21T14:29:16Z"
  },
  {
    "title": "Ireland v England: third men’s T20 cricket international – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/21/cricket-ireland-v-england-third-mens-t20-cricket-international-live",
    "image": "https://media.guim.co.uk/9ce400e24c262400002eb292ccb8aa3964fa47ae/299_0_2151_1720/500.jpg",
    "summary": "In the third match of the series in Malahide, James Wallace provided detailed over-by-over commentary. The match highlights include key performances and pivotal moments that shaped the game's flow. Fans are engaged as the match unfolds with live updates from Wallace.",
    "published": "2025-09-21T14:28:50Z"
  },
  {
    "title": "Arsenal v Manchester City: Premier League – live",
    "url": "https://www.theguardian.com/football/live/2025/sep/21/arsenal-v-manchester-city-premier-league-live-score-updates",
    "image": "https://media.guim.co.uk/8863b84b70a0f29c496d8fba24ab3113bb565e14/622_0_7200_5760/500.jpg",
    "summary": "Two title contenders face off in a highly anticipated match in north London. Rob Smyth provides real-time updates on the game. Stay tuned for the latest developments.",
    "published": "2025-09-21T14:20:49Z"
  },
  {
    "title": "UK, Canada and Australia formally recognise Palestinian state - UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/21/keir-starmer-palestine-recognition-announcement-gaza-uk-politics-live",
    "image": "https://media.guim.co.uk/5d53a7a61bf6806de877b79414bd2b432f38b9e7/1113_89_4416_3535/500.jpg",
    "summary": "The UK has made a symbolic gesture marking the 70th anniversary of the end of its mandate in Palestine. This move acknowledges the historical significance of the region's complex political landscape. It reflects ongoing discussions about the legacy of colonialism and its impact on current geopolitical issues.",
    "published": "2025-09-21T14:20:09Z"
  }
]