[
  {
    "title": "Qarabag v Chelsea: Champions League – live",
    "url": "https://www.theguardian.com/football/live/2025/nov/05/qarabag-v-chelsea-champions-league-live",
    "image": "https://media.guim.co.uk/dcc24bd26ab54e37dac077844e26e4941c92e182/272_0_3383_2707/500.jpg",
    "summary": "Chelsea is facing a long-distance away match in Baku, and John Brewin is providing live updates throughout the game. Fans can follow the action minute-by-minute as the events unfold. Stay tuned for timely coverage and analysis of the match.",
    "published": "2025-11-05T19:16:39Z"
  },
  {
    "title": "‘Tariffs are taxes’: US supreme court hears challenge to Trump levies as justices appear doubtful of White House reasoning – live",
    "url": "https://www.theguardian.com/us-news/live/2025/nov/05/zohran-mamdani-new-york-nyc-donald-trump-mayor-election-california-new-jersey-virginia-latest-news-results",
    "image": "https://media.guim.co.uk/aa1f95666c4c7cda0db9e46bbcf5ae2104eb30de/1004_0_7200_5760/500.jpg",
    "summary": "US Supreme Court justices from both conservative and liberal factions expressed doubts regarding the Trump administration’s rationale for imposing tariffs. The justices questioned the legal basis and implications of these trade measures. This bipartisan skepticism could impact future tariff-related decisions and policies.",
    "published": "2025-11-05T19:15:16Z"
  },
  {
    "title": "Manchester City v Dortmund, Newcastle v Athletic, and more: Champions League – live",
    "url": "https://www.theguardian.com/football/live/2025/nov/05/manchester-city-v-dortmund-newcastle-v-athletic-and-more-champions-league-live",
    "image": "https://media.guim.co.uk/a7f1a1a84de275b5b2e9bb19ce63487e23835e0d/848_0_6880_5504/500.jpg",
    "summary": "Scott Murray will provide live updates on goals and significant match moments from the Champions League games taking place on Wednesday night. Tune in for real-time coverage of the action. Stay informed about all the exciting developments in this prestigious tournament.",
    "published": "2025-11-05T19:10:43Z"
  },
  {
    "title": "Resident doctors’ strike to go ahead after Wes Streeting’s last-ditch offer is rejected",
    "url": "https://www.theguardian.com/society/2025/nov/05/resident-doctors-strike-to-go-ahead-after-wes-streetings-last-ditch-offer-is-rejected",
    "image": "https://media.guim.co.uk/6cdfb36f1ad571c44a35c5893abf371485404416/308_0_4143_3314/500.jpg",
    "summary": "Resident doctors in England plan to strike for five days next week in response to what they describe as a limited offer from the health secretary. The strike reflects ongoing tensions over pay and working conditions within the NHS. This action is part of broader industrial action by healthcare professionals seeking better negotiations from the government.",
    "published": "2025-11-05T19:06:24Z"
  },
  {
    "title": "Nine-month-old baby killed by XL bully, Gwent police confirm",
    "url": "https://www.theguardian.com/uk-news/2025/nov/05/nine-month-old-baby-killed-by-xl-bully-gwent-police-confirm",
    "image": "https://media.guim.co.uk/fc5f46dc359f2118fb9644c73b68f052dc581d9e/184_0_4206_3364/500.jpg",
    "summary": "A family pet that attacked an infant in Rogiet on Sunday was confirmed to have an exemption certificate, according to police. The incident has raised concerns about pet safety and regulations. Authorities are investigating the circumstances surrounding the attack.",
    "published": "2025-11-05T19:00:46Z"
  }
]