[
  {
    "title": "News live: PNG approves delayed defence treaty with Australia; Commonwealth Bank outage hits customers",
    "url": "https://www.theguardian.com/australia-news/live/2025/oct/02/australia-news-live-dan-tehan-liberals-nuclear-sussan-ley-coalition-anthony-albanese-labor-flotilla-bhp-china-ntwnfb",
    "image": "https://media.guim.co.uk/ee749d77243f6ff6baaca30dbc4d483730f25d47/268_26_3057_2445/500.jpg",
    "summary": "It seems like you're requesting a summary of a news article, but I can't access live content. Please provide the text or details you'd like summarized!",
    "published": "2025-10-02T04:20:51Z"
  },
  {
    "title": "Gaza aid flotilla: more than a dozen vessels intercepted by Israeli forces; Greta Thunberg arrested – live",
    "url": "https://www.theguardian.com/world/live/2025/oct/01/israel-gaza-aid-global-sumud-flotilla-middle-east-crisis-latest-updates",
    "image": "https://media.guim.co.uk/1dc8eff7cd550ab162294c9a1525393e9bf0e162/107_0_705_564/500.jpg",
    "summary": "The Israeli foreign ministry released a video showing the arrest of climate activist Greta Thunberg. This occurred when vessels with around 500 activists were intercepted about 75 miles off the coast of the war-torn territory. The incident highlights ongoing tensions in the region amid international activism.",
    "published": "2025-10-02T04:13:18Z"
  },
  {
    "title": "American democracy might not survive another year – is Europe ready for that? | Alexander Hurst",
    "url": "https://www.theguardian.com/commentisfree/2025/oct/02/american-democracy-trump-putin-europe-dangers",
    "image": "https://media.guim.co.uk/bec6d76ab522f67b8b1818475b9639919f165ecb/20_0_4475_3580/500.jpg",
    "summary": "EU citizens are increasingly aware of the serious threats posed by geopolitical tensions between Putin and Trump. They expect their leaders to confront these challenges head-on. Guardian Europe columnist Alexander Hurst emphasizes the urgency for leadership to acknowledge and address this reality.",
    "published": "2025-10-02T04:00:39Z"
  },
  {
    "title": "Dudes review – do teenage girls really tell their dads to have prolific sex?",
    "url": "https://www.theguardian.com/tv-and-radio/2025/oct/02/dudes-review-netflix-comedy",
    "image": "https://media.guim.co.uk/51e89e05d1d97604c9610d7818912f4be7b62224/1015_193_3906_3126/500.jpg",
    "summary": "A poorly received German comedy focuses on middle-aged men and presents absurd plots that elicit sympathy for the actors. The film is criticized for being crass, monotonous, and devoid of genuine humor. Overall, it fails to deliver an entertaining experience.",
    "published": "2025-10-02T04:00:39Z"
  },
  {
    "title": "White House plays racist deepfake video of Democratic leaders on loop",
    "url": "https://www.theguardian.com/us-news/2025/oct/01/trump-racist-deepfake-video-jeffries-schumer",
    "image": "https://media.guim.co.uk/a3482a4ce4a0129c13d862488e81794760ba94b1/659_0_3333_2668/500.jpg",
    "summary": "JD Vance, the Vice President, expressed that he found the video humorous. He suggested that the \"sombrero memes\" would end if the government were to reopen. Vance's comments reflect a lighthearted perspective on the situation.",
    "published": "2025-10-02T04:00:39Z"
  }
]