[
  {
    "title": "Premier League buildup, WSL updates and more – matchday live",
    "url": "https://www.theguardian.com/football/live/2025/nov/09/liverpool-travel-to-manchester-city-premier-league-buildup-and-more-matchday-live",
    "image": "https://media.guim.co.uk/e9d56f33422c2cabef5a0a8a80dfd465e810b691/319_0_2667_2134/500.jpg",
    "summary": "Tune in for news and engaging discussions ahead of the day's events. Get previews and insights to better prepare for the day's activities. Don't miss out on valuable updates before the action begins!",
    "published": "2025-11-09T12:34:23Z"
  },
  {
    "title": "Britain sends RAF specialists to help Belgium combat disruptive drones",
    "url": "https://www.theguardian.com/uk-news/2025/nov/09/britain-sends-raf-specialists-help-belgium-combat-disruptive-drones",
    "image": "https://media.guim.co.uk/bb8dab95c5d95de96ecc271a4271024b0578009c/312_0_3385_2707/500.jpg",
    "summary": "Incursions near Brussels and Liège airports last week caused flight disruptions. Authorities suspect Russia may be involved in these incidents. The situation has raised concerns about air traffic safety in the region.",
    "published": "2025-11-09T12:31:54Z"
  },
  {
    "title": "ATP Finals tennis: Carlos Alcaraz v Alex de Minaur – live",
    "url": "https://www.theguardian.com/sport/live/2025/nov/09/atp-finals-tennis-carlos-alcaraz-alex-de-minaur-live",
    "image": "https://media.guim.co.uk/c490142ff7064bb59176113e85a149e99df7790e/0_211_2191_1754/500.jpg",
    "summary": "The season-ending tournament kicks off in Turin, featuring world No. 2 facing Australia's Alex de Minaur. Daniel Harris will provide the latest updates. Fans can expect an exciting start to the competition.",
    "published": "2025-11-09T12:30:31Z"
  },
  {
    "title": "UK banks still committed to climate goals, Bank of England executive insists",
    "url": "https://www.theguardian.com/business/2025/nov/09/uk-banks-still-committed-to-climate-goals-bank-of-england-executive-insists",
    "image": "https://media.guim.co.uk/46511176d4dde40b74b35c045fcec767260e6da8/2710_1421_3803_3044/500.jpg",
    "summary": "David Bailey downplayed concerns following HSBC and Barclays' withdrawal from the UN-backed Net Zero Banking Alliance. He emphasized that the commitment to sustainable banking remains strong despite the exits. Bailey assured stakeholders that progress towards climate goals will continue without these institutions.",
    "published": "2025-11-09T12:15:18Z"
  },
  {
    "title": "King Charles and senior politicians lead UK Remembrance Sunday service at Cenotaph – live",
    "url": "https://www.theguardian.com/politics/live/2025/nov/09/mistaken-prisoner-releases-labour-budget-uk-politics-live",
    "image": "https://media.guim.co.uk/7a2bcc47f052b9489d7f632fcd6fc9842dcc4dec/9_0_7058_5647/500.jpg",
    "summary": "A two-minute silence was observed at 11 am GMT, honoring those being commemorated. Events took place nationwide in the UK, including major cities like Edinburgh, Cardiff, and Belfast. These commemorations reflect a collective remembrance across the country.",
    "published": "2025-11-09T12:13:02Z"
  }
]