[
  {
    "title": "US Open tennis 2025: Pegula eases past Li, Alcaraz and Sabalenka in action on day eight – live",
    "url": "https://www.theguardian.com/sport/live/2025/aug/31/us-open-tennis-2025-carlos-alcaraz-aryna-sabalenka-pegula-fritz-townsend-day-eight-live",
    "image": "https://media.guim.co.uk/3be8601df513c0f83c0b28d70f5f29c568e02379/1790_250_4332_3465/500.jpg",
    "summary": "The fourth round of singles matches at Flushing Meadows is set to begin, showcasing top tennis talent. Fans are encouraged to follow the latest developments and match results. Stay updated on all the exciting action happening at the tournament.",
    "published": "2025-08-31T19:22:06Z"
  },
  {
    "title": "JB Pritzker calls for ‘all to stand up’ to Trump’s immigration crackdown in Chicago",
    "url": "https://www.theguardian.com/us-news/2025/aug/31/jb-pritzker-trump-chicago-illinois",
    "image": "https://media.guim.co.uk/659a84857a1d42d25348c840329dc11d2c7a416b/623_0_3500_2800/500.jpg",
    "summary": "The President is planning a contentious federal intervention in a U.S. city as part of an effort to combat immigration policies known as \"sanctuary cities.\" This move aims to enforce stricter immigration regulations, sparking debate over federal versus local authority. The initiative has raised concerns among advocates for immigrant rights and local governments.",
    "published": "2025-08-31T19:21:25Z"
  },
  {
    "title": "Trump says he plans unconstitutional executive order to mandate ID for voters",
    "url": "https://www.theguardian.com/us-news/2025/aug/31/trump-order-voter-identification",
    "image": "https://media.guim.co.uk/8b37be8367cac7956b6bfabf20dd8b707eb40c3b/736_0_6355_5087/500.jpg",
    "summary": "The President is advocating for a ban on most mail-in voting, citing unsubstantiated allegations related to the 2020 election defeat. This push aims to reshape voting laws amid ongoing debates about election integrity. Critics argue that such measures are unfounded and could disenfranchise voters.",
    "published": "2025-08-31T19:01:52Z"
  },
  {
    "title": "Liverpool 1-0 Arsenal: Premier League player ratings from Anfield",
    "url": "https://www.theguardian.com/football/2025/aug/31/liverpool-arsenal-premier-league-player-ratings-anfield",
    "image": "https://media.guim.co.uk/0f7b402b7ea52293d6271dc500ab951158b55ed8/238_0_3325_2660/500.jpg",
    "summary": "Dominik Szoboszlai made a significant impact during the match, culminating in a decisive winning goal. In contrast, Viktor Gyökeres failed to leave a notable mark on the game. Szoboszlai's performance highlighted his skill and importance to the team.",
    "published": "2025-08-31T18:56:39Z"
  },
  {
    "title": "Rugby World Cup roundup: France demolish Brazil, South Africa edge Italy, Ireland win",
    "url": "https://www.theguardian.com/sport/2025/aug/31/women-rugby-world-cup-roundup-france-brazil-south-africa-italy-ireland-spain",
    "image": "https://media.guim.co.uk/5287f5aadb62a3e7640fa7261a1bd083f59615b8/0_0_4454_3563/500.jpg",
    "summary": "Marine Ménager played a key role in France's advancement to the quarterfinals by contributing to their victory over Brazil. South Africa secured a win against Italy, while Ireland triumphed over Spain. These results highlight notable performances in the knockout stages of the tournament.",
    "published": "2025-08-31T18:53:21Z"
  }
]