[
  {
    "title": "Sanae Takaichi expected to become Japan’s first female PM after winning ruling party leadership",
    "url": "https://www.theguardian.com/world/2025/oct/04/sanae-takaichi-expected-to-become-japans-first-female-pm-after-winning-ruling-party-leadership",
    "image": "https://media.guim.co.uk/13a365f8c4c1cf398895755fd9ffb330c08d7724/88_0_7563_6054/500.jpg",
    "summary": "An admirer of Margaret Thatcher has won the leadership of Japan's ruling Liberal Democratic Party, defeating the more moderate Shinjiro Koizumi. This victory indicates a potential shift towards more conservative policies within the party. The new leader's approach could impact Japan's political landscape moving forward.",
    "published": "2025-10-04T06:25:26Z"
  },
  {
    "title": "Emergency services recover two bodies found in Victorian high country by hikers",
    "url": "https://www.theguardian.com/australia-news/2025/oct/04/two-bodies-found-in-victorian-high-country-by-hikers",
    "image": "https://media.guim.co.uk/8f74427f996aefde56bd4ecb44878dad183bc56f/111_0_3725_2980/500.jpg",
    "summary": "Tasmanian police have confirmed the death of a woman due to a drowning incident in the Franklin River. In a separate event, authorities successfully rescued 11 hikers who were stranded. The incidents highlight ongoing safety concerns in the region’s outdoor activities.",
    "published": "2025-10-04T06:15:01Z"
  },
  {
    "title": "New Zealand v Australia: men’s third T20 international cricket – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/04/new-zealand-v-australia-mens-third-t20-international-cricket-live",
    "image": "https://media.guim.co.uk/df7179cf71aeac50b0763012f359522a64241f4f/500_0_5000_4000/500.jpg",
    "summary": "James Wallace will provide live updates in an over-by-over report. Stay tuned for real-time insights and key moments covering the unfolding events. Follow along for detailed commentary and analysis.",
    "published": "2025-10-04T06:14:55Z"
  },
  {
    "title": "‘Sweat equity’: homebuyers turn builders for £10k off their mortgage",
    "url": "https://www.theguardian.com/money/2025/oct/04/sweat-equity-schemes-homebuyers-mortgage",
    "image": "https://media.guim.co.uk/14b2a74815e348fa828ed07d69f937ac0189376c/0_0_1179_943/500.jpg",
    "summary": "A new initiative offers individuals the opportunity for home ownership in exchange for 500 hours of work. This program aims to provide more than just housing benefits, potentially including skills training and community engagement. Participants can expect to gain valuable experiences alongside the prospect of owning a home.",
    "published": "2025-10-04T06:00:07Z"
  },
  {
    "title": "My cultural awakening: Ratatouille helped me overcome my insomnia",
    "url": "https://www.theguardian.com/culture/2025/oct/04/my-cultural-awakening-ratatouille-film-insomnia",
    "image": "https://media.guim.co.uk/df45680d28cc80ab4e5ba3a0e03da93f223eb29d/21_0_4664_3730/500.jpg",
    "summary": "The author reflects on lifelong sleep struggles that began in childhood, often turning to movies for distraction. A specific children’s animated film consistently helped them fall asleep quickly. This experience highlights a personal connection between media and sleep comfort.",
    "published": "2025-10-04T06:00:06Z"
  }
]