[
  {
    "title": "Angela Rayner stands down as deputy PM after investigation by ethics adviser – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/05/angela-rayner-stamp-duty-labour-starmer-reform-nigel-farage-uk-politics-live-news-updates",
    "image": "https://media.guim.co.uk/548c85e07b6173161b515e9503fe83ca2eac0715/581_0_5122_4098/500.jpg",
    "summary": "Labour leader Keir Starmer faces criticism after a damaging move against his deputy, whom he initially supported. This decision raises questions about internal party unity and Starmer's leadership. The fallout could impact his credibility and the party's future direction.",
    "published": "2025-09-05T11:24:34Z"
  },
  {
    "title": "Australia v New Zealand: men’s international football friendly – live",
    "url": "https://www.theguardian.com/football/live/2025/sep/05/australia-socceroos-vs-new-zealand-all-whites-live-updates-international-football-friendly-latest",
    "image": "https://media.guim.co.uk/2f04d7f26b02625c148d7d7b655dfb41f335c1ce/235_0_3762_3011/500.jpg",
    "summary": "Australia is set to host the first match of two Soccer Ashes fixtures, reviving interest in the long-neglected trophy. Fans can follow live updates from Joey Lynch as the match unfolds. The event marks a significant moment for soccer enthusiasts in the region.",
    "published": "2025-09-05T11:22:49Z"
  },
  {
    "title": "Geelong v Brisbane: AFL 2025 second qualifying final – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/05/geelong-v-brisbane-afl-2025-second-qualifying-final-live",
    "image": "https://media.guim.co.uk/de3545a47d9d509fda4729413af3bb9701a4178f/139_0_2719_2174/500.jpg",
    "summary": "The Cats and Lions face off in a crucial match at the MCG, with a home preliminary final spot on the line. Fans can follow live updates from Martin Pegan. The stakes are high as both teams vie for victory.",
    "published": "2025-09-05T11:22:23Z"
  },
  {
    "title": "Trump’s department of war rebrand ‘won’t strengthen national security or help military personnel’ – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/05/donald-trump-pentagon-department-of-war-immigration-tariffs-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/c146a79abb28b95cb40e0832fb51f05174c5fc57/997_0_5338_4272/500.jpg",
    "summary": "Democrat Tammy Duckworth, a veteran who sustained injuries during her service, advocates for reallocating funds to support military families. She emphasizes the importance of using resources to prevent conflicts rather than escalating military involvement. Duckworth's stance reflects a focus on the well-being of service members and their families.",
    "published": "2025-09-05T11:21:28Z"
  },
  {
    "title": "Stones ruled out for England, Tottenham latest, Russo’s new deal as WSL kicks off: football news – live",
    "url": "https://www.theguardian.com/football/live/2025/sep/05/tottenham-latest-russo-new-arsenal-deal-internationals-world-cup-qualifiers-wsl-football-news-live",
    "image": "https://media.guim.co.uk/318aaf5f37035cd311b50cc9cffeb5e59a73fe17/0_232_1850_1480/500.jpg",
    "summary": "Denmark and Scotland are set to face off in an upcoming football match as part of the World Cup qualifiers. Enthusiasts are gearing up for a weekend filled with exciting international fixtures. Fans are eagerly anticipating the latest developments and updates from the tournament.",
    "published": "2025-09-05T11:18:29Z"
  }
]