[
  {
    "title": "Russia and Belarus carry out military drills amid rising tension – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/sep/15/russia-ukraine-romania-poland-drone-trump-tariffs-europe-live-news-updates",
    "image": "https://media.guim.co.uk/ad735b4c75b0ef28d45216257f1f7b1a7e03cb18/901_0_4854_3884/500.jpg",
    "summary": "Allied forces are conducting exercises simulating an attack on Belarus, marking the first drills of this nature since Russia began its invasion of Ukraine. The exercises aim to prepare for potential threats in the region amid escalating tensions. This move underscores concerns about security dynamics following the ongoing conflict in Ukraine.",
    "published": "2025-09-15T14:32:13Z"
  },
  {
    "title": "Surrey v Nottinghamshire, Sussex v Yorkshire, and more: county cricket, day one – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/15/surrey-v-nottinghamshire-sussex-v-yorkshire-and-more-county-cricket-day-one-live",
    "image": "https://media.guim.co.uk/027cb4b2165737228df1f412442457907b2fa7e3/0_0_4518_3616/500.jpg",
    "summary": "Tanya Aldred will provide live updates from the Oval on the latest County Championship fixtures. Fans can stay tuned for real-time insights and scores. Don't miss the action as the matches unfold!",
    "published": "2025-09-15T14:29:03Z"
  },
  {
    "title": "Top Starmer aide resigns over explicit Diane Abbott messages in further blow to PM – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/15/keir-starmer-peter-mandelson-labour-reform-tories-uk-politics-live-news-updates",
    "image": "https://media.guim.co.uk/14e971cefa4204c99b097dae19bf090c12945f9e/0_0_2708_2166/500.jpg",
    "summary": "Paul Ovenden has resigned from his position as director of strategy, citing the need to prevent becoming a distraction for the organization. His decision follows the revelation of derogatory emails he had sent previously. Ovenden's departure is aimed at allowing the focus to return to the company's objectives.",
    "published": "2025-09-15T14:22:27Z"
  },
  {
    "title": "World Athletics Championships 2025: Duplantis soars to pole vault gold and new world record – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/15/world-athletics-championships-2025-armand-duplantis-goes-for-pole-vault-gold-hurdles-finals-and-more-live",
    "image": "https://media.guim.co.uk/810e6913e086b2b5964a19d132598081d8ed6c68/821_0_5378_4305/500.jpg",
    "summary": "On the third day of events in Tokyo, Yara El-Shaboury reports on the latest updates and developments. Key highlights include significant performances and competitions happening across various sports. The atmosphere remains vibrant as athletes continue to showcase their talents.",
    "published": "2025-09-15T14:22:24Z"
  },
  {
    "title": "Senior Starmer adviser quits over offensive Diane Abbott messages",
    "url": "https://www.theguardian.com/politics/2025/sep/15/senior-starmer-adviser-paul-ovenden-quits-over-offensive-diane-abbott-messages",
    "image": "https://media.guim.co.uk/d0397d4f7d91a1f3bee61aae77b997cb94bed11e/0_0_2031_1623/500.jpg",
    "summary": "Paul Ovenden's resignation as political strategy director adds to Prime Minister's challenges, following the recent departures of key figures Peter Mandelson and Angela Rayner. This string of exits highlights ongoing instability within the leadership team. The Prime Minister faces increased pressure as they navigate these personnel changes.",
    "published": "2025-09-15T14:19:05Z"
  }
]