[
  {
    "title": "Manchester United v Vålerenga: Women’s Champions League – live",
    "url": "https://www.theguardian.com/football/live/2025/oct/08/manchester-united-v-valerenga-womens-champions-league-live",
    "image": "https://media.guim.co.uk/44ba08b53cab3c8ad187aff5a88e90f5fe300e6f/445_0_2280_1824/500.jpg",
    "summary": "Manchester United aims to carry their impressive domestic performance into European competitions. This analysis is covered by Sarah Rendell, who explores the team's potential in transitioning their success. Fans are eager to see if United can replicate their winning streak on the international stage.",
    "published": "2025-10-08T19:13:47Z"
  },
  {
    "title": "Police officer who put girl in headlock found guilty of assault",
    "url": "https://www.theguardian.com/uk-news/2025/oct/08/police-officer-girl-headlock-guilty-assault",
    "image": "https://media.guim.co.uk/d6867c168b1786238d3249de844b83c88b0393ac/0_0_3097_2478/500.jpg",
    "summary": "Adrian Young, a British Transport Police officer, restrained a 15-year-old at a train station in Camden, north London. The incident involved police intervention at the station. Further details about the circumstances remain unspecified.",
    "published": "2025-10-08T18:58:09Z"
  },
  {
    "title": "Twente 1-1 Chelsea: Women’s Champions League – as it happened",
    "url": "https://www.theguardian.com/football/live/2025/oct/08/twente-v-chelsea-womens-champions-league-live",
    "image": "https://media.guim.co.uk/2f16f9ce9baca6ddc1cce4a33cc952ea6e461778/408_0_3500_2800/500.jpg",
    "summary": "The WSL champions faced a close call as they nearly succumbed to an unexpected defeat. Sandy Baltimore stepped in to secure their victory with a crucial penalty. This pivotal moment ensured the champions maintained their winning streak.",
    "published": "2025-10-08T18:56:03Z"
  },
  {
    "title": "‘We’re not here as tourists’: Bellamy insists Wales will go on attack against England",
    "url": "https://www.theguardian.com/football/2025/oct/08/bellamy-wales-england-friendly",
    "image": "https://media.guim.co.uk/3aae4e0e8e54e8136042467ad1bbc0fdab99d590/528_222_2571_2057/500.jpg",
    "summary": "Craig Bellamy emphasized that Wales will not be passive \"tourists\" during their friendly match against England at Wembley on Thursday night. He is determined for the team to be competitive and fully engaged in the game. Bellamy's comments reflect a focus on striving for a strong performance.",
    "published": "2025-10-08T18:55:04Z"
  },
  {
    "title": "Baltimore penalty spares Chelsea blushes after Twente threaten WCL shock",
    "url": "https://www.theguardian.com/football/2025/oct/08/twente-chelsea-womens-champions-league-match-report",
    "image": "https://media.guim.co.uk/2f16f9ce9baca6ddc1cce4a33cc952ea6e461778/636_182_3130_2504/500.jpg",
    "summary": "Chelsea faced a setback in their Champions League campaign with a 1-1 draw against Twente in the Netherlands. This result marked a disappointing beginning for the team in the tournament. The match highlighted concerns over Chelsea's performance and prospects moving forward.",
    "published": "2025-10-08T18:52:59Z"
  }
]