[
  {
    "title": "Australia news live: class action filed over alleged systemic sexual abuse and discrimination in ADF; new taskforce takes over hunt for Dezi Freeman",
    "url": "https://www.theguardian.com/australia-news/live/2025/oct/24/australia-news-live-police-search-colleen-walker-craig-bowraville-river-labor-environment-laws-murray-watt-coalition-greens-ntwnfb",
    "image": "https://media.guim.co.uk/131fbea5712f4427c6f432dd54b92531dbd278b5/988_332_2004_1604/500.jpg",
    "summary": "I apologize, but I need the specific news or information you'd like summarized. Please provide the details, and I'll be happy to help!",
    "published": "2025-10-24T02:53:05Z"
  },
  {
    "title": "Plaid Cymru ousts Labour in Caerphilly byelection ",
    "url": "https://www.theguardian.com/uk-news/2025/oct/24/plaid-cymru-wins-caerphilly-byelection-result",
    "image": "https://media.guim.co.uk/a796d257e0fb6db90206937140b939b53e566cb2/271_0_4027_3221/500.jpg",
    "summary": "Rhun ap Iorwerth's party, advocating for Welsh independence, successfully captured a Senedd seat following a challenge from Reform UK. The victory underscores growing support for independence movements in Wales. The election outcome reflects shifting political dynamics in the region.",
    "published": "2025-10-24T02:50:42Z"
  },
  {
    "title": "Caerphilly byelection result live: Plaid Cyrmu beats challenge from Reform UK to win pivotal Welsh parliament vote",
    "url": "https://www.theguardian.com/politics/live/2025/oct/24/caerphilly-byelection-result-live-reform-plaid-cymru-labour-wales-welsh-government-senedd-latest-voting-news",
    "image": "https://media.guim.co.uk/878d59c2b9c9a6a5e62b56c4ff9c6d05f3ebeaf8/519_0_5608_4487/500.jpg",
    "summary": "A party advocating for Welsh independence has successfully taken a constituency from Labour in a recent election. They faced strong competition from Reform UK but managed to hold their ground. This win marks a significant shift in the political landscape of Wales.",
    "published": "2025-10-24T02:42:04Z"
  },
  {
    "title": "‘We’re just gonna kill people’: Trump says he does not need declaration of war for Venezuela strikes – as it happened",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/23/trump-san-francisco-federal-agents-white-house-ice-immigration-latest-news-updates",
    "image": "https://media.guim.co.uk/fcaf573e1483b746c3c7817ea128aa91cb6e7a09/398_0_5000_4000/500.jpg",
    "summary": "The live blog has officially concluded. No further updates will be provided. Thank you for following along.",
    "published": "2025-10-24T02:04:38Z"
  },
  {
    "title": "Man charged over deadly Palisades fire pleads not guilty in Los Angeles court",
    "url": "https://www.theguardian.com/us-news/2025/oct/23/palisades-fire-california-suspect",
    "image": "https://media.guim.co.uk/4c387dae0c85f05fe368f9db183efae534fc98ef/540_0_5419_4335/500.jpg",
    "summary": "Jonathan Rinderknecht, 29, has been charged with intentionally igniting a destructive fire that led to the devastation of over 6,800 structures. The fire caused significant damage in the affected area, raising concerns about wildfire management and safety. Investigations are ongoing as authorities work to assess the full impact of the disaster.",
    "published": "2025-10-24T02:00:01Z"
  }
]