[
  {
    "title": "Charlie Kirk shooting latest: FBI recovers rifle believed to have been used to kill Trump ally as suspect still at large",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/11/charlie-kirk-shot-latest-news-updates-utah-university-donald-trump",
    "image": "https://media.guim.co.uk/e2f5c2b4daf0d34ec0efb479b55b415771a39c95/203_0_3749_3000/500.jpg",
    "summary": "A high-powered bolt action rifle was discovered in a wooded area, with the FBI reporting that a suspect, who seems to be of college age, managed to blend in with the surroundings. Meanwhile, former President Trump is set to award Kirk with the Presidential Medal of Freedom. The circumstances surrounding both incidents have drawn significant attention.",
    "published": "2025-09-11T14:36:09Z"
  },
  {
    "title": "RTÉ says Ireland will not be part of Eurovision 2026 if Israel participates",
    "url": "https://www.theguardian.com/tv-and-radio/2025/sep/11/rte-says-ireland-will-not-be-part-of-eurovision-2026-if-israel-participates",
    "image": "https://media.guim.co.uk/f9ad922cd5212c5a634f70f994a5f3f28256a04b/351_0_4681_3744/500.jpg",
    "summary": "Ireland's national broadcaster has announced that participation in next year's events will be conditional, following Slovenia's lead. This decision is a response to the ongoing war in Gaza. Both countries are prioritizing the implications of the conflict in their programming and participation policies.",
    "published": "2025-09-11T14:35:22Z"
  },
  {
    "title": "Charlie Kirk shooting death – what we know so far",
    "url": "https://www.theguardian.com/us-news/2025/sep/10/charlie-kirk-shooting-what-we-know",
    "image": "https://media.guim.co.uk/f9ad1e881b72839e1c7e827aa204e0a03abc45a3/606_0_3600_2880/500.jpg",
    "summary": "Turning Point USA's executive director was shot and killed during an event at Utah Valley University. The incident has raised concerns regarding safety at campus events. Authorities are investigating the circumstances surrounding the shooting.",
    "published": "2025-09-11T14:34:35Z"
  },
  {
    "title": "No 10 says Starmer found Mandelson’s emails to Epstein ‘reprehensible’ – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/11/peter-mandelson-keir-starmer-deputy-labour-leader-uk-politics-latest-news",
    "image": "https://media.guim.co.uk/c07d84b6f076607ac3574c51f6231bdbd5c70ef6/1437_592_5194_4154/500.jpg",
    "summary": "No 10 has consistently declined to confirm whether Prime Minister Rishi Sunak was \"misled\" by Peter Mandelson regarding recent allegations. This lack of clarity comes despite repeated inquiries from the media. The situation raises questions about the transparency and accountability of the government's communications.",
    "published": "2025-09-11T14:33:48Z"
  },
  {
    "title": "Europe’s far-right leaders attack ‘hate-mongering left’ after Charlie Kirk murder",
    "url": "https://www.theguardian.com/us-news/2025/sep/11/europe-far-right-leaders-charlie-kirk-shooting-turning-point-usa",
    "image": "https://media.guim.co.uk/d35c77a05d2cedc1f5f301c73962d011c8c707b7/362_0_3861_3089/500.jpg",
    "summary": "Hungarian Prime Minister Viktor Orbán asserts that the death of Turning Point USA's founder was due to an \"international hate campaign.\" Following the news, several prominent figures have expressed their condolences and tributes. The statement highlights ongoing tensions surrounding political discourse and figures involved in conservative movements.",
    "published": "2025-09-11T14:30:26Z"
  }
]