[
  {
    "title": "World Series Game 7: Los Angeles Dodgers v Toronto Blue Jays – live ",
    "url": "https://www.theguardian.com/sport/live/2025/nov/01/world-series-game-7-los-angeles-dodgers-v-toronto-blue-jays-live-updates",
    "image": "https://media.guim.co.uk/7248badeb32947cd89ade87bee75be7f45ce2283/344_0_2878_2304/500.jpg",
    "summary": "The Los Angeles Dodgers and Toronto Blue Jays face off in a decisive Game 7 of the World Series. This matchup will determine the champion of the season. Bryan Graham is providing continuous updates on the game.",
    "published": "2025-11-02T03:09:27Z"
  },
  {
    "title": "Australia news live: Littleproud says Ley was ‘fully cognisant’ of Nationals net zero debate ahead of today’s formal scrapping of target",
    "url": "https://www.theguardian.com/australia-news/live/2025/nov/02/nationals-net-zero-party-room-meeting-coalition-labor-murray-watt-anthony-albanese-apec-mark-butler-medicare-bulk-billing-ntwnfb",
    "image": "https://media.guim.co.uk/086c337e470ebbe5f7ada75108d4c3490547cb53/2683_579_3292_2634/500.jpg",
    "summary": "I'm sorry, but I need more specific information about the news you're referring to in order to provide an accurate summary. Could you please provide additional details or context?",
    "published": "2025-11-02T03:08:19Z"
  },
  {
    "title": "Cambridgeshire train stabbing: 10 people injured in attack; police arrest two suspects – latest updates",
    "url": "https://www.theguardian.com/uk-news/live/2025/nov/02/cambridgeshire-train-stabbing-life-threatening-injuries-arrests-latest-updates",
    "image": "https://media.guim.co.uk/c8fb9faf5e3abb41a9f3bd7f074385fa02a6c37c/0_0_4076_3261/500.jpg",
    "summary": "Nine individuals have been hospitalized with life-threatening injuries following a serious incident. Police have stated that counter-terrorism officers are involved in the investigation. Updates on the situation are ongoing.",
    "published": "2025-11-02T03:06:40Z"
  },
  {
    "title": "Nationals ‘proud’ to formally scrap net zero target after party room meeting",
    "url": "https://www.theguardian.com/australia-news/2025/nov/02/nationals-party-room-meeting-net-zero-emissions-target-david-littleproud",
    "image": "https://media.guim.co.uk/c8643e5290179277f0200dd83162a3f2ff92143f/277_0_3433_2746/500.jpg",
    "summary": "David Littleproud revealed that he had communicated with Sussan Ley several days prior regarding a policy position under consideration by his party. His announcement suggests collaboration and transparency within the party ranks. The specifics of the policy have not been disclosed in the statement.",
    "published": "2025-11-02T03:02:21Z"
  },
  {
    "title": "Cambridgeshire train attack: what we know so far",
    "url": "https://www.theguardian.com/uk-news/2025/nov/02/cambridgeshire-train-attack-what-we-know-so-far",
    "image": "https://media.guim.co.uk/d5b20fd4fc95630d807baea793683ce1db055409/409_0_4181_3345/500.jpg",
    "summary": "Nine individuals have been hospitalized with life-threatening injuries following a significant incident on a train traveling through Cambridgeshire on Saturday. Emergency services responded to the situation, which has been classified as a major incident. Authorities are currently investigating the circumstances surrounding the event.",
    "published": "2025-11-02T02:32:12Z"
  }
]