[
  {
    "title": "Starmer facing fresh questions over Mandelson emails to Epstein – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/15/keir-starmer-peter-mandelson-labour-reform-tories-uk-politics-live-news-updates",
    "image": "https://media.guim.co.uk/e6ca981e440c9b84157f83965be795310d492cce/170_0_1706_1365/500.jpg",
    "summary": "The Prime Minister faces mounting scrutiny regarding his knowledge before last week's PMQs, during which he supported the former US ambassador. Critics are demanding clarification about his awareness of the situation at that time. This pressure intensifies amidst ongoing political tensions.",
    "published": "2025-09-15T08:45:46Z"
  },
  {
    "title": "Police investigating up to 20 deaths linked to Gold Coast ‘end of life’ business after veterinary drug found in man’s body",
    "url": "https://www.theguardian.com/australia-news/2025/sep/15/police-investigating-deaths-linked-to-end-of-life-business-gold-coast-veterinary-drug-found-mans-body-ntwnfb",
    "image": "https://media.guim.co.uk/415a0f08e6007928caec933bd519d733b3db875a/291_0_1350_1080/500.png",
    "summary": "A 53-year-old business owner has been charged with aiding suicide and trafficking dangerous drugs after allegedly using a fake whale charity to obtain euthanasia drugs. Authorities claim the scheme was designed to exploit the charitable organization for illegal purposes. The case highlights concerns over the misuse of charity status to facilitate criminal activities.",
    "published": "2025-09-15T08:40:50Z"
  },
  {
    "title": "‘Cascading, compounding’: five key takeaways from Australia’s national climate risk assessment",
    "url": "https://www.theguardian.com/environment/2025/sep/15/australia-national-climate-risk-assessment-summary-five-key-takeaways-heat-related-deaths-economic-cost-climate-change",
    "image": "https://media.guim.co.uk/0fe08f8360a0a4041988c80c974b4bacfbac3607/428_0_4281_3426/500.jpg",
    "summary": "A landmark report highlights an increase in heat-related deaths and emphasizes the significant environmental and economic costs associated with climate change. It underscores the urgent need for action to mitigate these effects. The findings serve as a stark warning about the ongoing impacts of climate change on public health and the economy.",
    "published": "2025-09-15T08:40:09Z"
  },
  {
    "title": "First annual drop in UK house asking prices since January 2024",
    "url": "https://www.theguardian.com/business/live/2025/sep/15/uk-house-prices-drop-tax-budget-rents-financial-markets-business-live-news-updates",
    "image": "https://media.guim.co.uk/7e293b77e2e84fc6f159a41a8f27fa6d25fa86f7/404_0_3941_3152/500.jpg",
    "summary": "This news provides continuous updates on current economic trends and financial developments. It covers key market movements, policy changes, and significant economic indicators. The aim is to keep readers informed about the evolving economic landscape.",
    "published": "2025-09-15T08:23:01Z"
  },
  {
    "title": "We Love You, Bunny by Mona Awad review – a delicious follow-up to Bunny",
    "url": "https://www.theguardian.com/books/2025/sep/15/we-love-you-bunny-by-mona-awad-review-a-delicious-follow-up-to-bunny",
    "image": "https://media.guim.co.uk/2abc483107b996f5591c2442eaad79b5b0ffa39e/31_192_1747_1397/500.jpg",
    "summary": "The film is a campy, humorous sequel centered around a group of writing students at an Ivy League university. It features sharp satire and whimsical elements, including charming \"hot-boyfriend\" golems. Overall, it blends comedy and satire to entertain audiences.",
    "published": "2025-09-15T08:00:58Z"
  }
]