[
  {
    "title": "Palestine supporters rally in three Australian capitals – as it happened",
    "url": "https://www.theguardian.com/australia-news/live/2025/oct/12/australia-news-live-pro-palestine-rally-sydney-optus-anthony-albanese-sussan-ley",
    "image": "https://media.guim.co.uk/fb686905f3e13040a7d310033b8c4082f97ddd5d/374_0_2461_1970/500.jpg",
    "summary": "The blog has officially ceased operations and will no longer be updated. Readers are thanked for their support during its run. The closure marks the end of content contributions and engagement.",
    "published": "2025-10-12T05:01:12Z"
  },
  {
    "title": "The plastic inside us: how microplastics may be reshaping our bodies and minds",
    "url": "https://www.theguardian.com/environment/2025/oct/12/plastic-inside-us-microplastics-reshaping-bodies-minds",
    "image": "https://media.guim.co.uk/f771789968b21b0dfcfff8c14f7945ad9e1d1257/688_0_6880_5504/500.jpg",
    "summary": "Researchers are discovering the presence of various particles within human blood, brains, and guts, highlighting their potential impact on health. As investigations continue, scientists are only beginning to understand the roles these particles play in bodily functions. This emerging field of study could lead to significant insights into disease mechanisms and overall well-being.",
    "published": "2025-10-12T05:00:45Z"
  },
  {
    "title": "‘I realised I’d been ChatGPT-ed into bed’: how ‘Chatfishing’ made finding love on dating apps even weirder",
    "url": "https://www.theguardian.com/lifeandstyle/2025/oct/12/chatgpt-ed-into-bed-chatfishing-on-dating-apps",
    "image": "https://media.guim.co.uk/c7262e1f3c0626fd7c668a0e1da32b1963f0d61e/448_782_2513_2011/500.jpg",
    "summary": "The rise of computer-generated personas poses new challenges for online interactions, shifting from traditional deceptive tactics like staged photos and rehearsed lines. Users now must navigate the complexities of convincing digital identities. This highlights the increasing sophistication of technology in creating realistic yet fabricated profiles.",
    "published": "2025-10-12T05:00:44Z"
  },
  {
    "title": "Restitution row: how Nigeria’s new home for the Benin bronzes ended up with clay replicas",
    "url": "https://www.theguardian.com/news/ng-interactive/2025/oct/12/restitution-row-how-nigerias-new-home-for-the-benin-bronzes-ended-up-with-clay-replicas",
    "image": "https://media.guim.co.uk/56783b4860feb61d9f83fc083031338246e9d58a/455_0_4561_3648/500.jpg",
    "summary": "The new Museum of West African Art intended to showcase artefacts looted by British colonial forces as a highlight of its restitution efforts. However, issues arose during the display, undermining the anticipated celebration of returning these cultural treasures. The situation has raised questions about the challenges of effectively addressing colonial legacies in museum contexts.",
    "published": "2025-10-12T05:00:44Z"
  },
  {
    "title": "European far right follows Trump in calling for antifa to be declared terrorists",
    "url": "https://www.theguardian.com/world/2025/oct/12/european-far-right-follows-trump-in-calling-for-antifa-to-be-declared-terrorists",
    "image": "https://media.guim.co.uk/32bdf78278f49dd2b9135f1c0b253dbc81c4d55d/807_215_4205_3365/500.jpg",
    "summary": "The Netherlands and Hungary are progressing towards a formal designation, as indicated by a draft resolution supported by 79 Members of the European Parliament (MEPs) from 20 countries. This development highlights significant political backing for their situation within the EU. The resolution aims to address ongoing concerns related to governance and rule of law in these nations.",
    "published": "2025-10-12T05:00:44Z"
  }
]