[
  {
    "title": "News live: energy rebates will not be extended, Chalmers says; Australians’ credit card debt at four-year high",
    "url": "https://www.theguardian.com/australia-news/live/2025/dec/08/australia-news-live-politics-coalition-housing-policy-liberal-labor-vic-nsw-qld-tasmania-weather-bushfires-economy-education-health-social-media-cost-of-living",
    "image": "https://media.guim.co.uk/f4d1dd78c3d9d3b0eb7c088b220c2e2efa2dc744/1024_0_5218_4174/500.jpg",
    "summary": "I'm sorry, but I need specific content or details from the news article to summarize it accurately. Please provide the text or main points you'd like me to summarize.",
    "published": "2025-12-08T05:22:35Z"
  },
  {
    "title": "Linguists start compiling first ever complete dictionary of ancient Celtic",
    "url": "https://www.theguardian.com/science/2025/dec/08/linguists-start-compiling-first-ever-complete-dictionary-of-ancient-celtic",
    "image": "https://media.guim.co.uk/b17577760292c6bcb7ac9c3363be24911a54c209/0_0_5000_4000/500.jpg",
    "summary": "Researchers are compiling over 1,000 ancient words dating back to 325 BC to explore historical linguistic patterns. This collection aims to provide insights into the linguistic landscape of the time. The initiative seeks to enhance understanding of language evolution and cultural communication in antiquity.",
    "published": "2025-12-08T05:00:44Z"
  },
  {
    "title": "Rules on single-sex spaces pose risk to trans people’s mental health, UK charities say",
    "url": "https://www.theguardian.com/society/2025/dec/08/single-sex-spaces-trans-nonbinary-mental-health-charities",
    "image": "https://media.guim.co.uk/7586d5257a3a497582b841ebe623f293392f22c6/1056_271_6249_4999/500.jpg",
    "summary": "Fifteen organizations have expressed significant concern regarding the guidance from the Equality and Human Rights Commission (EHRC) that is currently under consideration by ministers. They argue that the guidance could have detrimental effects on human rights protections. The letter emphasizes the need for careful evaluation before any decisions are made.",
    "published": "2025-12-08T05:00:43Z"
  },
  {
    "title": "A year after fall of Assad, a divided Syria struggles to escape cycle of violence",
    "url": "https://www.theguardian.com/world/2025/dec/08/stalled-justice-violence-syria-assad-one-year-on",
    "image": "https://media.guim.co.uk/cc91eccf164252e15b33c2330a66abba33de5994/708_0_5001_4000/500.jpg",
    "summary": "Syria's renewed presence on the global stage has sparked national pride among many citizens. However, lingering domestic grievances pose significant challenges to the country's rebuilding efforts. Balancing international recognition with internal conflicts remains a critical issue.",
    "published": "2025-12-08T05:00:43Z"
  },
  {
    "title": "Trump’s new doctrine confirms it. Ready or not, Europe is on its own | Georg Riekeles and Varg Folkman",
    "url": "https://www.theguardian.com/commentisfree/2025/dec/08/trump-doctrine-europe-us-coercion-economic",
    "image": "https://media.guim.co.uk/497f0a59f6463d88465f0960568eb5e4898a1cf4/1333_28_2525_2020/500.jpg",
    "summary": "Georg Riekeles and Varg Folkman from the European Policy Centre advocate for Europe to shift from a defensive stance to a position of strength against US pressure. They argue that leveraging economic resources effectively is crucial for achieving this transition. Utilizing these \"economic cards\" will empower Europe in its dealings with the US.",
    "published": "2025-12-08T05:00:43Z"
  }
]