[
  {
    "title": "Newcastle’s Wissa to see specialist over knee injury, Slot on Isak and Guéhi – live",
    "url": "https://www.theguardian.com/football/live/2025/sep/12/premier-league-buildup-press-conferences-team-news-live",
    "image": "https://media.guim.co.uk/5b6911fe781d10e008e822458bfa2c72bb6c9b51/256_0_3001_2400/500.jpg",
    "summary": "Niall McVeigh will provide updates on the Premier League as it resumes after the international break. Fans can expect coverage of key matches and player news. Stay tuned for insights and highlights from the latest games.",
    "published": "2025-09-12T09:29:44Z"
  },
  {
    "title": "How the Charlie Kirk shooting unfolded – in maps, videos and images",
    "url": "https://www.theguardian.com/us-news/2025/sep/11/charlie-kirk-shooting-maps-videos-images",
    "image": "https://media.guim.co.uk/b639c1f1043034f50689f16aa87ddfdd0ab3b0cc/386_0_3200_2561/500.jpg",
    "summary": "A conservative activist and ally of former President Trump was fatally shot at a Utah Valley University event on Wednesday. The incident has raised concerns about safety at political gatherings. Authorities are investigating the circumstances surrounding the shooting.",
    "published": "2025-09-12T09:29:26Z"
  },
  {
    "title": "Poland says Russia’s drone incursion ‘wasn’t a mistake’ after Trump’s speculation – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/sep/12/poland-russia-drones-ukraine-war-latest-news-europe-live",
    "image": "https://media.guim.co.uk/2bfaa88f8859cb90b156ce2f72ebab120bda5c00/197_0_2380_1904/500.jpg",
    "summary": "Donald Trump downplayed a situation on Thursday night, suggesting it \"could have been a mistake.\" His comments reflect a general attitude of dismissiveness regarding the issue at hand. The context of the remark and its implications remain unclear.",
    "published": "2025-09-12T09:28:05Z"
  },
  {
    "title": "Adelaide v Hawthorn: AFL 2025 first semi-final – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/12/adelaide-crows-vs-hawthorn-hawks-live-updates-2025-afl-semi-final-latest",
    "image": "https://media.guim.co.uk/8adae34a417b5fc03972d60e6c5479f7378943b4/0_93_2497_1995/500.jpg",
    "summary": "The Crows face the Hawks at Adelaide Oval in a crucial match for a spot in the preliminary finals against Geelong. Martin Pegan will provide updates throughout the game. The stakes are high as both teams aim for victory.",
    "published": "2025-09-12T09:27:22Z"
  },
  {
    "title": "Charlie Kirk shooting latest: killer still at large as video of suspect released",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/12/charlie-kirk-shooter-suspect-latest-news-updates-donald-trump-utah",
    "image": "https://media.guim.co.uk/ca8554f3ef7bb4b9452f7942dced10abb093acdf/58_0_6000_4800/500.jpg",
    "summary": "Utah's governor emphasized the crucial role of public assistance in ongoing investigations, stating that the FBI has received over 7,000 leads and tips. He underscored the collaborative effort needed to effectively address the situation. The comments highlight the importance of community involvement in law enforcement activities.",
    "published": "2025-09-12T09:23:55Z"
  }
]