[
  {
    "title": "England v Bangladesh: Women’s Cricket World Cup – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/07/england-v-bangladesh-womens-cricket-world-cup-live",
    "image": "https://media.guim.co.uk/66073dcb70fe89a925d759d584700f81307b711a/895_0_5303_4243/500.jpg",
    "summary": "Nat Sciver-Brunt's team aims to capitalize on their recent decisive victory against South Africa. Taha Hashim will provide live updates throughout the match. Fans are eager to see if they can maintain their winning momentum.",
    "published": "2025-10-07T09:20:33Z"
  },
  {
    "title": "Badenoch defends Jenrick over comments that he ‘did not see another white face’ in Birmingham – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/oct/07/conservative-tory-conference-kemi-badenoch-jenrick-starmer-labour-protests-reform-uk-politics-live-news-updates",
    "image": "https://media.guim.co.uk/83bf1f0275cdc0064ae2ef16f7befb863ae1aed3/467_0_6319_5056/500.jpg",
    "summary": "The Conservative leader responded to remarks reported in The Guardian, suggesting they might have been misinterpreted. He clarified that he was merely making an observation. This statement aims to mitigate any backlash from the report.",
    "published": "2025-10-07T09:18:41Z"
  },
  {
    "title": "Texas national guard troops head to Illinois after judge fails to block move",
    "url": "https://www.theguardian.com/us-news/2025/oct/06/trump-administration-illinois-national-guard",
    "image": "https://media.guim.co.uk/776fa2150d12252d74f688f25360b3b5f912dc38/375_0_3750_3000/500.jpg",
    "summary": "The federal government has been granted permission to maintain its deployment in Chicago as it addresses an ongoing lawsuit filed by the state of Illinois. This decision enables federal agents to continue their operations in the city amidst legal challenges. The situation highlights tensions between state and federal authorities over law enforcement practices.",
    "published": "2025-10-07T09:13:13Z"
  },
  {
    "title": "Gaza ceasefire talks live: negotiations to continue as Israelis mark two-year anniversary of 7 October attacks",
    "url": "https://www.theguardian.com/world/live/2025/oct/07/gaza-ceasefire-peace-talks-israel-hamas-egypt-7-october-anniversary-middle-east-crisis-live-news-updates",
    "image": "https://media.guim.co.uk/80cbbf97443948e18b310c0c97bfe70de025d818/375_0_3750_3000/500.jpg",
    "summary": "The initial day of negotiations between Hamas and mediators in Egypt concluded with a \"positive atmosphere,\" according to local media. The talks aim to address ongoing issues related to Gaza. Further discussions are expected to follow as part of the mediation efforts.",
    "published": "2025-10-07T09:11:15Z"
  },
  {
    "title": "Sixties Surreal: new exhibition offers an alternative view of the decade",
    "url": "https://www.theguardian.com/artanddesign/2025/oct/07/sixties-surreal-whitney-exhibition",
    "image": "https://media.guim.co.uk/ffbfbdf806e370b9ea84c18436173b8afb783897/103_137_4468_3576/500.jpg",
    "summary": "The Whitney Museum in New York is showcasing a new exhibition that emphasizes the lesser-known artistic movements of the current era. The show aims to bring attention to underrepresented artists and their contributions. By doing so, it broadens the narrative of contemporary art and invites fresh perspectives.",
    "published": "2025-10-07T09:03:17Z"
  }
]