[
  {
    "title": "TV tonight: Anthony Mackie’s action-packed apocalyptic comedy",
    "url": "https://www.theguardian.com/tv-and-radio/2025/oct/04/tv-tonight-anthony-mackies-action-packed-apocalyptic-comedy",
    "image": "https://media.guim.co.uk/59ab879efdce7b0a392d97de3ab38944d4fcfece/942_0_3279_2624/500.jpg",
    "summary": "A vibrant adaptation of the popular video game \"Twisted Metal\" is set to entertain viewers. Additionally, the thriller \"Nine Bodies in a Mexican Morgue\" promises intriguing developments. Tune in this evening for an exciting lineup of entertainment.",
    "published": "2025-10-04T04:15:01Z"
  },
  {
    "title": "UK electric car sales hit record high as taxpayer subsidies help attract buyers",
    "url": "https://www.theguardian.com/business/2025/oct/04/uk-electric-car-sales-record-high-taxpayer-subsidies",
    "image": "https://media.guim.co.uk/9d981a278c6c829307467dd565d677c507d5e13b/1000_0_5000_4000/500.jpg",
    "summary": "In September, electric vehicle (EV) sales increased nearly 33% compared to the same month last year. Plug-in hybrid sales surged by 56%, indicating growing consumer interest in these alternatives to traditional vehicles. The significant rise reflects a broader trend towards electrification in the automotive market.",
    "published": "2025-10-04T04:00:01Z"
  },
  {
    "title": "Unyielding Aces rally late to edge Mercury in WNBA finals opener",
    "url": "https://www.theguardian.com/sport/2025/oct/03/wnba-finals-2025-aces-mercury-game-1-report",
    "image": "https://media.guim.co.uk/e8168464aa017e52b9f6a9005865cdd4ca216ed5/711_0_3103_2483/500.jpg",
    "summary": "Las Vegas made a dramatic comeback to defeat Phoenix 89-86 in Game 1 of the WNBA Finals. The victory came with late-game heroics that surprised many fans. Meanwhile, Commissioner Cathy Engelbert addressed inquiries regarding off-court issues during the event.",
    "published": "2025-10-04T03:04:54Z"
  },
  {
    "title": "Two bodies found in Victorian high country by hikers",
    "url": "https://www.theguardian.com/australia-news/2025/oct/04/two-bodies-found-in-victorian-high-country-by-hikers",
    "image": "https://media.guim.co.uk/8f74427f996aefde56bd4ecb44878dad183bc56f/111_0_3725_2980/500.jpg",
    "summary": "Tasmanian police have confirmed the death of a woman who drowned in the Franklin River. In a separate incident, 11 hikers were successfully rescued after becoming stranded. Emergency services responded to both situations.",
    "published": "2025-10-04T02:08:15Z"
  },
  {
    "title": "Trump says Hamas response to peace plan means ‘peace in the Middle East’ is ‘very close’ – as it happened",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/03/shutdown-congress-trump-senate-latest-updates",
    "image": "https://media.guim.co.uk/9b4205aea3f4fabc735b6ffe16d553a37b6532ec/580_0_5802_4644/500.jpg",
    "summary": "US President expresses approval of Hamas's response to his Gaza plan, highlighting a positive step forward. However, Hamas indicates that additional negotiations are necessary to finalize the details. The blog covering this development is now closed.",
    "published": "2025-10-04T02:05:28Z"
  }
]