[
  {
    "title": "US Open tennis day three: Jannik Sinner and Iga Swiatek in action – live",
    "url": "https://www.theguardian.com/sport/live/2025/aug/26/us-open-tennis-day-three-jannik-sinner-and-iga-swiatek-in-action-live",
    "image": "https://media.guim.co.uk/3408d91a8460d5b33e827b254687bfebf73f1b3f/796_92_3389_2711/500.jpg",
    "summary": "Taha Hashim will provide updates on the opening matches of the two favorites in the tournament. Fans are eager to see how these teams perform right from the start. Stay tuned for live commentary and insights.",
    "published": "2025-08-26T16:45:52Z"
  },
  {
    "title": "James Dobson obituary",
    "url": "https://www.theguardian.com/us-news/2025/aug/26/james-dobson-obituary",
    "image": "https://media.guim.co.uk/23021e852b2c1dd7df02df02113627693772e922/251_0_4187_3350/500.jpg",
    "summary": "A prominent psychologist and author, known as a key figure in the evangelical Christian movement in the U.S., has passed away. His influence shaped the religious right and impacted social and political issues. His contributions to psychology and faith continue to resonate within conservative circles.",
    "published": "2025-08-26T16:44:44Z"
  },
  {
    "title": "Hundreds of senior diplomats call for EU to take urgent action over Gaza crisis – Middle East crisis live",
    "url": "https://www.theguardian.com/world/live/2025/aug/26/israel-gaza-protest-hostage-war-hospital-benjamin-netanyahu-latest-live-news-updates",
    "image": "https://media.guim.co.uk/2fd2fbaeced4fb68307e556f9280705f495c3fe2/457_0_4583_3667/500.jpg",
    "summary": "An open letter has been signed by 209 former EU ambassadors and senior diplomatic staff from various EU member states. The signatories express their concerns over current EU policies and their potential impacts. The letter calls for reevaluation and potential changes to strengthen the EU’s position on key issues.",
    "published": "2025-08-26T16:43:35Z"
  },
  {
    "title": "‘Trump has no authority’: Lisa Cook’s lawyer vows to sue administration over attempted firing of Fed governor – live",
    "url": "https://www.theguardian.com/us-news/live/2025/aug/26/trump-federal-reserve-lisa-cook-news-updates-us-politics-live",
    "image": "https://media.guim.co.uk/bb80bf6325afd21c5ae02bce7d87dc97c1a4eea9/0_0_3000_2400/500.jpg",
    "summary": "A lawyer for a Federal Reserve governor asserts that the Trump administration's attempt to dismiss her is unfounded, lacking both factual and legal support. The statement emphasizes the governor's right to maintain her position. This development highlights ongoing tensions regarding appointments within the Federal Reserve.",
    "published": "2025-08-26T16:40:43Z"
  },
  {
    "title": "Who is Lisa Cook, the Fed governor facing removal by Trump?",
    "url": "https://www.theguardian.com/business/2025/aug/26/who-is-lisa-cook-federal-reserve-governor",
    "image": "https://media.guim.co.uk/7a06b6227e6fd3cccfd20fefb872aa334e2f600d/584_0_5001_4000/500.jpg",
    "summary": "The first Black woman to serve on the Federal Reserve Board is confronting yet another challenge in her career. She has previously detailed the numerous obstacles she has encountered throughout her journey. This latest hurdle underscores the ongoing challenges faced by women of color in leadership positions.",
    "published": "2025-08-26T16:39:20Z"
  }
]