[
  {
    "title": "Gaza ceasefire live: Trump says ‘everybody’s cheering’ as he heads to Middle East for Gaza summit",
    "url": "https://www.theguardian.com/world/live/2025/oct/12/gaza-ceasefire-live-aid-relief-hamas-release-israel-hostages",
    "image": "https://media.guim.co.uk/b826099457fa74a398182d2a2a34105b1b0e6877/500_0_5000_4000/500.jpg",
    "summary": "US President Joe Biden expressed that his upcoming visit to Israel and Egypt, aimed at commemorating the Gaza ceasefire agreement, will be a \"very special time.\" The visit underscores the US's commitment to peace in the region. Biden's diplomacy highlights the importance of stability in the ongoing conflict.",
    "published": "2025-10-12T21:12:15Z"
  },
  {
    "title": "Australia news live: scam warning after massive Qantas data leak hits dark web; NSW promises pothole repair",
    "url": "https://www.theguardian.com/australia-news/live/2025/oct/13/australia-news-live-qantas-hack-data-leak-scam-warning-nsw-sydney-potholes-social-media-ban-anika-wells-albanese-sussan-ley-labor-liberal-coalition-ntwnfb",
    "image": "https://media.guim.co.uk/6f867c2f9d4bc53b853309645543d5e427b64b20/1571_0_7857_6286/500.jpg",
    "summary": "I'm sorry, but I need more context or details about the news you're referring to in order to provide an accurate summary. Could you please provide the specific news content or topic?",
    "published": "2025-10-12T21:11:17Z"
  },
  {
    "title": "Riot Women review – Sally Wainwright’s menopausal punk drama is one of her best",
    "url": "https://www.theguardian.com/tv-and-radio/2025/oct/12/riot-women-review-sally-wainwright-menopausal-punk-tv-drama-bbc",
    "image": "https://media.guim.co.uk/48657082207912dc23b92c9993b61edbef168877/320_0_3200_2560/500.jpg",
    "summary": "This new TV drama follows midlife women who come together to form a punk band, capturing their vibrant journey with humor and depth. Comparable to acclaimed series like Happy Valley and Last Tango in Halifax, it features a rich and engaging plot. Audiences can expect a well-crafted showcase of empowerment and creativity.",
    "published": "2025-10-12T21:00:02Z"
  },
  {
    "title": "UK to host international summit on Gaza recovery plan",
    "url": "https://www.theguardian.com/world/2025/oct/12/uk-to-host-international-summit-on-gaza-recovery-plan",
    "image": "https://media.guim.co.uk/05db5169b643683a8fbce122f7804296b83cda85/435_100_1417_1134/500.jpg",
    "summary": "A conference will feature representatives from the Palestinian Authority, Saudi Arabia, Jordan, Germany, and Italy. The gathering aims to address key issues in the region. Attendees will engage in discussions to promote collaboration and peace initiatives.",
    "published": "2025-10-12T21:00:02Z"
  },
  {
    "title": "McTominay and Adams strike as dismal Scotland edge out Belarus and seal playoff slot",
    "url": "https://www.theguardian.com/football/2025/oct/12/world-cup-qualifier-group-c-scotland-belarus-match-report",
    "image": "https://media.guim.co.uk/5639d210855a02419a53bced0700e309239b76cb/500_0_5000_4000/500.jpg",
    "summary": "Scotland secured a 2-1 victory against Belarus, bringing them closer to qualifying for the World Cup finals. Despite the lackluster performance, the win ensures they at least have a playoff spot. The result marks a crucial step in their campaign.",
    "published": "2025-10-12T20:57:55Z"
  }
]