[
  {
    "title": "European Union to reveal ratings for candidate countries – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/nov/04/european-union-eu-latest-news-updates-live",
    "image": "https://media.guim.co.uk/b7710bb879ac88f74b3e6c7daf0ec80b940dc6ac/23_0_4585_3668/500.jpg",
    "summary": "Kaja Kallas will provide an update this afternoon regarding the progress of various countries in their efforts to join the European Union. The announcement will outline advancements and challenges faced by these nations. Details on specific countries and their statuses are expected to be included.",
    "published": "2025-11-04T12:42:15Z"
  },
  {
    "title": "US elections 2025 live: Americans go to the polls, with elections in New York City, New Jersey, Virginia and California",
    "url": "https://www.theguardian.com/us-news/live/2025/nov/04/us-elections-2025-live-new-york-city-new-jersey-virginia-california-latest-news-updates-live",
    "image": "https://media.guim.co.uk/0965b087be591a2ae6e1804d1ce1af3e63bad4df/1131_49_3758_3005/500.jpg",
    "summary": "The upcoming New York mayoral race is attracting significant attention both domestically and internationally. Democratic candidate Zohran Mamdani will compete against former Governor Andrew Cuomo and Republican Curtis Sliwa. The election highlights a critical political moment in the city as candidates present their visions to voters.",
    "published": "2025-11-04T12:41:43Z"
  },
  {
    "title": "Calls to change ‘embarrassing’ Prince Andrew road names in Maidenhead",
    "url": "https://www.theguardian.com/uk-news/2025/nov/04/calls-to-change-embarrassing-prince-andrew-road-names-in-maidenhead",
    "image": "https://media.guim.co.uk/939d9e5633854bb33ec2cbf395d751775c05a77d/65_0_1859_1487/500.jpg",
    "summary": "Residents are calling for the renaming of two roads after a former prince faced censure for his friendship with a convicted child sex offender. The push for the name changes reflects community outrage and a desire to dissociate from the scandal. Local authorities are being urged to consider the names and their implications on public sentiment.",
    "published": "2025-11-04T12:35:50Z"
  },
  {
    "title": "Dick Cheney, vice-president and giant of Republican politics, dies aged 84",
    "url": "https://www.theguardian.com/us-news/2025/nov/04/dick-cheney-vice-president-republican-bush-dies",
    "image": "https://media.guim.co.uk/9639b507c9958e12fa6718815bc880e798f71455/469_120_2170_1736/500.jpg",
    "summary": "Former Vice President Dick Cheney, who held office under Presidents Nixon, Ford, Reagan, Bush Sr., and George W. Bush, is remembered for his significant influence in U.S. foreign policy and national security, particularly following the 9/11 attacks. His role in shaping the response to the attacks, including the wars in Afghanistan and Iraq, left a lasting legacy. Cheney's tenure was marked by a strong stance on terrorism and controversial decisions that continue to spark debate.",
    "published": "2025-11-04T12:30:54Z"
  },
  {
    "title": "Sir Alan Bates agrees multimillion-pound settlement over Post Office scandal",
    "url": "https://www.theguardian.com/uk-news/2025/nov/04/sir-alan-bates-settlement-post-office-scandal",
    "image": "https://media.guim.co.uk/a2da894031761c72001b40a8a3e4b6a23d3502bd/804_0_4004_3205/500.jpg",
    "summary": "The government has reached a settlement with a former post office operator after over 20 years of legal battles for justice. This resolution comes after prolonged efforts by the individual to address grievances related to their previous employment. The settlement marks a significant milestone in a long-standing fight for accountability and redress.",
    "published": "2025-11-04T12:25:50Z"
  }
]