[
  {
    "title": "France v England: Women’s Rugby World Cup 2025 semi-final – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/20/france-v-england-womens-rugby-world-cup-2025-semi-final-live",
    "image": "https://media.guim.co.uk/3a5a3cbb445f5b2c24d7c1f64a39d3c39ccca894/542_0_4741_3795/500.jpg",
    "summary": "Lee Calvert is providing live updates on the Rugby World Cup, highlighting which teams secure their spots in the final. Stay tuned for minute-by-minute reports on the key moments of the matches. Fans can follow the action closely as the tournament progresses.",
    "published": "2025-09-20T14:29:48Z"
  },
  {
    "title": "Brighton v Tottenham, Wolves v Leeds in Premier League and more: football – live",
    "url": "https://www.theguardian.com/football/live/2025/sep/20/brighton-v-tottenham-wolves-v-leeds-and-more-football-clockwatch-live",
    "image": "https://media.guim.co.uk/b956bee9e434958caf4c8c95c12d6e9e7b7ad414/474_158_4170_3338/500.jpg",
    "summary": "Stay updated on the four 3pm Premier League matches and more with live updates from Billy Munday. Catch all the action and key highlights as they unfold. Don't miss out on any crucial moments from today's games.",
    "published": "2025-09-20T14:29:31Z"
  },
  {
    "title": "F1: Verstappen on pole after Leclerc and Piastri crash out of chaotic Azerbaijan GP qualifying – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/20/formula-one-azerbaijan-grand-prix-qualifying-updates-live",
    "image": "https://media.guim.co.uk/5fd5a583f6fb537d449fda82c65d81c79ca0c8b0/140_0_4757_3806/500.jpg",
    "summary": "Oscar Piastri and Charles Leclerc were involved in crashes during Q3 at the Baku Grand Prix, contributing to an unprecedented six red flags. The session was chaotic as drivers struggled with track conditions. Updates on the situation are being provided by Niall McVeigh.",
    "published": "2025-09-20T14:22:26Z"
  },
  {
    "title": "World Athletics Championships 2025: heptathlon gold for Hall, Johnson-Thompson shares bronze; Wanyonyi wins men’s 800m – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/20/world-athletics-championships-2025-heptathlon-mens-800m-final-and-more-live",
    "image": "https://media.guim.co.uk/65ed93481e2cbd7e53d0fdc812c81b8aaba528e1/606_0_6899_5519/500.jpg",
    "summary": "Night eight in Tokyo features exciting events, including the decathlon and heptathlon competitions. Writers will provide live updates on these athletic performances. Additionally, relays are part of the night’s lineup, promising thrilling moments.",
    "published": "2025-09-20T14:19:01Z"
  },
  {
    "title": "Poland scrambles aircraft as Russia attacks Ukraine with hundreds of drones and missiles – as it happened",
    "url": "https://www.theguardian.com/world/live/2025/sep/20/poland-russia-estonia-ukraine-war-europe-latest-news-updates",
    "image": "https://media.guim.co.uk/9de5578fe9d20bd6356e8ddd441f42a976ebaa2a/87_0_1091_873/500.jpg",
    "summary": "Poland has deployed aircraft to safeguard its airspace amid rising tensions. This move comes after Ukraine reported a significant Russian assault involving over 600 drones and missiles. The escalation highlights ongoing security concerns in the region.",
    "published": "2025-09-20T14:14:27Z"
  }
]