[
  {
    "title": "Donald Trump to chair meeting on Gaza as US says it expects ‘to settle this before the end of this year’ – Middle East crisis live",
    "url": "https://www.theguardian.com/world/live/2025/aug/27/donald-trump-meeting-white-house-gaza-israel-middle-east-crisis-latest-updates-news",
    "image": "https://media.guim.co.uk/14257060759189e256012480593eb6627e45dde5/574_0_5600_4480/500.jpg",
    "summary": "US special envoy Steve Witkoff expresses confidence in reaching a resolution soon, stating, \"we think we’re going to settle this one way or another.\" Meanwhile, Marco Rubio is preparing for a meeting with Israeli politician Gideon Saar. This collaboration suggests ongoing diplomatic efforts in the region.",
    "published": "2025-08-27T07:29:41Z"
  },
  {
    "title": "Porepunkah shooting live: shots heard near property where suspected gunman was living as specialised paramedics enter roadblocks",
    "url": "https://www.theguardian.com/australia-news/live/2025/aug/27/porepunkah-shooting-live-updates-victoria-police-manhunt-latest-news-ntwnfb",
    "image": "https://media.guim.co.uk/a38a1d553f20a98e6c1833327acb744078f5b267/585_0_3840_3072/500.jpg",
    "summary": "I'm sorry, but I can't provide a summary without more context or content to summarize. Could you please provide the news you'd like summarized?",
    "published": "2025-08-27T07:28:32Z"
  },
  {
    "title": "Tory chair says party would consider deal with Taliban to return Afghan migrants – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/aug/27/conservatives-consider-deal-afghanistan-migrants-uk-politics-latest-updates-news",
    "image": "https://media.guim.co.uk/3ad4c223194faed8b0d96489fb7df90509d30478/0_29_1741_1394/500.jpg",
    "summary": "Kevin Hollinrake announced that the party might establish a returns agreement with a foreign country, emphasizing that their deportation strategy is significantly more comprehensive than that of the Reform party. The proposal highlights a robust approach to immigration control. This comes amidst ongoing discussions about managing illegal immigration effectively.",
    "published": "2025-08-27T07:27:46Z"
  },
  {
    "title": "Annual energy bills set to rise £35 in October, Trump slaps 50% tariff on India – business live",
    "url": "https://www.theguardian.com/business/live/2025/aug/27/energy-price-cap-rise-trump-tariff-india-business-live-news",
    "image": "https://media.guim.co.uk/6658a30250556fbd333d6b0a9a28fd2689e034ce/704_0_2796_2238/500.jpg",
    "summary": "Ongoing updates reveal key developments in the economy and finance, highlighting market trends and significant changes. Analysts assess impacts on various sectors and consumer behavior. Stay tuned for continuous insights and expert commentary on these dynamic shifts.",
    "published": "2025-08-27T07:26:18Z"
  },
  {
    "title": "Thames Water agrees payment plan for £123m sewage and dividend fines",
    "url": "https://www.theguardian.com/business/2025/aug/27/thames-water-agrees-payment-plan-for-sewage-and-dividend-fines",
    "image": "https://media.guim.co.uk/dbd97f0fe8c293a21b7400789d41d904c36c8bd3/11_25_3285_2628/500.jpg",
    "summary": "Ofwat has granted a struggling firm additional time as it seeks funding to avert nationalisation. This decision provides the company with a temporary reprieve in its financial challenges. The firm aims to stabilize its operations and secure necessary investments.",
    "published": "2025-08-27T07:25:28Z"
  }
]