[
  {
    "title": "New York attorney general calls bank fraud indictment ‘desperate weaponization of our justice system’ – live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/09/national-guard-ice-federal-property-chicago-illinois-us-politics-live",
    "image": "https://media.guim.co.uk/091b85fed22c626f1017da14894b25a206b4fdd7/737_0_5335_4267/500.jpg",
    "summary": "Trump stated that federal cuts during the government shutdown will primarily affect the priorities of his opponents. A bill passed by the House and a Democratic stopgap measure have both been rejected. The ongoing standoff highlights continued partisan divisions over budget negotiations.",
    "published": "2025-10-09T22:13:48Z"
  },
  {
    "title": "Australia politics live: admiral defends fourfold hike in Aukus contract; Gaza flotilla members arrive back in Australia",
    "url": "https://www.theguardian.com/australia-news/live/2025/oct/10/australia-politics-live-senate-estimates-anthony-albanese-sussan-ley-andrew-hastie-migration-aukus-trump-gaza-ntwnfb",
    "image": "https://media.guim.co.uk/b11445f0bcbd762bbfe91ac3678e79ce541cef69/674_0_4101_3280/500.jpg",
    "summary": "I apologize, but I cannot access live news or any current live updates. If you provide me with the text or details of the news article you'd like summarized, I'd be happy to help!",
    "published": "2025-10-09T22:12:28Z"
  },
  {
    "title": "Gaza ceasefire plan live: Trump says ‘nobody’s going to be forced to leave’ as territory is rebuilt",
    "url": "https://www.theguardian.com/world/live/2025/oct/09/gaza-ceasefire-live-trump-says-hostages-probably-released-monday-idf-says-gaza-city-still-extremely-dangerous",
    "image": "https://media.guim.co.uk/2072190864951de196b7397a409549fc0aaa136b/53_0_4800_3840/500.jpg",
    "summary": "US President praises a new \"great peace plan\" during an Oval Office meeting with Finland's Prime Minister. However, Israel's security cabinet has not yet publicly approved the deal. The situation remains uncertain as both leaders discuss the implications of the plan.",
    "published": "2025-10-09T22:04:49Z"
  },
  {
    "title": "Letitia James criminally charged in Trump’s latest effort to punish rivals",
    "url": "https://www.theguardian.com/us-news/2025/oct/09/criminal-charges-letitia-james-new-york-attorney-general",
    "image": "https://media.guim.co.uk/46945c38a3d217e26a1d470a6ce8814f19c31d06/1049_194_4020_3215/500.jpg",
    "summary": "The prosecutor who pursued charges has been appointed following Donald Trump's dissatisfaction with the slow progress of investigations into his political adversaries. This move reflects Trump's ongoing efforts to influence legal proceedings against his rivals. The situation highlights the intersection of law and partisan politics in the current landscape.",
    "published": "2025-10-09T22:01:12Z"
  },
  {
    "title": "Drake’s defamation lawsuit against Universal Music Group dismissed",
    "url": "https://www.theguardian.com/music/2025/oct/09/drakes-defamation-lawsuit-dismissed",
    "image": "https://media.guim.co.uk/ac4d1b693893f2e854e7d32ec6d1d11a713a0c59/72_59_1631_1306/500.jpg",
    "summary": "A rapper has accused Universal Music Group (UMG) of harming his reputation by distributing Kendrick Lamar's song \"Not Like Us.\" He alleges that the distribution was a deliberate attempt to undermine his image. The claim raises questions about industry practices and artist rights.",
    "published": "2025-10-09T21:35:04Z"
  }
]