[
  {
    "title": "Flight cancellations take effect amid government shutdown – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/nov/07/donald-trump-government-shutdown-air-traffic-flights-snap-viktor-orban-hungary-ukraine-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/fdc3bcd5f82150d9843568f7aa5b686d9a73ecc4/309_0_7105_5684/500.jpg",
    "summary": "Airlines began decreasing services before a 6am ET directive aimed at reducing traffic at 40 major airports. The move is part of efforts to manage congestion and improve operational efficiency. This directive was implemented to enhance the overall travel experience for passengers.",
    "published": "2025-11-07T11:15:48Z"
  },
  {
    "title": "Bellingham and Foden recalled to England squad; Rooney ‘a bit unfair’ to Van Dijk: football news – live",
    "url": "https://www.theguardian.com/football/live/2025/nov/07/thomas-tuchel-england-squad-jude-bellingham-weekend-team-news-and-more-football-live",
    "image": "https://media.guim.co.uk/906a70bbe6de1dfef1fffb2212c5a4b49e5f2b4c/0_0_5000_4000/500.jpg",
    "summary": "England manager Thomas Tuchel is set to announce his latest squad ahead of a busy weekend of Premier League matches. The announcement comes as teams prepare for key fixtures. Fans are eager to see which players will be included in the lineup.",
    "published": "2025-11-07T11:14:24Z"
  },
  {
    "title": "Passengers face global disruption as flights cut amid US government shutdown",
    "url": "https://www.theguardian.com/world/2025/nov/07/passengers-face-global-disruption-as-flights-cut-amid-us-government-shutdown",
    "image": "https://media.guim.co.uk/aa52e8a3420802bce3621a6e5513d87444acdca3/381_0_2414_1931/500.jpg",
    "summary": "Travelers are facing significant disruptions as the longest shutdown on record persists, affecting plans and itineraries. With no resolution in sight, many are forced to make adjustments to their travel arrangements. The ongoing situation continues to impact countless individuals relying on transportation services.",
    "published": "2025-11-07T11:13:37Z"
  },
  {
    "title": "Minister defends David Lammy and says ‘broken system’ to blame for prisoner releases – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/nov/07/uk-politics-latest-news-david-lammy-prisoners-labour-keir-starmer",
    "image": "https://media.guim.co.uk/b6359f3b609c171c0e308a5ba15b1cf0d7009ba7/323_0_4152_3323/500.jpg",
    "summary": "Steve Reed emphasizes that addressing the issue at hand requires meaningful solutions rather than engaging in gossip about David Lammy in the media. He advocates for focusing on substantive discussions instead. Reed's statement suggests a call for unity and constructive dialogue.",
    "published": "2025-11-07T11:10:43Z"
  },
  {
    "title": "ITV shares surge as it holds talks to sell broadcast operations to Sky; world food prices fall – business live",
    "url": "https://www.theguardian.com/business/live/2025/nov/07/itv-talks-sell-broadcasting-arm-sky-shares-bank-of-england-stock-markets-business-live",
    "image": "https://media.guim.co.uk/00ce7b1fbe922b05084eb427bab3c5cca58210fc/239_0_3021_2417/500.jpg",
    "summary": "ITV is in early talks with Sky about potentially selling its Media and Entertainment (M&E) business. The proposed deal values the business at £1.6 billion. Further details and developments regarding the negotiations are expected.",
    "published": "2025-11-07T11:08:33Z"
  }
]