[
  {
    "title": "Federal layoffs have started, Trump’s budget chief says, as Congress remains deadlocked over funding to end shutdown – live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/10/letitia-james-donald-trump-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/84c7b03bccaa2922d85ef889e5129dcd2e773dba/475_0_5000_4000/500.jpg",
    "summary": "Russ Vought, former chief of the Office of Management and Budget under Trump, announced that federal \"reductions in force\" are underway as the government enters its 10th day of shutdown. This move aligns with his role in designing Project 2025, a strategy aimed at reshaping the federal government. The shutdown's impact is beginning to be felt, with workforce reductions becoming a reality.",
    "published": "2025-10-10T17:16:30Z"
  },
  {
    "title": "Colm Tóibín: Why I set up a press to publish Nobel winner László Krasznahorkai",
    "url": "https://www.theguardian.com/books/2025/oct/10/colm-toibin-on-nobel-prize-in-literature-winner-laszlo-krasznahorkai",
    "image": "https://media.guim.co.uk/2243be4c91f512ff8bb340c315b27e53c30659b6/541_0_2917_2333/500.jpg",
    "summary": "The Irish novelist reflects on discovering the Hungarian writer two decades ago. They were captivated by the author's inventive language and unconventional narrative style. This enthusiasm highlights the lasting impact of the writer's work on their own literary journey.",
    "published": "2025-10-10T17:15:11Z"
  },
  {
    "title": "Eric Potts obituary",
    "url": "https://www.theguardian.com/business/2025/oct/10/eric-potts-obituary",
    "image": "https://media.guim.co.uk/ae71aa454d8a8abb44a3518c09c51b0f8e6fa9e5/0_2335_4704_3762/500.jpg",
    "summary": "An industrial economist focused on promoting business opportunities for manufacturers in northern England has passed away. His efforts aimed at revitalizing the region's economy and supporting local industries. His legacy includes significant contributions to the advancement of manufacturing in the area.",
    "published": "2025-10-10T17:13:27Z"
  },
  {
    "title": "Pezzolano sacked by Watford after ‘resisting pressure to use players linked to agent’",
    "url": "https://www.theguardian.com/football/2025/oct/10/pezzolano-sacked-by-watford-after-resisting-pressure-to-use-players-linked-to-agent",
    "image": "https://media.guim.co.uk/d74de44f41a94e6b448253f09ff66e9b5529c43e/720_0_3600_2880/500.jpg",
    "summary": "Watford sources have dismissed claims that Paulo Pezzolano was dismissed for refusing to choose players linked to agent Arnaud Mogi Bayat. The club clarified that his departure was not influenced by such pressures. No further details about the reasons for his sacking were provided.",
    "published": "2025-10-10T17:13:26Z"
  },
  {
    "title": "Rangers condemn ‘shameful’ attack on Smith statue; fans respond to Tuchel criticism: football – live",
    "url": "https://www.theguardian.com/football/live/2025/oct/10/tuchel-criticises-silent-england-fans-world-cup-qualifying-news-and-more-football-live",
    "image": "https://media.guim.co.uk/91c95a4ce920ea2bc5f35c724229358c43f191f2/0_0_3003_2403/500.jpg",
    "summary": "A rolling report covers the reactions from the England vs. Wales match and provides updates on World Cup qualifying news. Writers are sharing live insights and commentary. Stay tuned for the latest developments and analyses from the game.",
    "published": "2025-10-10T17:10:45Z"
  }
]