[
  {
    "title": "Australia news live: Sydney mayor urges Minns to step up rental protections; Victoria police confiscating about 50 knives a day amid crackdown",
    "url": "https://www.theguardian.com/australia-news/live/2025/nov/17/australia-news-live-schools-act-asbestos-education-sand-coalition-climate-energy-net-zero-sussan-ley-leadership-challenge-andrew-hastie-liberals-nationals-ntwnfb",
    "image": "https://media.guim.co.uk/dfcd2fa4a9641368b2d0da975b79db3221042eed/683_0_6827_5464/500.jpg",
    "summary": "I'm sorry, but I need more context or details about the news you'd like summarized. Please provide the information, and I'll be happy to help!",
    "published": "2025-11-17T04:24:52Z"
  },
  {
    "title": "Trump tells Republicans to vote to release Epstein files, saying ‘we have nothing to hide’",
    "url": "https://www.theguardian.com/us-news/2025/nov/17/trump-tells-republicans-to-vote-to-release-epstein-files-saying-we-have-nothing-to-hide",
    "image": "https://media.guim.co.uk/a206ffc2261998cc596bfb20416e248ae5d4dd63/402_0_4195_3355/500.jpg",
    "summary": "The US president has expressed support for lawmakers' initiatives to release certain files. This backing comes as the House prepares for a vote on the matter later this week. The move underscores the administration's commitment to transparency.",
    "published": "2025-11-17T03:26:19Z"
  },
  {
    "title": "China travel warning for Japan sends shares in tourism and retail companies plunging",
    "url": "https://www.theguardian.com/world/2025/nov/17/china-travel-warning-for-japan-sends-shares-in-tourism-and-retail-companies-plunging",
    "image": "https://media.guim.co.uk/66a6ed06b822f7f3fb315ff25efbec20ffd94cec/512_0_4458_3566/500.jpg",
    "summary": "China has advised its citizens against traveling to Japan due to rising tensions following remarks made by Japanese Prime Minister Sanae Takaichi regarding Taiwan. The diplomatic dispute highlights ongoing issues related to Taiwan's status and China's territorial claims. This warning reflects the broader strain in China-Japan relations, particularly over security and regional politics.",
    "published": "2025-11-17T02:22:34Z"
  },
  {
    "title": "‘Courageous’ Mary Fowler praised for revealing mental health struggles",
    "url": "https://www.theguardian.com/football/2025/nov/17/mary-fowler-matildas-reveals-mental-health-struggles",
    "image": "https://media.guim.co.uk/04ab3c79961cef13ead9b27bb873d13e668dcc6d/401_0_3553_2843/500.jpg",
    "summary": "Manchester City forward discussed her struggles with depression during her initial move to Europe. She highlighted the challenges of adapting to a new environment and the emotional toll it took on her. The revelation sheds light on the mental health issues athletes may face when transitioning in their careers.",
    "published": "2025-11-17T01:56:18Z"
  },
  {
    "title": "Paige Greco, Australian Paralympic gold medallist, dies aged 28",
    "url": "https://www.theguardian.com/sport/2025/nov/17/paige-greco-australian-paralympic-gold-medallist-dies-aged-28",
    "image": "https://media.guim.co.uk/534643543510e070c6e642121fd9b699b68dfeb3/288_0_2500_2000/500.jpg",
    "summary": "A cyclist who won the women's C1-3 3,000m individual pursuit at the Tokyo Games has passed away at her home in Adelaide following a sudden medical episode. The athlete's unexpected death has shocked the sporting community. Her contributions to cycling and her achievements will be remembered.",
    "published": "2025-11-17T01:40:49Z"
  }
]