[
  {
    "title": "Australia news live: PM takes aim at Ley after Coalition leader walks back ‘we don’t believe in setting targets at all’ comment",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/19/australia-news-live-cheaper-energy-chris-bowen-climate-bush-search-crashed-plane-pilot-julie-bishop-ntwnfb",
    "image": "https://media.guim.co.uk/48a04baa16f023c83da76ad54494c4539f55b8bb/1612_200_4281_3427/500.jpg",
    "summary": "I'm sorry, but I need the text or details of the news you'd like summarized. Please provide that information so I can help!",
    "published": "2025-09-19T04:37:18Z"
  },
  {
    "title": "Stephen Colbert condemns Jimmy Kimmel suspension as Jon Stewart airs Trump ‘approved’ Daily Show – live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/18/jimmy-kimmel-charlie-kirk-comments-show-cancelled-suspended-monologue-trump-us-politics-live",
    "image": "https://media.guim.co.uk/e749903785cd658944f7f7191220e08193aff733/449_0_4493_3594/500.jpg",
    "summary": "Late-night hosts are criticizing Disney executives for yielding to pressure from FCC chair Brendan Carr. They argue that the decision undermines creative freedom and accountability. The hosts emphasized the importance of standing firm against such threats to artistic expression.",
    "published": "2025-09-19T04:31:46Z"
  },
  {
    "title": "Bali to block new hotels and restaurants after deadly flooding raises questions about mass tourism",
    "url": "https://www.theguardian.com/world/2025/sep/19/bali-bans-new-hotels-restaurants-after-deadly-flooding-raises-questions-about-mass-tourism",
    "image": "https://media.guim.co.uk/d331aa70664193e4ab496d16f86c06c63696b1cc/272_0_4175_3341/500.jpg",
    "summary": "The governor of Bali has announced new regulations to prevent the construction of hotels and restaurants on productive agricultural land, specifically targeting rice fields. This move aims to protect the island's agricultural resources and promote sustainable development. The directive underscores the importance of preserving Bali's agricultural heritage amidst growing tourism.",
    "published": "2025-09-19T04:19:44Z"
  },
  {
    "title": "TfL says persistent offenders owe more than £700m in Ulez fines",
    "url": "https://www.theguardian.com/uk-news/2025/sep/19/tfl-persistent-ulez-offenders-unpaid-fines",
    "image": "https://media.guim.co.uk/ec9b59ccc37be93f9cbc2bf8cc605b696db788f9/224_0_2918_2333/500.jpg",
    "summary": "The transport authority is committed to addressing the issue of a small percentage of individuals who have received four or more penalty notices. They plan to implement stricter measures to target and penalize these repeat offenders. This initiative aims to improve compliance and reduce violations within the transport system.",
    "published": "2025-09-19T04:01:33Z"
  },
  {
    "title": "‘Cricket diplomacy’ collapses as India-Pakistan hostility enters field of play",
    "url": "https://www.theguardian.com/world/2025/sep/19/cricket-diplomacy-india-pakistan-hostility-asia-cup",
    "image": "https://media.guim.co.uk/e470d81eb353e445538f93794e0e2e3a84d4ae3d/255_0_3583_2867/500.jpg",
    "summary": "After the Asia Cup match, Indian players declined to shake hands with their Pakistani counterparts, reflecting a growing tension between the two cricketing nations. This incident highlights a decline in traditional sportsmanship and camaraderie on the field. The situation underscores the impact of broader political relations on sports interactions.",
    "published": "2025-09-19T04:00:34Z"
  }
]