[
  {
    "title": "Israeli hostage release: all living captives now freed, says Hamas, as Trump due to address Knesset – latest updates",
    "url": "https://www.theguardian.com/world/live/2025/oct/13/gaza-ceasefire-live-updates-israel-hostages-release-hamas-trump-middle-east",
    "image": "https://media.guim.co.uk/7869a3fc909bdfc8565c660dc10dbde21eda968c/551_0_4000_3202/500.jpg",
    "summary": "Donald Trump is set to address the Israeli parliament, coinciding with the release of hostages, whose first images have emerged. This event signifies a significant moment amidst ongoing tensions in the region. Trump's speech aims to reaffirm U.S. support for Israel during this critical time.",
    "published": "2025-10-13T09:22:16Z"
  },
  {
    "title": "MPs expected to grill minister over collapse of China spy trial as Commons resumes after recess – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/oct/13/china-spy-trial-keir-starmer-egypt-margaret-thatcher-anniversary-uk-politics-live-news-updates",
    "image": "https://media.guim.co.uk/f6125c2b2026546e29edcc14ff3a273a8a352ebb/0_349_1333_1066/500.jpg",
    "summary": "The Speaker is expected to support MPs who are advocating for increased scrutiny regarding the situation surrounding government security adviser Jonathan Powell. This comes amid growing pressure on the government related to transparency in security matters. The ongoing discussions reflect concerns about accountability and oversight within the government.",
    "published": "2025-10-13T09:22:01Z"
  },
  {
    "title": "‘A full-circle moment for me’: Jack Wilshere confirmed as Luton manager ",
    "url": "https://www.theguardian.com/football/2025/oct/13/jack-wilshere-confirmed-as-luton-manager",
    "image": "https://media.guim.co.uk/15aef88ab3e60804c3b9403f041da154303033ed/298_0_3317_2654/500.jpg",
    "summary": "Jack Wilshere has been appointed as the new manager of Luton Town, marking his first permanent role in management. The former Arsenal and England midfielder takes on the challenge of leading the team. This appointment highlights Wilshere's transition from player to coaching.",
    "published": "2025-10-13T09:19:37Z"
  },
  {
    "title": "Markets rebound amid latest US-China tariff spat as traders look to possible ‘Taco trade’",
    "url": "https://www.theguardian.com/business/2025/oct/13/markets-rebound-us-china-tariff-taco-trade",
    "image": "https://media.guim.co.uk/358b8e828a183f32753af2f6e74d5cce6b98a196/919_0_6601_5282/500.jpg",
    "summary": "European stock indices increased, and cryptocurrencies saw a rebound following a social media post from former President Trump that suggested the new front in the trade war may not be as severe as initially feared. Investors reacted positively to the possibility of reduced tensions in trade relations. This shift in sentiment contributed to a more optimistic market outlook.",
    "published": "2025-10-13T09:16:20Z"
  },
  {
    "title": "French political crisis continues as Lecornu unveils new government – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/oct/13/france-political-crisis-lecornu-macron-sarkozy-ukraine-russia-gaza-europe-news-latest-updates",
    "image": "https://media.guim.co.uk/40fda9c4fcc0ddae98a6037c30580e54954c3faf/947_0_6172_4938/500.jpg",
    "summary": "Marine Le Pen and Éric Ciotti have collaborated to submit a joint motion of no confidence against the government, alongside France Unbowed, a leftist party also aiming to topple the administration. This political move signals a growing opposition alliance within the French legislature. The outcome of the motion could significantly impact the current government's stability.",
    "published": "2025-10-13T09:15:12Z"
  }
]