[
  {
    "title": "NFL on Thanksgiving: Lions v Packers updates before Cowboys v Chiefs – live",
    "url": "https://www.theguardian.com/sport/live/2025/nov/27/nfl-on-thanksgiving-lions-v-packers-updates-cowboys-v-chiefs-live",
    "image": "https://media.guim.co.uk/da22c7d08748232813cfa6849320c977798c1092/174_0_3375_2700/500.jpg",
    "summary": "Graham Searles will host a double-header event on Thanksgiving as the NFL enters week 13. Fans can look forward to exciting matchups and festive football action. Don't miss the kickoff of this holiday-themed game day!",
    "published": "2025-11-27T21:17:56Z"
  },
  {
    "title": "Nottingham Forest v Malmö, Rangers v Braga, and more: Europa League – live ",
    "url": "https://www.theguardian.com/football/live/2025/nov/27/nottingham-forest-v-malmo-rangers-v-braga-and-more-europa-league-live",
    "image": "https://media.guim.co.uk/963c65c4b3ace28c914a0d7c88c28ca7c9493678/0_222_2300_1839/500.jpg",
    "summary": "Michael Butler will provide live updates on the Europa League matches taking place on Thursday night, keeping fans informed on the latest developments and scores. Tune in for real-time commentary and insights from the games. Don't miss out on the excitement of this prestigious tournament.",
    "published": "2025-11-27T21:14:33Z"
  },
  {
    "title": "Australia news live: Watt says Coalition has ‘no one to blame but themselves’ after Labor does nature law deal with Greens",
    "url": "https://www.theguardian.com/australia-news/live/2025/nov/28/australia-news-live-storms-hail-queensland-environment-laws-anthony-albanese-labor-greens-sussan-ley-coalition-ntwnfb",
    "image": "https://media.guim.co.uk/c4aec440a3c2e410e5c5ecdd9bbfa1eacd0945b2/884_0_6521_5217/500.jpg",
    "summary": "I need more context or information about the news you are referring to in order to provide a summary. Please provide the details or main points of the news article.",
    "published": "2025-11-27T21:10:16Z"
  },
  {
    "title": "Suspect in Washington DC national guard shooting had ties to CIA, agency confirms",
    "url": "https://www.theguardian.com/us-news/2025/nov/27/washington-dc-national-guard-shooting-suspect",
    "image": "https://media.guim.co.uk/f9488f8b084789aeb4dc82cdff7806c595f3894b/89_0_4169_3337/500.jpg",
    "summary": "Rahmanullah Lakanwal, a 29-year-old Afghan, collaborated with agency-backed military units during the U.S. war in Afghanistan. His work has put him in danger following the Taliban's return to power. Efforts are ongoing to ensure his safety and that of other Afghan allies.",
    "published": "2025-11-27T21:07:39Z"
  },
  {
    "title": "Corrections and clarifications",
    "url": "https://www.theguardian.com/news/2025/nov/27/corrections-and-clarifications",
    "summary": "A proposal for jury trials has been introduced, aiming to enhance the judicial process. Advocates argue that it will improve fairness and transparency in legal proceedings. The measure is set to spark discussions on its potential impact on the legal system.",
    "published": "2025-11-27T21:00:45Z"
  }
]