[
  {
    "title": "Cop30 live: Brazil aims for early agreement on ‘big four’ issues",
    "url": "https://www.theguardian.com/environment/live/2025/nov/19/cop30-live-brazilian-president-lula-climate-summit-belem-latest-news-updates",
    "image": "https://media.guim.co.uk/35357afced045243f6ac8a856c43cd9dc01e4699/646_0_6455_5164/500.jpg",
    "summary": "Brazilian organizers plan to conclude the toughest discussions at the climate summit two days ahead of schedule, aiming for an unusual quick resolution. This strategy seeks to streamline the process and manage complexities efficiently. The decision reflects an innovative approach to handling climate negotiations.",
    "published": "2025-11-19T16:25:39Z"
  },
  {
    "title": "Streeting defends asylum policy, but says he’s not ‘comfortable’ with forced removal of children – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/nov/19/pmqs-uk-politics-latest-news-john-healey-rachel-reeves-keir-starmer-labour",
    "image": "https://media.guim.co.uk/7a791be2c9fe1a97072141f58aa2419c4d6ae765/292_0_2918_2334/500.jpg",
    "summary": "The Health Secretary continues to assert that forced removals are necessary for the nation's well-being. Despite controversies surrounding the policy, he believes it aligns with the country's best interests. The statement reflects ongoing debates about immigration and public health strategies.",
    "published": "2025-11-19T16:25:29Z"
  },
  {
    "title": "Every time new emails drop, elites do the Epstein shuffle: ‘Yes I knew him, but I didn’t KNOW him’ | Emma Brockes",
    "url": "https://www.theguardian.com/commentisfree/2025/nov/19/emails-celebrities-epstein-new-york-washington",
    "image": "https://media.guim.co.uk/807c9a41d35d7bbc32a03fa2568ba6df34ca3649/1336_629_6093_4875/500.jpg",
    "summary": "In her column, Emma Brockes discusses how the allure of wealth and power has diminished for the elite in New York and Washington. She suggests that their previous charm is now overshadowed by emerging challenges. The piece reflects a shift in perception regarding the values of those in influential positions.",
    "published": "2025-11-19T16:24:02Z"
  },
  {
    "title": "Trump to sign bill to compel release of more files related to Jeffrey Epstein",
    "url": "https://www.theguardian.com/us-news/2025/nov/19/trump-sign-bill-epstein-files",
    "image": "https://media.guim.co.uk/298d8b201c01f38da764b2f1efda94c9675623b7/798_0_6024_4818/500.jpg",
    "summary": "Former President Trump initially opposed the release of certain files but changed his stance once it became evident that the House would approve legislation mandating their disclosure. This reversal reflects the political pressure surrounding the issue. The release of the files may have significant implications for ongoing investigations and public transparency.",
    "published": "2025-11-19T16:21:17Z"
  },
  {
    "title": "‘I never wanted to sing into a vacuum’: Scottish folk pioneer Dick Gaughan’s fight for his lost music",
    "url": "https://www.theguardian.com/music/2025/nov/19/i-never-wanted-to-sing-into-a-vacuum-scottish-folk-pioneer-dick-gaughans-fight-for-his-lost-music",
    "image": "https://media.guim.co.uk/dee9157009ba79f5e1daab6786919d83910680cc/310_0_1836_1469/500.jpg",
    "summary": "Gaughan, a talented interpreter and advocate for social justice, is celebrated by artists like Richard Hawley and Billy Bragg. Despite his impactful work being largely overlooked for decades, a dedicated fan has taken action to revive it. This effort aims to bring Gaughan's contributions back into the spotlight.",
    "published": "2025-11-19T16:15:02Z"
  }
]