[
  {
    "title": "Ravens v Steelers, Jaguars v Colts and Bills v Bengals: NFL week 14 – live",
    "url": "https://www.theguardian.com/sport/live/2025/dec/07/ravens-v-steelers-jaguars-v-colts-and-bills-v-bengals-nfl-week-14-live",
    "image": "https://media.guim.co.uk/1ea7fa83f577c8548e2efe73546b18e30ae842ce/254_0_7066_5653/500.jpg",
    "summary": "Graham Searles will provide live updates on tonight's NFL games, featuring the matchup between the Ravens and Steelers at M&T Bank Stadium. Fans can tune in for real-time coverage and insights. Stay connected for all the action!",
    "published": "2025-12-07T18:27:26Z"
  },
  {
    "title": "Fulham 1-2 Crystal Palace: Premier League – live reaction",
    "url": "https://www.theguardian.com/football/live/2025/dec/07/fulham-v-crystal-palace-premier-league-live",
    "image": "https://media.guim.co.uk/1e54ae5d9adce0f2133d978f809378485ef354f4/496_0_4503_3602/500.jpg",
    "summary": "Marc Guehi scored a late header to secure a victory in an entertaining match. Harry Wilson also impressed with an incredible goal. The game showcased exciting moments from both teams.",
    "published": "2025-12-07T18:25:25Z"
  },
  {
    "title": "‘He made the mundane magnificent’: Martin Parr could make a chip shop as mighty as a cathedral",
    "url": "https://www.theguardian.com/artanddesign/2025/dec/07/mundane-magnificent-martin-parr-chip-shop-cathedral-cheese-sandwich-britishness",
    "image": "https://media.guim.co.uk/b49f5172bda7708b5f987cfc51aa6699ab3b9078/294_0_3000_2400/500.jpg",
    "summary": "A talented photographer captured the beauty in everyday moments, from cheese sandwiches at church fetes to ice cream queues at the beach. His work highlighted the often-overlooked aspects of life while playfully critiquing British culture. Through his lens, he celebrated the quirky and relatable facets of humanity.",
    "published": "2025-12-07T18:19:49Z"
  },
  {
    "title": " The Guardian view on Marwan Barghouti: Palestinians need a political future as well as aid and reconstruction | Editorial",
    "url": "https://www.theguardian.com/commentisfree/2025/dec/07/the-guardian-view-on-marwan-barghouti-palestinians-need-a-political-future-as-well-as-aid-and-reconstruction",
    "image": "https://media.guim.co.uk/635e2fab7e5b4cefe6060b1b9ac70e8a697b1b71/213_0_2459_1967/500.jpg",
    "summary": "The editorial emphasizes that advocating for the release of a jailed leader may play a crucial role in achieving the peace that Donald Trump asserts he desires in the Middle East. It suggests that this action could be pivotal in fostering dialogue and resolution in the region. The piece implies that addressing the situation of the imprisoned leader could have significant implications for ongoing peace efforts.",
    "published": "2025-12-07T17:30:27Z"
  },
  {
    "title": "Martin Parr obituary",
    "url": "https://www.theguardian.com/artanddesign/2025/dec/07/martin-parr-obituary",
    "image": "https://media.guim.co.uk/1cbc235e605ab4a1952f8312805748e02997731d/0_17_2000_1600/500.jpg",
    "summary": "A photographer known for capturing the human experience with the precision of a birdwatcher has passed away. His work highlighted the nuances of individuals, comparing their characteristics to the study of birds in terms of plumage, habitat, and diet. His unique perspective has left a lasting impact on the art of photography.",
    "published": "2025-12-07T17:29:33Z"
  }
]