[
  {
    "title": "White House claims ‘tremendous progress’ made in Ukraine-Russia peace plan but says more talks needed - Europe live ",
    "url": "https://www.theguardian.com/world/live/2025/nov/25/us-russia-ukraine-peace-talks-abu-dhabi-kyiv-strikes-zelenskyy-putin-europe-live-news",
    "image": "https://media.guim.co.uk/eb053601e69d2a0f8cc056d984033cbd97ca488f/252_0_4589_3672/500.jpg",
    "summary": "A spokesperson emphasizes the necessity for ongoing discussions among Ukraine, Russia, and the US regarding sensitive issues. These talks aim to address critical concerns and facilitate diplomatic relations. Continued dialogue is deemed essential for progress and resolution.",
    "published": "2025-11-25T16:28:33Z"
  },
  {
    "title": "Mayors in England to get power to impose tourism tax on overnight visitors at ‘modest’ rate – UK politics live ",
    "url": "https://www.theguardian.com/politics/live/2025/nov/25/nigel-farage-nathan-gill-labour-reform-uk-russia-keir-starmer-uk-politics-live-news",
    "image": "https://media.guim.co.uk/a63653c2b443cab13b08544f7b993a21a269c95b/37_0_3824_3060/500.jpg",
    "summary": "The government has introduced an overnight levy in anticipation of the upcoming budget announcement. This measure aims to address financial shortfalls and stabilize the economy. Further details and implications are expected to be revealed in the budget presentation.",
    "published": "2025-11-25T16:28:21Z"
  },
  {
    "title": "UK sugar tax to be extended to more soft drinks and milkshakes – business live",
    "url": "https://www.theguardian.com/business/live/2025/nov/25/sterling-volatility-the-budget-rachel-reeves-german-economy-stagnating-stock-markets-business-live-news",
    "image": "https://media.guim.co.uk/52dbfd465707e0a9edcc9afd044b30b98681895a/0_109_4705_3764/500.jpg",
    "summary": "The government has announced plans to reduce the threshold for the Soft Drinks Industry Levy from 5g to 4.5g of sugar per 100ml. This move aims to encourage manufacturers to reduce sugar content in beverages. The change is part of broader efforts to tackle obesity and promote healthier choices.",
    "published": "2025-11-25T16:26:18Z"
  },
  {
    "title": "From Years and Years to Black Mirror: the best TV prophecies for how AI will end us all",
    "url": "https://www.theguardian.com/tv-and-radio/2025/nov/25/years-and-years-black-mirror-tv-show-depictions-ai-repurcussions",
    "image": "https://media.guim.co.uk/072c20c10ae4529958fe185f0f2f9d91c8db6726/409_0_3750_3000/500.jpg",
    "summary": "The article explores speculative questions surrounding the impact of AI on jobs, crime prevention, and creative skills. It highlights how television has portrayed these themes, showcasing both optimistic and pessimistic views of AI's potential future role in society. Ultimately, it reflects on the narratives that shape our understanding of AI's capabilities and consequences.",
    "published": "2025-11-25T16:25:15Z"
  },
  {
    "title": "CPS to train staff on ‘spectrum of abuse’ in violence against women and girls",
    "url": "https://www.theguardian.com/society/2025/nov/25/cps-to-train-staff-spectrum-of-abuse-violence-against-women-girls",
    "image": "https://media.guim.co.uk/45a451a00506a99b56bec99fe7a9a3e51c22bce7/482_0_4816_3853/500.jpg",
    "summary": "A new five-year strategy has been launched to enhance casework following an analysis revealing that over a third of rape cases involve domestic abuse. The initiative aims to address these findings and improve support for victims. Focused efforts will be made to strengthen the handling of such sensitive cases.",
    "published": "2025-11-25T16:25:11Z"
  }
]