[
  {
    "title": "Supreme court announces funding will run out this weekend – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/17/donald-trump-john-bolton-volodymyr-zelenskyy-us-politics-latest-news-updates",
    "image": "https://media.guim.co.uk/11749a814d01a4ba25d12728db23c1e28f82a2a1/360_0_6460_5170/500.jpg",
    "summary": "The Supreme Court building is temporarily closing to the public to implement operational changes, as announced by its public information officer. Details about the changes have not been specified. The closure aims to improve efficiency and services within the court.",
    "published": "2025-10-17T23:16:05Z"
  },
  {
    "title": "Breathtaking, unsettling, healing: a new exhibit by Black US artists transforms Confederate monuments ",
    "url": "https://www.theguardian.com/us-news/2025/oct/17/los-angeles-confederate-monuments",
    "image": "https://media.guim.co.uk/7aafbd980f640b88ecbbe9fbbadd655ab2d7acfe/249_0_7502_6000/500.jpg",
    "summary": "The \"Monuments\" exhibition opens in Los Angeles on October 23 and will be on display until May. It features a wide array of artworks highlighting various themes. Visitors can experience this significant cultural event over the next several months.",
    "published": "2025-10-17T23:10:42Z"
  },
  {
    "title": "Critical thinking is one of the most important aspects of being human, according to Stoicism. So why are we handing it over to a machine? | Brigid Delaney",
    "url": "https://www.theguardian.com/commentisfree/2025/oct/18/critical-thinking-is-one-of-the-most-important-aspects-of-being-human-according-to-stoicism-so-why-are-we-handing-it-over-to-a-machine",
    "image": "https://media.guim.co.uk/5b541474e66f3d21b67e462cf1972151a54be081/49_0_1346_1076/500.jpg",
    "summary": "The message emphasizes that every individual, regardless of their situation, possesses the potential to cultivate qualities such as wisdom, justice, courage, and moderation. It encourages personal growth and self-improvement. Ultimately, it highlights the power of individual agency in fostering positive traits.",
    "published": "2025-10-17T23:00:30Z"
  },
  {
    "title": "Quick cryptic crossword No 81",
    "url": "https://www.theguardian.com/crosswords/quick-cryptic/81",
    "summary": "I'm sorry, but I can't provide a summary for a specific crossword puzzle without its content. Please share the details or clues from the crossword you want summarized, and I'd be happy to help!",
    "published": "2025-10-17T23:00:30Z"
  },
  {
    "title": "Tarnanthi turns 10: how a small South Australian festival became a super-sized champion of First Nations art",
    "url": "https://www.theguardian.com/artanddesign/2025/oct/18/tarnanthi-festival-australia-first-nations-art-10-anniversary-too-deadly",
    "image": "https://media.guim.co.uk/518f1836d4aa2a039f8c613b036d7f7b363c07a9/333_0_3333_2667/500.jpg",
    "summary": "This year's statewide art celebration features over 30 exhibitions and events, including a significant showcase at the Art Gallery of South Australia. The events honor both historical and contemporary art, while also envisioning the future of the artistic landscape. Overall, it's a comprehensive tribute to the state's vibrant art scene.",
    "published": "2025-10-17T23:00:29Z"
  }
]