[
  {
    "title": "Gaza ceasefire live: Israel ‘preparing to receive’ hostages as Trump says he will be ’involved’ in keeping peace",
    "url": "https://www.theguardian.com/world/live/2025/oct/08/gaza-ceasefire-talks-israel-hamas-trump-us-qatar-turkey-egypt-live-news-updates",
    "image": "https://media.guim.co.uk/fed85a0e98dd8f5bd8cb8d87764405150bb8f946/500_0_5000_4000/500.jpg",
    "summary": "The US president announced that all hostages will be released \"very soon,\" signaling progress in negotiations. Additionally, Israel will withdraw its troops to a mutually agreed-upon line. This development may lead to a de-escalation in regional tensions.",
    "published": "2025-10-09T02:54:05Z"
  },
  {
    "title": "Chris Minns’ chief of staff in constitutional showdown with parliament over 120-year-old law",
    "url": "https://www.theguardian.com/australia-news/2025/oct/09/chris-minns-chief-of-staff-in-constitutional-showdown-with-parliament-over-120-year-old-law",
    "image": "https://media.guim.co.uk/978dd7ce336c3945ed6ed5546d60258f9170ef4c/0_0_4328_3464/500.jpg",
    "summary": "James Cullen, called to testify at the Rosehill inquiry, argues that the 1901 law allowing Parliament to compel witness testimony is unconstitutional. His claim raises questions about the legality of such inquiries in Australia. The issue could have significant implications for future parliamentary proceedings.",
    "published": "2025-10-09T02:53:35Z"
  },
  {
    "title": "Australia politics live: Google blocked ads for government-funded STI campaign; PM welcomes Gaza peace deal announcement",
    "url": "https://www.theguardian.com/australia-news/live/2025/oct/09/australia-politics-live-opera-house-rally-palestine-gaza-parliament-senate-estimates-anthony-albanese-sussan-ley-question-time-ntwnfb",
    "image": "https://media.guim.co.uk/90b29b67b2de2719e925ae571a1316784aa43ec6/1560_241_3587_2870/500.jpg",
    "summary": "I need more context or specific details about the news you want me to summarize. Please provide the relevant information or text!",
    "published": "2025-10-09T02:45:28Z"
  },
  {
    "title": "Trump news at a glance: a note, a whisper and the first phase of a Gaza ceasefire deal ",
    "url": "https://www.theguardian.com/us-news/2025/oct/09/trump-administration-news-updates-today",
    "image": "https://media.guim.co.uk/46b0d6e9d69effe9c76acde956d7c1874a4d092c/264_0_2638_2110/500.jpg",
    "summary": "On October 8, Donald Trump outlined initial measures aimed at achieving lasting peace. Meanwhile, South Dakota Governor Kristi Noem drew a controversial comparison between Antifa and the violent gang MS-13. These developments highlight key themes in current US political discourse.",
    "published": "2025-10-09T02:45:03Z"
  },
  {
    "title": "Republican lawmakers praise Trump for Gaza deal as Palestinian Americans remain wary: ‘So much remains unclear’",
    "url": "https://www.theguardian.com/us-news/2025/oct/08/trump-gaza-deal-response",
    "image": "https://media.guim.co.uk/edf28f0b2a942d847ab266c91714b3df73e9709d/193_0_3118_2495/500.jpg",
    "summary": "Politicians, poets, and academics are actively using social media to express their admiration for the US president and address various concerns. Their posts reflect a wide range of opinions and sentiments about his leadership. This engagement highlights the intersection of politics, art, and academia in contemporary discourse.",
    "published": "2025-10-09T02:17:25Z"
  }
]