[
  {
    "title": "Surrey v Nottinghamshire, Sussex v Yorkshire, and more: county cricket, day two – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/16/surrey-v-nottinghamshire-sussex-v-yorkshire-and-more-county-cricket-day-two-live",
    "image": "https://media.guim.co.uk/2f17c2e7f5aeeb89077071e376ee9bcac13c95e3/117_0_1375_1100/500.jpg",
    "summary": "Tanya Aldred provides updates on the recent County Championship fixtures. She shares key highlights and results from matches. Fans can stay informed about team performances and standings in the championship.",
    "published": "2025-09-16T16:43:26Z"
  },
  {
    "title": "Athletic Bilbao v Arsenal: Champions League – live",
    "url": "https://www.theguardian.com/football/live/2025/sep/16/athletic-bilbao-v-arsenal-champions-league-live-score-updates",
    "image": "https://media.guim.co.uk/c7f139fae41a6fcf376261a82be2f21f06a11582/242_50_2850_2280/500.jpg",
    "summary": "The league stage of the season begins in Bilbao, with live updates provided by Barry Glendenning. Fans can look forward to minute-by-minute coverage of the event. Stay tuned for the latest developments as the games unfold!",
    "published": "2025-09-16T16:41:10Z"
  },
  {
    "title": "FBI director Kash Patel sparked ‘mass confusion’ over Charlie Kirk shooting suspect, top Democrat says – live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/16/donald-trump-new-york-times-defamation-charlie-kirk-vance-miller-news-updates-us-politics-live",
    "image": "https://media.guim.co.uk/d34fd528cac2ac0a4dbc7fd60a7d04689d1fca5f/424_0_4243_3394/500.jpg",
    "summary": "FBI Director faced intense questioning from the Senate Judiciary Committee regarding his conduct and social media activity during the investigation of the Kirk shooting. Criticism has mounted over his handling of the case. The session highlighted concerns about transparency and accountability within the agency.",
    "published": "2025-09-16T16:38:57Z"
  },
  {
    "title": "McLaughlin-Levrone throws down gauntlet to Kipyegon in race to be greatest",
    "url": "https://www.theguardian.com/sport/2025/sep/16/sydney-mclaughlin-levrone-gauntlet-faith-kipyegon-race-to-be-greatest",
    "image": "https://media.guim.co.uk/f6b8fd867931a3c96407324cdaa730c2f5029382/199_0_5654_4523/500.jpg",
    "summary": "Sydney McLaughlin-Levrone achieved one of the fastest 400m times ever while easing through the race. Her performance has sparked speculation about the potential break of a longstanding and controversial track record later this week. Running at such a pace hints at her remarkable ability to challenge historic limits in the sport.",
    "published": "2025-09-16T16:35:20Z"
  },
  {
    "title": "Charlie Kirk suspect allegedly took responsibility for killing in online post",
    "url": "https://www.theguardian.com/us-news/2025/sep/16/court-hearing-charlie-kirk-shooting-suspect",
    "image": "https://media.guim.co.uk/edfcec4c58ce5defe2113539b697b8d75811adc8/1162_642_4550_3641/500.jpg",
    "summary": "Discord has confirmed that a message sent by a 22-year-old suspect to friends is part of an ongoing investigation. The suspect is scheduled to be arraigned on Tuesday. Details surrounding the case remain under wraps as legal proceedings unfold.",
    "published": "2025-09-16T16:29:01Z"
  }
]