[
  {
    "title": "Australia news live: NSW lashed by wild weather; MPs condemn Charlie Kirk shooting",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/11/australia-news-live-sydney-storm-weather-anthony-albanese-solomon-islands-pacific-sussan-ley-jacinta-nampijinpa-price-ntwnfb",
    "image": "https://media.guim.co.uk/4cb2f72b88e176c31dad7c5751319109bf8583a8/690_0_5893_4715/500.jpg",
    "summary": "I apologize, but I need the specific news content you would like summarized. Please provide the details, and I will be happy to help!",
    "published": "2025-09-10T23:23:35Z"
  },
  {
    "title": "The Fence review – Claire Denis stumbles with a grim and grating misfire",
    "url": "https://www.theguardian.com/film/2025/sep/10/the-fence-movie-review-claire-denis",
    "image": "https://media.guim.co.uk/0e5f08dc8d5dfc9208a909c80835141723cc0830/476_0_4763_3811/500.jpg",
    "summary": "The French director's latest film, an adaptation of a 1979 play, is described as one of her least effective works. Critics highlight its dullness and clumsy execution, pointing out that Matt Dillon's casting is a misstep. Overall, the film has received negative reviews for failing to engage audiences.",
    "published": "2025-09-10T23:19:16Z"
  },
  {
    "title": "Trump ally Charlie Kirk has died after being shot at university event, with suspect still at large – latest updates",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/10/donald-trump-jeffrey-epstein-tariffs-immigration-crime-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/2673fb19ee0d09b38b7c9c4de993bd283a9eb6e7/313_215_3046_2437/500.jpg",
    "summary": "Officials provided an update on a deadly attack involving a Trump ally, revealing that a new individual is being interviewed. The person previously arrested in connection with the incident has been cleared and is no longer considered a suspect. Investigations are ongoing as authorities seek further information.",
    "published": "2025-09-10T23:05:17Z"
  },
  {
    "title": "More than half of UK births now involve medical intervention, audit finds",
    "url": "https://www.theguardian.com/society/2025/sep/11/more-than-half-of-uk-births-now-involve-medical-intervention-audit-finds",
    "image": "https://media.guim.co.uk/7a005aa775f1dc9671450fec82c2ea1612353099/396_0_4234_3387/500.jpg",
    "summary": "Experts warn that the increasing number of Caesarean sections is contributing to a rise in assisted deliveries. This trend is linked to complex pregnancies often associated with factors like advanced maternal age and obesity. Healthcare professionals are voicing concerns over the implications of these trends for maternal and infant health.",
    "published": "2025-09-10T23:01:16Z"
  },
  {
    "title": "Global press freedom suffers sharpest fall in 50 years, report finds",
    "url": "https://www.theguardian.com/media/2025/sep/11/global-press-freedom-suffers-sharpest-fall-in-50-years-report-finds",
    "image": "https://media.guim.co.uk/38f297f51e093a89db904f33fff9af3f1a5ceed6/466_0_4097_3277/500.jpg",
    "summary": "The International IDEA's survey indicates that the United States is providing 'encouragement' for populist leaders through its democratic practices. This observation raises concerns about the impact on global democratic standards. The findings suggest a complex interplay between U.S. actions and the rise of populism worldwide.",
    "published": "2025-09-10T23:01:16Z"
  }
]