[
  {
    "title": "England given target of 331 to beat South Africa: second men’s one-day international – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/04/england-v-south-africa-second-mens-one-day-international-live",
    "image": "https://media.guim.co.uk/32e0f897251eb9c96cdc16b60124786ffcf794d7/135_34_2133_1707/500.jpg",
    "summary": "England seeks redemption against South Africa in the second ODI at Lord's, following a significant defeat in the first match. The team aims to improve their performance and regain confidence. Join our writers for an over-by-over report of the match.",
    "published": "2025-09-04T17:29:02Z"
  },
  {
    "title": "RFK Jr grilled in tense hearing about chaos at federal health agencies and vaccines – live updates",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/04/donald-trump-tariffs-immigration-technology-epstein-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/c9ce9df4e0a13cc2fb1c6525d12a19fd293216bc/763_0_4913_3933/500.jpg",
    "summary": "Trump's health secretary is under pressure as he defends the administration's plans to lay off employees and implement budget cuts. Critics are questioning how these measures align with his agenda to improve national health. The scrutiny highlights concerns about the potential impact on public health services.",
    "published": "2025-09-04T17:24:25Z"
  },
  {
    "title": "Lisbon funicular crash: Portugal’s PM vows swift and thorough investigation",
    "url": "https://www.theguardian.com/world/2025/sep/04/lisbon-funicular-crash-portugal-declares-day-of-mourning-deaths",
    "image": "https://media.guim.co.uk/e4d0c6657fccc922c4de18a38cefbe75c547ec5d/500_0_5000_4000/500.jpg",
    "summary": "Luís Montenegro labels the incident that resulted in 16 fatalities as “one of the biggest tragedies in our recent history.” He expresses deep sorrow over the loss of life. The event has sparked widespread concern and reflection on its impact.",
    "published": "2025-09-04T17:20:07Z"
  },
  {
    "title": "Daniel Levy steps down as Tottenham chairman with immediate effect",
    "url": "https://www.theguardian.com/football/2025/sep/04/daniel-levy-steps-down-as-tottenham-chairman-with-immediate-effect",
    "image": "https://media.guim.co.uk/0f83dc9ab84c7236f41369ff252716cb5d92cee0/313_103_2101_1681/500.jpg",
    "summary": "Daniel Levy has resigned as chairman of Tottenham Hotspur, effective immediately. He held the position for nearly 25 years, overseeing significant changes and developments at the club. His departure marks a pivotal moment in Tottenham's leadership.",
    "published": "2025-09-04T16:58:38Z"
  },
  {
    "title": "Starmer declines to say if he will sack Rayner if she is found to have broken ministerial code – as it happened",
    "url": "https://www.theguardian.com/politics/live/2025/sep/04/tories-flat-tax-angela-rayner-keir-starmer-news-updates-uk-politics-live",
    "image": "https://media.guim.co.uk/884a58e77166912a805d0111233636e1f85b9e28/108_0_1139_911/500.jpg",
    "summary": "Keir Starmer anticipates receiving a swift report from his ethics adviser regarding Angela Rayner. The inquiry will likely address concerns related to her conduct. The timeline for the report suggests a prompt resolution to the matter.",
    "published": "2025-09-04T16:51:55Z"
  }
]