[
  {
    "title": "Australia v England: Ashes second Test, day three – live",
    "url": "https://www.theguardian.com/sport/live/2025/dec/06/australia-vs-england-live-ashes-second-2nd-test-day-three-aus-v-eng-cricket-scores-updates-gabba-brisbane",
    "image": "https://media.guim.co.uk/8a9fe1f5d67e35444fb4fe751a05a0861d05327b/0_652_3968_3174/500.jpg",
    "summary": "The hosts established a significant first-innings lead of 177 runs at the Gabba. They then shifted focus to their bowling performance under lights. Updates are being provided by the writers on-site.",
    "published": "2025-12-06T11:15:07Z"
  },
  {
    "title": "Arsenal v Liverpool: Women’s Super League – live",
    "url": "https://www.theguardian.com/football/live/2025/dec/06/arsenal-v-liverpool-womens-super-league-live",
    "image": "https://media.guim.co.uk/8c94b4a3243d2aac5c5752a2e39e507cb141babd/449_0_5027_4022/500.jpg",
    "summary": "The Women's Super League season resumes with Arsenal aiming to reinvigorate their title challenge. They face the bottom-placed team in a crucial match. Emillia Hawkins will provide minute-by-minute updates on the game.",
    "published": "2025-12-06T11:12:06Z"
  },
  {
    "title": "Russia launches attacks across Ukraine as Miami peace talks continue ",
    "url": "https://www.theguardian.com/world/2025/dec/06/russia-overnight-attacks-across-ukraine-miami-peace-talks-continue",
    "image": "https://media.guim.co.uk/acd7a817fa9a58053b24ee70c3d65ab48646c5f4/65_0_1950_1560/500.jpg",
    "summary": "Russian forces launched over 650 drones and 51 missiles, targeting multiple locations, including western regions of Ukraine. Sirens were activated in eastern Poland as a precautionary measure due to the proximity of the attacks. The heightened military activity underscores ongoing tensions in the region.",
    "published": "2025-12-06T11:07:53Z"
  },
  {
    "title": "World Cup draw reaction, Q&A and fixture schedule to come – matchday live",
    "url": "https://www.theguardian.com/football/live/2025/dec/06/world-cup-draw-reaction-with-fixture-schedule-to-come-matchday-live",
    "image": "https://media.guim.co.uk/f30a1f2ca2452654077674084371a78e5ff088bb/378_0_5000_4000/500.jpg",
    "summary": "World Cup draw reactions and pre-match insights are being shared by our writers. Fans can expect analysis and commentary on team matchups. Stay tuned for in-depth coverage leading up to the tournament.",
    "published": "2025-12-06T11:07:48Z"
  },
  {
    "title": "Warner Bros Disaster? Netflix deal for Hollywood giant follows string of flops",
    "url": "https://www.theguardian.com/media/2025/dec/06/warner-bros-discovery-netflix-deal",
    "image": "https://media.guim.co.uk/42412a30fd3c768d7d4e66f2b3c9f8aca6405c18/285_0_1350_1080/500.jpg",
    "summary": "David Zaslav, CEO of Warner Bros. Discovery, assured that merging traditional Hollywood studios with his reality TV empire would benefit all stakeholders. However, the integration has instead led to significant losses for many involved. Critics argue that the promised outcomes have not materialized, causing widespread dissatisfaction.",
    "published": "2025-12-06T11:00:51Z"
  }
]