[
  {
    "title": "Trump to cut ‘Democrat agencies’ as White House says government shutdown layoffs could be in the thousands – live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/02/government-shutdown-trump-democrats-latest-updates",
    "image": "https://media.guim.co.uk/67f0cf364ead08501750764e4c7d8c49cf1252d5/200_0_6588_5271/500.jpg",
    "summary": "Trump highlighted his meeting with Russ Vought, known for Project 2025, to discuss potential budget cuts. Meanwhile, Karoline Leavitt criticized Democrats, attributing imminent job losses to their policies. The discussions reflect ongoing tensions regarding fiscal management and economic impact.",
    "published": "2025-10-02T15:17:36Z"
  },
  {
    "title": "Manchester synagogue attack that killed two was a ‘terrorist incident’, say police – latest updates",
    "url": "https://www.theguardian.com/uk-news/live/2025/oct/02/police-reports-stabbing-synagogue-greater-manchester-live",
    "image": "https://media.guim.co.uk/09f20100fbf2630c0e0352f448c48247471f5999/386_0_3289_2632/500.jpg",
    "summary": "During a Yom Kippur attack, police confirmed that the victims were Jewish and stated that the unnamed suspect was shot dead shortly after the incident. The attack occurred on one of the holiest days in the Jewish calendar. Authorities are continuing to investigate the circumstances surrounding the attack.",
    "published": "2025-10-02T15:15:55Z"
  },
  {
    "title": "Judge denies Kilmar Ábrego García’s bid for asylum in the US",
    "url": "https://www.theguardian.com/us-news/2025/oct/02/trump-immigration-kilmar-abrego-garcia-asylum",
    "image": "https://media.guim.co.uk/c84ef7d7803cf92529d913a972a47671cfdc1924/1658_852_2779_2223/500.jpg",
    "summary": "A Salvadoran man deported to El Salvador in March has been allowed to return to the U.S. He now has a 30-day window to appeal the ruling regarding his deportation. This case highlights ongoing immigration challenges and legal processes.",
    "published": "2025-10-02T15:14:45Z"
  },
  {
    "title": "Europe needs political will to act and cut ties with Russia, says Zelenskyy after leaders summit – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/oct/02/epc-european-political-community-leaders-copenhagen-denmark-ukraine-russia-europe-live",
    "image": "https://media.guim.co.uk/86bda33912374d018cf93b6a6e5ae0e4f6eb303c/500_224_2066_1653/500.jpg",
    "summary": "Ukraine's president shared insights following the seventh summit of the European Political Community, emphasizing the importance of collaboration and support. He highlighted the ongoing challenges faced by Ukraine and the need for a united European response. The summit served as a platform for fostering diplomatic ties and discussions on regional security.",
    "published": "2025-10-02T15:10:55Z"
  },
  {
    "title": "Spin the World Cup’s wheel of fortune",
    "url": "https://www.theguardian.com/football/2025/oct/02/football-daily-newsletter-world-cup-2026-tickets",
    "image": "https://media.guim.co.uk/81bbc1286f176e03e2c45b1ecec9ba98428f100d/601_0_4224_3381/500.jpg",
    "summary": "In today's Football Daily, discussions focus on the latest developments in World Cup infrastructure. Key projects and enhancements are highlighted as preparations for the tournament progress. The conversation emphasizes the importance of infrastructure in ensuring a successful event.",
    "published": "2025-10-02T15:07:21Z"
  }
]