[
  {
    "title": "Arsenal v Tottenham buildup, Liverpool lose again, and Sheffield derby updates – matchday live",
    "url": "https://www.theguardian.com/football/live/2025/nov/23/arsenal-v-tottenham-hotspur-buildup-and-sheffield-derby-updates-matchday-live",
    "image": "https://media.guim.co.uk/ca360e23438137d526ccf8eaa93de37925a0bef8/0_0_5000_4000/500.jpg",
    "summary": "Writers are providing updates on the upcoming weekend's domestic football matches. Anticipation builds as fans gear up for a series of exciting games. Stay tuned for insights and predictions from the team.",
    "published": "2025-11-23T08:23:34Z"
  },
  {
    "title": "Max Verstappen dominates F1 Las Vegas GP to keep championship hopes alive",
    "url": "https://www.theguardian.com/sport/2025/nov/23/max-verstappen-wins-f1-las-vegas-gp-lando-norris-second",
    "image": "https://media.guim.co.uk/711b321710c93dedd5cfc1d1a9533c27b5d00e24/443_160_3896_3116/500.jpg",
    "summary": "Red Bull driver dominated the race, showcasing unmatched performance under the lights. Lando Norris secured a strong second place, demonstrating his competitive edge. The event highlighted Red Bull's continued supremacy in the series.",
    "published": "2025-11-23T08:17:38Z"
  },
  {
    "title": "‘No miracles’: Philippe Clement gets instant view of size of task at Norwich",
    "url": "https://www.theguardian.com/football/2025/nov/23/philippe-clement-new-manager-norwich-city-championship-birmingham",
    "image": "https://media.guim.co.uk/de360086c0c63dffa89cbb8032593a80ec929f58/352_0_5084_4067/500.jpg",
    "summary": "The new manager could not prevent a 4-1 loss to Birmingham City, marking the Canaries' twelfth consecutive game without a win. This defeat leaves the team five points away from safety in the standings. The ongoing struggles suggest a challenging season ahead for the club.",
    "published": "2025-11-23T08:00:04Z"
  },
  {
    "title": "‘We’ve got to find answers’: Corby families affected by cancer searching for truth about toxic waste sites",
    "url": "https://www.theguardian.com/society/2025/nov/23/cancer-corby-toxic-waste-sites-steelworks",
    "image": "https://media.guim.co.uk/8224b9a4a1d64d9d309ebbc9a633bde4ececb23f/831_0_4169_3335/500.jpg",
    "summary": "Alison Gaffney suspects that her son's rare leukaemia resulted from toxic waste improperly disposed of by the local steelworks. She is raising awareness about the potential health impacts of industrial pollution. Her claims spotlight concerns over environmental accountability in the community.",
    "published": "2025-11-23T08:00:04Z"
  },
  {
    "title": "How ambitious ‘forest city’ plan for England could become a reality",
    "url": "https://www.theguardian.com/environment/2025/nov/23/how-ambitious-forest-city-plan-for-england-could-become-a-reality",
    "image": "https://media.guim.co.uk/2b20edc4c5fd2bc51447a9df3fc344b6fc7644ee/270_0_2038_1632/500.jpg",
    "summary": "A cross-party coalition has unveiled plans for an eco-friendly initiative aimed at benefiting one million people. This scheme is designed to promote sustainability and environmental awareness. The coalition hopes to launch the program before the end of the decade.",
    "published": "2025-11-23T08:00:03Z"
  }
]