[
  {
    "title": "‘I still want to achieve’: people living with stage 4 cancer embrace Chris Hoy charity ride",
    "url": "https://www.theguardian.com/society/2025/sep/06/i-still-want-to-achieve-people-living-with-stage-4-cancer-embrace-chris-hoy-charity-ride",
    "image": "https://media.guim.co.uk/836b9a4d873fb02541feb94e5a47bb8e570ac286/566_0_4840_3872/500.jpg",
    "summary": "The inaugural Tour de 4 is designed for individuals with varying physical abilities, promoting inclusivity in sports. This event seeks to challenge misconceptions surrounding stage 4 cancer. It aims to empower participants and raise awareness about the capabilities of those living with the disease.",
    "published": "2025-09-06T13:00:52Z"
  },
  {
    "title": "Arsenal v London City Lionesses: WSL – football live",
    "url": "https://www.theguardian.com/football/live/2025/sep/06/arsenal-v-london-city-lionesses-wsl-football-live",
    "image": "https://media.guim.co.uk/20a1f34400eabd67f75ce4a957cdc863684891bd/823_240_3521_2817/500.jpg",
    "summary": "Arsenal, the reigning European champions, begin their new season by hosting a wealthy London rival. Fans can follow minute-by-minute updates on the match. Rob Smyth will provide live commentary and insights throughout the game.",
    "published": "2025-09-06T12:59:31Z"
  },
  {
    "title": "No early election despite Rayner resignation and Farage claims, says prime minister’s key adviser – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/06/no-early-election-angela-rayner-resignation-nigel-farage-reform-uk-politics-live-news-latest",
    "image": "https://media.guim.co.uk/ef89e6d973b2d1173f1dff0d29de38013d336ef3/393_0_3928_3143/500.jpg",
    "summary": "Chief Secretary Darren Jones stated that the resignation of Rayner prompted an earlier-than-expected reshuffle within the Labour party. He emphasized that despite these changes, there is no division within the party. The situation reflects ongoing adjustments in response to internal dynamics.",
    "published": "2025-09-06T12:44:39Z"
  },
  {
    "title": "World Cup qualifying buildup to England v Andorra, WSL Q&A  and Football League – matchday live",
    "url": "https://www.theguardian.com/football/live/2025/sep/06/world-cup-qualifying-buildup-to-england-v-andorra-wsl-qa-and-football-league-matchday-live",
    "image": "https://media.guim.co.uk/6bbdd2e6e47c70dd6499708786934a74327eed03/0_0_5000_4000/500.jpg",
    "summary": "This news highlights the upcoming World Cup qualifying matches and Women's Super League (WSL) action scheduled for Saturday. It features insights and answers to questions from football expert Suzanne Wrack. Fans can stay updated on key developments as the matches approach.",
    "published": "2025-09-06T12:23:01Z"
  },
  {
    "title": "Police make arrests at London Palestine Action ban protest",
    "url": "https://www.theguardian.com/world/2025/sep/06/police-make-arrests-at-london-palestine-action-ban-protest",
    "image": "https://media.guim.co.uk/40ff905602d310caa852b5ad1164891375b05311/298_0_4773_3819/500.jpg",
    "summary": "Over 1,000 individuals have committed to participating in a significant protest, which is expected to be the largest since the group was banned. The protestors are willing to face arrest in their demonstration. This rally highlights ongoing tensions related to the group's legal status.",
    "published": "2025-09-06T12:18:14Z"
  }
]