[
  {
    "title": "Tottenham v Manchester United buildup, Premier League and WSL news – matchday live ",
    "url": "https://www.theguardian.com/football/live/2025/nov/08/tottenham-v-manchester-united-buildup-premier-league-and-wsl-news-matchday-live",
    "image": "https://media.guim.co.uk/9ad2977bd5c40ff9858f4c5002b2ec56253ea145/0_0_5000_4000/500.jpg",
    "summary": "Tune in for news updates, engaging discussions, and previews as we gear up for today’s events. Don't miss out on the latest information before the action begins! Join us for an informative session.",
    "published": "2025-11-08T09:01:37Z"
  },
  {
    "title": "Cutting aid for disease fund would be moral failure, Labour MPs tell Starmer",
    "url": "https://www.theguardian.com/politics/2025/nov/08/cutting-aid-for-disease-fund-would-be-moral-failure-labour-mps-tell-starmer",
    "image": "https://media.guim.co.uk/3de2fb39e8d60709e24c3886a171f9db96f7fdc8/1202_584_5234_4187/500.jpg",
    "summary": "The UK is anticipated to decrease its financial contribution to the Global Fund to Fight Aids, Tuberculosis, and Malaria by 20%. This reduction raises concerns about the impact on ongoing health initiatives and global efforts to combat these diseases. The decision may influence international funding dynamics and public health outcomes.",
    "published": "2025-11-08T09:00:03Z"
  },
  {
    "title": "Australia v India: fifth men’s Twenty20 international – live",
    "url": "https://www.theguardian.com/sport/live/2025/nov/08/australia-v-india-fifth-mens-twenty20-international-cricket-live-updates",
    "image": "https://media.guim.co.uk/5b848a3598ff6bfdfb2f4a6e2b7a567483d4d785/308_0_2797_2237/500.jpg",
    "summary": "Australia aims to equalize the T20 series against their rivals in the final match at the Gabba. The team seeks victory to level the series. Follow James Wallace for live updates.",
    "published": "2025-11-08T08:58:00Z"
  },
  {
    "title": "Jailed UK climate protesters facing conditions reserved for extremists on release",
    "url": "https://www.theguardian.com/law/2025/nov/08/jailed-uk-climate-protesters-facing-conditions-reserved-for-extremists-on-release",
    "image": "https://media.guim.co.uk/e9068fad4d52f668313d18c38a58f70892cfb8a0/845_0_7200_5760/500.jpg",
    "summary": "An activist from the group Just Stop Oil received a ban prohibiting attendance at gatherings, including social meetings at cafes, without prior approval. This restriction highlights the government's approach to managing protests and public demonstrations. The activist's case raises concerns over civil liberties and the right to free assembly.",
    "published": "2025-11-08T08:00:06Z"
  },
  {
    "title": "Fall and redemption of Becker and Wiggins shows sporting glory does not deliver purpose or meaning | Cath Bishop",
    "url": "https://www.theguardian.com/sport/2025/nov/08/boris-becker-bradley-wiggins-autobiographies-redemption-abuse",
    "image": "https://media.guim.co.uk/5f55c218243aa1896d0b2a4e255d0e6a0d700c2d/0_0_5000_4000/500.jpg",
    "summary": "Books by former champions highlight the need to reject the notion that abuse and suffering are acceptable for achieving success in sports. They advocate for a cultural shift to prioritize well-being over winning. The message emphasizes that sports organizations must take greater responsibility in addressing these issues.",
    "published": "2025-11-08T08:00:06Z"
  }
]