[
  {
    "title": "Manchester City v Everton, Brighton v Newcastle, and more: football – live",
    "url": "https://www.theguardian.com/football/live/2025/oct/18/manchester-city-v-everton-brighton-v-newcastle-and-more-football-live",
    "image": "https://media.guim.co.uk/35b523a9125284c21aa13c1451b9255be48517a8/311_0_3108_2486/500.jpg",
    "summary": "Barry Glendenning will provide updates on the afternoon's Premier League games and additional matches. Tune in for live commentary and insights as the action unfolds. Stay informed on key moments and results from the day's fixtures.",
    "published": "2025-10-18T14:15:24Z"
  },
  {
    "title": "Nottingham Forest 0-3 Chelsea: Premier League – live",
    "url": "https://www.theguardian.com/football/live/2025/oct/18/nottingham-forest-v-chelsea-premier-league-live",
    "image": "https://media.guim.co.uk/a66f5f86d387756c7dcde61bc1efbed0607a47f4/979_362_3543_2834/500.jpg",
    "summary": "Ange Postecoglou was dismissed as manager shortly after Chelsea's victory over Nottingham Forest. This defeat added to the pressure surrounding his position. The decision reflects Chelsea's ongoing struggles and their need for effective leadership.",
    "published": "2025-10-18T14:15:11Z"
  },
  {
    "title": "Champions Day horse racing at Ascot: Powerful Glory pulls off 200-1 shock – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/18/champions-day-champion-stakes-ascot-horse-racing-live-updates",
    "image": "https://media.guim.co.uk/5695fcb1a6b51dacba9943258943dfd82338d7cf/0_0_5000_4000/500.jpg",
    "summary": "Today's racing events at Ascot featured an intense showdown in the Champion Stakes. The racing team provided comprehensive updates on all the day's highlights. Fans were treated to thrilling performances from top contenders.",
    "published": "2025-10-18T14:15:00Z"
  },
  {
    "title": "Mental Health Is Real Wealth: how Black men prioritize healing ‘in this white world’",
    "url": "https://www.theguardian.com/us-news/2025/oct/18/mental-health-black-men",
    "image": "https://media.guim.co.uk/6c58da7d95a75d64670a77e7fd8db622c6af7537/0_0_3413_2732/500.jpg",
    "summary": "In Los Angeles, a bi-monthly group has been established to provide Black men with a safe environment for sharing their experiences and emotions. The initiative encourages reflection and mutual support among participants. This community aims to foster connection and understanding in a challenging societal landscape.",
    "published": "2025-10-18T14:00:47Z"
  },
  {
    "title": "I can’t stop watching videos of people discovering Beds are Burning by Midnight Oil. Send help",
    "url": "https://www.theguardian.com/culture/2025/oct/19/cant-stop-watching-first-time-hearing-videos",
    "image": "https://media.guim.co.uk/55f313e4c8d3b2d981f34b937ec65cdb3c847742/53_450_1854_1484/500.jpg",
    "summary": "The author expresses their obsession with \"First Time Hearing\" clips on YouTube, highlighting how captivating and addictive they are. They admit to losing track of time while watching these videos. The allure of discovering new music through others' reactions keeps them engaged.",
    "published": "2025-10-18T14:00:47Z"
  }
]