[
  {
    "title": "Tory plan to scrap green energy measures called ‘contradictory nonsense’ by environment groups – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/oct/06/conservative-tory-party-conference-spending-welfare-immigration-labour-starmer-reform-uk-politics-live-news-updates",
    "image": "https://media.guim.co.uk/4f5940c689bb3410e38d346c06667ed9988d8ece/575_0_6830_5464/500.jpg",
    "summary": "Shadow energy secretary's proposals for energy policy have been criticized by environmental groups, who label them as \"dead wrong.\" These groups argue that the plans do not align with sustainable practices. The backlash highlights the ongoing debate over effective energy strategies amidst environmental concerns.",
    "published": "2025-10-06T14:18:47Z"
  },
  {
    "title": "Supreme court rejects appeal from Jeffrey Epstein associate Ghislaine Maxwell – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/06/donald-trump-national-guard-ice-government-shutdown-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/f601e63b0226ff62d26dad92aa03f26763272fcb/64_0_3779_3024/500.jpg",
    "summary": "The justices declined to hear a case regarding the release of Jeffrey Epstein's files, which would have drawn renewed scrutiny on the Trump administration's handling of the documents. This decision prevents further legal action aimed at making the files public. Critics had previously condemned the administration for not disclosing the information.",
    "published": "2025-10-06T14:13:59Z"
  },
  {
    "title": "Restored Hogarth murals at London hospital open to public for first time",
    "url": "https://www.theguardian.com/artanddesign/2025/oct/06/restored-hogarth-murals-london-hospital-open-public-st-bartholomews",
    "image": "https://media.guim.co.uk/7a69855a2ed4f7719c3ffcf6ba1fffedaf425be7/242_0_3083_2467/500.jpg",
    "summary": "St Bartholomew’s aims to attract art enthusiasts by showcasing two large-scale paintings by 18th-century satirist. These works are expected to enhance the gallery's appeal and become a new highlight for visitors. The initiative reflects a commitment to celebrating historical artistic contributions.",
    "published": "2025-10-06T14:12:42Z"
  },
  {
    "title": "Investigation underway into cause of fire at home of South Carolina judge who received death threats",
    "url": "https://www.theguardian.com/us-news/2025/oct/06/isouth-carolina-judge-home-fire",
    "image": "https://media.guim.co.uk/f3556eb9c787c3a6cd05c73f775e752f0a3ffbf3/0_0_1098_882/500.jpg",
    "summary": "The state's chief justice reported that a fire, which resulted in three individuals being hospitalized, seemed to have been triggered by an \"explosion.\" The incident is under investigation to determine the exact cause. Authorities are focusing on safety measures following this event.",
    "published": "2025-10-06T14:10:44Z"
  },
  {
    "title": "Gaza flotilla members allege beatings and insults in Israeli detention",
    "url": "https://www.theguardian.com/world/2025/oct/06/gaza-flotilla-members-allege-beatings-and-insults-in-israeli-detention",
    "image": "https://media.guim.co.uk/cfd912b7a2bcfb78726c2234d71eb6798eb92a40/1596_986_2991_2392/500.jpg",
    "summary": "Some detainees reported being threatened with guns and dogs, experiencing sleep deprivation during their detention. Allegations of mistreatment highlight serious concerns regarding their treatment by authorities. These claims point to potential violations of human rights and call for further investigation.",
    "published": "2025-10-06T14:07:12Z"
  }
]