[
  {
    "title": "Justice department plans to send election monitors to polling sites in California, New Jersey – live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/24/donald-trump-trade-negotiations-canada-mark-carney-terminated-tariff-letitia-james-new-york-us-politics-live-news",
    "image": "https://media.guim.co.uk/358f1e4f363081d83afe3a3c3a4fa218f161d08d/655_0_4718_3775/500.jpg",
    "summary": "Federal observers will now be deployed to only six counties, a significant change from previous practices. The selected areas include five counties in California and one in New Jersey. This decision reflects a new focus for federal oversight in local elections.",
    "published": "2025-10-24T22:16:35Z"
  },
  {
    "title": "Leeds 2-1 West Ham: Premier League – as it happened",
    "url": "https://www.theguardian.com/football/live/2025/oct/24/leeds-v-west-ham-premier-league-live-updates",
    "image": "https://media.guim.co.uk/11f224ea1b79a83a85e5a321d3b989ea1fccd7f6/0_0_4979_3985/500.jpg",
    "summary": "Brendan Aaronson and Joe Rodon scored to secure a victory for their team, extending Nuno Espírito Santo's winless streak at West Ham. The match highlighted ongoing struggles for Santo's side. Their failure to secure points has raised concerns about his management.",
    "published": "2025-10-24T21:54:27Z"
  },
  {
    "title": "Tennessee man’s heart still active nearly two minutes after execution, lawyer says",
    "url": "https://www.theguardian.com/us-news/2025/oct/24/tennessee-execution-byron-black-cardiac-activity",
    "image": "https://media.guim.co.uk/444240e0c9b85e36e92e5622f873659bf25801f4/175_0_1750_1400/500.jpg",
    "summary": "Allegations surrounding the death of Byron Black suggest significant mishandling during his execution, which his lawyer claims was “100% botched.” This has prompted renewed scrutiny and questions about the procedures followed. The case raises ongoing concerns about the integrity of the death penalty process.",
    "published": "2025-10-24T21:52:47Z"
  },
  {
    "title": "Napoleon’s soldiers who died in Russian retreat had unexpected diseases, study finds",
    "url": "https://www.theguardian.com/world/2025/oct/24/napoleon-army-died-russia-unexpected-diseases",
    "image": "https://media.guim.co.uk/491514b1e4a72a299281e0d62b52e4178d085473/1266_600_1735_1388/500.jpg",
    "summary": "DNA analysis from the teeth of soldiers in a mass grave indicates that they suffered from paratyphoid fever and relapsing fever. This finding provides insight into the health conditions faced by troops during their service. The genetic evidence highlights the impact of infectious diseases on historical military personnel.",
    "published": "2025-10-24T21:34:17Z"
  },
  {
    "title": "‘I don’t care what Slot is saying’: Ruben Amorim hits back at Liverpool manager",
    "url": "https://www.theguardian.com/football/2025/oct/24/i-dont-care-what-slot-is-saying-ruben-amorim-hits-back-at-liverpool-manager",
    "image": "https://media.guim.co.uk/c33675c206208a0bb0a0b5b6042e4b2deb85ad14/127_0_1019_815/500.jpg",
    "summary": "Ruben Amorim dismissed the need for external evaluation of his team following remarks from Arne Slot about Manchester United's performance. He stated, \"I don’t need anyone to evaluate my team.\" Amorim's comments reflect a strong confidence in his squad's abilities and performance.",
    "published": "2025-10-24T21:31:15Z"
  }
]