[
  {
    "title": "Australia v India: third men’s Twenty20 international – live",
    "url": "https://www.theguardian.com/sport/live/2025/nov/02/australia-v-india-t20-live-third-twenty20-international-cricket-aus-vs-ind-latest",
    "image": "https://media.guim.co.uk/01cab61516480128ebfc73749eb5b97be5d76274/125_0_1646_1317/500.jpg",
    "summary": "India needs to score 187 runs to win the T20I at Bellerive Oval and level the series against Australia. The match is currently ongoing, with updates being provided by Martin Pegan. The outcome will determine the series standings.",
    "published": "2025-11-02T10:15:08Z"
  },
  {
    "title": "Celtic and Rangers meet again, Premier League news and buildup – matchday live",
    "url": "https://www.theguardian.com/football/live/2025/nov/02/old-firm-clash-scottish-league-cup-semi-final-premier-league-buildup-matchday-live",
    "image": "https://media.guim.co.uk/c085638892a50f62981c279c5e9b536343331d9e/1008_301_3821_3059/500.jpg",
    "summary": "Tom Bassam provides updates and insights on the upcoming events in Scotland and England, offering news and previews for sports fans. Stay tuned for key information ahead of a significant day of action. Don't miss out on the latest highlights!",
    "published": "2025-11-02T10:12:43Z"
  },
  {
    "title": "Cambridgeshire train stabbing: police briefing expected after 10 injured in mass attack – latest updates",
    "url": "https://www.theguardian.com/uk-news/live/2025/nov/02/cambridgeshire-train-stabbing-life-threatening-injuries-arrests-latest-updates",
    "image": "https://media.guim.co.uk/614b82e38c8f87141ef8ba13c21bde83d35728b1/0_950_4000_3198/500.jpg",
    "summary": "The Defence Secretary described the attack on a train from Doncaster to London as likely an isolated incident. Nine individuals sustained life-threatening injuries during the event. Authorities are investigating the circumstances surrounding the attack.",
    "published": "2025-11-02T10:12:22Z"
  },
  {
    "title": "India v South Africa: Women’s Cricket World Cup final – live",
    "url": "https://www.theguardian.com/sport/live/2025/nov/02/india-v-south-africa-womens-cricket-world-cup-final-live",
    "image": "https://media.guim.co.uk/539189f911b5b81c5822193fab3b3f0cf801c5c0/0_0_4847_3877/500.jpg",
    "summary": "An over-by-over report details the unfolding match in Navi Mumbai, focusing on which team might secure the trophy. Writers provide commentary and insights as the game progresses. Fans eagerly await the outcome of this competitive event.",
    "published": "2025-11-02T10:07:44Z"
  },
  {
    "title": "Lynne Ramsay on pushing Jennifer Lawrence to the brink in her twisted motherhood drama: ‘I make films my way’",
    "url": "https://www.theguardian.com/film/2025/nov/02/lynne-ramsay-interview-film-die-my-love-jennifer-lawrence-robert-pattinson-talk-about-kevin",
    "image": "https://media.guim.co.uk/a2fa0e4efd184f7bbb1262ca6dae53a668b67b29/628_0_10920_8736/500.jpg",
    "summary": "Scottish filmmaker Lynsey Miller gained recognition with \"Ratcatcher\" and \"We Need to Talk About Kevin,\" both known for their intense themes. Her latest film features Hollywood star Jennifer Lawrence and explores the darker aspects of family life. The film continues Miller's tradition of tackling challenging narratives.",
    "published": "2025-11-02T10:02:43Z"
  }
]