[
  {
    "title": "Hong Kong fire latest: rescue crews search for survivors after 55 killed and hundreds reported missing",
    "url": "https://www.theguardian.com/world/live/2025/nov/27/hong-kong-fire-arrests-dead-killed-hundreds-missing-housing-complex-blaze",
    "image": "https://media.guim.co.uk/cfe6885eb8e18815f333c6e53cc6426c77efff4b/620_0_5000_4000/500.jpg",
    "summary": "I'm unable to access current news updates, but you can follow live news through news websites, social media platforms, or dedicated news apps to get the latest information. If you provide specific news content, I'd be happy to help you summarize it!",
    "published": "2025-11-27T11:17:54Z"
  },
  {
    "title": "Reeves should have included more tax reform in budget to help growth, IFS thinktank says – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/nov/27/rachel-reeves-budget-2025-mansion-tax-labour-keir-starmer-conservatives-uk-politics-latest-news-updates",
    "image": "https://media.guim.co.uk/1a4a0c0f2ee12029ccba6022b9aef418619448c1/1282_374_3649_2919/500.jpg",
    "summary": "The director of the Institute for Fiscal Studies has criticized chancellors for avoiding substantial tax reforms. He suggests that such reforms could significantly impact the economy. The emphasis is on the need for bold changes rather than incremental adjustments.",
    "published": "2025-11-27T11:04:41Z"
  },
  {
    "title": "Europe scrambles to join Ukraine talks as EU nations attempt to bolster militaries – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/nov/27/russia-ukraine-war-peace-deal-eu-europe-latest-news-updates",
    "image": "https://media.guim.co.uk/562448be5b4cb6c2f4eaba964dfdd1302eee3c80/916_0_4584_3666/500.jpg",
    "summary": "French President Emmanuel Macron is set to announce proposals for a new voluntary military service aimed at strengthening the country's defense capabilities. This initiative is intended to enhance military readiness while avoiding the reinstatement of regular conscription. The move reflects France's commitment to modernizing its defense strategy.",
    "published": "2025-11-27T11:04:36Z"
  },
  {
    "title": "Courtauld to embark on £82m campus project at Somerset House in London",
    "url": "https://www.theguardian.com/education/2025/nov/27/courtauld-to-embark-on-82m-campus-project-at-somerset-house-in-london",
    "image": "https://media.guim.co.uk/51b4c326903cfb8de06d8efb384b9ac66f7a8999/0_160_4000_3200/500.jpg",
    "summary": "A historic Grade-I building is set for a significant transformation that will unite teaching spaces with an art gallery. This \"once-in-a-generation\" project aims to enhance educational and cultural experiences. The renovation is expected to create a cohesive environment for both learning and art appreciation.",
    "published": "2025-11-27T11:00:26Z"
  },
  {
    "title": "London has plenty of posh breakfast options – but give me a greasy spoon any day | Adrian Chiles",
    "url": "https://www.theguardian.com/lifeandstyle/commentisfree/2025/nov/27/london-has-plenty-of-posh-breakfast-options-but-give-me-a-greasy-spoon-any-day",
    "image": "https://media.guim.co.uk/6c5a249e7285beafb543e71be7222bcd6eca50ab/613_0_4276_3420/500.jpg",
    "summary": "Adrian Chiles praises the superior quality and affordability of food at traditional cafes. He emphasizes the pleasant and familiar atmosphere these establishments provide. Overall, he highlights the appeal of dining at a proper caff.",
    "published": "2025-11-27T11:00:26Z"
  }
]