[
  {
    "title": "‘I can’t go on anymore’: Mazón resigns as Valencia leader and acknowledges mistakes during deadly 2024 floods – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/nov/03/valencia-spain-europe-ukraine-serbia-czech-republic-latest-live-news-updates",
    "image": "https://media.guim.co.uk/ec6e07800d48fbd7596e116183649217cbbe63be/912_0_5040_4032/500.jpg",
    "summary": "In October 2024, flooding resulted in the deaths of 229 individuals, leading to widespread calls for Mazón's resignation. The public outcry intensified as questions arose about his handling of the crisis. Despite the pressure, Mazón has not announced any plans to step down.",
    "published": "2025-11-03T14:19:22Z"
  },
  {
    "title": "Powerful Afghanistan earthquake leaves 20 dead and reportedly damages famous Blue Mosque",
    "url": "https://www.theguardian.com/world/2025/nov/03/afghanistan-earthquake-death-toll-reportedly-damages-blue-mosque",
    "image": "https://media.guim.co.uk/a96157d8fa6fa20c78cfe2b2dd8742c50042bd10/464_0_4640_3712/500.jpg",
    "summary": "A magnitude 6.3 earthquake struck the northern provinces of Balkh and Samangan, causing hundreds of injuries. The quake notably impacted Mazar-i-Sharif, where the historic Blue Mosque was reportedly affected. Rescue efforts are ongoing to assist those impacted by the disaster.",
    "published": "2025-11-03T14:19:11Z"
  },
  {
    "title": "Failed signings, fan fury and resignations: how Fiorentina became a crisis club | Nicky Bandini",
    "url": "https://www.theguardian.com/football/2025/nov/03/fiorentina-serie-a-crisis-club",
    "image": "https://media.guim.co.uk/a0b2b29c031982910dab0519056cb163381761c6/127_0_2953_2362/500.jpg",
    "summary": "Florence's team, after a significant financial investment, initially had high hopes for the season. However, their performance has turned chaotic, leading to growing concerns about future prospects. The situation may deteriorate further as issues mount.",
    "published": "2025-11-03T14:17:13Z"
  },
  {
    "title": "WTA Finals: Swiatek v Rybakina, Anisimova v Keys – live",
    "url": "https://www.theguardian.com/sport/live/2025/nov/03/wta-finals-swiatek-v-rybakina-anisimova-v-keys-live",
    "image": "https://media.guim.co.uk/ae276f98eb1da2d8b0ca76ab6167ba07db8a7e59/322_0_2402_1921/500.jpg",
    "summary": "Daniel Harris will provide updates from the season-ending tournament taking place in Saudi Arabia. Tune in for insights and highlights as the event unfolds. Stay informed on key matches and performances.",
    "published": "2025-11-03T14:16:25Z"
  },
  {
    "title": "Trump says he doesn’t know who crypto tycoon is despite having pardoned him",
    "url": "https://www.theguardian.com/us-news/2025/nov/03/trump-changpeng-zhao-cz-pardon-crypto",
    "image": "https://media.guim.co.uk/2bbbff47454f27ca39d7812a30b9430290fd13b1/111_0_3426_2742/500.jpg",
    "summary": "Billionaire Changpeng Zhao pleaded guilty to charges of enabling money laundering. He was released by the president last month following his plea. The case highlights ongoing concerns regarding financial regulations and cryptocurrency.",
    "published": "2025-11-03T14:15:30Z"
  }
]