[
  {
    "title": "Newcastle v Arsenal buildup, Barcelona in action, WSL and more – matchday live",
    "url": "https://www.theguardian.com/football/live/2025/sep/28/newcastle-v-arsenal-buildup-barcelona-in-action-wsl-and-more-matchday-live",
    "image": "https://media.guim.co.uk/b6d3fa4a2eaa9fc15a3722ae8f8004fbdd325e57/0_0_5000_4000/500.jpg",
    "summary": "Join our discussion on today's football highlights, featuring a crucial match at St James' Park, an exciting day in the Women's Super League, and Barcelona aiming for victory to maintain their lead in La Liga.",
    "published": "2025-09-28T07:11:12Z"
  },
  {
    "title": "Starmer calls on Labour to to stop ‘navel-gazing’ and join ‘fight of our times’ as Labour conference begins – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/28/labour-conference-keir-starmer-latest-uk-politics-news-live-updates",
    "image": "https://media.guim.co.uk/2315d78495d8e60c31191af6ee91420d7c8ab258/522_0_6830_5464/500.jpg",
    "summary": "In response to criticisms from certain Labour MPs regarding his leadership, the Prime Minister urges party members to stop self-reflection. He emphasizes the need for the Labour Party to focus on delivering change. The call for unity comes as internal discussions about leadership intensify.",
    "published": "2025-09-28T07:07:40Z"
  },
  {
    "title": "‘A serious disappointment’: Labour has to regain business sector’s confidence at conference",
    "url": "https://www.theguardian.com/politics/2025/sep/28/a-serious-disappointment-labour-has-to-regain-business-sectors-confidence-at-conference",
    "image": "https://media.guim.co.uk/af65d13239fdb916093a8e7372b4408679d543b6/1182_3335_2073_1658/500.jpg",
    "summary": "Executives who were assured last year they could collaborate with the party on policy are now expressing confusion about the lack of engagement. Many are questioning what led to this disconnect between their expectations and the current situation. The situation highlights a growing frustration among business leaders regarding their involvement in political decision-making.",
    "published": "2025-09-28T07:01:04Z"
  },
  {
    "title": "Far-right Facebook groups are engine of radicalisation in UK, data investigation suggests",
    "url": "https://www.theguardian.com/world/2025/sep/28/far-right-facebook-groups-are-engine-of-radicalisation-in-uk-data-investigation-suggests",
    "image": "https://media.guim.co.uk/3ad719263d95a5d09da51559f93b7765b022b3b1/1_0_4998_4000/500.png",
    "summary": "Research by The Guardian reveals that rioters were influenced by a network spreading racist disinformation, which reaches hundreds of thousands of people in the UK. This network amplifies harmful narratives and fosters division among communities. The findings highlight the significant impact of misinformation on societal unrest.",
    "published": "2025-09-28T07:00:06Z"
  },
  {
    "title": "Inside the everyday Facebook networks where far-right ideas grow",
    "url": "https://www.theguardian.com/world/ng-interactive/2025/sep/28/inside-the-everyday-facebook-networks-where-far-right-ideas-grow",
    "image": "https://media.guim.co.uk/c503514b4c62e6fface446b85b9e70568eb8de19/1_0_4998_4000/500.jpg",
    "summary": "The Guardian conducted a year-long investigation into an online community focused on anti-immigration sentiment and the spread of misinformation. Experts warn that these platforms may contribute to radicalization. The study highlights the significant impact of such digital spaces on societal attitudes and behaviors.",
    "published": "2025-09-28T07:00:05Z"
  }
]