[
  {
    "title": "Falling stock markets and high shop prices push US consumer confidence down; bitcoin hits nine-month low – business live",
    "url": "https://www.theguardian.com/business/live/2025/nov/21/uk-public-finances-retail-sales-budget-energy-price-cap-stock-markets-ai-bubble-fears-business-live",
    "image": "https://media.guim.co.uk/274491b7dd3a69cd412ed41b89b8c842464a5ac1/0_0_3703_2962/500.jpg",
    "summary": "Rolling coverage provides continuous updates on the latest developments in the economic and financial sectors. It focuses on key trends, market movements, and significant events impacting the economy. Stay informed with real-time analysis and insights.",
    "published": "2025-11-21T19:15:30Z"
  },
  {
    "title": "A translation of the Nauruan president’s remarks will stay suppressed for a decade – but secrecy in Australia’s offshore policy is nothing new ",
    "url": "https://www.theguardian.com/world/2025/nov/22/a-translation-of-the-nauruan-presidents-remarks-will-stay-suppressed-for-a-decade-but-secrecy-in-australias-offshore-policy-is-nothing-new",
    "image": "https://media.guim.co.uk/669f6ba0782b03d94aebb31aac44f8a4b4a06ad0/102_93_3206_2565/500.jpg",
    "summary": "Both Scott Morrison and the Albanese government have demonstrated a consistent hostility towards legitimate scrutiny regarding their treatment of 'on-water matters' and the Memorandum of Understanding with Nauru. This pattern indicates a reluctance to allow transparency in handling critical issues related to immigration and asylum policies. The ongoing trend raises concerns over accountability in government actions.",
    "published": "2025-11-21T19:00:17Z"
  },
  {
    "title": "The best coffee machines for your home: your morning brew made easy, according to our expert",
    "url": "https://www.theguardian.com/thefilter/2024/nov/21/best-coffee-machines",
    "image": "https://media.guim.co.uk/271a01b8ed7a041e6258516f76e9ab831c9b4f03/0_0_5000_4000/500.jpg",
    "summary": "Explore our curated list of ideal coffee makers featuring trusted brands like Sage and Nespresso. We offer recommendations for both capsule and manual machines. Find your perfect coffee companion today!",
    "published": "2025-11-21T19:00:14Z"
  },
  {
    "title": "Ukraine risks losing key partner or its dignity, warns Zelenskyy, as Trump sets Thanksgiving deadline to accept deal – as it happened",
    "url": "https://www.theguardian.com/world/live/2025/nov/21/europe-latest-news-russia-ukraine-war-updates-zelenskyy-putin-g20",
    "image": "https://media.guim.co.uk/9db26e6a635fd6e0e40e8e15559eeb918b3ec7a8/285_0_1350_1080/500.jpg",
    "summary": "In a recent radio interview, the US President indicated that \"Thursday is an appropriate time\" regarding an important decision or announcement. This coincides with Ukrainian President Volodymyr Zelensky's deliberation of a US proposal. The comments suggest a potential alignment or upcoming collaboration between the two leaders.",
    "published": "2025-11-21T18:58:49Z"
  },
  {
    "title": "Iqbal Mohamed becomes second MP to quit Your Party",
    "url": "https://www.theguardian.com/politics/2025/nov/21/iqbal-mohamed-second-mp-quit-your-party-jeremy-corbyn",
    "image": "https://media.guim.co.uk/c6b654bcfa5580e4944c59676d867e827d0f3140/0_953_3748_2998/500.jpg",
    "summary": "Mohamed announced his decision to leave due to a series of \"many false allegations and smears\" directed at him and others. He expressed concerns over the impact of these accusations. The announcement reflects a desire to distance himself from the ongoing controversy.",
    "published": "2025-11-21T18:56:57Z"
  }
]