[
  {
    "title": "Trump’s justice department in ‘full cover-up mode’ amid Comey indictment, House Democrat says – live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/26/james-comey-fbi-indictment-donald-trump-executive-orders-tariffs-us-politics-live",
    "image": "https://media.guim.co.uk/8f31529865b8187b958bd3c91fb4e864d8b1aba1/295_0_3932_3146/500.jpg",
    "summary": "Jamie Raskin, the leading Democrat on the House Judiciary Committee, has accused the Department of Justice (DoJ) of acting under President Trump's influence in suppressing certain legal cases. He claims that the agency is prioritizing political interests over justice. Raskin's remarks highlight concerns about potential bias within the DoJ's actions.",
    "published": "2025-09-26T19:13:54Z"
  },
  {
    "title": "Ryder Cup 2025: USA 1-3 Europe after day-one foursomes – live updates",
    "url": "https://www.theguardian.com/sport/live/2025/sep/26/ryder-cup-2025-day-one-golf-europe-usa-bethpage-black-live",
    "image": "https://media.guim.co.uk/a0a3e0a101c2a89ff757822aa37f1fa8566e72d9/144_0_4335_3469/500.jpg",
    "summary": "Europe begins its title defense at Bethpage Black with a strong performance, as live updates provide hole-by-hole coverage of the event. Join our writers for continuous updates on the action. Stay tuned for the latest developments in the tournament.",
    "published": "2025-09-26T19:09:46Z"
  },
  {
    "title": "Rare orange lobster found in New York supermarket returned to sea",
    "url": "https://www.theguardian.com/us-news/2025/sep/26/orange-lobster-new-york-supermarket",
    "image": "https://media.guim.co.uk/34913de67420bb31fceec67b352a5731eb5b5502/125_0_3750_3000/500.jpg",
    "summary": "A rare fish, estimated to occur once in every 30 million, was discovered in a grocery store in upstate New York. After being removed from the menu, it was released back into Long Island Sound. The extraordinary find has drawn public attention due to its rarity.",
    "published": "2025-09-26T19:07:28Z"
  },
  {
    "title": "Queens of the stone age: England legends on what a Rugby World Cup win would mean",
    "url": "https://www.theguardian.com/sport/2025/sep/26/england-rugby-union-legends-what-rugby-world-cup-win-would-mean",
    "image": "https://media.guim.co.uk/277eca82ce945ec8b1dad766c0f56c798966b67d/360_492_3705_2964/500.jpg",
    "summary": "Rochelle Clark, Maggie Alphonsi, and Catherine Spencer reflect on the growth and popularity of women's rugby from their perspective as former players. They express joy and pride in witnessing the sport's evolution and increased visibility. The trio emphasizes the significance of their experiences in shaping the game's future.",
    "published": "2025-09-26T19:00:20Z"
  },
  {
    "title": "What is leucovorin, the drug the FDA approved to treat autism?",
    "url": "https://www.theguardian.com/wellness/2025/sep/26/what-is-leucovorin-autism-drug",
    "image": "https://media.guim.co.uk/85815e0cc66e3bc6633ffc37a6d3795635fcc152/500_0_5000_4000/500.jpg",
    "summary": "The FDA has approved a generic drug for treating autism, a decision that has surprised health experts. This approval raises questions about the appropriateness and implications of using the drug for this purpose. The move reflects ongoing discussions about treatment options in the autism community.",
    "published": "2025-09-26T18:51:42Z"
  }
]