[
  {
    "title": "Supporting Reform’s ‘racist policy’ does not make voters racist, says Rachel Reeves – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/29/rachel-reeves-labour-party-conference-youth-guarantee-unemployment-uk-politics-live-latest-news",
    "image": "https://media.guim.co.uk/06fd0956fa69df1f42c50f74d8cc278e11837471/368_0_3683_2946/500.jpg",
    "summary": "The Chancellor supports Keir Starmer's claim that the policy to end indefinite leave to remain is racist. He also suggests that many supporters of the Reform Party would be appalled by this stance. This statement highlights a growing divide on immigration policy within British politics.",
    "published": "2025-09-29T11:15:48Z"
  },
  {
    "title": "Donald Trump and Benjamin Netanyahu to discuss Gaza peace plan at the White House – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/29/donald-trump-benjamin-netanyahu-gaza-white-house-us-politics-live",
    "image": "https://media.guim.co.uk/dcac1da0ca83af83dab779b453431861fe887c0b/296_0_3770_3016/500.jpg",
    "summary": "The US president will urge the Israeli prime minister to establish a new framework aimed at ending the war in Gaza. This initiative also seeks to secure the release of remaining hostages held by Hamas. The discussions highlight ongoing international efforts to address the conflict and facilitate humanitarian outcomes.",
    "published": "2025-09-29T11:15:22Z"
  },
  {
    "title": "JLR to resume some manufacturing in coming days after hack: GSK shares rise 3% after surprise CEO change – business live",
    "url": "https://www.theguardian.com/business/live/2025/sep/29/moral-hazard-fears-jlr-jaguar-land-rover-government-loan-gsk-ceo-astrazeneca-listing-dollar-shutdown-business-live-news",
    "image": "https://media.guim.co.uk/f91f5a390fb4912042b9770554a8e23b7261cd22/994_0_5511_4409/500.jpg",
    "summary": "Jaguar Land Rover (JLR) is progressing with a \"controlled, phased restart\" of its operations. GlaxoSmithKline (GSK) has appointed a new leader to take over from Dame Emma Walmsley. The transitions in both companies signal ongoing changes in their operational strategies and leadership.",
    "published": "2025-09-29T11:09:40Z"
  },
  {
    "title": "The usually excellent Ravens are in a hole. And it could get a lot deeper",
    "url": "https://www.theguardian.com/sport/2025/sep/29/chiefs-ravens-lamar-jackson-nfl",
    "image": "https://media.guim.co.uk/a02af31d985ee7ccf49237e5dfa97936b337e94e/399_0_3993_3195/500.jpg",
    "summary": "Kansas City rebounded with a strong offensive performance, improving their season record. Meanwhile, their AFC rivals are struggling at 1-3 and have lost one of the league's top players. This situation highlights the contrasting fortunes of the teams.",
    "published": "2025-09-29T11:09:35Z"
  },
  {
    "title": "Chris Woakes retires from international cricket to end 15-year England career",
    "url": "https://www.theguardian.com/sport/2025/sep/29/chris-woakes-retires-from-international-cricket-england",
    "image": "https://media.guim.co.uk/52aead634570cd6b1a60734c8723ecdf1fb90948/278_296_4430_3544/500.jpg",
    "summary": "Chris Woakes has announced his retirement from international cricket, ending a nearly 15-year career with the England national team. Throughout his tenure, he made significant contributions in both Tests and limited-overs formats. His retirement marks the conclusion of an impactful period for the player and the team.",
    "published": "2025-09-29T11:00:30Z"
  }
]