[
  {
    "title": "Reeves’s pledge to save firms £6bn by cutting red tape dismissed as not ‘remotely serious’ by Tories – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/oct/21/rachel-reeves-economy-starmer-labour-streeting-sentencing-bill-uk-politics-live-news-updates",
    "image": "https://media.guim.co.uk/82b1f5de3873010e16591eb56fc15dfe9fbe82de/239_0_5000_4000/500.jpg",
    "summary": "Chancellor and Business Secretary are attending a regional summit in Birmingham to discuss economic challenges. The event comes as the economic outlook remains bleak, highlighting concerns over growth and stability. Officials aim to engage with local leaders to explore solutions and strategies for recovery.",
    "published": "2025-10-21T10:20:52Z"
  },
  {
    "title": "Covid inquiry live: children paid ‘huge price’ to protect rest of society in pandemic, says Johnson",
    "url": "https://www.theguardian.com/uk-news/live/2025/oct/21/covid-19-inquiry-boris-johnson-pandemic-children-lockdown-impact-live-updates",
    "image": "https://media.guim.co.uk/c803674b912e35f131fddeaa2c9b8a94abc1915a/232_0_1350_1080/500.jpg",
    "summary": "The former prime minister criticized the process used to adjudicate exam results, expressing that it likely left students feeling disheartened. He highlighted the need for a more fair and transparent approach. The commentary reflects broader concerns over the handling of academic assessments.",
    "published": "2025-10-21T10:20:08Z"
  },
  {
    "title": "Trump to host GOP senators at White House amid demolition work and government shutdown – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/21/donald-trump-republicans-white-house-ballroom-government-shutdown-troops-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/e5547632d1355dcd8c7a05bd41265382e48e6347/577_0_6535_5228/500.jpg",
    "summary": "The president is hosting a lunch for Republican lawmakers in the Rose Garden. This event takes place while construction is ongoing in the east wing of the White House. The gathering aims to foster collaboration among party members.",
    "published": "2025-10-21T10:18:58Z"
  },
  {
    "title": "Gaza ceasefire live: Vance arrives in Israel as Qatar condemns ‘continued violation’ of ceasefire",
    "url": "https://www.theguardian.com/world/live/2025/oct/21/israel-gaza-ceasefire-jd-vance-hostages-hamas-netanyahu-latest-news-updates",
    "image": "https://media.guim.co.uk/2dbc725136a84cf183a3c21b14f665e638a15d51/410_0_3440_2752/500.jpg",
    "summary": "U.S. Vice President Kamala Harris is visiting Israel shortly after two former Trump administration envoys held discussions with Prime Minister Netanyahu. The meetings indicate ongoing diplomatic engagements between the U.S. and Israel. Harris's trip aims to strengthen ties and discuss regional security and cooperation.",
    "published": "2025-10-21T10:17:02Z"
  },
  {
    "title": "Defiant Sarkozy begins jail sentence as lawyer says he will be held in solitary confinement – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/oct/21/nicolas-sarkozy-france-jail-russia-ukraine-europe-news-live-updates",
    "image": "https://media.guim.co.uk/2b5cd7d1e8743daefc14f0cb0f50323a981871d7/1629_167_5072_4057/500.jpg",
    "summary": "Former French President Nicolas Sarkozy has been convicted of criminal conspiracy related to funding irregularities in his 2007 election campaign. He has begun serving his sentence at La Santé prison in Paris. This marks a significant legal setback for the former leader, as he becomes the first president in France's history to be imprisoned.",
    "published": "2025-10-21T10:07:02Z"
  }
]