[
  {
    "title": "Russian violation of Estonian airspace brings region ‘closer to conflict’, foreign minister says – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/sep/22/latest-europe-news-russia-estonia-un-united-nations-security-live-latest-updates",
    "image": "https://media.guim.co.uk/bede7b5fb8e9922b7fab81bfbbbb8ccb5436a9e4/443_198_1619_1295/500.jpg",
    "summary": "The Estonian foreign minister reported that an incident on Friday marks the fourth violation of Estonian airspace by Russia in 2023. This ongoing issue highlights increasing tensions between the two countries. Estonia continues to monitor and respond to these incursions.",
    "published": "2025-09-22T14:38:27Z"
  },
  {
    "title": "British-Egyptian activist Alaa Abd el-Fattah to be freed from prison",
    "url": "https://www.theguardian.com/world/2025/sep/22/british-egyptian-activist-alaa-abd-el-fattah-to-be-freed-from-prison",
    "image": "https://media.guim.co.uk/acdabbdbe0d492bda8983086c5a149625e8adb2b/746_0_3008_2407/500.jpg",
    "summary": "A writer, who previously served six years in prison for liking a Facebook post, has been granted a presidential pardon. The pardon highlights concerns over freedom of expression and the severe penalties for online activities. This case has drawn attention to the broader implications of social media use in some countries.",
    "published": "2025-09-22T14:37:42Z"
  },
  {
    "title": "‘Extraordinary milestone’: ticket sales for 2025 Rugby World Cup tripled since previous edition",
    "url": "https://www.theguardian.com/sport/2025/sep/22/womens-rugby-world-cup-ticket-sales-tripled-england-canada-twickenham",
    "image": "https://media.guim.co.uk/8e1ba09d2be0129845e41a0c607a093dd4917817/375_0_5000_4000/500.jpg",
    "summary": "Ticket prices for the 2025 Rugby World Cup have tripled compared to the last tournament. Organisers report that sales have exceeded their highest expectations. This surge indicates strong demand for the event.",
    "published": "2025-09-22T14:32:42Z"
  },
  {
    "title": "Trump hails Charlie Kirk as ‘a martyr for America’s freedom’ at memorial – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/22/donald-trump-charlie-kirk-autism-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/c13dd63acaa1528daa70e1589a9257bcb54be327/401_0_4008_3207/500.jpg",
    "summary": "President's remarks expressing hatred towards his opponents stand in stark contrast to Erika Kirk's act of forgiveness for the man accused of murdering her husband. While the President promotes animosity, Kirk exemplifies compassion amidst tragedy. This juxtaposition highlights differing approaches to conflict and personal loss.",
    "published": "2025-09-22T14:31:58Z"
  },
  {
    "title": "Family of man killed in New Hampshire shooting says he sacrificed his life",
    "url": "https://www.theguardian.com/us-news/2025/sep/22/new-hampshire-country-club-shooting",
    "image": "https://media.guim.co.uk/50f80213cc81e6a168074ebbad4d3143c53bd7a3/356_0_2640_2111/500.jpg",
    "summary": "Robert Steven DeCesare confronted a shooter at a Nashua country club while dining with his family, acting bravely to protect his wife and loved ones. His courageous action helped to shield them from potential harm. The incident highlights the risks faced during unexpected acts of violence.",
    "published": "2025-09-22T14:30:10Z"
  }
]