[
  {
    "title": "Gaza ceasefire talks live: Hamas says hostage and prisoner lists exchanged with Israel",
    "url": "https://www.theguardian.com/world/live/2025/oct/08/gaza-ceasefire-talks-israel-hamas-trump-us-qatar-turkey-egypt-live-news-updates",
    "image": "https://media.guim.co.uk/7edff8dee2afbac3984dcf086ad40564c666668a/262_0_3078_2463/500.jpg",
    "summary": "The Qatari Prime Minister, along with US officials Witkoff and Kushner, are participating in negotiations between Hamas and Israeli representatives regarding a plan for Gaza proposed by Trump. The discussions aim to address the complex issues surrounding the ongoing conflict in the region. This collaboration underscores the involvement of multiple stakeholders in efforts to find a resolution.",
    "published": "2025-10-08T13:28:15Z"
  },
  {
    "title": "Guardian prison columnist Erwin James drowned in Devon marina, inquest finds",
    "url": "https://www.theguardian.com/uk-news/2025/oct/08/prison-columnist-erwin-james-drowned-devon-marina-inquest-finds",
    "image": "https://media.guim.co.uk/9c701bb3772f6f6c1ab69a463be9608bc7e1ec81/0_0_3744_2995/500.jpg",
    "summary": "A journalist known for his column \"A Life Inside\" died after falling into the sea in January 2024 while serving a prison sentence for murder. The incident attracted attention due to his controversial background. His writings from prison had garnered significant public interest.",
    "published": "2025-10-08T13:25:48Z"
  },
  {
    "title": "Women’s Cricket World Cup: Australia v Pakistan – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/08/womens-cricket-world-cup-australia-v-pakistan-live-updates-scores-results-teams-squads-start-time-colombo",
    "image": "https://media.guim.co.uk/74b7eeda9030ff93aa949f483ccddfd15a20e1e8/408_0_2704_2164/500.jpg",
    "summary": "In Colombo, the defending champions aim to regain their momentum in the group stage of an ODI match. Megan Maurice is providing an over-by-over report of the game. Fans are eager to see if the team can capitalize on their experience and strengths.",
    "published": "2025-10-08T13:25:17Z"
  },
  {
    "title": "Tories would abolish stamp duty, Badenoch tells party conference – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/oct/08/conservative-tory-conference-kemi-badenoch-labour-keir-starmer-india-uk-politics-live-news-updates",
    "image": "https://media.guim.co.uk/0307c38293edfb7caa70253a42b37082a9e76b9a/225_0_3750_3000/500.jpg",
    "summary": "The party leader criticizes the current measure as a \"bad tax,\" advocating for its elimination. They argue that removing the tax would enhance the housing market and promote better social mobility. This proposal aims to create more opportunities for individuals and families seeking affordable housing.",
    "published": "2025-10-08T13:21:38Z"
  },
  {
    "title": "Trump says Chicago mayor ‘should be in jail’ for not protecting Ice officers after Texas national troops arrive in Illinois – live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/08/donald-trump-james-comey-justice-department-national-guard-chicago-antifa-government-shutdown-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/ca79c801faff89958a96851529bd0353beefecca/499_0_2500_2001/500.jpg",
    "summary": "Former President Trump criticized Chicago Mayor Brandon Johnson and Illinois Governor JB Pritzker on social media, highlighting their leadership in Democratic-led states. His comments come as part of a broader initiative to target Democratic policies and governance. Trump aims to galvanize support among his political base by emphasizing perceived failures in these leadership roles.",
    "published": "2025-10-08T13:20:14Z"
  }
]