[
  {
    "title": "China ends tariffs on US imports including farm goods but soy bean levies remain; M&S profits hammered by cyber-attack – business live",
    "url": "https://www.theguardian.com/business/live/2025/nov/05/china-ends-tariffs-us-imports-soy-bean-levies-ms-profits-cyber-attack-business-live",
    "image": "https://media.guim.co.uk/ba9587b24537a7628d820588b6ba12fbe13e35c2/414_0_4099_3280/500.jpg",
    "summary": "Asian stock markets declined following a drop on Wall Street, driven by concerns over tech sector valuations. Investors are reacting to potential overvaluations in technology stocks, leading to widespread sell-offs. This sentiment has impacted markets across the region, reflecting overall negative investor confidence.",
    "published": "2025-11-05T08:24:41Z"
  },
  {
    "title": "New York mayor-elect Zohran Mamdani challenges Donald Trump in victory speech as Democrats win key US election races – live",
    "url": "https://www.theguardian.com/us-news/live/2025/nov/04/nyc-mayor-election-zohran-mamdani-andrew-cuomo-results-latest",
    "image": "https://media.guim.co.uk/a8a175efb88ab9a3e3fab71c8a0ee2e6bf4486ed/349_0_2972_2379/500.jpg",
    "summary": "Mamdani criticized the prevailing \"oligarchy and authoritarianism,\" directly addressing Trump during his speech. This condemnation came as Democrats celebrated victories in California's redistricting vote and the gubernatorial elections in New Jersey and Virginia. The wins signal a potential shift in political power and influence for the party.",
    "published": "2025-11-05T08:17:25Z"
  },
  {
    "title": "Rapidly lost records in football, from transfer fees to eye-opening wins | The Knowledge",
    "url": "https://www.theguardian.com/football/2025/nov/05/the-knowledge-rapidly-lost-records-in-football-from-transfer-fees-to-eye-opening-wins",
    "image": "https://media.guim.co.uk/3b50de9d324f5807f9d1ad284f58270a037c55df/458_3_2339_1871/500.jpg",
    "summary": "The news covers various topics, including the challenges posed by domestic duopolies in sports. It also highlights changes in gameplay, such as when kick-ins replaced traditional throw-ins. Additionally, it recalls the last striped team to win the English top flight, adding a historical perspective to the discussion.",
    "published": "2025-11-05T08:00:20Z"
  },
  {
    "title": "‘All those silly things – do them’: Guruzeta’s journey from gurney to goals with Athletic",
    "url": "https://www.theguardian.com/football/2025/nov/05/gorka-guruzeta-athletic-bilbao-newcastle-champions-league",
    "image": "https://media.guim.co.uk/5d18d2aa8c2146e9deca09c8e29ac9212da615a2/238_0_3159_2527/500.jpg",
    "summary": "The Basque club's striker has excelled since their return to the Champions League after a ten-year absence. He is poised to play against Newcastle on Wednesday. The team's resurgence has been marked by his impressive performance.",
    "published": "2025-11-05T08:00:20Z"
  },
  {
    "title": "Enzo Maresca must decide to stick or twist on Chelsea’s epic Qarabag trek",
    "url": "https://www.theguardian.com/football/2025/nov/05/chelsea-enzo-maresca-champions-league-qarabag",
    "image": "https://media.guim.co.uk/586bd8bb403ec817d3220c8a0d2f8ebf4504c6a3/215_65_2464_1970/500.jpg",
    "summary": "The head coach is preparing for a challenging Champions League match in Baku on Wednesday. Finding the right balance with player rotation will be crucial for success. This strategic decision is essential given the stakes of the upcoming game.",
    "published": "2025-11-05T08:00:19Z"
  }
]