[
  {
    "title": "Flattery will get you everywhere: Orbán lays it on thick with Trump ",
    "url": "https://www.theguardian.com/world/2025/nov/07/orban-trump-flattery-white-house",
    "image": "https://media.guim.co.uk/4be112d7f38dfdc036189c3ab61c45379ac5c9bf/397_0_3236_2590/500.jpg",
    "summary": "Hungarian Prime Minister Viktor Orbán sought Donald Trump's assistance regarding oil sanctions on Russia. To secure Trump's support, he utilized a familiar approach. This move reflects Hungary's strategy in navigating international pressures related to energy policies.",
    "published": "2025-11-07T22:12:23Z"
  },
  {
    "title": "Pentagon is shifting weapons purchases to ‘a wartime footing’, Hegseth announces - live",
    "url": "https://www.theguardian.com/us-news/live/2025/nov/07/donald-trump-government-shutdown-air-traffic-flights-snap-viktor-orban-hungary-ukraine-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/f5a436a69ac84c2a2b267c43126d47630f13b4af/650_0_5043_4034/500.jpg",
    "summary": "In a recent speech, Hegesth declared the traditional defense acquisitions system obsolete, signaling a significant shift in how military procurement will be approached. He addressed industry leaders, military commanders, and officials, emphasizing the need for modernization. This statement suggests a move towards more innovative and adaptive methods in defense spending and acquisitions.",
    "published": "2025-11-07T22:10:44Z"
  },
  {
    "title": "Revealed: Qatar-linked intelligence operation targeted ICC prosecutor’s alleged victim",
    "url": "https://www.theguardian.com/law/2025/nov/06/qatar-linked-intelligence-operation-targeted-icc-prosecutor-karim-khan-alleged-victim",
    "image": "https://media.guim.co.uk/e9265b311d2846fe4a76fdeb31709fcab6e04bee/0_0_5000_4000/500.jpg",
    "summary": "A woman who accused Karim Khan of misconduct was reportedly the target of a covert operation by two British private intelligence firms. The operation aimed to gather information on her, raising concerns about privacy and tactics used against accusers. This revelation has sparked further scrutiny into the methods employed in high-profile cases of alleged misconduct.",
    "published": "2025-11-07T22:04:52Z"
  },
  {
    "title": "All Her Fault review – Sarah Snook’s terrifying thriller is an absolute pleasure to watch",
    "url": "https://www.theguardian.com/tv-and-radio/2025/nov/07/all-her-fault-review-sarah-snook-andrea-mara",
    "image": "https://media.guim.co.uk/94d66b1e6cc65deb7625fb97f759a278ce51621a/456_0_2501_2001/500.jpg",
    "summary": "In a gripping child kidnapping drama, the intricate plot weaves together seamlessly as it unfolds. Sarah Snook, known for her role in Succession, delivers a powerful performance as a mother searching for her missing son. The film expertly blends suspense and emotion, keeping audiences on the edge of their seats.",
    "published": "2025-11-07T22:00:45Z"
  },
  {
    "title": "Passengers start to feel bite of flight cuts amid US government shutdown",
    "url": "https://www.theguardian.com/world/2025/nov/07/passengers-face-global-disruption-as-flights-cut-amid-us-government-shutdown",
    "image": "https://media.guim.co.uk/a907e50c14d38bf4408bd279c3aac9e998d53803/500_0_5000_4000/500.jpg",
    "summary": "Travelers are facing significant disruptions as the longest shutdown in history persists, leaving many to alter their plans. The lack of a resolution has created uncertainty and frustration among those affected. As the shutdown drags on, people are seeking alternative solutions for their travel needs.",
    "published": "2025-11-07T21:39:41Z"
  }
]