[
  {
    "title": "Transfer deadline day: Isak deal agreed, Guéhi, Wissa, Donnarumma and more – live",
    "url": "https://www.theguardian.com/football/live/2025/sep/01/transfer-deadline-day-guehi-wissa-martinez-ederson-latest-and-more-live",
    "image": "https://media.guim.co.uk/6e28c81c68d5db1aab4bd20800d604dd8c0abcb1/237_0_1920_1536/500.jpg",
    "summary": "Niall McVeigh is providing a rolling report to keep readers updated on the latest developments for deadline day. Expect a variety of significant moves and news throughout the day. Stay tuned for live updates and insights.",
    "published": "2025-09-01T08:50:10Z"
  },
  {
    "title": "Zelenskyy says Ukraine will ‘remind everyone’ as Trump’s semi-deadline of end to war expires – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/sep/01/volodymyr-zelenskyy-ukraine-donald-trump-semi-deadline-war-end-europe-latest-updates-news-live",
    "image": "https://media.guim.co.uk/583df19ec50e9c9a7f4fb186ca14ef8c4ef2cacb/643_0_4998_3999/500.jpg",
    "summary": "At a recent summit in Alaska, Donald Trump announced he is nearing a breakthrough that could facilitate a meeting between Russian President Vladimir Putin and Ukrainian President Volodymyr Zelenskyy. He expressed optimism about the potential diplomatic progress. This statement highlights Trump's ongoing interest in international relations and conflict resolution.",
    "published": "2025-09-01T08:47:57Z"
  },
  {
    "title": "Women and childen to lose out most from Home Office plan to tighten rules on refugee family reunions, experts say – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/01/women-children-home-office-refugee-family-reunions-uk-politics-live-latest-updates-news",
    "image": "https://media.guim.co.uk/cc47c631a1ff2f3529b59cf416cffb2a701ba439/711_0_6880_5504/500.jpg",
    "summary": "The Refugee Council warns that proposed financial and language requirements for refugees could result in family separations or compel individuals to undertake perilous journeys. These measures could create significant barriers for those seeking safety. The organization emphasizes the need for more compassionate policies to protect vulnerable families.",
    "published": "2025-09-01T08:43:51Z"
  },
  {
    "title": "Afghanistan earthquake live: more than 800 dead after shallow quake strikes country’s east, state media reports",
    "url": "https://www.theguardian.com/world/live/2025/sep/01/afghanistan-earthquake-live-hundreds-after-shallow-quake-strikes-countrys-east-state-media-reports",
    "image": "https://media.guim.co.uk/4a505703b0a4050ac22ad1014630c49509de5ce0/0_0_2333_1867/500.jpg",
    "summary": "The ministry for public health reports that several villages in Kunar province have been \"completely destroyed.\" Rescue operations are currently underway in response to the disaster. Further details on the cause and impact of the situation are yet to be revealed.",
    "published": "2025-09-01T08:38:18Z"
  },
  {
    "title": "Profits surge at Royal Mail’s parent company after £3.6bn takeover by foreign owner – business live",
    "url": "https://www.theguardian.com/business/live/2025/sep/01/factory-activity-us-tariffs-uk-house-price-drop-mortgage-interest-rates-business-live-news-updates",
    "image": "https://media.guim.co.uk/356e75e891122c89cf682720896431a15220349f/344_0_3440_2752/500.jpg",
    "summary": "Manufacturing activity in the Asia-Pacific region saw a decline last month, indicating a slowdown in the sector. Simultaneously, UK house prices unexpectedly fell in August. These trends reflect broader economic challenges facing these regions.",
    "published": "2025-09-01T08:35:07Z"
  }
]