[
  {
    "title": "Bayern Munich 3-1 Chelsea: Champions League – live reaction",
    "url": "https://www.theguardian.com/football/live/2025/sep/17/bayern-munich-v-chelsea-champions-league-live",
    "image": "https://media.guim.co.uk/49e4cc71cbf22dc5848abf4e056f1ebbb98f341f/222_0_3111_2489/500.jpg",
    "summary": "Harry Kane scored two goals to help Bayern Munich defeat the Club World Cup champions. The match was closely monitored with a minute-by-minute report. Luke McLaughlin provided further reactions to the game.",
    "published": "2025-09-17T21:24:34Z"
  },
  {
    "title": "RFK Jr and red flags: key moments from ousted CDC director’s testimony",
    "url": "https://www.theguardian.com/us-news/2025/sep/17/cdc-director-susan-monarez-key-takeaways",
    "image": "https://media.guim.co.uk/89ad1bde92e70f278d1a70d335371e6242c4b522/456_0_4553_3643/500.jpg",
    "summary": "Susan Monarez provided testimony alongside former chief medical officer Debra Houry regarding the implications of vaccines and the influence of Robert F. Kennedy Jr. on public health. They discussed the potential threats posed by misinformation and vaccine hesitancy. Their insights underscore the importance of accurate health communication in combating public health challenges.",
    "published": "2025-09-17T21:18:08Z"
  },
  {
    "title": "Ex-US health official warns of RFK Jr’s risk to public health: ‘We’re going to see kids dying of vaccine-preventable diseases’ – live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/17/donald-trump-charlie-kirk-free-speech-nyt-cdc-rfk-epstein-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/588ddd7fb1bd97b4757b8f5ad8de5098e0fbfcb6/917_0_4583_3667/500.jpg",
    "summary": "Dr. Debra Houry and Susan Monarez have highlighted that the United States is inadequately prepared to prevent chronic diseases and to combat future pandemics. They emphasize the need for improved public health strategies and resources. Their statements underscore the urgency for systemic changes to enhance healthcare resilience.",
    "published": "2025-09-17T21:17:24Z"
  },
  {
    "title": "Liverpool 3-2 Atlético Madrid: Champions League – as it happened",
    "url": "https://www.theguardian.com/football/live/2025/sep/17/liverpool-v-atletico-madrid-champions-league-live",
    "image": "https://media.guim.co.uk/6326cdab48b808c492cdbd6850c02d4e3815f65d/735_858_1998_1598/500.jpg",
    "summary": "Liverpool initially dominated the match, but they gradually lost control as the game progressed. Despite this, they managed to regain their composure and secure a victory. The team's resilience ultimately led them to triumph.",
    "published": "2025-09-17T21:17:00Z"
  },
  {
    "title": "Misery for Postecoglou as Swansea stun Nottingham Forest with late turnaround",
    "url": "https://www.theguardian.com/football/2025/sep/17/swansea-nottingham-forest-carabao-cup-match-report",
    "image": "https://media.guim.co.uk/4cf493abbdce09d6c89eab3edfbb69bfe1e09976/1191_589_2422_1938/500.jpg",
    "summary": "Cameron Burgess netted a dramatic 97th-minute goal to secure a 3-2 victory for Swansea against Nottingham Forest in the Carabao Cup. Swansea made a remarkable comeback after trailing by two goals. Ange Postecoglou's Forest was unable to hold onto their lead.",
    "published": "2025-09-17T21:12:21Z"
  }
]