[
  {
    "title": "Australia news live: RBA chief upbeat on economy but warns of ‘uncertain’ future; murder charge after body found in Brisbane River",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/22/australia-news-live-anthony-albanese-new-york-israel-palestine-donald-trump-optus-triple-zero-ntwnfb",
    "image": "https://media.guim.co.uk/2e55cbc6564c2d831da74a390c3bcfad2162c629/814_0_4051_3243/500.jpg",
    "summary": "Please provide the news article or details you would like summarized, and I'll be happy to help!",
    "published": "2025-09-22T03:09:41Z"
  },
  {
    "title": "Kangaroo review – furry family feature is hard to hate",
    "url": "https://www.theguardian.com/film/2025/sep/22/kangaroo-film-review-furry-family-feature-is-hard-to-hate",
    "image": "https://media.guim.co.uk/753423b7d719efa8eaef76de49a08d89ab60b55c/2231_0_5168_4138/500.jpg",
    "summary": "The new children's film, directed by the creator of \"Looking for Alibrandi\" and co-written by Melina Marchetta, has a cheesy charm. While some elements may be a bit over the top, it features adorable joeys that add to its appeal. Overall, the film aims to entertain young audiences with its heartwarming themes.",
    "published": "2025-09-22T02:55:19Z"
  },
  {
    "title": "Kim Jong-un open to nuclear talks with US, saying he has ‘fond memories’ of previous Trump meeting",
    "url": "https://www.theguardian.com/world/2025/sep/22/kim-jong-un-nuclear-talks-fond-memories-donald-trump-meeting",
    "image": "https://media.guim.co.uk/a0c22d5442ec7e2f245b52f2c1995f7576a0cfbc/125_0_2678_2143/500.jpg",
    "summary": "North Korean leader has made comments amid discussions on potential diplomatic negotiations. South Korea's leader, Lee Jae Myung, indicated he might be open to a deal allowing North Korea to keep its nuclear weapons. This development highlights shifting perspectives in inter-Korean relations.",
    "published": "2025-09-22T02:23:53Z"
  },
  {
    "title": "Australia’s diminished world championships return fails to cloud athletics optimism | Jack Snape",
    "url": "https://www.theguardian.com/sport/2025/sep/22/australia-team-results-performance-world-athletics-championships-2025",
    "image": "https://media.guim.co.uk/d14bc3a925ac58809526475d41b394787127a278/358_0_6139_4913/500.jpg",
    "summary": "The high-performance director praised Tokyo's atmosphere, highlighting the rise of younger athletes like Gout Gout alongside the continued success of veteran competitors. This dual achievement offers optimism for the team's future. Overall, Tokyo showcased a blend of fresh talent and established excellence.",
    "published": "2025-09-22T02:08:57Z"
  },
  {
    "title": "Trump news at a glance: president calls Charlie Kirk a ‘martyr’ at memorial",
    "url": "https://www.theguardian.com/us-news/2025/sep/22/trump-administration-news-updates-latest",
    "image": "https://media.guim.co.uk/cef01400a5b0a2df154e5ccb8e91ee40230707c5/482_0_4823_3858/500.jpg",
    "summary": "On September 21, a president expressed strong disdain for his opponents, stating, \"I hate my opponents.\" Additionally, the widow of a man named Kirk publicly forgave his shooter, highlighting themes of compassion amid tragedy. Meanwhile, discussions arose about the Murdoch family's potential involvement in a deal concerning TikTok, reflecting ongoing shifts in the political landscape.",
    "published": "2025-09-22T00:47:22Z"
  }
]