[
  {
    "title": "Manchester United v Chelsea: Women’s Super League – live",
    "url": "https://www.theguardian.com/football/live/2025/oct/03/manchester-united-v-chelsea-womens-super-league-live",
    "image": "https://media.guim.co.uk/e3fef68ea462e9095578579e7cf8550ef15ecc16/201_63_2687_2151/500.jpg",
    "summary": "The champions are set to face their toughest challenge this season as they travel to Manchester United. The match promises to be an intense showdown, with both teams looking to secure a crucial victory. Join Scott Murray for a minute-by-minute report.",
    "published": "2025-10-03T19:14:01Z"
  },
  {
    "title": "‘We must not let hatred defeat us’: British Jews on their fears, hopes and sad sense that an attack was inevitable",
    "url": "https://www.theguardian.com/uk-news/2025/oct/03/british-jews-fears-hopes-manchester-synagogue-attack",
    "image": "https://media.guim.co.uk/8fff0e15e62e3317c57091ace44c19dd9c1a6d98/691_0_7200_5760/500.jpg",
    "summary": "Residents affected by Thursday's terror attack express deep frustration and lack of trust in the government's response. They feel that the measures taken are inadequate to ensure their safety and security. The community seeks more decisive and effective actions to address their concerns.",
    "published": "2025-10-03T19:13:45Z"
  },
  {
    "title": "Sean ‘Diddy’ Combs sentencing live: mogul’s children say he is ‘changed man’; prosecutor says he is casting himself as ‘victim’",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/03/sean-diddy-combs-sentencing-trial-conviction-latest-updates",
    "image": "https://media.guim.co.uk/275587ab041d168427a6e4ce98fef167deb4dc24/105_0_2812_2250/500.jpg",
    "summary": "Combs, convicted of prostitution charges in July, faces a potentially lengthy prison sentence. He is anticipated to make a statement in court. The situation is developing as the case progresses.",
    "published": "2025-10-03T19:13:32Z"
  },
  {
    "title": "Lammy heckled at vigil for Manchester synagogue attack; one victim died after apparently being hit by police bullet – latest",
    "url": "https://www.theguardian.com/uk-news/live/2025/oct/03/manchester-synagogue-attack-victims-adrian-daulby-melvin-cravitz-attacker-jihad-al-shamie-latest-news-updates",
    "image": "https://media.guim.co.uk/5347b15f89fa47dd6352daad2ae5a946f25a0b07/231_0_5423_4340/500.jpg",
    "summary": "The justice secretary is facing public backlash, with crowds gathering to express their outrage and chant \"shame on you\" during a vigil for victims of a recent terror attack. The gathering highlights communal grief and demand for accountability. Tensions are rising as the community seeks justice and support for those affected.",
    "published": "2025-10-03T19:13:20Z"
  },
  {
    "title": "US government shutdown: Senate rejects both funding bills again; White House threatens Portland aid cuts – live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/03/shutdown-congress-trump-senate-latest-updates",
    "image": "https://media.guim.co.uk/d163936223a09fe19ab2e49ad64ee6a2e33c9bb6/610_0_6103_4885/500.jpg",
    "summary": "Both Democrat and Republican stopgap bills have failed to prevent a government shutdown. Karoline Leavitt claims that the state endorses anarchy amidst the crisis. Meanwhile, the White House continues to attribute the shutdown to Democratic actions.",
    "published": "2025-10-03T19:12:31Z"
  }
]