[
  {
    "title": "Asylum seekers can remain at Epping hotel after Home Office wins appeal – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/aug/29/latest-live-uk-politics-news-updates-asylum-hotels-labour-conservatives-reform",
    "image": "https://media.guim.co.uk/69db6f531143c0c52f448704b7123eb50758b45e/396_137_3832_3066/500.jpg",
    "summary": "The Home Office and the owner of the Bell hotel are contesting an injunction issued by the local council, which aimed to prevent the accommodation of numerous asylum seekers at the hotel. The injunction could significantly impact the government's plans to house asylum seekers at the location. The legal challenge highlights ongoing tensions between local authorities and national immigration policies.",
    "published": "2025-08-29T14:33:14Z"
  },
  {
    "title": "Starmer names former Bank of England deputy governor as his chief economic adviser",
    "url": "https://www.theguardian.com/politics/2025/aug/29/starmer-names-former-bank-of-england-deputy-governor-as-his-chief-economic-adviser",
    "image": "https://media.guim.co.uk/c5dc4877178a31c4289faea7fc814302ad425ff2/539_0_4783_3827/500.jpg",
    "summary": "Nemat \"Minouche\" Shafik has been appointed to a key position following a series of economic missteps by the UK government. Her appointment is seen as a response to the growing criticism of economic management by Downing Street. Shafik's experience is expected to help address the ongoing economic challenges facing the country.",
    "published": "2025-08-29T14:33:00Z"
  },
  {
    "title": "IDF declares famine-hit Gaza City a combat zone, ending ‘tactical pauses’ that allowed limited food delivery – Middle East crisis live",
    "url": "https://www.theguardian.com/world/live/2025/aug/29/gaza-famine-israel-middle-east-lastest-news-updates",
    "image": "https://media.guim.co.uk/b1901bbed84a056f7f41f390f3d7f66a951b5bae/619_0_4715_3772/500.jpg",
    "summary": "Around one million Palestinians are anticipated to be displaced in a devastated city facing a declared famine. The worsening humanitarian crisis reflects escalating tensions and violence in the region. Efforts to provide aid and support to those affected are urgently needed.",
    "published": "2025-08-29T14:31:33Z"
  },
  {
    "title": "New Trump rule to ban VA abortions for veterans even in cases of rape and incest",
    "url": "https://www.theguardian.com/us-news/2025/aug/29/trump-veterans-affairs-abortion-ban",
    "image": "https://media.guim.co.uk/c82b7532b18695c01dbeb824d9f7a36e8b1813d9/333_0_3333_2667/500.jpg",
    "summary": "The Trump administration plans to restrict nearly all abortions, raising concerns given that a significant portion of female veterans—about one-third—are survivors of sexual assault. Critics argue this decision disregards the reproductive rights and health needs of these women. The move has sparked widespread debate over access to abortion services for vulnerable populations.",
    "published": "2025-08-29T14:30:43Z"
  },
  {
    "title": "Backlash as White House chooses Robert F Kennedy Jr deputy to run CDC – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/aug/29/cdc-robert-f-kennedy-jr-donald-trump-federal-reserve-lisa-cook-latest-us-politics-news-live-updates",
    "image": "https://media.guim.co.uk/413dc232b37a3613e5c8b3e89e532ae1c69565d8/1429_0_7200_5760/500.jpg",
    "summary": "Senators expressed strong outrage over the appointment of Jim O’Neill to replace Susan Monarez at the US Centers for Disease Control and Prevention. They raised concerns about the decision, indicating dissatisfaction with the leadership changes. The developments have sparked a significant debate about the agency's direction and oversight.",
    "published": "2025-08-29T14:30:21Z"
  }
]