[
  {
    "title": "News live: heavy rain breaks multiple records in Sydney; US influencer leaves Australia after ‘cruel’ crocodile stunts",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/11/australia-news-live-sydney-storm-weather-anthony-albanese-solomon-islands-pacific-sussan-ley-jacinta-nampijinpa-price-ntwnfb",
    "image": "https://media.guim.co.uk/c8893403d929728788bfe1beb357cd1fff86ce1a/57_0_1919_1536/500.jpg",
    "summary": "Please provide the news content you'd like me to summarize, and I'll be happy to help!",
    "published": "2025-09-11T03:08:47Z"
  },
  {
    "title": "Charlie Kirk shooting: Trump blames ‘radical left’, but does not mention attacks on Democrats as search for suspect continues – follow live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/10/donald-trump-jeffrey-epstein-tariffs-immigration-crime-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/2673fb19ee0d09b38b7c9c4de993bd283a9eb6e7/313_215_3046_2437/500.jpg",
    "summary": "In a recent Oval Office address, Trump promised retribution without addressing the murder of Melissa Hortman, the attack on Paul Pelosi, or threats made against Mike Pence. His speech focused on other topics, leaving out significant incidents of violence. This omission has drawn attention amid ongoing discussions about political violence.",
    "published": "2025-09-11T03:01:06Z"
  },
  {
    "title": "Orlando review – a heartwarming adaptation of Virginia Woolf’s time-travelling queer adventure",
    "url": "https://www.theguardian.com/stage/2025/sep/11/orlando-review-play-virginia-woolf-belvoir-st-theatre-sydney",
    "image": "https://media.guim.co.uk/b19003bd33a2d7d9b85e4683bdfd61a69d27b841/160_0_1600_1280/500.jpg",
    "summary": "A new adaptation of \"Orlando\" features four trans and non-binary actors playing the titular role, highlighting themes of sexual and gender fluidity. This inclusive casting aims to bring fresh perspectives to the classic story. The feelgood production seeks to celebrate diversity and challenge traditional norms.",
    "published": "2025-09-11T02:57:43Z"
  },
  {
    "title": "‘Despicable’: Republicans and Democrats condemn violence after Charlie Kirk killing",
    "url": "https://www.theguardian.com/us-news/2025/sep/10/charlie-kirk-shooting-reaction",
    "image": "https://media.guim.co.uk/cddc8dd3dc2dc420ef154842c3a7d21b1c26c808/240_0_3931_3145/500.jpg",
    "summary": "US lawmakers from both parties condemned the recent violence in America, emphasizing that it has no place in society. In response to the situation, former President Trump has ordered flags to be lowered. The bipartisan statement highlights the need for unity and peace amid turmoil.",
    "published": "2025-09-11T02:39:24Z"
  },
  {
    "title": "Marty Sheargold’s sexist comments about the Matildas breached decency rules, regulator finds",
    "url": "https://www.theguardian.com/media/2025/sep/11/marty-sheargold-sexist-matildas-comments-breached-decency-rules-regulator-finds",
    "image": "https://media.guim.co.uk/4204db9ad6eb1f7f0cf34a27ad664f082abcc029/187_362_2645_2116/500.jpg",
    "summary": "The Australian Communications and Media Authority (ACMA) criticized the Austereo network for broadcasting demeaning and sarcastic comments regarding women's sports. The remarks demonstrated a significant level of contempt and disdain towards female athletes and teams. This ruling highlights ongoing concerns about the portrayal of women in sports media.",
    "published": "2025-09-11T02:37:28Z"
  }
]