[
  {
    "title": "Supreme court to decide legality of Trump’s order to restrict birthright citizenship – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/dec/05/trump-pete-hegseth-signal-politics-updates",
    "image": "https://media.guim.co.uk/c55cb65a49483a4c16aed7253602e734516d69ec/456_0_4560_3648/500.jpg",
    "summary": "The court has not set a specific date for oral arguments, but they are expected to occur in the coming months. No further details about the case have been disclosed. Observers are anticipating updates as the timeline progresses.",
    "published": "2025-12-05T20:23:13Z"
  },
  {
    "title": "World Cup 2026 draw updates: England to meet Croatia, Brazil await Scotland, USA will face Australia – live",
    "url": "https://www.theguardian.com/football/live/2025/dec/05/world-cup-2026-draw-updates-usa-mexico-canada",
    "image": "https://media.guim.co.uk/e375aa0f1405face2949e5854c716080a2bd03a6/607_83_3860_3088/500.jpg",
    "summary": "Join our writers for live updates from the draw in Washington, D.C. for the upcoming 48-team tournament next summer. Don't miss out on the latest news and insights as teams are announced. Stay tuned for exciting developments!",
    "published": "2025-12-05T20:16:29Z"
  },
  {
    "title": "Jack and the Beanstalk review – ‘moooosical’ caper gives the cow’s eye view",
    "url": "https://www.theguardian.com/stage/2025/dec/05/jack-and-the-beanstalk-review-dundee-rep",
    "image": "https://media.guim.co.uk/5d585cd213058f8d2a1b396dad8a1ae2f617df2b/191_0_5600_4480/500.jpg",
    "summary": "The show, noted for its vibrant style and Brian Cox's narration, suffers from its portrayal of Jack's cynicism, mirroring his mother's outlook. This approach diminishes the emotional core of the narrative. Ultimately, it sacrifices depth for flair.",
    "published": "2025-12-05T20:00:33Z"
  },
  {
    "title": "Wretched start to six wins in a row: how Aston Villa turned their season around",
    "url": "https://www.theguardian.com/football/2025/dec/05/how-aston-villa-turned-season-around-arsenal-premier-league",
    "image": "https://media.guim.co.uk/ab6707f6ef0c1cabc91dde809025b60d2af09203/463_0_4341_3474/500.jpg",
    "summary": "The Premier League's top-performing team is set to face Arsenal at home, showcasing their exceptional form. Their experience on the field is emerging as a significant advantage. This match highlights the growing confidence and capabilities of the in-form side.",
    "published": "2025-12-05T20:00:32Z"
  },
  {
    "title": "Norris’ date with F1 destiny arrives as he aims to keep Verstappen and Piastri at bay",
    "url": "https://www.theguardian.com/sport/2025/dec/05/lando-norris-date-f1-destiny-max-verstappen-oscar-piastri-abu-dhabi-gp",
    "image": "https://media.guim.co.uk/45ce601387492f6cf6b9d6f31900ce3bdbd8f0a1/884_273_4299_3439/500.jpg",
    "summary": "The British driver, leading by 12 points ahead of the Abu Dhabi Grand Prix, remains focused on maintaining his advantage. He expresses commitment to improving, regardless of whether the championship title slips away. His competitive mindset emphasizes determination to perform better in future races.",
    "published": "2025-12-05T20:00:32Z"
  }
]