[
  {
    "title": "England chasing 320 to beat South Africa: Women’s Cricket World Cup semi-final – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/29/england-v-south-africa-womens-cricket-world-cup-semi-final-live",
    "image": "https://media.guim.co.uk/d8cb40acea05b9a21e9f9c4a29ee14e340702a00/425_0_5363_4293/500.jpg",
    "summary": "In a recent match, England faces a challenging target of 320 runs after South Africa's Laura Wolvaardt scored an impressive 169 runs. The game unfolds with an over-by-over report detailing the action. England's chase is set against a backdrop of a formidable performance by Wolvaardt.",
    "published": "2025-10-29T13:32:49Z"
  },
  {
    "title": "Pound slides on bleak outlook for UK public finances; mortgage approvals hit nine-month high – business live",
    "url": "https://www.theguardian.com/business/live/2025/oct/29/donald-trump-cut-fentanyl-tariff-chinese-goods-expects-great-deal-with-xi-jinping-federal-reserve-rate-cut-business-live",
    "image": "https://media.guim.co.uk/f8c2ed4a28db622323f4ef816adc85e016091f10/683_0_6827_5464/500.jpg",
    "summary": "Trump announced his intention to reduce tariffs on Chinese goods related to fentanyl. He expressed optimism about reaching a \"great deal\" with China's President Xi Jinping. The move aims to address the ongoing fentanyl crisis while improving trade relations.",
    "published": "2025-10-29T13:31:38Z"
  },
  {
    "title": "Trump fires federal arts board in charge of reviewing White House ballroom and ‘Arc de Trump’",
    "url": "https://www.theguardian.com/us-news/2025/oct/29/trump-fires-arts-board-arc-ballroom",
    "image": "https://media.guim.co.uk/b8b71ad7c6baa478cfedf24d533444552778345e/237_0_4165_3333/500.jpg",
    "summary": "All six members of the independent Commission of Fine Arts were reportedly dismissed on Tuesday. The decision comes amid ongoing discussions about the commission's effective role and governance. Details regarding the reasons for their dismissal have yet to be clarified.",
    "published": "2025-10-29T13:29:51Z"
  },
  {
    "title": "‘No Trump’ protests in South Korea as US president finalises trade deal with Lee Jae Myung - US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/29/donald-trump-south-korea-china-latest-news-updates-live",
    "image": "https://media.guim.co.uk/a84044e61de74d5f35143cb140c2b0f118a74b07/1263_0_6830_5464/500.jpg",
    "summary": "Progressive groups and opposition politicians staged an anti-US protest while expressing their concerns over US policies. Meanwhile, Donald Trump expressed optimism regarding an upcoming summit with China. The contrasting sentiments highlight differing views on international relations and domestic politics.",
    "published": "2025-10-29T13:29:49Z"
  },
  {
    "title": "Press Israel to release Marwan Barghouti, former world leaders urge Trump",
    "url": "https://www.theguardian.com/world/2025/oct/29/israel-release-marwan-barghouti-former-world-leaders-urge-trump",
    "image": "https://media.guim.co.uk/87234a5c0f107f16d269aca78a1f1c3227a1a3bf/95_0_3151_2523/500.jpg",
    "summary": "An elders group founded by Nelson Mandela and chaired by former Colombian President Juan Manuel Santos has expressed support for Palestinian leader Mahmoud Abbas. They believe he could serve as a 'unifying' figure in the region. The group's endorsement reflects a call for cohesive leadership in addressing the challenges faced by Palestinians.",
    "published": "2025-10-29T13:29:17Z"
  }
]