[
  {
    "title": "Nampijinpa Price accuses Liberal colleague of ‘cowardly’ conduct as Ley tries to limit fallout from offensive comments",
    "url": "https://www.theguardian.com/australia-news/2025/sep/07/jacinta-nampijinpa-price-indian-immigration-alex-hawke",
    "image": "https://media.guim.co.uk/2c6da7889525cc1f4d5ee23b4527c2baa695bef5/298_0_2983_2387/500.jpg",
    "summary": "Northern Territory senator accused Alex Hawke of berating her staff, expressing concerns over the treatment they received. She criticized some media coverage of her remarks, claiming it was driven by an agenda. The senator defended her comments amid the controversy.",
    "published": "2025-09-07T07:23:08Z"
  },
  {
    "title": "Merseyside derby in WSL, England reaction and Germany v Northern Ireland – matchday live",
    "url": "https://www.theguardian.com/football/live/2025/sep/07/merseyside-derby-in-wsl-england-reaction-and-germany-v-northern-ireland-matchday-live",
    "image": "https://media.guim.co.uk/3342438d93190f4f8805a32db14d81dc78d896c6/0_0_5000_4000/500.jpg",
    "summary": "Exciting football action is on the horizon with a full schedule in the Women's Super League (WSL). Additionally, Northern Ireland is preparing to face Germany in a crucial World Cup qualifier. Fans can expect thrilling matches and important outcomes in the upcoming fixtures.",
    "published": "2025-09-07T07:09:54Z"
  },
  {
    "title": "Antony a rare piece of spending for Spanish clubs unable to match Premier League’s wealth",
    "url": "https://www.theguardian.com/football/2025/sep/07/antony-a-rare-piece-of-spending-for-spanish-clubs-unable-to-match-premier-leagues-wealth",
    "image": "https://media.guim.co.uk/0ed58a9d4bc58d8b0f5ff411e4279d23c78778ca/209_0_3333_2667/500.jpg",
    "summary": "Real Betis fans celebrated the signing of a Manchester United player, bringing excitement to the club. However, like many teams in La Liga, they needed to sell some of their stars to finance the acquisition. This highlights the financial balancing act many clubs face in the league.",
    "published": "2025-09-07T07:00:18Z"
  },
  {
    "title": "Sorry, purists: the Coachella-fication of the US Open is here to stay",
    "url": "https://www.theguardian.com/sport/2025/sep/07/us-open-influencers-coachella-prices-money",
    "image": "https://media.guim.co.uk/d43f9eda916cbd7983744c2dd1c5d63231b978c1/474_0_4721_3779/500.jpg",
    "summary": "New York's major events have evolved into lifestyle carnivals, transforming from mere spectator experiences to social occasions where the act of attending is a status symbol. The focus has shifted from simply enjoying the event to being seen participating. This trend highlights the intertwining of entertainment and social visibility in contemporary urban culture.",
    "published": "2025-09-07T07:00:14Z"
  },
  {
    "title": "Vive les Socios: struggling French clubs open doors to shareholder fans in tough times",
    "url": "https://www.theguardian.com/football/2025/sep/07/french-clubs-shareholder-fans-socios",
    "image": "https://media.guim.co.uk/edbceece9a87eb04a2f0d3f07f130066644543de/186_131_3636_2908/500.jpg",
    "summary": "Fans are rallying to financially support their teams amid a financial crisis, reflecting a united front. This collective effort showcases the dedication and loyalty of supporters. The financial contributions aim to help teams navigate challenging economic conditions.",
    "published": "2025-09-07T07:00:14Z"
  }
]