[
  {
    "title": "Australia news live: Monash University to repay thousands of casual staff underpaid over almost a decade",
    "url": "https://www.theguardian.com/australia-news/live/2025/nov/28/australia-news-live-storms-hail-queensland-environment-laws-anthony-albanese-labor-greens-sussan-ley-coalition-ntwnfb",
    "image": "https://media.guim.co.uk/4bb05cf254a0d001887cc470a954f6597ff2f951/0_296_3244_2595/500.jpg",
    "summary": "I'm sorry, but I cannot summarize news without the specific content or details. Please provide the information or news article you would like summarized.",
    "published": "2025-11-28T05:20:01Z"
  },
  {
    "title": "Budget 2025: your questions about your finances answered",
    "url": "https://www.theguardian.com/uk-news/2025/nov/28/budget-2025-your-questions-about-your-finances-answered",
    "image": "https://media.guim.co.uk/4be43872009262fe408c59f0cf518aa2d7783110/2413_573_3299_2640/500.jpg",
    "summary": "The article explores the impact of recent tax rate changes and measures on various financial aspects, including pensions, savings, and car tax. It addresses specific inquiries from individuals regarding how these adjustments will affect their finances. Overall, it aims to clarify the implications of the new tax framework on everyday financial decisions.",
    "published": "2025-11-28T05:00:56Z"
  },
  {
    "title": "‘We had six MPs and four factions’: inside Your Party’s toxic power struggles",
    "url": "https://www.theguardian.com/politics/2025/nov/28/your-party-rifts-power-struggles-jeremy-corbyn-zarah-sultana",
    "image": "https://media.guim.co.uk/fc2b1318aa50ebf0b9a4c748b00cd003f4ad9d1b/281_0_2829_2264/500.jpg",
    "summary": "Jeremy Corbyn faces criticism for being non-committal regarding the project's success. Meanwhile, some attribute challenges to Zarah Sultana's confrontational approach. The differing opinions highlight internal tensions within the initiative.",
    "published": "2025-11-28T05:00:56Z"
  },
  {
    "title": "Germany raised its citizens to hate war. Now it wants us to enlist in the army – but we say no | Mithu Sanyal",
    "url": "https://www.theguardian.com/commentisfree/2025/nov/28/germany-war-army-national-service-citizens-ukraine-europe",
    "image": "https://media.guim.co.uk/dd06d1dedb3493fa2c8db16da450caed505a3ebd/1420_0_6189_4953/500.jpg",
    "summary": "German academic Mithu Sanyal argues that the war in Ukraine is a crime and emphasizes the need for European leaders to prioritize peace efforts. She criticizes the focus on preparing young people for conflict instead of fostering dialogue and resolution. Sanyal's statements highlight the urgency for a shift in approach towards addressing the ongoing crisis.",
    "published": "2025-11-28T05:00:56Z"
  },
  {
    "title": "‘Is this doable?’: why political paralysis threatens an ambitious Brussels arts complex",
    "url": "https://www.theguardian.com/world/2025/nov/28/brussels-political-paralysis-threatens-ambitious-kanal-arts-complex",
    "image": "https://media.guim.co.uk/77f4a12ac6572f08cf21e65b96426eeff2ba8cff/1848_1733_4714_3771/500.jpg",
    "summary": "Kanal is 95% complete and on track for completion, but recent budget cuts have shifted discussions about its opening from a focus on timing to uncertainty. Concerns about financial constraints raise questions about whether it will open at all. The project's future remains in doubt as stakeholders evaluate the implications of reduced funding.",
    "published": "2025-11-28T05:00:55Z"
  }
]