[
  {
    "title": "England chasing 179 to beat Bangladesh: Women’s Cricket World Cup – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/07/england-v-bangladesh-womens-cricket-world-cup-live",
    "image": "https://media.guim.co.uk/dad816dd737022c599ed3bea04604c65948b094e/188_0_2302_1841/500.jpg",
    "summary": "Nat Sciver-Brunt's team aims to continue their momentum following a decisive victory against South Africa. Writers provide live updates and coverage of the ongoing match. Fans can expect an exciting performance as the team seeks to build on their recent success.",
    "published": "2025-10-07T13:29:04Z"
  },
  {
    "title": "Israel marks two years since 7 October Hamas attack as Gaza ceasefire talks continue – live",
    "url": "https://www.theguardian.com/world/live/2025/oct/07/gaza-ceasefire-peace-talks-israel-hamas-egypt-7-october-anniversary-middle-east-crisis-live-news-updates",
    "image": "https://media.guim.co.uk/88f96cf76ce349adfdc52cdcd4d2cb2f1eb2e7e4/1108_250_6296_5037/500.jpg",
    "summary": "Israelis commemorated the second anniversary of the devastating Hamas-led attack that resulted in the deaths of 1,200 people. Memorial events honored the victims and reflected on the impact of the tragedy. The occasion serves as a poignant reminder of ongoing tensions in the region.",
    "published": "2025-10-07T13:26:02Z"
  },
  {
    "title": "Bondi expected to be grilled about use of justice department to investigate Trump’s political enemies – live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/07/donald-trump-national-guard-pam-bondi-mark-carney-government-shutdown-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/cebf7d2e7625588e8538f926b5e3df11e8463900/1268_1018_4988_3993/500.jpg",
    "summary": "Former Attorney General William Barr testified before the Senate Judiciary Committee, where he is anticipated to face criticism from Democrats regarding the Justice Department's direction during his tenure. Barr's leadership decisions, particularly in politically charged cases, are likely to be scrutinized. The hearing reflects ongoing tensions between the former administration and congressional Democrats over issues of justice and accountability.",
    "published": "2025-10-07T13:25:48Z"
  },
  {
    "title": "Marjorie Taylor Greene open to healthcare deal with Democrats amid shutdown",
    "url": "https://www.theguardian.com/us-news/2025/oct/07/marjorie-taylor-greene-government-shutdown-healthcare",
    "image": "https://media.guim.co.uk/a5ddae735b547a31395ee1b36805ede86e4ee452/367_0_3332_2666/500.jpg",
    "summary": "A Republican politician has expressed her strong discontent with increasing insurance premiums. She is considering defying her party's stance due to the expiration of tax credits. This indicates a potential shift in her position on the issue amidst rising healthcare costs.",
    "published": "2025-10-07T13:21:34Z"
  },
  {
    "title": "NHS could cease to function under Labour’s new visa rules, say nurses",
    "url": "https://www.theguardian.com/uk-news/2025/oct/06/nhs-social-care-labour-new-visa-rules-royal-college-of-nursing",
    "image": "https://media.guim.co.uk/fd71a7ff837040df2f526d52d5805940fb535173/54_0_6453_5163/500.jpg",
    "summary": "The Royal College of Nursing criticized proposed plans to tighten regulations for foreign workers, branding them as an attempt to appease the political party Reform UK. The organization argues that such measures could exacerbate the existing staffing shortages in the healthcare sector. They urge a more constructive approach to addressing workforce challenges.",
    "published": "2025-10-07T13:15:50Z"
  }
]