[
  {
    "title": "Tory-Reform election pact would be ‘alliance of austerity and failure’, says Starmer – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/dec/03/nigel-farage-deal-tories-conservatives-pact-kemi-badenoch-labour-keir-starmer-pmqs-uk-politics-news-live",
    "image": "https://media.guim.co.uk/31bfd1ad1eab3fdcf35c253f8f4ec9f8c54e302d/432_0_4583_3667/500.jpg",
    "summary": "Prime Minister has addressed reports suggesting Nigel Farage indicated that the Reform Party is open to making an electoral deal with the Conservatives. The remarks come amid discussions about potential alliances ahead of upcoming elections. The Prime Minister emphasizes the importance of strategic partnerships in the political landscape.",
    "published": "2025-12-03T15:24:16Z"
  },
  {
    "title": "UK using more wood to make electricity than ever, Drax figures show",
    "url": "https://www.theguardian.com/business/2025/dec/03/uk-using-more-wood-to-make-electricity-than-ever-drax-figures-show",
    "image": "https://media.guim.co.uk/44cd2339219f1451f72216d7397de9abc85afc57/403_0_4381_3505/500.jpg",
    "summary": "In July, a giant biomass plant reported that burning wood pellets accounted for 9% of the UK's electricity supply, marking the highest monthly share recorded to date. This milestone highlights the increasing reliance on biomass energy in the country's energy mix. The trend may impact discussions on renewable energy sources and sustainability in the UK.",
    "published": "2025-12-03T15:21:20Z"
  },
  {
    "title": "Labour planned in opposition how to introduce assisted dying via private member’s bill",
    "url": "https://www.theguardian.com/society/2025/dec/03/labour-planned-in-opposition-introduce-assisted-dying-via-private-members-bill",
    "image": "https://media.guim.co.uk/589cfcbc125e05b8016f9bd653d07213fa89a75f/885_0_6720_5376/500.jpg",
    "summary": "A leaked document has surfaced, suggesting significant government influence over MP Kim Leadbeater's proposed legislation. The revelations have sparked concerns about the extent of political control in shaping the bill. Critics argue that this undermines the independence of parliamentary processes.",
    "published": "2025-12-03T15:15:41Z"
  },
  {
    "title": "Thames Water profits surge on higher bills; Prada buys Versace for $1.4bn – as it happened",
    "url": "https://www.theguardian.com/business/live/2025/dec/03/thames-water-profits-surge-higher-bills-prada-buys-versace-for-14bn-business-live-news",
    "image": "https://media.guim.co.uk/701b16c64b62c73d63238cd2ab586e61606e5a2d/130_0_2844_2275/500.jpg",
    "summary": "The latest economic and financial news highlights key market trends, economic indicators, and global developments. Analysts are closely monitoring inflation rates, interest rate changes, and their impact on various sectors. Ongoing geopolitical events are also influencing market volatility and investor sentiment.",
    "published": "2025-12-03T15:11:38Z"
  },
  {
    "title": "Trump’s homeland security department announces New Orleans immigration operation – live",
    "url": "https://www.theguardian.com/us-news/live/2025/dec/03/donald-trump-somali-immigrants-ice-minnesota-pete-hegseth-caribbean-boats-venezuela-us-politics-live-latest-news-updates",
    "image": "https://media.guim.co.uk/e25f1024859f7ea73372990f1270c1b61acef259/715_0_7149_5719/500.jpg",
    "summary": "The Department of Homeland Security (DHS) has announced plans to focus on apprehending \"criminal illegal aliens\" who are not being detained due to sanctuary policies in Democratic-led cities. This initiative aims to enhance enforcement against individuals deemed a threat to public safety. The announcement reflects ongoing tensions between federal immigration enforcement and local jurisdictions that prioritize protective measures for undocumented immigrants.",
    "published": "2025-12-03T15:07:34Z"
  }
]