[
  {
    "title": "Tom Phillips shooting: NZ police race to find children before nightfall after fugitive father shot dead by police – latest updates",
    "url": "https://www.theguardian.com/world/live/2025/sep/08/tom-phillips-shooting-live-updates-nz-police-search-for-children-of-fugitive-father-shot-new-zealand-police-latest-updates",
    "image": "https://media.guim.co.uk/f9f0a59a0229d41651191bed78ddca513eae7f2c/0_11_750_600/500.jpg",
    "summary": "A fugitive father, who had been on the run with his children for four years, was shot by police during an attempted burglary in Piopio. Authorities are now actively searching for two of his missing children. The incident has raised concerns over their safety and whereabouts.",
    "published": "2025-09-08T05:33:40Z"
  },
  {
    "title": "News live: Adam Bandt named CEO of Australian Conservation Foundation; tagged great white shark detected off Sydney’s Manly beach",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/08/australia-news-live-erin-patterson-mushroom-murders-trial-sentencing-blood-moon-pictures-shark-net-beach-ntwnfb",
    "image": "https://media.guim.co.uk/06c79717d5ea7aeb786df67eca6f70f6038f2635/708_0_4331_3465/500.jpg",
    "summary": "I'm sorry, but I need the content or details of the news article you want summarized. Please provide the information, and I'll be happy to help!",
    "published": "2025-09-08T05:32:02Z"
  },
  {
    "title": "TV tonight: Mark Ruffalo stars in new drama by Mare of Easttown creator",
    "url": "https://www.theguardian.com/tv-and-radio/2025/sep/08/tv-tonight-mark-ruffalo-stars-as-fbi-agent-in-fantastic-new-drama",
    "image": "https://media.guim.co.uk/bf4702bd62c10e4743ea40ebfb1dec0ac8368c2c/1470_423_4412_3530/500.jpg",
    "summary": "An FBI agent grapples with personal issues in a complex crime series perfect for cozy autumn nights. Additionally, Stacey Dooley profiles the ‘Benefits Queen’ in another engaging watch. Tune in for compelling storytelling this evening.",
    "published": "2025-09-08T05:20:40Z"
  },
  {
    "title": "MTV VMAs 2025 winners: Lady Gaga, Ariana Grande and Sabrina Carpenter triumph at muted award ceremony",
    "url": "https://www.theguardian.com/music/2025/sep/08/vmas-2025-winners-lady-gaga-ariana-grande-sabrina-carpenter-award-ceremony-mtv",
    "image": "https://media.guim.co.uk/78c26779a7caaa032023b8de34328eefb9a8204d/411_0_5104_4084/500.jpg",
    "summary": "During a night celebrating female artists, Mariah Carey received a lifetime achievement award, while singers were recognized with two trophies each. The event highlighted the contributions of women in music. Overall, the ceremony marked a significant recognition of female talent in the industry.",
    "published": "2025-09-08T05:07:01Z"
  },
  {
    "title": "Reshuffle it how you like, Starmer’s ‘grownup’ Labour has the Tory whiff of spiteful incompetence | Nesrine Malik",
    "url": "https://www.theguardian.com/commentisfree/2025/sep/08/keir-starmer-reshuffle-labour-tory-reform",
    "image": "https://media.guim.co.uk/08e4f52607dee7057f10a341997d1bba8653cacf/614_0_4468_3574/500.jpg",
    "summary": "Nesrine Malik, writing for The Guardian, critiques the ongoing cycles of political turmoil marked by harsh rhetoric and strict measures. She highlights the persistent challenges society faces, suggesting that these trends are propelling us toward a future defined by reform. The commentary reflects a sense of urgency in addressing these issues.",
    "published": "2025-09-08T05:00:43Z"
  }
]