[
  {
    "title": "Worcestershire v Nottinghamshire, Surrey v Warwickshire and more: county cricket, day four – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/11/worcestershire-v-nottinghamshire-surrey-v-warwickshire-and-more-county-cricket-day-four-live",
    "image": "https://media.guim.co.uk/1581c6001aa5286f6d2745bc3bd9765be03d277b/0_157_2449_1959/500.jpg",
    "summary": "Tanya Aldred provides live updates on the concluding day of the latest County Championship matches. Follow along for insights and key moments from the games. Stay tuned for the final results and highlights as the matches wrap up.",
    "published": "2025-09-11T10:37:35Z"
  },
  {
    "title": "Peter Mandelson sacked for saying Epstein’s first conviction was wrong, minister says – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/11/peter-mandelson-keir-starmer-deputy-labour-leader-uk-politics-latest-news",
    "image": "https://media.guim.co.uk/c07d84b6f076607ac3574c51f6231bdbd5c70ef6/1437_592_5194_4154/500.jpg",
    "summary": "A Foreign Office minister has described the ex-ambassador's claim that Epstein's conviction was wrongful as \"new information.\" This statement highlights ongoing discussions about the details of Epstein's legal situation. The implication of this comment may prompt further investigation or scrutiny into the circumstances of the conviction.",
    "published": "2025-09-11T10:36:40Z"
  },
  {
    "title": "Former EU diplomats urge suspension of bloc’s co-operation agreement with Israel",
    "url": "https://www.theguardian.com/world/2025/sep/11/former-eu-diplomats-urge-suspension-of-blocs-co-operation-agreement-with-israel",
    "image": "https://media.guim.co.uk/444200eac91051a6592b681153bc38d490a585e7/402_0_3541_2833/500.jpg",
    "summary": "Over 300 signatories have urged for a stronger response to the ongoing conflict in Gaza, emphasizing the need for a more decisive action. They advocate for greater recognition of Palestine amid the escalating violence. The call reflects growing international concern over the humanitarian crisis in the region.",
    "published": "2025-09-11T10:32:45Z"
  },
  {
    "title": "From lethal sex to gore-soaked dinners: Downton Abbey’s best and worst bits",
    "url": "https://www.theguardian.com/tv-and-radio/2025/sep/11/downton-abbey-best-and-worst-bits-from-lethal-sex-to-gore-soaked-dinner-guests",
    "image": "https://media.guim.co.uk/d59dbe1554cc85fcb77a1cfbeac785eb82b0e63f/265_0_2528_2022/500.jpg",
    "summary": "After 15 years, the beloved period drama and its final spin-off film reflect on its tumultuous journey filled with soap-based injuries and tragic festive deaths. Prominent moments include actor Hugh Bonneville's dramatic vomiting scene. The series concludes, leaving a legacy of highs and lows.",
    "published": "2025-09-11T10:32:43Z"
  },
  {
    "title": "Larry Ellison: Oracle co-founder who overtook Musk as world’s richest person",
    "url": "https://www.theguardian.com/us-news/2025/sep/11/who-is-larry-ellison-richest-person-oracle",
    "image": "https://media.guim.co.uk/7ccfb3291e2717ac21e345453b09911fd1e64194/817_0_4362_3490/500.jpg",
    "summary": "A tycoon who briefly surpassed Elon Musk in wealth is a close friend of Donald Trump and owns an island in Hawaii. He is also the father of the executive who recently took over CBS. This combination of wealth, political ties, and family connections highlights his influence in multiple sectors.",
    "published": "2025-09-11T10:28:54Z"
  }
]