[
  {
    "title": "Labour MPs will be despondent after Rayner and Mandelson departures, says cabinet minister – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/12/uk-politics-latest-news-peter-mandelson-labour-keir-starmer-angela-rayner",
    "image": "https://media.guim.co.uk/95e8e572ca2e33ef0b5a5d45051acab3d36b78c1/0_0_4447_3558/500.jpg",
    "summary": "Scotland Secretary Douglas Alexander expressed that the departure of Rayner has deeply affected MPs, who are feeling a strong sense of loss. He emphasized the emotional impact of her exit on the parliamentary community. The sentiment reflects the significant role Rayner played in their collective work.",
    "published": "2025-09-12T08:42:05Z"
  },
  {
    "title": "Pound dips after UK economy grinds to a halt in July with no growth in GDP – business live",
    "url": "https://www.theguardian.com/business/live/2025/sep/12/uk-gdp-report-economy-july-tariffs-inflation-consumer-confidence-business-live",
    "image": "https://media.guim.co.uk/c6be9b8c1d79a51bd79ae817a30de8a7c44a0aad/166_0_4934_3948/500.jpg",
    "summary": "UK GDP remained unchanged in July, indicating a stagnant economy, according to a Treasury spokesperson. This situation highlights concerns about economic growth and stability. The spokesperson noted that the economy \"does feel stuck\" at this time.",
    "published": "2025-09-12T08:40:20Z"
  },
  {
    "title": "Poland says Russia’s drone incursion ‘wasn’t a mistake’ after Trump’s speculation – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/sep/12/poland-russia-drones-ukraine-war-latest-news-europe-live",
    "image": "https://media.guim.co.uk/2bfaa88f8859cb90b156ce2f72ebab120bda5c00/197_0_2380_1904/500.jpg",
    "summary": "Donald Trump downplayed a situation on Thursday night, suggesting it might have been a \"mistake.\" His comments appeared dismissive, reflecting his typical approach to controversies. The context of the mistake was not detailed.",
    "published": "2025-09-12T08:33:42Z"
  },
  {
    "title": "Charlie Kirk’s killer still at large as video of suspect released – live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/12/charlie-kirk-shooter-suspect-latest-news-updates-donald-trump-utah",
    "image": "https://media.guim.co.uk/ca8554f3ef7bb4b9452f7942dced10abb093acdf/58_0_6000_4800/500.jpg",
    "summary": "Utah's governor emphasized the vital role of public assistance in ongoing investigations, noting the FBI has received over 7,000 tips and leads. He highlighted the collaborative effort needed between the community and authorities. The call for public involvement underscores the significance of collective action in solving cases.",
    "published": "2025-09-12T08:32:31Z"
  },
  {
    "title": "Premier League team news, press conferences and more: football news – live",
    "url": "https://www.theguardian.com/football/live/2025/sep/12/premier-league-buildup-press-conferences-team-news-live",
    "image": "https://media.guim.co.uk/440564add475f106cdc3ab7c5e852b13a7257b69/789_0_4560_3648/500.jpg",
    "summary": "Niall McVeigh will provide updates on the Premier League as it resumes after the international break. Fans can expect the latest news and developments from the league. Tune in for insights and analysis on upcoming matches and player performances.",
    "published": "2025-09-12T08:27:24Z"
  }
]