[
  {
    "title": "Danish authorities will acquire ‘enhanced capabilities’ after drones shut down Aalborg airport – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/sep/25/aalborg-airport-denmark-drones-oslo-sarkozy-meloni-news-updates-europe-live",
    "image": "https://media.guim.co.uk/c2b71d508f522cc7f06f331051bc963187c60757/668_0_4140_3313/500.jpg",
    "summary": "Denmark's justice and defense ministers have expressed concerns about the persistent threat of hybrid incidents following a second drone encounter in Danish airspace within the week. They emphasized the need for heightened awareness and preparedness against such challenges. The government is taking the situation seriously as these incidents underscore evolving security risks.",
    "published": "2025-09-25T07:30:10Z"
  },
  {
    "title": "Australia news live: Greens call for review of Optus’s telco licence; Tasmanian politicians approve their own $30,000 pay rise",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/25/australia-news-live-penny-wong-anthony-albanese-climate-crisis-united-nations-donald-trump-turkey-cop-politics-ntwnfb",
    "image": "https://media.guim.co.uk/583bda446153d46e7869054b5cd291c26c9b4142/697_0_6880_5504/500.jpg",
    "summary": "It appears you haven't provided specific news content for summarization. Please share the details or text you'd like me to summarize!",
    "published": "2025-09-25T07:28:03Z"
  },
  {
    "title": "Burnham says MPs are privately urging him to challenge Starmer for Labour leadership",
    "url": "https://www.theguardian.com/politics/2025/sep/25/andy-burnham-mps-challenge-starmer-labour-leadership-prime-minister-greater-manchester-mayo",
    "image": "https://media.guim.co.uk/6a89f0e5950f5b56382f9799a8495ddf4f67bf19/643_0_4355_3486/500.jpg",
    "summary": "The Mayor of Greater Manchester has criticized Downing Street for fostering a \"climate of fear\" among the public. He calls for comprehensive changes to address the issues at hand. His remarks highlight concerns over government policies and their impact on communities.",
    "published": "2025-09-25T07:18:00Z"
  },
  {
    "title": "New NDIS needs assessments will use technology to simplify process but advocacy groups hesitant about change",
    "url": "https://www.theguardian.com/australia-news/2025/sep/25/new-ndis-assessments-using-technology-simplify-process-advocacy-groups-hesitant-about-change",
    "image": "https://media.guim.co.uk/c98b6ee5f7ad7532a48aad376f31405760834cfb/724_54_4298_3439/500.jpg",
    "summary": "A new model has been introduced whereby participants will undergo interviews lasting up to three hours. They are no longer required to submit supporting documents for their applications. This change aims to streamline the process and reduce administrative burdens.",
    "published": "2025-09-25T07:13:04Z"
  },
  {
    "title": "Co-op reveals cyber-attack cost it £80m in profits; government ponders support for JLR suppliers – business live",
    "url": "https://www.theguardian.com/business/live/2025/sep/25/co-op-cyber-attack-cost-it-80m-profits-loss-government-support-jlr-suppliers-business-live-news",
    "image": "https://media.guim.co.uk/c655d5a52167670d2af5de42723cd3f8ecb6f950/588_0_4072_3257/500.jpg",
    "summary": "The Co-operative Group announced that a recent cyber attack resulted in a loss of £206 million in revenue. The hack has raised concerns over cybersecurity within the retail sector. Ongoing coverage highlights the broader implications for the economy and financial landscape.",
    "published": "2025-09-25T07:10:47Z"
  }
]