[
  {
    "title": "Farage claims there is ‘threat to public order’ if small boats issue is not resolved – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/aug/26/nigel-farage-mass-deportations-reform-migration-small-boats-uk-politics-live",
    "image": "https://media.guim.co.uk/f9f70cbbcf632f4d86be8ec69fbf36dcc213c995/700_0_6480_5184/500.jpg",
    "summary": "Nigel Farage has announced Reform UK's proposal for mass deportations, aiming to repeal human rights legislation. The plan includes the ability to detain up to 24,000 illegal migrants simultaneously. This initiative is set to be a key focus if the party secures victory in the upcoming election.",
    "published": "2025-08-26T10:20:03Z"
  },
  {
    "title": "Israeli security cabinet to discuss Gaza and hostage deal amid families’ protests – Middle East crisis live",
    "url": "https://www.theguardian.com/world/live/2025/aug/26/israel-gaza-protest-hostage-war-hospital-benjamin-netanyahu-latest-live-news-updates",
    "image": "https://media.guim.co.uk/b1c715739878d468a640a7031f1d7049f7bbdac3/551_0_4585_3668/500.jpg",
    "summary": "Relatives of hostages gathered in Hostages Square, Tel Aviv, to hold a press conference. They delivered emotional speeches calling for action and support for their loved ones. The event aimed to raise awareness about the plight of the captives.",
    "published": "2025-08-26T10:18:22Z"
  },
  {
    "title": "Trump’s attempt to fire Federal Reserve chief denounced as ‘authoritarian power grab’ - US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/aug/26/trump-federal-reserve-lisa-cook-news-updates-us-politics-live",
    "image": "https://media.guim.co.uk/8c0d132cafe709eddec2a9ad2e44629b19958282/0_0_3000_2400/500.jpg",
    "summary": "Former President Donald Trump is accused of fabricating mortgage fraud allegations against economist Lisa Cook, leading to strong backlash from prominent Democrats. The accusations appear to be motivated by Cook’s recent advocacy for financial reforms. The situation has sparked a heated debate about political tactics and accountability.",
    "published": "2025-08-26T10:12:55Z"
  },
  {
    "title": "Analysing the early form of three Women’s Rugby World Cup favourites",
    "url": "https://www.theguardian.com/sport/2025/aug/26/rugby-union-womens-world-cup-england-new-zealand-canada-form",
    "image": "https://media.guim.co.uk/b035d1642877a58d7d8ee13532fd894acd032fa6/1205_0_6073_4860/500.jpg",
    "summary": "England, New Zealand, and Canada all secured victories in their recent matches. Despite the wins, each team showed areas needing improvement. The performance gaps could be critical ahead of future competitions.",
    "published": "2025-08-26T10:11:00Z"
  },
  {
    "title": "World Sevens Football coming to Fort Lauderdale in December, with NWSL teams in talks to participate",
    "url": "https://www.theguardian.com/football/2025/aug/26/world-sevens-football-fort-lauderdale",
    "image": "https://media.guim.co.uk/e986e44c12b12909430dbb2717d09082a4d81842/0_14_4448_3558/500.jpg",
    "summary": "A new seven-a-side competition launched in May, featuring a substantial prize pool of $5 million for participating teams. The tournament aims to attract top talent and exciting gameplay. Teams are eager to compete for the lucrative financial rewards.",
    "published": "2025-08-26T10:10:00Z"
  }
]