[
  {
    "title": "Nottinghamshire close on title against Warwickshire: county cricket final round – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/25/nottinghamshire-close-on-title-against-warwickshire-county-cricket-final-round-live",
    "image": "https://media.guim.co.uk/33647d31b655e49b766f871eb12fe218ac4a2b74/167_0_2250_1800/500.jpg",
    "summary": "Tanya Aldred provides updates from various grounds during the final round of this season's County Championship matches. Fans can look forward to the latest developments and key moments from the games. Stay tuned for highlights as teams compete for the championship title.",
    "published": "2025-09-25T11:15:46Z"
  },
  {
    "title": "Former French president Nicolas Sarkozy sentenced to five years in prison in Libya campaign-financing trial – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/sep/25/aalborg-airport-denmark-drones-oslo-sarkozy-meloni-news-updates-europe-live",
    "image": "https://media.guim.co.uk/f8a4a6f58e1e5f8ac15c7aff8978620b91dcb23d/542_150_3599_2879/500.jpg",
    "summary": "Former French President Nicolas Sarkozy has been found guilty of criminal conspiracy for accepting millions of euros from the late Libyan dictator Muammar Gaddafi during his presidential campaign in 2007. The court's ruling highlights the illicit funding involved in Sarkozy's political rise. He is facing a prison sentence, marking a significant fall from grace for the former leader.",
    "published": "2025-09-25T11:11:00Z"
  },
  {
    "title": "Former FBI director James Comey expected to be indicted on criminal charges, reports say – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/25/donald-trump-james-comey-fbi-ice-texas-latest-us-politics-news-updates-live",
    "image": "https://media.guim.co.uk/06d86fd2cedd69e78aec01568d1e34b60983c567/1435_0_4484_3588/500.jpg",
    "summary": "James Comey, former FBI Director, has been a target of Donald Trump's criticism since he was dismissed from his position in the early days of Trump's presidency. The dismissal was linked to Comey's investigation into Russian interference in the 2016 election. Trump's ongoing attacks have kept Comey in the public eye and in the political discourse.",
    "published": "2025-09-25T11:09:16Z"
  },
  {
    "title": "Cyber-attacks latest: Co-op expects hack will wipe out £120m of profits; government urged to give loans to Jaguar Land Rover suppliers – business live",
    "url": "https://www.theguardian.com/business/live/2025/sep/25/co-op-cyber-attack-cost-it-80m-profits-loss-government-support-jlr-suppliers-business-live-news",
    "image": "https://media.guim.co.uk/c655d5a52167670d2af5de42723cd3f8ecb6f950/588_0_4072_3257/500.jpg",
    "summary": "The Co-op has disclosed that a cyber attack resulted in a loss of £206 million in revenue. The incident is part of ongoing coverage of significant economic and financial developments. The impact of the hack raises concerns about cybersecurity in the retail sector.",
    "published": "2025-09-25T11:07:43Z"
  },
  {
    "title": "Igor Jesus stakes claim to usurp Chris Wood as Forest convert to Ange-ball",
    "url": "https://www.theguardian.com/football/2025/sep/25/igor-jesus-chris-wood-nottingham-forest-ange-postecoglou",
    "image": "https://media.guim.co.uk/efb51161c70a36f8303d6e6fb912197844d18734/334_19_2152_1721/500.jpg",
    "summary": "New head coach Ange Postecoglou faces a tough decision regarding player selection after a standout performance from the Brazilian forward, who scored twice in Seville. The player's impressive form may make it challenging to keep him out of the lineup. Postecoglou's choices will be scrutinized as he aims to build a successful team.",
    "published": "2025-09-25T11:01:03Z"
  }
]