[
  {
    "title": "Nottinghamshire v Warwickshire, tributes paid to Dickie Bird, and more: county cricket – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/24/nottinghamshire-v-warwickshire-hampshire-v-surrey-and-more-county-cricket-live",
    "image": "https://media.guim.co.uk/f7c819d4564a071a70a2cdc4eb76f9843b27575e/282_0_4767_3814/500.jpg",
    "summary": "Notts aims to secure the County Championship title against Surrey as the season's final round begins. Tanya Aldred will provide updates throughout the first day of this crucial match. Tension builds as the outcome could determine the championship victor.",
    "published": "2025-09-24T14:37:17Z"
  },
  {
    "title": "‘Ukraine is only the first’, Zelenskyy warns UN as he highlights global threats – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/sep/24/russia-ukraine-trump-zelenskyy-unga-drones-europe-latest-news-updates",
    "image": "https://media.guim.co.uk/683af768ddcf5deba163461dff47c0a4f652a28e/319_0_3201_2560/500.jpg",
    "summary": "The Kremlin has rejected U.S. President Biden's assertion that Ukraine has the potential to reclaim all territory lost since Russia's invasion. Russian officials maintain that such a scenario is unrealistic amid ongoing conflict. The statement highlights increasing tensions between the U.S. and Russia regarding the Ukraine war.",
    "published": "2025-09-24T14:34:17Z"
  },
  {
    "title": "John Morgan obituary",
    "url": "https://www.theguardian.com/artanddesign/2025/sep/24/john-morgan-obituary",
    "image": "https://media.guim.co.uk/8fb02b5e961f327b0de37aebcee60c998cb9d19e/0_318_1170_936/500.jpg",
    "summary": "A graphic designer has modernized the traditional aesthetic of prayer books in the Church of England's Common Worship. Additionally, they created unique lettering for the historic HMS Victory. This innovative approach highlights a blend of contemporary design with significant cultural heritage.",
    "published": "2025-09-24T14:30:10Z"
  },
  {
    "title": "As it happened – deadly cyclone makes landfall in China after devastating Hong Kong, Taiwan and Philippines",
    "url": "https://www.theguardian.com/world/live/2025/sep/24/typhoon-ragasa-live-china-hong-kong-taiwan-philippines-latest-storm-news-updates",
    "image": "https://media.guim.co.uk/6a5f84d5eab801cbdd0346b22df23c2f49cc532e/451_0_4628_3702/500.jpg",
    "summary": "In southern China's Guangdong province, approximately 2 million people have been evacuated in preparation for an approaching storm. Authorities are taking proactive measures to ensure safety as the region braces for severe weather conditions. The storm is expected to impact various areas, prompting significant response efforts.",
    "published": "2025-09-24T14:29:57Z"
  },
  {
    "title": "Two people detained by US immigration reportedly shot at Dallas Ice facility – live updates",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/24/donald-trump-jimmy-kimmel-freedom-of-speech-immigration-government-shutdown-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/4ec0d4e2c1f0fae53ac4b3f802a7f1d4e3501465/836_240_1425_1141/500.jpg",
    "summary": "Dallas police have reported one fatality at the scene of a shooting incident where three individuals were shot. The Department of Homeland Security (DHS) stated that some of the victims were detainees. Investigations are ongoing to determine further details about the incident.",
    "published": "2025-09-24T14:26:43Z"
  }
]