[
  {
    "title": "Markets on track for worst week since April, and bitcoin hits nine-month low, as AI bubble fears mount – business live",
    "url": "https://www.theguardian.com/business/live/2025/nov/21/uk-public-finances-retail-sales-budget-energy-price-cap-stock-markets-ai-bubble-fears-business-live",
    "image": "https://media.guim.co.uk/004bcc62899c90e6dcd7e71211113b7759589bef/427_0_4265_3414/500.jpg",
    "summary": "The latest economic and financial news highlights ongoing developments in global markets, including shifts in stock performance and inflation rates. Analysts are closely monitoring central bank policies and their potential impact on economic growth. Key indicators suggest mixed signals as various sectors respond differently to current economic challenges.",
    "published": "2025-11-21T16:23:52Z"
  },
  {
    "title": "Ukraine facing choice between losing major partner or its dignity, says Zelenskyy as he considers US plan – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/nov/21/europe-latest-news-russia-ukraine-war-updates-zelenskyy-putin-g20",
    "image": "https://media.guim.co.uk/9db26e6a635fd6e0e40e8e15559eeb918b3ec7a8/285_0_1350_1080/500.jpg",
    "summary": "Ukrainian President warns of a challenging week ahead for Ukraine, emphasizing his commitment to national interests. He indicates a resolute stance in the face of potential difficulties. The statement reflects ongoing tensions and uncertainties in the region.",
    "published": "2025-11-21T16:23:09Z"
  },
  {
    "title": "Premier League team news: predicted lineups for the weekend action",
    "url": "https://www.theguardian.com/football/2025/nov/21/premier-league-team-news-predicted-lineups-for-the-weekend-action",
    "image": "https://media.guim.co.uk/71912a2b9614dad8fa54db0a9f9ed6bb7ee1af6d/375_0_2946_2356/500.jpg",
    "summary": "Newcastle will face Manchester City in a Saturday evening match. On Sunday, Arsenal will compete against Tottenham in the highly anticipated north London derby. Both matches promise to be key fixtures in the Premier League calendar.",
    "published": "2025-11-21T16:22:29Z"
  },
  {
    "title": "Palmer breaks toe in mishap; Celtic AGM cut short amid jeers; Liverpool injuries: football news – live",
    "url": "https://www.theguardian.com/football/live/2025/nov/21/premier-league-returns-wolves-to-unveil-edwards-and-more-football-news-live",
    "image": "https://media.guim.co.uk/46b501b8f0d15a767e18e8006e9b082f48496244/368_0_3791_3033/500.jpg",
    "summary": "Writers are preparing to provide updates and insights for an upcoming weekend filled with domestic football matches. Fans can expect comprehensive coverage and analysis of the games. Stay tuned for the latest news and developments in the football world.",
    "published": "2025-11-21T16:21:26Z"
  },
  {
    "title": "Trump’s threats amount to calls for ‘execution of elected officials’, says Chuck Schumer – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/nov/21/donald-trump-democrats-republicans-zohran-mamdani-us-politics-latest-news-updates",
    "image": "https://media.guim.co.uk/f6dc0ca4e1bafcd0274dc386e65a9df440a77ab5/669_0_3559_2849/500.jpg",
    "summary": "The Democrat Senate minority leader condemned the president's remarks as an \"outright threat,\" highlighting concerns within the party. Other prominent Democrats echoed the sentiment, asserting that \"political violence has no place in America.\" The statements reflect rising tensions and calls for a peaceful political discourse.",
    "published": "2025-11-21T16:20:49Z"
  }
]