[
  {
    "title": "US Open tennis 2025: Auger-Aliassime v De Minaur, Anisimova v Swiatek on day 11 – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/03/us-open-tennis-2025-auger-aliassime-v-de-minaur-anisimova-v-swiatek-on-day-11-live",
    "image": "https://media.guim.co.uk/6bc38ad34397527f6272d2ab40014c8c2a556069/241_0_4298_3438/500.jpg",
    "summary": "Daniel Harris provides ongoing updates from the singles quarter-finals at Flushing Meadows. Stay tuned for the latest developments and match highlights. Follow along as the excitement unfolds in this prestigious tournament.",
    "published": "2025-09-03T18:39:54Z"
  },
  {
    "title": "Only two more Republicans needed to force vote on Epstein files release, bill co-sponsor says – live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/03/donald-trump-immigration-tariffs-epstein-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/966119b82ed9b3bd7935028173318e2c72db156e/767_0_4248_3398/500.jpg",
    "summary": "Donald Trump has described the ongoing attention on Jeffrey Epstein's files as a \"Democrat hoax that never ends.\" This statement comes as a bipartisan group of lawmakers seeks to push a vote on related legislation. The scrutiny surrounding Epstein's case remains a contentious political issue.",
    "published": "2025-09-03T18:36:03Z"
  },
  {
    "title": "Scotland bans arms companies that supply IDF from receiving financial aid",
    "url": "https://www.theguardian.com/uk-news/2025/sep/03/scotland-government-defence-israel-military-gaza",
    "image": "https://media.guim.co.uk/d9bb9cf33f89eb7fe79edd8fdb898ce3005e0c7e/224_0_6146_4917/500.jpg",
    "summary": "The devolved government has announced that contractors requesting support must demonstrate that their products will not be used by the Israeli military. This decision aims to uphold specific ethical standards regarding defense and military contracts. The move highlights ongoing tensions related to military use and international relations.",
    "published": "2025-09-03T18:35:28Z"
  },
  {
    "title": "Trump says ‘you’ll see things happen’ if US is unhappy with Putin’s decisions – as it happened",
    "url": "https://www.theguardian.com/world/live/2025/sep/03/volodymyr-zelenskyy-denmark-support-ukraine-karol-nawrocki-meet-donald-trump-europe-latest-updates-news",
    "image": "https://media.guim.co.uk/6dda344675221d2736430f538d245e3cf1e0ecf5/234_0_3545_2836/500.jpg",
    "summary": "During a meeting with Polish President Karol Nawrocki, Trump addressed tensions following Putin's warning that Russia may resort to military action if diplomatic efforts do not succeed. The comments come amid escalating concerns regarding regional security and Russia's aggressive posture. Trump's remarks highlight the complexities of international relations in the context of the ongoing conflict.",
    "published": "2025-09-03T18:28:03Z"
  },
  {
    "title": "Kim Jong-un promises to do ‘everything to assist’ Moscow after Putin meeting",
    "url": "https://www.theguardian.com/world/2025/sep/03/kim-jong-un-promises-to-do-everything-to-assist-moscow-vladimir-putin-russia-north-korea",
    "image": "https://media.guim.co.uk/66caac12bc9ff03085abccc6a4ee7ab288da4251/665_85_5921_4740/500.jpg",
    "summary": "North Korean leader Kim Jong-un has been invited to visit Russia amid escalating tensions in Ukraine. Ukrainian President Zelenskyy criticized Putin for showing \"impunity\" with recent strikes on Ukraine. The invitation highlights growing ties between North Korea and Russia amidst the ongoing conflict.",
    "published": "2025-09-03T18:19:19Z"
  }
]