[
  {
    "title": "Former FBI director James Comey expected to be indicted on criminal charges, reports say – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/25/donald-trump-james-comey-fbi-ice-texas-latest-us-politics-news-updates-live",
    "image": "https://media.guim.co.uk/06d86fd2cedd69e78aec01568d1e34b60983c567/1435_0_4484_3588/500.jpg",
    "summary": "James Comey, former FBI Director, has been a focal point for Donald Trump, particularly following his dismissal from the FBI in the early days of Trump's presidency. This firing has continually influenced their relationship and political discourse. Comey's role in investigating Trump and his associates remains a significant topic in ongoing discussions about accountability and presidential power.",
    "published": "2025-09-25T10:40:00Z"
  },
  {
    "title": "Nottinghamshire close on title against Warwickshire: county cricket final round – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/25/nottinghamshire-close-on-title-against-warwickshire-county-cricket-final-round-live",
    "image": "https://media.guim.co.uk/262a8e45cc6679c08f0d353e9dc445b0b4ad8200/12_0_2250_1800/500.jpg",
    "summary": "Tanya Aldred provides live updates on the final round of County Championship matches. Fans can expect insights and highlights from various games as the season concludes. Stay tuned for an engaging wrap-up of the action from the grounds.",
    "published": "2025-09-25T10:39:04Z"
  },
  {
    "title": "What makes a good women’s football stadium? Everton point the way",
    "url": "https://www.theguardian.com/football/2025/sep/25/womens-football-stadiums-goodison-park-everton",
    "image": "https://media.guim.co.uk/d83b9d28d0e53a4b353fb04bcbf75876bdff0071/627_0_4449_3559/500.jpg",
    "summary": "Stadiums, historically designed for male audiences, are evolving as the women’s game experiences significant growth. This shift reflects a broader recognition of women's sports and increasing fan interest. As a result, venues are adapting to better accommodate and celebrate female athletes.",
    "published": "2025-09-25T10:37:38Z"
  },
  {
    "title": "The experts: estate agents on how to find the perfect property",
    "url": "https://www.theguardian.com/lifeandstyle/2025/sep/25/ignore-dirt-and-always-use-social-media-estate-agents-on-how-to-find-the-perfect-property",
    "image": "https://media.guim.co.uk/d85336029d895a01ed4eb5b0fff43d23154fca00/0_0_5000_4000/500.jpg",
    "summary": "Navigating the UK property market can be challenging for both buyers and renters. To successfully secure a property, it’s essential to be aware of common pitfalls and traps. This guide offers tips to help streamline the process and achieve successful transactions.",
    "published": "2025-09-25T10:37:19Z"
  },
  {
    "title": "Farage steps up calls for Bank of England to halt bond sales",
    "url": "https://www.theguardian.com/business/2025/sep/25/nigel-farage-bank-of-england-halt-bond-sales-reform-uk",
    "image": "https://media.guim.co.uk/10683ae9e076e0011b37fd054df61e49e173f63b/23_0_6121_4899/500.jpg",
    "summary": "Reform UK leader has called on Bank of England governor Andrew Bailey to address concerns regarding quantitative easing during a meeting at Threadneedle Street. The discussion highlights ongoing debates about monetary policy and its impact on the economy. Bailey's response to these pressing issues remains awaited.",
    "published": "2025-09-25T10:31:45Z"
  }
]