[
  {
    "title": "Manchester City v Liverpool: Premier League – live",
    "url": "https://www.theguardian.com/football/live/2025/nov/09/manchester-city-v-liverpool-premier-league-live",
    "image": "https://media.guim.co.uk/6e750a78e7053e4e87a8cb0068e6c57d94656a31/1445_213_2941_2353/500.jpg",
    "summary": "Manchester City and Liverpool, both contenders for the Premier League title, are set to clash at the Etihad Stadium. This highly anticipated match promises to be a thrilling encounter. Rob Smyth will provide coverage of the event.",
    "published": "2025-11-09T17:14:51Z"
  },
  {
    "title": "Premier League top scorers 2025-26: who is leading race for golden boot?",
    "url": "https://www.theguardian.com/football/2025/sep/15/premier-league-top-scorers-2025-26-who-is-leading-race-for-golden-boot",
    "image": "https://media.guim.co.uk/7467a90a5a415f45959903d6d1b0c6942de5a2ce/1263_152_3876_3100/500.jpg",
    "summary": "The latest news highlights the standout players currently topping the goalscoring charts in the English Premier League. These \"hot shots\" are making significant impacts on their teams with their impressive performances. Fans can check the rankings to see who is leading the pack this season.",
    "published": "2025-11-09T17:14:40Z"
  },
  {
    "title": "NFL week 10 live: Indianapolis Colts v Atlanta Falcons in Berlin – live",
    "url": "https://www.theguardian.com/sport/live/2025/nov/09/nfl-week-10-live-vikings-ravens-jets-browns-dolphins-bills-live",
    "image": "https://media.guim.co.uk/443de1c90a43b78b33d7226e03032a3bbd853c28/175_0_2027_1621/500.jpg",
    "summary": "Seven NFL games are set to start at 6 PM UK time, with the Atlanta Falcons facing the Indianapolis Colts in Berlin as the highlight matchup. Graham Searles will provide all the details of the games. Fans can look forward to exciting action across these matchups.",
    "published": "2025-11-09T17:10:30Z"
  },
  {
    "title": "England’s curriculum review needs to be more radical | Letters ",
    "url": "https://www.theguardian.com/education/2025/nov/09/englands-curriculum-review-needs-to-be-more-radical",
    "image": "https://media.guim.co.uk/6a6b3d33700fabd5ce69facfc5ad95172c3840f0/255_0_2499_2000/500.jpg",
    "summary": "Dr. Rupert Higham, Caroline Norbury, and Colin Richards discuss their perspectives on the recommendations outlined in the Francis report. They emphasize the importance of implementing these recommendations to improve healthcare practices. Their letters highlight the need for systemic reforms to enhance patient safety and care quality.",
    "published": "2025-11-09T17:02:37Z"
  },
  {
    "title": "It pays to support women’s health in the workplace | Letter",
    "url": "https://www.theguardian.com/society/2025/nov/09/it-pays-to-support-womens-health-in-the-workplace",
    "image": "https://media.guim.co.uk/3a665979c209b0d17b27c835818837a8495bd03a/12_0_834_667/500.jpg",
    "summary": "Prof. Geeta Nargund emphasizes the urgent need for employers to address health inequalities, highlighting that over 32% of women lack adequate support to remain in the workforce. She calls for actionable measures to improve workplace health resources. This issue underlines the importance of equal access to support for women in the workplace.",
    "published": "2025-11-09T17:02:13Z"
  }
]