[
  {
    "title": "Australia news live: ‘quite extraordinary’ for Labor to claim some credit for Gaza ceasefire deal, Melissa McIntosh says",
    "url": "https://www.theguardian.com/australia-news/live/2025/oct/12/australia-news-live-pro-palestine-rally-sydney-optus-anthony-albanese-sussan-ley",
    "image": "https://media.guim.co.uk/44a190722a3d9977dd7b8f56561a88b101bf28cc/593_0_5913_4733/500.jpg",
    "summary": "Could you please provide the news article or details you'd like summarized?",
    "published": "2025-10-11T23:14:55Z"
  },
  {
    "title": "Rolling Stones’s Ronnie Wood says he is working on new songs with Rod Stewart",
    "url": "https://www.theguardian.com/music/2025/oct/12/ronnie-wood-and-rod-stewart-working-together-on-songs-again-rolling-stone-says",
    "image": "https://media.guim.co.uk/aa3a3870e19578ed3b350480bf794283630d95fd/156_0_1567_1253/500.jpg",
    "summary": "On Desert Island Discs, a guitarist highlighted the strong musical partnership between him and a former bandmate from the Faces in the 1960s. He expressed confidence in their collaboration, stating they have a \"good body of songs going.\" The discussion underscores their lasting musical connection and creativity.",
    "published": "2025-10-11T23:01:35Z"
  },
  {
    "title": "The dream of turning empty office blocks into apartments appears over. What went wrong?",
    "url": "https://www.theguardian.com/australia-news/2025/oct/12/converting-empty-office-blocks-apartments-appears-over",
    "image": "https://media.guim.co.uk/f24d52674b94b438e5674b23e3617c66f33c17d8/386_0_2699_2160/500.jpg",
    "summary": "Strict planning regulations and increasing refurbishment costs are discouraging landlords and developers from investing in housing projects. This situation has sparked demands for government action to address the housing shortage. Experts emphasize the urgent need for policy changes to alleviate the escalating housing crisis.",
    "published": "2025-10-11T23:00:36Z"
  },
  {
    "title": "‘Uneasy alliance’: why Brisbane’s Olympics has a former LNP premier and Greens radical fighting on the same side",
    "url": "https://www.theguardian.com/sport/2025/oct/12/queensland-brisbane-olympics-former-lnp-premier-greens-radical-same-side",
    "image": "https://media.guim.co.uk/ae5d8e01aef019afbfcd6d45033cf5bc03340670/126_0_3740_2992/500.jpg",
    "summary": "The Queensland government's proposal to construct the main stadium for the 2032 Games at Victoria Park has sparked protests from a diverse coalition. This group includes local residents, environmentalists, and sports fans, all opposing the development. Their collective effort highlights concerns over environmental impacts and the park's significance.",
    "published": "2025-10-11T23:00:36Z"
  },
  {
    "title": "Chicago TV journalist pushed to ground and arrested during Ice raid, then later released",
    "url": "https://www.theguardian.com/us-news/2025/oct/10/chicago-ice-raid-arrest",
    "image": "https://media.guim.co.uk/19f7b109209584241f407552d239c2324f991b93/413_0_4133_3306/500.jpg",
    "summary": "Witnesses described the arrest of Debbie Brockman, a U.S. citizen and video editor, by masked federal agents as \"absolutely horrifying.\" The incident has raised concerns among bystanders about the tactics used by law enforcement. The motivations and circumstances surrounding her arrest remain unclear.",
    "published": "2025-10-11T22:52:20Z"
  }
]