[
  {
    "title": "Charlie Kirk shooting: suspect set to face aggravated murder charge - live updates",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/12/charlie-kirk-shooter-suspect-latest-news-updates-donald-trump-utah",
    "image": "https://media.guim.co.uk/b3900dee754cc4e9b61442cbd4826f211c47f0af/0_969_1693_1353/500.jpg",
    "summary": "Tyler Robinson, 22, is anticipated to face charges following an incident where he allegedly shot a right-wing activist. A family friend reportedly informed authorities about the shooting. The formal charges are expected to be announced on Tuesday.",
    "published": "2025-09-12T21:19:46Z"
  },
  {
    "title": "US immigration officers kill man trying to flee vehicle stop near Chicago",
    "url": "https://www.theguardian.com/us-news/2025/sep/12/ice-agent-shooting-chicago",
    "image": "https://media.guim.co.uk/614880ebdc98251c09db7173da72829dc3822ce4/275_0_2735_2189/500.jpg",
    "summary": "An officer was shot after a man attempted to drive his vehicle into an arrest team, hitting one officer, as reported by ICE. The incident escalated during an operation, leading to the officer's injury. Authorities have not released further details about the condition of the officer or any arrests made.",
    "published": "2025-09-12T21:19:08Z"
  },
  {
    "title": "Records tumble as Phil Salt’s stunning ton leads England to T20 rout of South Africa",
    "url": "https://www.theguardian.com/sport/2025/sep/12/records-tumble-as-phil-salts-stunning-ton-leads-england-to-t20-rout-of-south-africa-match-report",
    "image": "https://media.guim.co.uk/4a4527370ac100d9c733e79fd9a69f47b6404713/266_0_4320_3456/500.jpg",
    "summary": "England made history by scoring over 300 runs for the first time in a T20 match, achieving a resounding victory against South Africa at Old Trafford. Their impressive performance showcased dominant batting throughout the game. This landmark achievement highlights England's growing prowess in the T20 format.",
    "published": "2025-09-12T21:13:04Z"
  },
  {
    "title": "Leigh sweep sorry St Helens aside to confirm home playoff slot",
    "url": "https://www.theguardian.com/sport/2025/sep/12/leigh-st-helens-rugby-league-match-report",
    "image": "https://media.guim.co.uk/28dfe3543b667d07e1490a321161bbdf422615f2/298_0_2982_2385/500.jpg",
    "summary": "Leigh Leopards secured a spot at home for the opening round of the Super League playoffs by defeating St Helens 28-10. The victory was decisive, ensuring the Leopards a favorable position in the playoffs. This win highlights their strong performance leading into the postseason.",
    "published": "2025-09-12T21:11:07Z"
  },
  {
    "title": "Alessia Russo double seals victory for rampant Arsenal away to West Ham",
    "url": "https://www.theguardian.com/football/2025/sep/12/west-ham-arsenal-wsl-match-report",
    "image": "https://media.guim.co.uk/5fc6b2a75d4cae555286dde9ded5f235985fe0c3/318_0_3411_2728/500.jpg",
    "summary": "Arsenal's England striker scored two goals in quick succession during a 5-1 victory over West Ham. This impressive win propelled Arsenal to the top of the Women’s Super League. The triumph underscores Arsenal's strong performance this season.",
    "published": "2025-09-12T21:08:46Z"
  }
]