[
  {
    "title": "Trump administration says it will partially fund Snap food aid benefits– live",
    "url": "https://www.theguardian.com/us-news/live/2025/nov/03/us-government-shutdown-donald-trump-latest-politics-news",
    "image": "https://media.guim.co.uk/c77959f8bedd35ba713f13cb326bde041092e86f/461_0_3901_3122/500.jpg",
    "summary": "The Trump administration announced in a court filing that it intends to use emergency funds to help partially finance SNAP benefits for millions of Americans in November. This decision comes amid ongoing discussions about food assistance programs. The plan aims to alleviate potential hardships for low-income families during the coming month.",
    "published": "2025-11-03T21:17:39Z"
  },
  {
    "title": "Australia politics live: Ryan says Coalition must pull itself together or face oblivion; police pepper spray protesters and make arrests outside Sydney weapons expo",
    "url": "https://www.theguardian.com/australia-news/live/2025/nov/04/australia-politics-live-keating-trump-anthony-albanese-sussan-ley-david-littleproud-net-zero-policy-coalition-question-time-energy-policy-ntwnfb",
    "image": "https://media.guim.co.uk/829717a316191d1f8274092452b9e436e7e0e74b/421_0_6252_5002/500.jpg",
    "summary": "Please provide the news article or details you'd like summarized.",
    "published": "2025-11-03T21:16:18Z"
  },
  {
    "title": "Sunderland v Everton: Premier League – live",
    "url": "https://www.theguardian.com/football/live/2025/nov/03/sunderland-v-everton-premier-league-live",
    "image": "https://media.guim.co.uk/787297581fc95b757bc8390c825cfcbd3f30e9a9/0_200_6630_5304/500.jpg",
    "summary": "David Moyes makes his return to Wearside for a highly anticipated match. Rob Smyth provides live updates and minute-by-minute coverage of the event. Fans eagerly await the outcome of this pivotal game.",
    "published": "2025-11-03T21:16:17Z"
  },
  {
    "title": "Corrections and clarifications",
    "url": "https://www.theguardian.com/news/2025/nov/03/corrections-and-clarifications",
    "summary": "Suicide rates have become a growing public health concern, with recent studies showing increases in various demographics. Factors contributing to the rise include mental health challenges, economic stress, and social isolation. Efforts are being intensified to raise awareness and improve access to mental health resources to help combat this crisis.",
    "published": "2025-11-03T21:00:09Z"
  },
  {
    "title": "Diane Ladd, Oscar-nominated actor of Alice Doesn’t Live Here Anymore, dies aged 89",
    "url": "https://www.theguardian.com/film/2025/nov/03/diane-ladd-dead",
    "image": "https://media.guim.co.uk/be76dc677dd416a518ac70973ecb8a8cbfadd005/376_0_3760_3008/500.jpg",
    "summary": "Three-time Oscar nominee who starred in films like \"Chinatown\" has passed away, as announced by her daughter, Laura Dern. The actress was celebrated for her contributions to cinema. Her legacy continues through her impactful performances.",
    "published": "2025-11-03T20:59:21Z"
  }
]