[
  {
    "title": "Spaniard among six killed in Jerusalem shooting – Middle East crisis live",
    "url": "https://www.theguardian.com/world/live/2025/sep/08/middle-east-crisis-live-jerusalem-shooting-israel-threatens-gaza-city-powerful-hurricane-latest-news",
    "image": "https://media.guim.co.uk/8f08c5ac32cba1a7bbe727134e644e7c9349a662/597_0_4917_3933/500.jpg",
    "summary": "Two attackers were shot dead by police at the scene of an incident. The nature of the attack is currently unclear, and authorities are investigating. Further details will be released as the situation develops.",
    "published": "2025-09-08T16:44:19Z"
  },
  {
    "title": "Argentinians deliver electoral blow to Milei’s scandal-rocked government",
    "url": "https://www.theguardian.com/world/2025/sep/08/argentina-election-javier-milei",
    "image": "https://media.guim.co.uk/7a104d2ad7038ababc039f3554c43799abeddf24/431_0_4638_3710/500.jpg",
    "summary": "The president emphasized the importance of the contest in Buenos Aires province, which represents 40% of the electorate, calling it a \"life or death battle.\" However, he secured only 34% of the vote in the election. This result highlights challenges for his administration moving forward.",
    "published": "2025-09-08T16:44:16Z"
  },
  {
    "title": "New home secretary Shabana Mahmood says she will not run for deputy leader after Labour accused of ‘stitch-up’ over contest – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/08/labour-deputy-leadership-election-contest-keir-starmer-angela-rayner-uk-politics-live",
    "image": "https://media.guim.co.uk/b52ec3a17d28ede6f33f0e69669c9e5a98245ef3/448_0_1951_1560/500.jpg",
    "summary": "An MP has emphasized that law enforcement should target actual members of a certain group rather than individuals who merely show support in a careless manner. This statement highlights concerns about misdirected policing efforts. The MP advocates for a more focused approach to addressing issues related to the group.",
    "published": "2025-09-08T16:43:20Z"
  },
  {
    "title": "Hamnet review – stately Shakespeare drama with emotionally overwhelming finale",
    "url": "https://www.theguardian.com/film/2025/sep/08/hamnet-movie-review-tiff",
    "image": "https://media.guim.co.uk/4f72e260f4102833c6c35caff15e3595c714c43e/794_0_3747_3000/500.jpg",
    "summary": "Jessie Buckley and Paul Mescal deliver standout performances in Chloé Zhao's moving adaptation of Maggie O'Farrell's 2020 novel. The film captures deep emotional themes and resonates with audiences. It concludes with a touching, tearjerker ending that leaves a lasting impact.",
    "published": "2025-09-08T16:41:04Z"
  },
  {
    "title": "US supreme court backs Trump on aggressive immigration raids – live updates",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/08/donald-trump-immigration-hyundai-tariffs-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/176e8758304c8d935223d4f6e1714433ce3bec83/683_0_6827_5464/500.jpg",
    "summary": "A court has granted federal agents permission to carry out raids in southern California aimed at deporting individuals based on their race or language. This controversial decision raises concerns about racial profiling and discrimination. Advocates fear it could lead to the targeting of vulnerable communities.",
    "published": "2025-09-08T16:33:46Z"
  }
]