[
  {
    "title": "Unsold goods pile up at US factories as growth slows; JLR shutdown hits UK manufacturing – business live",
    "url": "https://www.theguardian.com/business/live/2025/sep/23/gold-price-on-track-best-year-since-1979-record-high-global-economy-uk-growth-business-live-news",
    "image": "https://media.guim.co.uk/2bb1d2fb4d0fc336538cb819b277f4c52386dd10/267_0_2925_2340/500.jpg",
    "summary": "Jaguar Land Rover is facing manufacturing disruptions due to a recent cyber-attack. Concurrently, the OECD has published its latest economic outlook, reflecting global economic trends. The combined impact of these events highlights ongoing challenges in the automotive sector and broader economy.",
    "published": "2025-09-23T14:39:33Z"
  },
  {
    "title": "Trump says European countries buying Russian energy ‘inexcusable’ and ‘embarrassing’ – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/sep/23/copenhagen-oslo-airport-drones-denmark-norway-russia-nato-estonia-europe-live-latest-news-updates",
    "image": "https://media.guim.co.uk/4208963a3a8e2c9fc93d9006f21b394ce1045803/921_463_4051_3241/500.jpg",
    "summary": "During his speech at the UN, the US President expressed a willingness to impose tariffs on Russia. This announcement underscores the Biden administration's stance on holding Russia accountable for its actions. The move aligns with ongoing efforts to address geopolitical tensions and enhance international security.",
    "published": "2025-09-23T14:38:58Z"
  },
  {
    "title": "Ed Davey warns NHS will be privatised and gun laws rolled back by ‘hypocrite’ Farage in Lib Dem conference speech – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/23/lib-dem-ed-davey-conference-donald-trump-keir-starmer-labour-reform-tory-latest-politics-live-news-updates",
    "image": "https://media.guim.co.uk/bff1eaae177c2843dc07243ac25e02001cb6265b/258_0_2709_2168/500.jpg",
    "summary": "The Liberal Democrat leader has called on Conservative voters to switch to his party, emphasizing the need for a united front against the Reform party and far-right groups in the UK. He aims to attract disillusioned Tory supporters dissatisfied with their current leadership. This appeal marks a strategic move to strengthen the Liberal Democrats’ position in the political landscape.",
    "published": "2025-09-23T14:37:28Z"
  },
  {
    "title": "Do you speak Sylheti? Tamajaght? Klingon? Inside the Festival for Endangered Languages",
    "url": "https://www.theguardian.com/culture/2025/sep/23/sylheti-klingon-tamajaght-festival-for-endangered-languages",
    "image": "https://media.guim.co.uk/7321e491e748d0ab292f8fe74f95dacc0861a94b/232_179_2113_1691/500.jpg",
    "summary": "Every two weeks, a language disappears, with estimates suggesting that by the end of the century, half of the world's 7,000 languages could be extinct. An artist is working to preserve these languages through a creative process involving eyeliner and chokeberries. Their unique approach aims to capture and revitalize languages such as Ogham and Arablish.",
    "published": "2025-09-23T14:37:09Z"
  },
  {
    "title": "Allan ‘Skill’ Cole obituary",
    "url": "https://www.theguardian.com/world/2025/sep/23/allan-skill-cole-obituary",
    "image": "https://media.guim.co.uk/5feb45e1b9f2ebb6b8cfca3ffd3667efb658193e/175_0_4859_3887/500.jpg",
    "summary": "A Jamaican footballer, who was a close friend of reggae legend Bob Marley, has recently made headlines as the manager of the iconic band the Wailers. His dual passion for music and sports highlights the cultural intertwining of Jamaica's vibrant scene. The news emphasizes the lasting influence of Marley and the Wailers on both music and community.",
    "published": "2025-09-23T14:37:05Z"
  }
]