[
  {
    "title": "Charlie Kirk shooting latest: FBI shares photos of person of interest and offers reward for information",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/11/charlie-kirk-shot-latest-news-updates-utah-university-donald-trump",
    "image": "https://media.guim.co.uk/76c0230ab358372bf02a0a59e55b7ea5d8ab10ca/0_399_1092_873/500.jpg",
    "summary": "The FBI has announced a $100,000 reward for information leading to a suspect after the discovery of a high-powered bolt action rifle in a wooded area. The agency is seeking the public's assistance in identifying the individual connected to this weapon. Authorities are concerned about potential threats related to the firearm.",
    "published": "2025-09-11T17:23:21Z"
  },
  {
    "title": "Brighton owner Tony Bloom nets another winner with Santorini Star at Doncaster ",
    "url": "https://www.theguardian.com/sport/2025/sep/11/brighton-owner-tony-bloom-nets-another-winner-with-santorini-star-at-doncaster-horse-racing",
    "image": "https://media.guim.co.uk/50fde4e3705200e62264324f0dd512506f07a271/489_0_3718_2976/500.jpg",
    "summary": "Santorini Star's victory at Doncaster marked the fourth win for Brighton owner Tony Bloom in just six days. This streak highlights Bloom's successful involvement in horse racing. The wins showcase both the quality of his horses and his strategic investments in the sport.",
    "published": "2025-09-11T17:19:49Z"
  },
  {
    "title": "Charlie Kirk shooting death – what we know so far",
    "url": "https://www.theguardian.com/us-news/2025/sep/10/charlie-kirk-shooting-what-we-know",
    "image": "https://media.guim.co.uk/f9ad1e881b72839e1c7e827aa204e0a03abc45a3/606_0_3600_2880/500.jpg",
    "summary": "The executive director of Turning Point USA was fatally shot during an event at Utah Valley University. The incident occurred amidst public gatherings, raising concerns about safety at such events. Authorities are investigating the shooting, with details of the incident still emerging.",
    "published": "2025-09-11T17:13:58Z"
  },
  {
    "title": "Big Little Lies: third season of starry HBO drama series on the way",
    "url": "https://www.theguardian.com/tv-and-radio/2025/sep/11/big-little-lies-hbo",
    "image": "https://media.guim.co.uk/882d7a15d7a525f1af8aaf0f5307f5594e9a69d6/458_0_5000_4000/500.jpg",
    "summary": "Francesca Sloane, known for her work on \"Mr and Mrs Smith,\" is set to reprise the hit series with an A-list cast. This news has generated excitement among fans eager for a revival. Details about the show's return remain limited.",
    "published": "2025-09-11T17:09:44Z"
  },
  {
    "title": "Rome mayor’s claim of swimmable Tiber in five years met with scepticism",
    "url": "https://www.theguardian.com/world/2025/sep/11/rome-mayor-claim-swimmable-tiber-five-years-met-with-scepticism",
    "image": "https://media.guim.co.uk/50b642e184923717b8d39a0ee6a0dac98905f5bb/343_0_2021_1616/500.jpg",
    "summary": "Experts express skepticism regarding Roberto Gualtieri's proposed timeline for reopening a river for public bathing. Concerns revolve around safety and environmental assessments. They emphasize the need for thorough analysis before allowing public access.",
    "published": "2025-09-11T17:07:33Z"
  }
]