[
  {
    "title": "Bellingham and Foden recalled to England squad; Rooney ‘a bit unfair’ to Van Dijk: football news – live",
    "url": "https://www.theguardian.com/football/live/2025/nov/07/thomas-tuchel-england-squad-jude-bellingham-weekend-team-news-and-more-football-live",
    "image": "https://media.guim.co.uk/906a70bbe6de1dfef1fffb2212c5a4b49e5f2b4c/0_0_5000_4000/500.jpg",
    "summary": "England manager Thomas Tuchel is set to announce his latest squad ahead of an action-packed weekend in the Premier League. The announcement will precede various matches across the league. Fans eagerly await the lineup's impact on upcoming games.",
    "published": "2025-11-07T10:21:11Z"
  },
  {
    "title": "Grilled salmon tikka with fragrant orzo and mint raita – recipe",
    "url": "https://www.theguardian.com/cook-up-a-feast-with-tesco-finest/2025/nov/07/grilled-salmon-tikka-orzo-mint-raita-recipe",
    "image": "https://media.guim.co.uk/7c13891b1604f98635d6fddb39ecd6c812ab7d9b/0_0_3901_3121/500.jpg",
    "summary": "Tender salmon fillets feature in a luxurious midweek dinner for two, complemented by orzo pasta that absorbs flavorful spices. The dish is paired with a creamy raita for added richness. It's a delicious and comforting meal option.",
    "published": "2025-11-07T10:17:18Z"
  },
  {
    "title": "Diane Arbus: Sanctum Sanctorum review – a grotesquely bleak but brutally truthful vision of humanity",
    "url": "https://www.theguardian.com/artanddesign/2025/nov/07/diane-arbus-sanctum-sanctorum-review-a-grotesquely-bleak-but-brutally-truthful-vision-of-humanity",
    "image": "https://media.guim.co.uk/ff02725291c70307a676e93ae6f14487dd6a4f39/93_143_2641_2113/500.png",
    "summary": "An American photographer's latest exhibition powerfully captures contrasting themes, presenting haunting images of elderly widows alongside striking depictions of motherhood. Her work poignantly explores the presence of ugliness and beauty in everyday life. This showcase highlights her artistic genius and ability to evoke deep emotional responses.",
    "published": "2025-11-07T10:16:30Z"
  },
  {
    "title": "Airports in Belgium disrupted again by suspected drone sightings – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/nov/07/europe-latest-news-updates-belgium-airports-brussels-liege-drones-russia-orban-trump-ukraine",
    "image": "https://media.guim.co.uk/cca9f6fc83ed30c250dab98735385955bc6715fc/788_0_5968_4775/500.jpg",
    "summary": "Drone sightings were reported near Brussels and Liège airports shortly after a national security council meeting focused on emerging threats. This has raised concerns about air traffic safety and potential security risks. Authorities are investigating the incidents to ensure the safety of the flights.",
    "published": "2025-11-07T10:03:51Z"
  },
  {
    "title": "‘Why don’t you believe Palestinians?’: the Israeli comedian putting the genocide on stage",
    "url": "https://www.theguardian.com/film/2025/nov/07/israeli-comedian-putting-genocide-on-stage",
    "image": "https://media.guim.co.uk/27db104da33b26fd1dafb06c6d2f11427337f0b1/1363_178_2477_1982/500.jpg",
    "summary": "In the documentary \"Coexistence, My Ass!\", Noam Shuster Eliassi blends humor and honesty to transform her one-woman show into a politically charged commentary. Through her personal experiences, she addresses complex social issues in a thought-provoking way. The film challenges audiences to reconsider perspectives on coexistence and conflict.",
    "published": "2025-11-07T10:01:22Z"
  }
]