[
  {
    "title": "England chasing 179 to beat Bangladesh: Women’s Cricket World Cup – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/07/england-v-bangladesh-womens-cricket-world-cup-live",
    "image": "https://media.guim.co.uk/dad816dd737022c599ed3bea04604c65948b094e/188_0_2302_1841/500.jpg",
    "summary": "Nat Sciver-Brunt's team aims to capitalize on their recent decisive victory against South Africa. Writers will provide live updates during the match. Follow the over-by-over report for the latest developments.",
    "published": "2025-10-07T14:19:59Z"
  },
  {
    "title": "Far-right National Rally snubs French PM’s bid to salvage cabinet amid political turmoil – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/oct/07/france-macron-lecornu-cabinet-europe-live",
    "image": "https://media.guim.co.uk/23110a5d401f5c412a95efd5c655b22eca2d4cd8/28_0_4834_3867/500.jpg",
    "summary": "Bardella and Le Pen have rejected an invitation from Lecornu to engage in discussions aimed at resolving the ongoing crisis. Their decision reflects continued political tensions and a lack of willingness to negotiate. This refusal may hinder efforts to find a viable solution to the current issues at hand.",
    "published": "2025-10-07T14:16:10Z"
  },
  {
    "title": "Metro Bank customers hit by payment problems; EU to raise tariffs on foreign steel imports – as it happened",
    "url": "https://www.theguardian.com/business/live/2025/oct/07/uk-house-price-growth-slowest-april-2024-trump-truck-imports-25-tariff-1-november-stock-markets-business-live-news",
    "image": "https://media.guim.co.uk/7239fc5dd79f1cc2149becea2753f1261da562da/456_0_4560_3648/500.jpg",
    "summary": "The European Commission has proposed a 50% tariff on foreign steel imports, raising concerns within the UK. A UK union warns that such tariffs pose an \"existential threat\" to the nation's steel industry. The move aims to protect local markets but may have significant repercussions for UK producers.",
    "published": "2025-10-07T14:15:47Z"
  },
  {
    "title": "Bryan Washington and Rabih Alameddine among National Book Award finalists",
    "url": "https://www.theguardian.com/books/2025/oct/07/bryan-washington-rabih-alameddine-national-book-award-finalists",
    "image": "https://media.guim.co.uk/76d8ae598fcab4c10a24bdaed1127737df7ca1bf/0_0_5000_4000/500.jpg",
    "summary": "This year's fiction nominees feature notable authors Karen Russell, Megha Majumdar, and Ethan Rutherford. They are recognized for their contributions to contemporary literature. The competition highlights the diversity and talent within the literary field.",
    "published": "2025-10-07T14:15:00Z"
  },
  {
    "title": "Israel marks two years since 7 October Hamas attack as Gaza ceasefire talks continue – live",
    "url": "https://www.theguardian.com/world/live/2025/oct/07/gaza-ceasefire-peace-talks-israel-hamas-egypt-7-october-anniversary-middle-east-crisis-live-news-updates",
    "image": "https://media.guim.co.uk/88f96cf76ce349adfdc52cdcd4d2cb2f1eb2e7e4/1108_250_6296_5037/500.jpg",
    "summary": "Israelis are commemorating the second anniversary of the devastating Hamas-led attack that resulted in the deaths of 1,200 individuals. This solemn occasion reflects on the impact of the attack on the nation. Various ceremonies and memorials are being held to honor the victims and their families.",
    "published": "2025-10-07T14:11:18Z"
  }
]