[
  {
    "title": "Alleged Porepunkah killer shown ranting at police in pandemic-era footage as manhunt continues ",
    "url": "https://www.theguardian.com/australia-news/2025/sep/03/alleged-porepunkah-killer-dezi-freeman-shown-ranting-at-police-pandemic-era-footage-as-manhunt-continues-ntwnfb",
    "image": "https://media.guim.co.uk/785f5cab3cf0138a63277936552950ed5405c075/178_0_1957_1566/500.jpg",
    "summary": "Dezi Freeman was recorded arguing with police over Covid-19 mask mandates, expressing frustration with their enforcement. During the confrontation, he criticized the officers' intelligence, comparing it to that of \"kindergarten children.\" The videos have garnered attention for highlighting tensions surrounding pandemic regulations.",
    "published": "2025-09-03T09:29:17Z"
  },
  {
    "title": "Streeting says hate speech laws are having ‘unintended consequences’ after arrest of Father Ted writer – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/03/farage-starmer-badenoch-pmqs-news-updates-uk-politics-live",
    "image": "https://media.guim.co.uk/5530a8a7cb56752a692f736210a075b3235835ab/306_0_2809_2248/500.jpg",
    "summary": "The health secretary emphasized the importance of balancing legislation to ensure police focus is not solely on social media content. This statement follows the recent detention of Graham Linehan due to his posts regarding transgender issues. The government aims to navigate the complexities of policing online speech and protecting free expression.",
    "published": "2025-09-03T09:26:48Z"
  },
  {
    "title": "The Spin | ‘They’re like time machines’: the endless magic of cricket scorecards",
    "url": "https://www.theguardian.com/sport/2025/sep/03/theyre-like-time-machines-the-endless-magic-of-cricket-scorecards",
    "image": "https://media.guim.co.uk/0e97ece7ad22a0c8041cbed4d3e3ebe0e37d9a74/528_0_4343_3473/500.jpg",
    "summary": "An enigmatic column of data, often deemed perplexing, holds intriguing stories within its numbers. These figures, while seemingly incomprehensible, can unveil various eccentric narratives. Exploring this data invites curiosity and encourages deeper understanding beyond the surface.",
    "published": "2025-09-03T09:25:22Z"
  },
  {
    "title": "At least 24 Palestinians killed by Israeli military across Gaza on Wednesday, say health officials – Middle East crisis live",
    "url": "https://www.theguardian.com/world/live/2025/sep/03/gaza-graveyard-international-humanitarian-law-unrwa-israel-middle-east-crisis-latest-updates-news",
    "image": "https://media.guim.co.uk/9501ef62e035f4fe4233e091a9265ecc8af5446a/247_0_2891_2312/500.jpg",
    "summary": "The head of UNRWA warns that Gaza is turning into a \"graveyard of international humanitarian law\" amid continuing Israeli military operations in the city. He highlights the severe humanitarian crisis unfolding as the conflict escalates. Calls for urgent international attention and intervention are growing.",
    "published": "2025-09-03T09:22:30Z"
  },
  {
    "title": "Police must focus on ‘streets not tweets’, says Wes Streeting after Graham Linehan arrest",
    "url": "https://www.theguardian.com/politics/2025/sep/03/police-focus-streets-not-tweets-wes-streeting-graham-linehan-arrest",
    "image": "https://media.guim.co.uk/5530a8a7cb56752a692f736210a075b3235835ab/645_60_1997_1598/500.jpg",
    "summary": "The health secretary implied that previous Conservative governments contributed to societal issues after the arrest of Father Ted writer Graham Linehan over controversial social media posts. This incident has sparked discussions about accountability in government and freedom of expression. Linehan's arrest raises concerns about the impact of social media on public discourse.",
    "published": "2025-09-03T09:19:43Z"
  }
]