[
  {
    "title": "Nottinghamshire stun Surrey, Glamorgan promoted and more: county cricket, day four – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/18/surrey-v-nottinghamshire-somerset-v-hampshire-and-more-county-cricket-day-four-live",
    "image": "https://media.guim.co.uk/6e00c513cd479e01fb23433c5043c61e772fff4f/335_0_2978_2382/500.jpg",
    "summary": "Tanya Aldred provides updates on the concluding day of the latest County Championship matches. Fans can expect insights and highlights from the day's play. Stay tuned for key moments and results as teams vie for crucial points.",
    "published": "2025-09-18T17:31:06Z"
  },
  {
    "title": "The Guardian view on Trump’s state visit to Britain: plenty of glitter, but this was gilt, not gold | Editorial",
    "url": "https://www.theguardian.com/commentisfree/2025/sep/18/the-guardian-view-on-trump-state-visit-to-britain-plenty-of-glitter-but-this-was-gilt-not-gold",
    "image": "https://media.guim.co.uk/b8a70856d1e9ebe0ee5489ad4c0866a1fe2098f9/328_0_5000_4000/500.jpg",
    "summary": "The editorial highlights a disparity between exaggerated claims and the reality of accomplishments. It suggests that in the current context, the priorities have shifted towards damage control and strategic delay. Ultimately, these actions are perceived as successes in navigating challenges.",
    "published": "2025-09-18T17:29:25Z"
  },
  {
    "title": "The Guardian view on the Lib Dem conference: speaking for parts of England | Editorial",
    "url": "https://www.theguardian.com/commentisfree/2025/sep/18/the-guardian-view-on-the-lib-dem-conference-speaking-for-parts-of-england",
    "image": "https://media.guim.co.uk/3245bf63dd1cfc5d2857f72c609d3b17d1bd91fd/424_0_5000_4000/500.jpg",
    "summary": "Sir Ed Davey's party has a promising outlook ahead, with opportunities for growth and influence. However, it faces significant challenges that require difficult decision-making. Balancing aspirations with strategic choices will be crucial for their future success.",
    "published": "2025-09-18T17:29:20Z"
  },
  {
    "title": "Anna Friel tells court of stalking ordeal as former pilot subject to 15-year restraining order",
    "url": "https://www.theguardian.com/world/2025/sep/18/anna-friel-looking-over-shoulder-man-stalked-her-three-years",
    "image": "https://media.guim.co.uk/9470853aa7f4ce7647729bd0bfc290b2d6d27428/0_55_3915_3133/500.jpg",
    "summary": "Phil Appleton, 71, has been placed under a court order restricting him from contacting a specific actor and prohibiting him from entering designated areas. The decision comes amid concerns for the actor's safety. This legal action aims to ensure peace and security for the individual involved.",
    "published": "2025-09-18T17:27:45Z"
  },
  {
    "title": "John Windle obituary",
    "url": "https://www.theguardian.com/politics/2025/sep/18/john-windle-obituary",
    "image": "https://media.guim.co.uk/cae6946fe1b25dfedc220246890ff4706c531ac7/0_0_480_384/master/480.jpg",
    "summary": "The general manager of Sheffield University's students' union has been recognized for his significant contributions, helping the organization achieve national excellence. His leadership and initiatives have played a pivotal role in enhancing the student experience. The union is now regarded as one of the best in the country under his guidance.",
    "published": "2025-09-18T17:24:34Z"
  }
]