[
  {
    "title": "Rachel Reeves urged to break manifesto pledges to avoid ‘pasty tax’ budget",
    "url": "https://www.theguardian.com/uk-news/2025/oct/04/rachel-reeves-urged-to-break-manifesto-pledges-to-avoid-pasty-tax-budget",
    "image": "https://media.guim.co.uk/5a3635033cff9e5511941074febfb07e6feeeb87/897_56_5423_4340/500.jpg",
    "summary": "Labour party members are cautioning the chancellor to avoid implementing a series of minor tax increases. This advice comes as the Office for Budget Responsibility (OBR) releases its financial forecast. The emphasis is on more substantial and effective fiscal strategies rather than piecemeal approaches.",
    "published": "2025-10-04T05:00:56Z"
  },
  {
    "title": "Europe needs to ‘get serious’ about threat posed to it by Russia, Ukraine minister says",
    "url": "https://www.theguardian.com/world/2025/oct/04/europe-needs-to-get-serious-about-threat-posed-to-it-by-russia-ukraine-minister-says",
    "image": "https://media.guim.co.uk/cf652f02103cf4abe3ba2d6ec4a1e19008184dad/672_0_6717_5374/500.jpg",
    "summary": "Sergiy Kyslytsia states that the Kremlin is already at war with Europe. He forecasts that Vladimir Putin will continue to escalate tensions. Kyslytsia's remarks highlight increasing concerns about the geopolitical situation.",
    "published": "2025-10-04T05:00:09Z"
  },
  {
    "title": "Warnings of imports of caged hen eggs as Ukraine and Poland become UK’s biggest suppliers",
    "url": "https://www.theguardian.com/food/2025/oct/04/warnings-imports-caged-hen-eggs-ukraine-poland-uk-biggest-suppliers",
    "image": "https://media.guim.co.uk/7fa57032dad5a52a6664fb169bd87be01b270672/99_0_4640_3712/500.jpg",
    "summary": "Shift in import regulations raises alarms over food safety and animal welfare, as imported products may not meet the same standards required of domestic producers. This lack of uniformity could compromise public health and consumer trust. Advocates call for tighter regulations to ensure compliance across all food sources.",
    "published": "2025-10-04T05:00:08Z"
  },
  {
    "title": "Blind date: ‘As she was trying to show me something on her phone, there was a guy’s fully nude video on there’",
    "url": "https://www.theguardian.com/lifeandstyle/2025/oct/04/blind-date-jenny-nova",
    "image": "https://media.guim.co.uk/e1cfb59ed16580eae957a5667091e53eb191ad24/0_0_5000_4000/500.jpg",
    "summary": "Jenny, a 31-year-old lash technician, meets Nova, a 27-year-old master's student. Their encounter highlights a connection between two women from different backgrounds. The story explores their experiences and interactions as they get to know each other.",
    "published": "2025-10-04T05:00:08Z"
  },
  {
    "title": "‘One rule for the rich’: the Salzburg mansion, the Porsche heir and the writer Stefan Zweig",
    "url": "https://www.theguardian.com/world/2025/oct/04/salzburg-mansion-tunnel-porsche-heir-jewish-writer-stefan-zweig",
    "image": "https://media.guim.co.uk/23056005f78ba8346a721824e142d052ca4bf813/66_0_2378_1903/500.jpg",
    "summary": "A car magnate is restoring a villa previously owned by a Jewish author and has received approval to construct a 500-metre road to a garage. This development has raised concerns among local residents and city officials. The project is causing tension in the community due to its potential impact.",
    "published": "2025-10-04T05:00:07Z"
  }
]