[
  {
    "title": "Australia news live: early risers wonder at blood moon; Erin Patterson awaits sentencing for mushroom murders",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/08/australia-news-live-erin-patterson-mushroom-murders-trial-sentencing-blood-moon-pictures-shark-net-beach-ntwnfb",
    "image": "https://media.guim.co.uk/e3e395bf8e180f7c5ff23cd3aa4f1162f0a5449a/1_184_3924_3139/500.jpg",
    "summary": "I'm sorry, but I need more details about the news article you're referring to in order to provide a summary. Please share the main points or key information!",
    "published": "2025-09-07T21:22:45Z"
  },
  {
    "title": "US Open tennis 2025: Jannik Sinner v Carlos Alcaraz, men’s singles final – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/07/us-open-tennis-2025-jannik-sinner-v-carlos-alcaraz-mens-singles-final-live",
    "image": "https://media.guim.co.uk/47178e9877bdd5c1d72513719ad7a733080c9fc9/503_0_3200_2560/500.jpg",
    "summary": "The men's singles final at Flushing Meadows is currently underway, with live updates provided by Daniel Harris. Fans are eagerly following the match as it progresses. Key moments and performances are expected to shape the outcome of this highly anticipated showdown.",
    "published": "2025-09-07T21:21:15Z"
  },
  {
    "title": "US treasury secretary denies Trump tariffs are tax on Americans",
    "url": "https://www.theguardian.com/us-news/2025/sep/07/us-treasury-secretary-trump-tariffs",
    "image": "https://media.guim.co.uk/cdf35f05938b6765f0cb993a5b97a608155b2c0c/0_0_3750_3000/500.jpg",
    "summary": "Billionaire Scott Bessent downplayed worries regarding the president's tax levies, suggesting they won't hinder economic growth. He believes the U.S. economy is set to accelerate despite these concerns. Bessent's optimistic outlook reflects confidence in the country's economic resilience.",
    "published": "2025-09-07T21:02:26Z"
  },
  {
    "title": "Death of a Showjumper review – the investigators in this bleak true-crime drama restore your faith in humanity",
    "url": "https://www.theguardian.com/tv-and-radio/2025/sep/07/death-of-a-showjumper-review-investigators-bleak-true-crime-drama-restore-faith-in-humanity",
    "image": "https://media.guim.co.uk/b8145ed93c43515baec6e93fa514dbec0feb386a/899_487_4061_3249/500.jpg",
    "summary": "The gripping three-part series centers on the death of a young equestrian, highlighting the relentless pursuit of justice by two individuals. It offers a profound exploration of a tragic story, revealing the darker aspects of the case. Through their determination, the narrative seeks to honor the victim's memory and shed light on the circumstances surrounding her demise.",
    "published": "2025-09-07T21:00:30Z"
  },
  {
    "title": "Roofman review – Channing Tatum and Kirsten Dunst lift fact-based crime caper",
    "url": "https://www.theguardian.com/film/2025/sep/07/channing-tatum-kirsten-dunst",
    "image": "https://media.guim.co.uk/14462a2175a10bd6dd3666705dc93e1030307e09/260_0_2600_2080/500.jpg",
    "summary": "In Derek Cianfrance's comedy-drama, two leading stars showcase their talents as they navigate a story centered on a deceitful prison escapee. The film delivers moments of effectiveness while exploring themes of deception and escape. Overall, it offers a blend of humor and drama through its compelling performances.",
    "published": "2025-09-07T20:35:24Z"
  }
]