[
  {
    "title": "Australia v England: Ashes second Test, day three – live",
    "url": "https://www.theguardian.com/sport/live/2025/dec/06/australia-vs-england-live-ashes-second-2nd-test-day-three-aus-v-eng-cricket-scores-updates-gabba-brisbane",
    "image": "https://media.guim.co.uk/c2faa8ef0abe537ae63a92b08f738d59337a1fb9/174_0_1600_1280/500.jpg",
    "summary": "The hosts aim to extend their 44-run first-innings lead as play resumes at the Gabba. An over-by-over report provides updates on the match's progress. Join the writers for live insights and commentary.",
    "published": "2025-12-06T04:23:01Z"
  },
  {
    "title": "Suspected smuggling boat struck twice by military was reportedly moving drugs to South American country, not US –as it happened",
    "url": "https://www.theguardian.com/us-news/live/2025/dec/05/trump-pete-hegseth-signal-politics-updates",
    "image": "https://media.guim.co.uk/4665e3169400d6beac0d92a65967133d1496f625/490_0_2635_2110/500.jpg",
    "summary": "The live blog has concluded, and no further updates will be provided. Readers can refer to previous posts for coverage and insights. Thank you for following along.",
    "published": "2025-12-06T02:58:27Z"
  },
  {
    "title": "Ukraine war briefing: Progress depends on Russia taking peace talks seriously, say Washington and Kyiv",
    "url": "https://www.theguardian.com/world/2025/dec/06/ukraine-war-briefing-progress-depends-on-russian-taking-peace-talks-seriously-say-washington-and-kyiv",
    "image": "https://media.guim.co.uk/158f19f3e2973536665ee4b1e2fc24df423cd772/731_0_3653_2923/500.jpg",
    "summary": "U.S. and Ukrainian officials are engaged in a third day of discussions in Florida. French President Emmanuel Macron emphasized that there is \"no mistrust\" between Europe and the White House. The talks aim to strengthen cooperation amidst ongoing geopolitical tensions.",
    "published": "2025-12-06T02:42:59Z"
  },
  {
    "title": "Socceroos should not be overawed by 2026 World Cup group that plays to their strengths | Joey Lynch",
    "url": "https://www.theguardian.com/football/blog/2025/dec/06/australia-socceroos-2026-world-cup-group-strengths",
    "image": "https://media.guim.co.uk/740ce4deb6ae7c49fe89bd710c0fb3917cbc5a4e/9_18_3027_2422/500.jpg",
    "summary": "Australia may encounter tough opponents, including the USA, Paraguay, and a European qualifier, as the underdog in an upcoming tournament. Despite this, the team has developed a playing style well-suited for tournament scenarios. Their preparation suggests they could be competitive despite the challenges ahead.",
    "published": "2025-12-06T02:24:16Z"
  },
  {
    "title": "Trump news at a glance: list of countries under US travel ban set to grow",
    "url": "https://www.theguardian.com/us-news/2025/dec/05/trump-administration-news-update-today",
    "image": "https://media.guim.co.uk/8a56fbd26a22bd0adece95d9b8b420a7cbdb8361/0_0_4377_3501/500.jpg",
    "summary": "US Department of Homeland Security Secretary Kristi Noem announced plans to expand the list of countries included in a specific program to over 30. The expansion aims to enhance security and streamline travel processes. Details on the criteria for inclusion and affected countries have yet to be released.",
    "published": "2025-12-06T02:08:58Z"
  }
]