[
  {
    "title": "Albanese’s Oprah-style emissions target aims to please almost everyone but falls short of real climate action",
    "url": "https://www.theguardian.com/australia-news/2025/sep/18/government-climate-emissions-target-albanese-oprah-style-aims-please-everyone-australia-falls-short-real-climate-action",
    "image": "https://media.guim.co.uk/1e7f0bb3fa351c2025b0b6768d5dc4305c063674/414_0_6492_5194/500.jpg",
    "summary": "The prime minister, enjoying a strong majority, faces pressure from a progressive crossbench advocating for deeper cuts. Despite this support, there has been a shift away from previously set ambitious goals. The reasons for this change in direction remain unclear.",
    "published": "2025-09-18T08:40:02Z"
  },
  {
    "title": "Trump celebrates Jimmy Kimmel suspension as some networks replace show with Charlie Kirk tribute – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/18/jimmy-kimmel-charlie-kirk-comments-show-cancelled-suspended-monologue-trump-us-politics-live",
    "image": "https://media.guim.co.uk/306674dfc9eced5d884c681dfe68c36b08dcafbe/518_0_3084_2469/500.jpg",
    "summary": "The indefinite removal of \"Jimmy Kimmel Live!\" has sparked widespread outrage, coinciding with the Trump administration's crackdown on commentary. This decision comes in the wake of the tragic killing of Charlie Kirk, raising concerns about free speech and censorship. Critics argue that the move highlights growing tension between entertainment and political commentary.",
    "published": "2025-09-18T08:39:26Z"
  },
  {
    "title": "New French PM under pressure as strikes disrupt schools and transport across country – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/sep/18/france-strikes-lecornu-merz-sanchez-von-der-leyen-europe-live-latest-updates",
    "image": "https://media.guim.co.uk/26228cb2ade9e34a5b27d2c204240beb168548af/1161_0_6880_5504/500.jpg",
    "summary": "Up to 800,000 people are expected to participate in a march protesting budget cuts, public service reductions, and wage issues. This event follows the recent appointment of Sébastien Lecornu. The demonstration highlights growing public discontent regarding government financial policies.",
    "published": "2025-09-18T08:31:37Z"
  },
  {
    "title": "Starmer and Trump to hold talks as PM warned UK faces ‘huge dilemma’ over relationship with US – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/18/donald-trump-state-visit-uk-keir-starmer-labour-politics-latest-news",
    "image": "https://media.guim.co.uk/3958c5ac5b3c46487aeabed468711e145e04bc95/0_0_3576_2861/500.jpg",
    "summary": "The US president is visiting Chequers, where discussions are taking place regarding technological independence. Former Meta executive Nick Clegg emphasizes the need for the UK to reduce its reliance on US technology. The visit highlights ongoing dialogues about innovation and self-sufficiency in the UK.",
    "published": "2025-09-18T08:31:01Z"
  },
  {
    "title": "Next shares slide as retailer warns UK faces years of ‘anaemic’ growth",
    "url": "https://www.theguardian.com/business/2025/sep/18/next-shares-slide-as-retailer-warns-on-weak-uk-growth-and-jobs",
    "image": "https://media.guim.co.uk/c5a9b33e9875040e875095a63c208252776b0b39/683_0_6827_5464/500.jpg",
    "summary": "Chain reported an 18% increase in profits, highlighting strong financial performance. However, the company cautioned that its outlook is uncertain due to decreasing job opportunities and an escalating tax burden. These factors could impact future growth and profitability.",
    "published": "2025-09-18T08:28:35Z"
  }
]