[
  {
    "title": "Max Verstappen qualifies in pole position for Italian Grand Prix ahead of Lando Norris – live reaction",
    "url": "https://www.theguardian.com/sport/live/2025/sep/06/italian-f1-grand-prix-qualifying-live",
    "image": "https://media.guim.co.uk/0144572f87eec5bee057c843486d87e6838fe157/427_0_4251_3400/500.jpg",
    "summary": "Billy Munday provides live updates on the ongoing Formula One season at Monza. Fans can stay informed about race developments and key moments. Tune in for real-time coverage and insights from the event.",
    "published": "2025-09-06T15:25:37Z"
  },
  {
    "title": "England v Australia: Women’s Rugby World Cup – rugby union live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/06/england-v-australia-womens-rugby-world-cup-rugby-union-live",
    "image": "https://media.guim.co.uk/94a5eccea59670835a46d98c11e70e27b052b4d1/388_0_3823_3058/500.jpg",
    "summary": "Daniel Gallan provides live updates on England's crucial group match against Australia in the Women’s Rugby World Cup. The coverage includes minute-by-minute details as the game unfolds. Fans can follow for real-time insights and highlights.",
    "published": "2025-09-06T15:25:14Z"
  },
  {
    "title": "England v Andorra: World Cup 2026 qualifying – live",
    "url": "https://www.theguardian.com/football/live/2025/sep/06/england-v-andorra-world-cup-2026-qualifying-live",
    "image": "https://media.guim.co.uk/2d886077e84382f2252d228af3c78c55b440d62e/872_0_6880_5504/500.jpg",
    "summary": "Thomas Tuchel's team aims for a significant victory at Villa Park to enhance their morale. The match is set to be covered by Barry Glendenning. Fans are hopeful for a strong performance from the side.",
    "published": "2025-09-06T15:24:40Z"
  },
  {
    "title": "Keir Starmer confirms first batch of junior ministers in post-Rayner reshuffle – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/06/no-early-election-angela-rayner-resignation-nigel-farage-reform-uk-politics-live-news-latest",
    "image": "https://media.guim.co.uk/ef89e6d973b2d1173f1dff0d29de38013d336ef3/393_0_3928_3143/500.jpg",
    "summary": "Chief Secretary Darren Jones stated that Angela Rayner's resignation accelerated a planned reshuffle within the Labour Party. He emphasized that there are no divisions within the party despite her departure. Rayner's exit has led to significant changes in party leadership dynamics.",
    "published": "2025-09-06T15:20:38Z"
  },
  {
    "title": "Arsenal 4-1 London City Lionesses: WSL – as it happened",
    "url": "https://www.theguardian.com/football/live/2025/sep/06/arsenal-v-london-city-lionesses-wsl-football-live",
    "image": "https://media.guim.co.uk/278455fa5a1fd0c2db99665ce99cd92601765ecd/784_480_2229_1783/500.jpg",
    "summary": "Olivia Smith marked her debut for Arsenal with a stunning equaliser after the team had a sluggish start. The goal sparked a turnaround, leading Arsenal to dominate the match against London City Lionesses. The performance showcased the team's resilience and Smith's promising talent.",
    "published": "2025-09-06T15:04:52Z"
  }
]