[
  {
    "title": "Demand for UK government debt falls as political risks spook bond market – business live",
    "url": "https://www.theguardian.com/business/live/2025/sep/25/co-op-cyber-attack-cost-it-80m-profits-loss-government-support-jlr-suppliers-business-live-news",
    "image": "https://media.guim.co.uk/9ae4d2c19beddde67b6281fad4ad2b3d1328c6d0/1244_0_6473_5181/500.jpg",
    "summary": "UK bond yields increased due to weak demand at a government debt auction. Economists attribute the lackluster interest to prevailing policy uncertainty. This trend indicates potential concerns in the market regarding the government's financial strategy.",
    "published": "2025-09-25T14:18:12Z"
  },
  {
    "title": "Federal prosecutors reportedly gave US attorney memo suggesting not to file charges against James Comey – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/25/donald-trump-james-comey-fbi-ice-texas-latest-us-politics-news-updates-live",
    "image": "https://media.guim.co.uk/06d86fd2cedd69e78aec01568d1e34b60983c567/1435_0_4484_3588/500.jpg",
    "summary": "Prosecutors in Virginia advised Lindsey Halligan against filing criminal charges against former FBI Director. The discussion highlighted legal reasons for not pursuing the case. ABC News reported the details of the conversation.",
    "published": "2025-09-25T14:16:43Z"
  },
  {
    "title": "Nottinghamshire close on title against Warwickshire: county cricket final round – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/25/nottinghamshire-close-on-title-against-warwickshire-county-cricket-final-round-live",
    "image": "https://media.guim.co.uk/33647d31b655e49b766f871eb12fe218ac4a2b74/167_0_2250_1800/500.jpg",
    "summary": "Tanya Aldred will provide updates from various venues during the final round of County Championship matches this season. The updates will cover key highlights and developments in the games. Fans can look forward to comprehensive coverage as the season concludes.",
    "published": "2025-09-25T14:16:43Z"
  },
  {
    "title": "What is the Labour Together row and are there risks for Keir Starmer?",
    "url": "https://www.theguardian.com/politics/2025/sep/25/what-is-the-labour-together-row-keir-starmer-risks",
    "image": "https://media.guim.co.uk/ab99bfbff1be63d2f63f1bf356c8acf01eb867ef/62_23_891_712/500.jpg",
    "summary": "The Conservative Party is demanding an investigation by the standards commissioner and police into a thinktank affiliated with the Labour Party. They allege potential misconduct or unethical behavior. The call for an inquiry underscores ongoing political tensions between the two parties.",
    "published": "2025-09-25T14:15:28Z"
  },
  {
    "title": "Burnham claims he is ‘completely committed’ to his Greater Manchester mayoral job - UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/25/andy-burnham-steve-reed-keir-starmer-labour-news-updates-uk-politics-live",
    "image": "https://media.guim.co.uk/3d33381f6da48c2fca3926a72dc63bcfa12e069b/629_0_4303_3442/500.jpg",
    "summary": "Burnham expresses his enthusiasm for his role, stating he loves every aspect of the job. He emphasizes his commitment to supporting the Labour party. Burnham's dedication shows his willingness to contribute in any capacity needed.",
    "published": "2025-09-25T14:14:58Z"
  }
]