[
  {
    "title": "TV tonight: Tim Robinson’s office comedy just gets freakier and funnier",
    "url": "https://www.theguardian.com/tv-and-radio/2025/nov/10/tv-tonight-tim-robinsons-office-comedy-just-gets-freakier-and-funnier",
    "image": "https://media.guim.co.uk/e7fee9763305e2b9e1c062d786139658bf237087/363_0_7200_5760/500.jpg",
    "summary": "Ron explores conspiracy theories while interspersing the discussion with emotional moments. Additionally, the horror series \"It: Welcome to Derry\" continues to unfold its chilling narrative. Viewers are given recommendations for their evening watch.",
    "published": "2025-11-10T06:20:53Z"
  },
  {
    "title": "In New York, Zohran Mamdani showed how it’s done: ‘identity politics’ can win elections | Nesrine Malik",
    "url": "https://www.theguardian.com/commentisfree/2025/nov/10/new-york-zohran-mamdani-identity-politics-win-elections",
    "image": "https://media.guim.co.uk/31a3c742e14a915c24406cc103342f13536334de/339_0_4583_3667/500.jpg",
    "summary": "New York's newly elected mayor focused his campaign on personal experiences, reflecting the ideals of the American 'melting pot'. Columnist Nesrine Malik highlights the irony in his approach, suggesting it underscores the blend of diverse backgrounds in the city. This duality raises questions about identity and representation in leadership.",
    "published": "2025-11-10T06:00:54Z"
  },
  {
    "title": "Documentary explores whether JMW Turner may have been neurodivergent",
    "url": "https://www.theguardian.com/artanddesign/2025/nov/10/documentary-jmw-turner-secret-sketchbooks-neurodivergence-bbc",
    "image": "https://media.guim.co.uk/07502f10b0836670932664c0df166575ca2e3173/0_343_1933_1546/500.jpg",
    "summary": "A new program utilizes the sketches, drawings, and watercolors of an artist to create a unique psychological portrait. This innovative approach provides an in-depth exploration of the artist's inner thoughts and emotions. The resulting work aims to offer unprecedented insights into the artist's psyche.",
    "published": "2025-11-10T06:00:54Z"
  },
  {
    "title": "‘It makes you feel glam’: shaggy, Studio 54-style coats are partying again",
    "url": "https://www.theguardian.com/fashion/2025/nov/10/it-makes-you-feel-glam-shaggy-studio-54-style-coats-are-partying-again",
    "image": "https://media.guim.co.uk/194610a4c4fbfae5be2806f0b5a92f99b4b4b746/0_0_2560_2048/500.jpg",
    "summary": "Furry jackets, previously donned by celebrities like Jerry Hall and Bianca Jagger, are making a comeback as a stylish, effortless fashion choice. They provide a \"one and done\" look that enhances any outfit with minimal effort. This trend emphasizes simplicity and elegance in winter wear.",
    "published": "2025-11-10T06:00:54Z"
  },
  {
    "title": "Starwatch: the Leonids meteor shower reaches its peak",
    "url": "https://www.theguardian.com/science/2025/nov/10/starwatch-the-leonids-meteor-shower-reaches-its-peak",
    "image": "https://media.guim.co.uk/71a1cff8400c4e00aeebe5090637aa5f4af14ea8/132_0_1362_1090/500.jpg",
    "summary": "Prepare for a celestial show as you bundle up and set up a deck chair to enjoy a meteor shower. Expect to see approximately 10-15 bright meteors per hour. Make sure to find a good viewing spot for the best experience!",
    "published": "2025-11-10T06:00:53Z"
  }
]