[
  {
    "title": "Australia news live: Ley sets new KPIs for frontbenchers; expert calls for law change after landmark strip-search case",
    "url": "https://www.theguardian.com/australia-news/live/2025/oct/01/australia-news-live-nicole-kidman-divorce-keith-urban-sussan-ley-coalition-andrew-hastie-anthony-albanese-housing-ntwnfb",
    "image": "https://media.guim.co.uk/3a1ca450f274d6939dfe83aa3f17478fe4257f40/0_0_5000_4000/500.jpg",
    "summary": "I'm sorry, but it appears that you've provided an incomplete message or request. Could you please share the specific news story you'd like summarized?",
    "published": "2025-09-30T23:17:01Z"
  },
  {
    "title": "Senate rejects Democrats’ stopgap funding resolution as government shutdown deadline looms – live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/30/us-government-shutdown-funding-trump-vance-portland-hegseth-latest-updates",
    "image": "https://media.guim.co.uk/fe3316a2e58c91fcece6a306a293024b18b14d3d/287_0_2881_2304/500.jpg",
    "summary": "A Democratic resolution was narrowly defeated in the Senate with a 47-53 vote, highlighting ongoing partisan division. Both parties engaged in a blame game as Congress approaches a critical deadline without reaching an agreement. The failure adds urgency to the looming legislative challenges.",
    "published": "2025-09-30T23:14:55Z"
  },
  {
    "title": "Buy now, pay later use exploding among older Britons, data shows",
    "url": "https://www.theguardian.com/business/2025/oct/01/buy-now-pay-later-uk-finance",
    "image": "https://media.guim.co.uk/1adbf20bc0661b0c3ca64145b2bbfbfac0b9ec85/10_0_4560_3648/500.jpg",
    "summary": "In 2024, UK Finance reported that nearly one-third of British adults primarily operated without cash. This shift reflects the growing trend towards digital transactions and cashless living in the UK. The change highlights the increasing reliance on electronic payments in everyday life.",
    "published": "2025-09-30T23:01:56Z"
  },
  {
    "title": "UK business confidence falls to record low amid rising employment costs",
    "url": "https://www.theguardian.com/business/2025/oct/01/uk-business-confidence-falls-record-low-employment-costs",
    "image": "https://media.guim.co.uk/af0ced85a7514c25226f66d26fe5c1b55d9f90b3/379_0_2521_2017/500.jpg",
    "summary": "A recent survey of business leaders indicates that rising energy prices are a significant concern for employers. Meanwhile, policymakers at the Bank have cautioned that inflation may take longer than expected to decrease. This combination of factors raises ongoing economic uncertainties.",
    "published": "2025-09-30T23:01:55Z"
  },
  {
    "title": "Common toad is becoming uncommon in UK, study shows",
    "url": "https://www.theguardian.com/environment/2025/oct/01/common-toad-is-becoming-uncommon-in-uk-study-shows",
    "image": "https://media.guim.co.uk/ce8bfb8d7b491b0fff6c14f6da319117b0fb311c/435_0_4258_3407/500.jpg",
    "summary": "A recent analysis reveals that the population of a specific species has nearly halved over the past generation, indicating a significant decline. Experts stress that immediate action is crucial to ensure the species' survival. This urgent call for measures highlights the importance of conservation efforts.",
    "published": "2025-09-30T23:01:55Z"
  }
]