[
  {
    "title": "Australia politics live: Bob Carr defends China visit but ‘wouldn’t have picked this guest list’; RBA chief dampens hope for more interest rate cuts",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/04/australia-politics-live-bob-carr-daniel-andrews-beijing-putin-question-time-labor-coalition-anthony-albanese-sussan-ley-ntwnfb",
    "summary": "I'm sorry, but I need more context or details about the news you want summarized. Please provide the specific information or article.",
    "published": "2025-09-03T21:25:35Z"
  },
  {
    "title": "US Open tennis 2025: Anisimova v Swiatek, Auger-Aliassime beats De Minaur on day 11 – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/03/us-open-tennis-2025-auger-aliassime-v-de-minaur-anisimova-v-swiatek-on-day-11-live",
    "image": "https://media.guim.co.uk/f5963fd8ce6bf92f839d04b0f805fa95577afdcb/290_15_3014_2412/500.jpg",
    "summary": "Daniel Harris is providing live updates on the singles quarter-finals taking place at Flushing Meadows. Stay tuned for real-time information and developments throughout the matches. Follow along for the latest highlights and scores.",
    "published": "2025-09-03T21:24:08Z"
  },
  {
    "title": "Auger-Aliassime comes from set down to beat De Minaur and make US Open semi-finals",
    "url": "https://www.theguardian.com/sport/2025/sep/03/auger-aliassime-comes-from-set-down-to-beat-de-minaur-and-make-us-open-semi-finals",
    "image": "https://media.guim.co.uk/0320c0a0c537eafc98c73f68bf1403af2c4ce8fd/165_0_4630_3705/500.jpg",
    "summary": "Félix Auger-Aliassime reached his first grand slam semi-final in four years by defeating Alex de Minaur. The match concluded with scores of 4-6, 7-6 (7), 7-5, 7-6 (4). Auger-Aliassime showcased resilience, coming back after dropping the first set.",
    "published": "2025-09-03T21:17:47Z"
  },
  {
    "title": "Adams denies being offered Trump job in exchange for quitting mayoral race",
    "url": "https://www.theguardian.com/us-news/2025/sep/03/eric-adams-trump-new-york-mayor",
    "image": "https://media.guim.co.uk/e4d090d8566ac15e4072602f088d1d20ec1112ff/438_0_4999_3999/500.jpg",
    "summary": "Reports indicate that a mayor is being urged to withdraw from the race, potentially clearing the way for Andrew Cuomo to challenge incumbent Zohran Mamdani. This suggestion comes amid speculation about Cuomo's political ambitions. The move could significantly reshape the electoral landscape.",
    "published": "2025-09-03T21:15:32Z"
  },
  {
    "title": "Judge sides with Harvard and orders Trump to reverse billions in funding cuts – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/03/donald-trump-immigration-tariffs-epstein-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/9b14c0471ec0692c614c2b2cd1d915767d12243c/213_0_4069_3256/500.jpg",
    "summary": "A federal judge in Boston has mandated the reversal of the administration's cuts to over $2.6 billion in research grant funding. The ruling aims to restore financial support for various research initiatives affected by the funding reductions. This decision may have significant implications for ongoing scientific projects relying on these grants.",
    "published": "2025-09-03T21:04:49Z"
  }
]