[
  {
    "title": "Liverpool 1-0 Arsenal: Premier League updates – live reaction",
    "url": "https://www.theguardian.com/football/live/2025/aug/31/liverpool-v-arsenal-premier-league-updates-live",
    "image": "https://media.guim.co.uk/60fe432f51cfc61333e35506d6f97083309955da/789_0_4406_3526/500.jpg",
    "summary": "Dominik Szoboszlai's stunning free-kick secured a victory for Liverpool, maintaining their perfect start to the season. The goal also marked the end of Arsenal's unbeaten run. This match showcased Liverpool’s strong performance and resilience.",
    "published": "2025-08-31T17:29:34Z"
  },
  {
    "title": "US Open tennis 2025: Pegula eases past Li, Alcaraz and Sabalenka in action on day eight – live",
    "url": "https://www.theguardian.com/sport/live/2025/aug/31/us-open-tennis-2025-carlos-alcaraz-aryna-sabalenka-pegula-fritz-townsend-day-eight-live",
    "image": "https://media.guim.co.uk/0faac55241c851a097f26c93d7445d4667ada1b2/325_0_2560_2048/500.jpg",
    "summary": "The fourth round of singles matches is set to begin at Flushing Meadows. Fans can stay updated on the latest developments and results from the tournament. Excitement builds as top players compete for a spot in the next round.",
    "published": "2025-08-31T17:27:20Z"
  },
  {
    "title": "Putin persists, Trump dithers – and a just peace for Ukraine still seems a long way off | Olga Chyzh",
    "url": "https://www.theguardian.com/commentisfree/2025/aug/31/donald-trump-vladimir-putin-russia-us-ukraine-peace",
    "image": "https://media.guim.co.uk/8f9e90137c7729341e5dfa38532d0a4d3f1d09fb/595_0_5123_4098/500.jpg",
    "summary": "The University of Toronto's Olga Chyzh suggests that the US president has a pivotal choice: to act as a peacemaker or risk being seen as a pawn in elevating Russia's imperial status. This decision will significantly impact international dynamics. The outcome could reshape perceptions of US leadership on the global stage.",
    "published": "2025-08-31T17:20:26Z"
  },
  {
    "title": "UK still intends to recognise a Palestinian state, David Lammy to tell MPs",
    "url": "https://www.theguardian.com/politics/2025/aug/31/uk-still-intends-to-recognise-a-palestinian-state-david-lammy-to-tell-mps",
    "image": "https://media.guim.co.uk/771de0e5b7f5ae417d9423936ebe42b237c93f35/589_492_4419_3535/500.jpg",
    "summary": "The Foreign Secretary will announce an evaluation to determine if Israel has adhered to the conditions set by Keir Starmer. This assessment aims to assess compliance regarding specific terms outlined. The outcome may influence future diplomatic relations and responses.",
    "published": "2025-08-31T17:10:22Z"
  },
  {
    "title": "No fears over playing ‘man without a face’ Putin, Jude Law says in Venice",
    "url": "https://www.theguardian.com/film/2025/aug/31/jude-law-putin-wizard-of-the-kremlin-venice",
    "image": "https://media.guim.co.uk/842ab7d01424ac1f5f894eac4f75f057d099e924/0_0_2813_2250/500.jpg",
    "summary": "The star of \"The Wizard of the Kremlin\" has expressed confidence that he will face no repercussions for his portrayal of Russian leader Vladimir Putin. He believes that his performance will be well-received and not result in any backlash. The film is generating interest due to its politically charged subject matter.",
    "published": "2025-08-31T17:05:33Z"
  }
]