[
  {
    "title": "Philippines earthquake: tsunami warning for coasts including Indonesia after 7.4 quake hits Mindanao – live updates",
    "url": "https://www.theguardian.com/world/live/2025/oct/10/philippines-earthquake-tsunami-warning-issued-after-7-quake-hits-mindanao",
    "image": "https://media.guim.co.uk/493045828b23fc6223c5dfbf1673931fd70fa417/162_0_4860_3888/500.jpg",
    "summary": "The Philippines seismology agency has issued a strong evacuation warning for coastal towns in the central and southern regions due to impending threats. Residents are urged to leave the area immediately for their safety. Authorities are closely monitoring the situation to ensure public safety.",
    "published": "2025-10-10T02:58:36Z"
  },
  {
    "title": "Australia news live: Hannah Thomas begins legal action against NSW; Allegra Spender quits parliamentary sports club after Pocock ban",
    "url": "https://www.theguardian.com/australia-news/live/2025/oct/10/australia-politics-live-senate-estimates-anthony-albanese-sussan-ley-andrew-hastie-migration-aukus-trump-gaza-ntwnfb",
    "image": "https://media.guim.co.uk/2082d090ffde56861078117d9858c57729c0447d/47_0_6880_5504/500.jpg",
    "summary": "Please provide the specific news content you would like me to summarize into three lines.",
    "published": "2025-10-10T02:57:20Z"
  },
  {
    "title": "US anti-fascism expert blocked from flying to Spain at airport",
    "url": "https://www.theguardian.com/us-news/2025/oct/09/anti-fascism-mark-bray-rutgers-university",
    "image": "https://media.guim.co.uk/f51d6df3a6dc3d4479372f7b740db871696373e8/0_237_1520_1217/500.jpg",
    "summary": "A Rutgers University professor, known for his book on antifa, was notified at the boarding gate that his flight had been canceled. The incident sparked discussions regarding academic freedom and freedom of travel. Details surrounding the cancellation remain unclear.",
    "published": "2025-10-10T02:20:14Z"
  },
  {
    "title": "Orion’s melt: Dodgers eliminate Phillies from MLB playoffs after Kerkering’s devastating error",
    "url": "https://www.theguardian.com/sport/2025/oct/09/dodgers-phillies-mlb-orion-kerkering-error",
    "image": "https://media.guim.co.uk/7df0a4c885b530b3a6a7867af42e8134266a278c/720_0_7200_5760/500.jpg",
    "summary": "The Los Angeles Dodgers have advanced to the National League Championship Series, aided by a critical mistake from Phillies pitcher Orion Kerkering. This unexpected error played a pivotal role in the Dodgers' victory. The team's momentum continues as they aim for the championship.",
    "published": "2025-10-10T02:19:23Z"
  },
  {
    "title": "New York attorney general calls bank fraud indictment ‘desperate weaponization of our justice system’ – as it happened",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/09/national-guard-ice-federal-property-chicago-illinois-us-politics-live",
    "image": "https://media.guim.co.uk/091b85fed22c626f1017da14894b25a206b4fdd7/737_0_5335_4267/500.jpg",
    "summary": "Trump stated that federal cuts during a government shutdown will primarily affect the priorities of his opponents. A House-passed bill and a Democratic stopgap measure aimed at preventing the shutdown were both rejected. Tensions continue to rise as negotiations stall over budgetary issues.",
    "published": "2025-10-10T01:59:17Z"
  }
]