[
  {
    "title": "Japan v Australia: rugby union international Test – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/25/japan-v-australia-live-rugby-union-international-test-scores-results-kick-off-time-national-stadium-tokyo",
    "image": "https://media.guim.co.uk/14fec09a7c5d55f45d56ba1eb3daca71f83545cc/97_23_3600_2881/500.jpg",
    "summary": "Jonathan Howcroft offers a live update as the Wallabies prepare to face off against their former coach, Eddie Jones. The report provides minute-by-minute coverage of the match. Stay tuned for key moments and insights from the game.",
    "published": "2025-10-25T06:26:15Z"
  },
  {
    "title": "Australia v India: third men’s one-day international – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/25/australia-v-india-cricket-odi-live-scores-aus-vs-ind-scorecard-third-mens-one-day-international",
    "image": "https://media.guim.co.uk/0dc3e7e0355336466629b8195dad223b39ca0944/49_0_2806_2246/500.jpg",
    "summary": "James Wallace provides an over-by-over report for cricket updates, offering real-time insights and analysis of the game. Fans can join the coverage for detailed commentary as the match unfolds. Stay tuned for the latest developments and highlights from the event.",
    "published": "2025-10-25T06:23:00Z"
  },
  {
    "title": "Buy now, pay later holiday purchases leaving travellers exposed to losses",
    "url": "https://www.theguardian.com/business/2025/oct/25/buy-now-pay-later-holiday-purchase-traveller-risks",
    "image": "https://media.guim.co.uk/f1586358209bc045a0f1c401a6e5b0a2138929c7/68_0_4687_3749/500.jpg",
    "summary": "Buy Now, Pay Later (BNPL) options are increasingly favored for booking holidays and flights. However, consumers are advised to carefully consider the associated risks. Weighing financial responsibilities against travel plans is essential for informed decision-making.",
    "published": "2025-10-25T06:00:28Z"
  },
  {
    "title": "Daisy May and Charlie Cooper’s NightWatch: their hilarious ghost show is a warm-hearted joy",
    "url": "https://www.theguardian.com/tv-and-radio/2025/oct/25/daisy-may-and-charlie-coopers-nightwatch-their-hilarious-ghost-show-is-a-warm-hearted-joy",
    "image": "https://media.guim.co.uk/2e0b2ee29689934bc0837d3f54073c0b92cc09b6/640_296_3370_2698/500.jpg",
    "summary": "Bafta-winning siblings explore some of the UK's most haunted locations, engaging in playful banter and humorous antics. The focus is less on ghostly encounters and more on delivering comedic moments. Audiences can expect a night filled with laughter and entertainment.",
    "published": "2025-10-25T06:00:28Z"
  },
  {
    "title": "‘Enforced veganism’: Ofcom lets GB News flout accuracy rules, say climate campaigners",
    "url": "https://www.theguardian.com/environment/2025/oct/25/enforced-veganism-ofcom-gb-news-flout-accuracy-rules-say-climate-campaigners",
    "image": "https://media.guim.co.uk/51aa66b1456065c745119e95ce67b5954b7ea954/147_0_2259_1808/500.jpg",
    "summary": "A regulator reported receiving 1,221 complaints against UK broadcasters since 2020. Despite this high volume of grievances, it found no violations of its broadcasting code. The findings suggest the broadcasters adhered to the established standards amid public concerns.",
    "published": "2025-10-25T06:00:27Z"
  }
]