[
  {
    "title": "PMQs: Starmer defends Rayner amid controversy surrounding seaside flat – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/03/farage-starmer-badenoch-pmqs-news-updates-uk-politics-live",
    "image": "https://media.guim.co.uk/d8db59d6ff351623f8c9383b8a7cc72c4eb81633/38_107_2388_1911/500.jpg",
    "summary": "Labour leader Keir Starmer expressed pride in sitting beside his deputy, Angela Rayner, a working-class woman, during a recent event. This follows Rayner's admission of underpaying stamp duty on her £800,000 flat, raising questions about her financial transparency. The situation highlights ongoing discussions regarding the responsibilities of public officials in managing their fiscal obligations.",
    "published": "2025-09-03T11:25:18Z"
  },
  {
    "title": "Pat Cummins ready to ‘take a few risks’ to be fit for first Ashes Test with back issue",
    "url": "https://www.theguardian.com/sport/2025/sep/02/australia-ashes-test-cricket-pat-cummins-mitchell-starc",
    "image": "https://media.guim.co.uk/caf5735ccd9592d129337d7957642eaedeae1bbe/66_164_1620_1295/500.jpg",
    "summary": "Australia's captain will sit out the upcoming home white-ball series against India. Mitchell Starc has announced his retirement from T20 internationals. The squad has been announced for the upcoming tour of New Zealand.",
    "published": "2025-09-03T11:22:44Z"
  },
  {
    "title": "‘It’s been quite a ride!’ Melvyn Bragg to step down from Radio 4’s In Our Time after 27 years",
    "url": "https://www.theguardian.com/tv-and-radio/2025/sep/03/in-our-time-melvyn-bragg-to-step-down-from-radio-4-role-after-27-years",
    "image": "https://media.guim.co.uk/810cc276394b91cbe05910994fb856bdb22244d3/0_624_2795_2235/500.jpg",
    "summary": "The broadcaster is departing from the popular BBC program after hosting over 1,000 episodes. Their tenure has significantly impacted the lives of millions. The decision marks the end of an era for the show's dedicated audience.",
    "published": "2025-09-03T11:17:50Z"
  },
  {
    "title": "Cringe or comfort? Why some Black people ‘code switch’ their accents",
    "url": "https://www.theguardian.com/news/2025/sep/03/black-people-code-switch-accents-dialects",
    "image": "https://media.guim.co.uk/8c91c41b01be1fe57aff757558f61d8ac6ef1972/0_0_3989_3191/500.jpg",
    "summary": "Dialects serve as significant markers of identity, particularly for individuals from ethnic minority backgrounds. They can influence social dynamics and perceptions within communities. Understanding these dialects can foster greater cultural appreciation and awareness.",
    "published": "2025-09-03T11:15:05Z"
  },
  {
    "title": "Investors urge calm over bond sell-off as UK borrowing costs ease back from 27-year high – business live",
    "url": "https://www.theguardian.com/business/live/2025/sep/03/global-bond-sell-off-japan-government-debt-uk-us-eurozone-pound-falls-business-live-news-updates",
    "image": "https://media.guim.co.uk/33043e635ce2b16bdd760078e1df4511ce16a2d7/500_0_5000_4002/500.jpg",
    "summary": "UK 30-year yields initially increased in early trading on Wednesday but later retreated from those higher levels. The market experienced fluctuations in response to economic conditions. Investors are closely monitoring developments that could influence interest rates.",
    "published": "2025-09-03T11:14:10Z"
  }
]