[
  {
    "title": "NRL 2025 grand final: Melbourne Storm v Brisbane Broncos – rugby league live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/05/nrl-2025-grand-final-melbourne-storm-v-brisbane-broncos-rugby-league-live",
    "image": "https://media.guim.co.uk/1c365743459ec754019045619bf183db0b00dc10/424_0_2938_2351/500.jpg",
    "summary": "The Storm and Broncos are facing off in the men’s decider at Accor Stadium. Jonathan Howcroft provides minute-by-minute updates on the match. Fans can follow along for the latest developments in this exciting showdown.",
    "published": "2025-10-05T10:15:54Z"
  },
  {
    "title": "Gaza ceasefire talks live: negotiators due in Cairo as Israeli attacks continue",
    "url": "https://www.theguardian.com/world/live/2025/oct/05/gaza-ceasefire-israel-palestine-hamas-trump-cairo-negotiations-middle-east-crisis-live-news-updates",
    "image": "https://media.guim.co.uk/547b7a5cc18105a953b48919cda03551a19b5e0f/886_0_4554_3642/500.jpg",
    "summary": "Reports of deadly attacks in Gaza persist even after Donald Trump's urging for Israel to \"immediately stop the bombing.\" The ongoing violence has raised concerns about civilian casualties. The situation remains volatile, with international calls for a ceasefire intensifying.",
    "published": "2025-10-05T10:10:51Z"
  },
  {
    "title": "Uprooted review – the female fightback against the exploitation of Latin America",
    "url": "https://www.theguardian.com/stage/2025/oct/05/uprooted-review-ephemeral-ensemble-new-diorama-theatre",
    "image": "https://media.guim.co.uk/96b37f18b00cb8bc981cc5acb666c29f36fa623e/367_511_2931_2345/500.jpg",
    "summary": "Ephemeral Ensemble's new work, following their piece Rewind, presents an atmospheric exploration of the ecological devastation caused by Western colonization in Latin America. The narrative is framed through a feminist lens, highlighting the complex intersections of gender and environmental issues. However, critics note the execution may lack clarity and focus.",
    "published": "2025-10-05T10:08:00Z"
  },
  {
    "title": "WSL updates from four games, plus Ipswich v Norwich in Championship – clockwatch live",
    "url": "https://www.theguardian.com/football/live/2025/oct/05/postecoglou-nottingham-forest-wsl-ipswich-norwich-matchday-live",
    "image": "https://media.guim.co.uk/42ba77261cee77e46e1fea7309b8a53ae5c0e6f2/0_0_5000_4000/500.png",
    "summary": "Join our writers for updates, previews, and discussions surrounding a packed day of football action. Stay informed with the latest news and insights. Don't miss out on the excitement!",
    "published": "2025-10-05T10:07:55Z"
  },
  {
    "title": "Russian drones and missiles bombard Ukrainian city of Lviv",
    "url": "https://www.theguardian.com/world/2025/oct/05/russian-drones-missiles-bombard-attack-ukraine-lviv",
    "image": "https://media.guim.co.uk/9a9ffcfbdaead90e4c8392f29d7c49cfd6385428/51_0_1499_1199/500.jpg",
    "summary": "Four individuals were killed in drone and missile strikes on a western city located just 70 kilometers from the Polish border. The attacks highlight ongoing regional tensions and security concerns. Authorities are investigating the incident further.",
    "published": "2025-10-05T10:01:42Z"
  }
]