[
  {
    "title": "Hawke urges Nampijinpa Price to say sorry for ‘real damage’ her migration comments caused Indian community",
    "url": "https://www.theguardian.com/australia-news/2025/sep/08/alex-hawke-calls-for-jacinta-nampijinpa-price-apology-to-indian-community",
    "image": "https://media.guim.co.uk/9cb0382b5638df51cd92aa8b02aa45f254e95c4c/600_143_2702_2163/500.jpg",
    "summary": "Sussan Ley faces pressure to mend relations with the diaspora community after a Northern Territory senator alleged, without evidence, that the Labor Party is importing migrants to secure votes. The claims have sparked controversy and criticism. Ley's response is being closely observed as tensions rise within the political landscape.",
    "published": "2025-09-08T03:13:42Z"
  },
  {
    "title": "Tom Phillips shooting: NZ police search for children after fugitive father shot dead by police – latest updates",
    "url": "https://www.theguardian.com/world/live/2025/sep/08/tom-phillips-shooting-live-updates-nz-police-search-for-children-of-fugitive-father-shot-new-zealand-police-latest-updates",
    "image": "https://media.guim.co.uk/f9f0a59a0229d41651191bed78ddca513eae7f2c/0_11_750_600/500.jpg",
    "summary": "A fugitive father, on the run with his children for four years, was shot by police during an attempted burglary in Piopio. Authorities are now actively searching for two of his missing children. The incident marks a significant development in a long-standing case involving the family.",
    "published": "2025-09-08T03:12:54Z"
  },
  {
    "title": "Australia news live: UTS cuts staff bonuses amid restructure; ‘anti-corruption’ protests will not march on Harbour Bridge",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/08/australia-news-live-erin-patterson-mushroom-murders-trial-sentencing-blood-moon-pictures-shark-net-beach-ntwnfb",
    "image": "https://media.guim.co.uk/943c8e38c06f76ca0d92176db0afe187c10feede/0_0_7240_5792/500.jpg",
    "summary": "I'm sorry, but I can't summarize the news without specific content or details about the event you're referring to. Please provide the text or context you want summarized, and I'll be happy to help!",
    "published": "2025-09-08T03:08:16Z"
  },
  {
    "title": "Hidden for nearly four years: how the saga of fugitive father Tom Phillips unfolded in New Zealand",
    "url": "https://www.theguardian.com/world/2025/sep/08/fugitive-father-tom-phillips-how-saga-unfolded-new-zealand",
    "image": "https://media.guim.co.uk/a4a2cf1d90ae8afe1f0bd0429c8a60862babb350/461_0_2111_1690/500.jpg",
    "summary": "Phillips and his three children were seldom seen over the years, leading to questions about their survival in the remote wilderness. Their elusive presence sparked intrigue and speculation. The family's situation remained a mystery for an extended period.",
    "published": "2025-09-08T03:04:10Z"
  },
  {
    "title": "Pacific Islands Forum: climate crisis tops agenda as China exclusion casts shadow over leaders meeting",
    "url": "https://www.theguardian.com/world/2025/sep/08/pacific-islands-forum-2025-pif-leaders-meeting",
    "image": "https://media.guim.co.uk/a34179b7c1e3bbf7e51678133c8e21e6c1e760e4/0_0_1500_1200/500.jpg",
    "summary": "The Pacific Islands Forum 2025 is off to a contentious beginning as discussions in the Solomon Islands exclude China, the US, and Taiwan. Pacific leaders are convening amid ongoing geopolitical tensions in the region. The absence of these major powers may influence the forum's goals and effectiveness.",
    "published": "2025-09-08T02:35:58Z"
  }
]