[
  {
    "title": "Geelong v Brisbane: AFL 2025 second qualifying final – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/05/geelong-v-brisbane-afl-2025-second-qualifying-final-live",
    "image": "https://media.guim.co.uk/de3545a47d9d509fda4729413af3bb9701a4178f/139_0_2719_2174/500.jpg",
    "summary": "The Cats and Lions are competing in a crucial preliminary final at the MCG, vying for a coveted home final spot. Martin Pegan will provide live updates on their progress throughout the match. Fans can tune in for a detailed report as the game unfolds.",
    "published": "2025-09-05T10:38:17Z"
  },
  {
    "title": "Stones ruled out for England, Tottenham latest, Russo’s new deal as WSL kicks off: football news – live",
    "url": "https://www.theguardian.com/football/live/2025/sep/05/tottenham-latest-russo-new-arsenal-deal-internationals-world-cup-qualifiers-wsl-football-news-live",
    "image": "https://media.guim.co.uk/318aaf5f37035cd311b50cc9cffeb5e59a73fe17/0_232_1850_1480/500.jpg",
    "summary": "Denmark and Scotland prepare for their upcoming match as part of the World Cup qualifiers. The excitement builds with various teams gearing up for important fixtures. Fans are eagerly awaiting this weekend's action in the football world.",
    "published": "2025-09-05T10:37:51Z"
  },
  {
    "title": "Australia v New Zealand: men’s international football friendly – live",
    "url": "https://www.theguardian.com/football/live/2025/sep/05/australia-socceroos-vs-new-zealand-all-whites-live-updates-international-football-friendly-latest",
    "image": "https://media.guim.co.uk/4bb1b67fc72cb0a476812fc85b765966b154cc97/145_0_3021_2417/500.jpg",
    "summary": "Australia hosts the first match of the Soccer Ashes series, featuring the historically significant trophy. The event marks a renewed rivalry with both teams vying for victory. Stay tuned for minute-by-minute updates from Joey Lynch.",
    "published": "2025-09-05T10:37:42Z"
  },
  {
    "title": "Trump’s department of war rebrand ‘won’t strengthen national security or help military personnel’ – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/05/donald-trump-pentagon-department-of-war-immigration-tariffs-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/c146a79abb28b95cb40e0832fb51f05174c5fc57/997_0_5338_4272/500.jpg",
    "summary": "Democrat Tammy Duckworth, an injured veteran, advocates for allocating funds to support military families. She emphasizes the importance of preventing conflicts as a priority. Duckworth's stance reflects her commitment to veteran and family welfare.",
    "published": "2025-09-05T10:34:06Z"
  },
  {
    "title": "Tycoon who led campaign to decriminalise cannabis to be Thai PM",
    "url": "https://www.theguardian.com/world/2025/sep/05/tycoon-anutin-charnvirakul-thai-pm-cannabis-campaign",
    "image": "https://media.guim.co.uk/c8f10348abf7d2640da4c67f02a7bbabeacffa44/438_30_4259_3409/500.jpg",
    "summary": "Anutin Charnvirakul has been elected as Thailand's new prime minister by parliament, committing to hold elections within four months. His election comes as former Prime Minister Thaksin Shinawatra departs the country. The political landscape in Thailand is shifting with these developments.",
    "published": "2025-09-05T10:32:16Z"
  }
]