[
  {
    "title": "Ruthless New Zealand machine an ominous obstacle on England’s horizon  | Andy Bull",
    "url": "https://www.theguardian.com/sport/2025/sep/13/ruthless-new-zealand-machine-an-ominous-obstacle-on-englands-horizon",
    "image": "https://media.guim.co.uk/92e47cfc03b1447cc4723a6e3b80de23cdb59be4/467_221_2131_1704/500.jpg",
    "summary": "The Black Ferns are showing strong form as they approach the World Cup, positioning themselves as the primary challengers to the Red Roses. Their current peak performance levels enhance their threat in the tournament. The competition between these two teams is anticipated to be intense as they vie for the title.",
    "published": "2025-09-13T17:24:15Z"
  },
  {
    "title": "Sophie de Goede shines in Canada’s formidable win over Australia",
    "url": "https://www.theguardian.com/sport/2025/sep/13/canada-australia-womens-rugby-world-cup-match-report",
    "image": "https://media.guim.co.uk/6110ec970972c38b1ff2feca5594d43c2b85c753/251_98_5185_4148/500.jpg",
    "summary": "Canada triumphed over Australia with a dominant performance, scoring seven tries to secure a 46-5 victory. This win propels Canada into the semi-finals of the World Cup. The team's strong showing highlights their potential in the tournament.",
    "published": "2025-09-13T17:19:00Z"
  },
  {
    "title": "West Ham v Tottenham: Premier League – live",
    "url": "https://www.theguardian.com/football/live/2025/sep/13/west-ham-v-tottenham-premier-league-live",
    "image": "https://media.guim.co.uk/edb8d8b11d253de2bebc91408af6ec08cf3f3035/669_0_4050_3240/500.jpg",
    "summary": "Tottenham is set to begin a new chapter without chairman Daniel Levy as they face West Ham at the London Stadium. Emillia Hawkins will provide insights on whether the team can secure a victory in this pivotal match. The outcome will mark the start of Tottenham's future direction following Levy's departure.",
    "published": "2025-09-13T17:18:56Z"
  },
  {
    "title": "Charlie Kirk’s US campus tour will continue despite his death, widow says – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/13/charlie-kirk-suspect-tyler-robinson-erika-kirk-us-politics-latest-news-donald-trump",
    "image": "https://media.guim.co.uk/4ef3a1799aa47a877a94ba4204664a5c985dac29/210_0_1333_1067/500.jpg",
    "summary": "Erika Kirk shared that her late husband’s voice will continue to resonate with her, emphasizing the lasting impact of his presence in her life. She expressed a deep emotional connection to his memory as she navigates her grief. The statement highlights the enduring bond between them, even after his passing.",
    "published": "2025-09-13T17:05:43Z"
  },
  {
    "title": "Several people fired after clampdown on speech over Charlie Kirk shooting",
    "url": "https://www.theguardian.com/us-news/2025/sep/13/charlie-kirk-shooting-people-fired-social-media",
    "image": "https://media.guim.co.uk/a0842f70fc4d54dfaf9fe8982ac68caeffacbf96/439_0_4583_3667/500.jpg",
    "summary": "A number of teachers, firefighters, and military personnel have been terminated from their positions for expressing their opinions on social media. These job losses highlight the growing scrutiny of online expressions and their potential consequences on professional roles. The incidents raise concerns about free speech and the boundaries of personal expression in the workplace.",
    "published": "2025-09-13T17:00:39Z"
  }
]