[
  {
    "title": "Global stocks rally on US-China trade optimism; Greencore-Bakkavor food giant deal faces UK competition concerns – business live",
    "url": "https://www.theguardian.com/business/live/2025/oct/27/global-stocks-rally-us-china-trade-greencore-bakkavor-deal-uk-competition-business-live-news",
    "image": "https://media.guim.co.uk/9181ed644abdf35f09b475d782ff9f2ad7608510/425_0_4245_3396/500.jpg",
    "summary": "Donald Trump announced that the United States and China are poised to reach a trade deal. He expressed optimism about the negotiations between the two countries. This development could signal progress in easing trade tensions.",
    "published": "2025-10-27T09:22:21Z"
  },
  {
    "title": "England and Wales prison checks to be enhanced after inmate released in error",
    "url": "https://www.theguardian.com/society/2025/oct/27/england-and-wales-prison-checks-to-be-enhanced-after-inmate-released-in-error",
    "image": "https://media.guim.co.uk/20232e761df5e6b6b5cf1b8f00ccef17be74373c/298_0_3141_2512/500.jpg",
    "summary": "Justice Secretary David Lammy will unveil a series of measures in response to the wrongful release of Hadush Kebatu. The announcement aims to address flaws in the justice system that allowed the error to occur. Specific details of the measures have yet to be disclosed.",
    "published": "2025-10-27T09:21:30Z"
  },
  {
    "title": "Javier Milei hails ‘tipping point’ as his far-right party wins Argentina’s midterm elections",
    "url": "https://www.theguardian.com/world/2025/oct/27/javier-milei-president-far-right-party-wins-argentina-midterm-elections",
    "image": "https://media.guim.co.uk/e720fbcf4ff396097337ab573590ff0ccc79868f/0_0_3921_3137/500.jpg",
    "summary": "Javier Milei's party did not secure a congressional majority, despite expectations following recent scandals. The election results caught many analysts by surprise, indicating a more resilient voter base than anticipated. This outcome suggests potential challenges for Milei's proposed agenda moving forward.",
    "published": "2025-10-27T09:14:14Z"
  },
  {
    "title": "Lithuania to close border with Belarus after balloons shut down Vilnius airport – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/oct/27/lithuania-airport-russia-belarus-viktor-orban-pope-leo-europe-live-news-updates",
    "image": "https://media.guim.co.uk/b480f3dd6d296cd4a68952ce66d5416834f239b0/628_0_4098_3278/500.jpg",
    "summary": "Radar systems detected 66 unidentified objects overnight, prompting the fourth airport closure within a week. In response, the Prime Minister announced a policy to shoot down any further balloons identified in airspace. The series of events has heightened concerns about air safety and national security.",
    "published": "2025-10-27T09:03:16Z"
  },
  {
    "title": "The Four Spent the Day Together by Chris Kraus review – a cult writer tries something new",
    "url": "https://www.theguardian.com/books/2025/oct/27/the-four-spent-the-day-together-by-chris-kraus-review-a-cult-writer-tries-something-new",
    "image": "https://media.guim.co.uk/285672a1df72773c150ae1d38f3c5ede3633ebb0/714_1334_1928_1542/500.jpg",
    "summary": "The author of \"I Love Dick\" merges elements of autofiction, memoir, and true crime in their latest work. This new blend explores personal narratives alongside gripping real-life stories. The innovative approach highlights the complexities of identity and experience.",
    "published": "2025-10-27T09:00:28Z"
  }
]