[
  {
    "title": "Australia news live: Hecs debt relief to come into effect from mid-November; Melbourne’s new Town Hall metro station complete",
    "url": "https://www.theguardian.com/australia-news/live/2025/oct/05/australia-news-live-hecs-student-debt-mark-butler-albanese-labor-melbourne-metro-nsw-qld-sussan-ley-andrew-hastie-coalition-ntwnfb",
    "image": "https://media.guim.co.uk/677bd6bc3f202404374826e287de834f6177658e/756_415_3490_2793/500.jpg",
    "summary": "Sorry, I can't provide live updates or current news summaries as I am not connected to the internet. However, if you provide specific news content or topics, I can help summarize that information!",
    "published": "2025-10-04T22:05:22Z"
  },
  {
    "title": "Maresca’s wild sprint a red-hot release after Chelsea stifle misfiring Liverpool | Barney Ronay",
    "url": "https://www.theguardian.com/football/2025/oct/04/enzo-maresca-wild-sprint-red-hot-release-chelsea-stifle-misfiring-liverpool",
    "image": "https://media.guim.co.uk/48132ea6465a20776fe09c44f8de536fee347035/117_65_2357_1886/500.jpg",
    "summary": "The Blues' head coach was dismissed during the match following Estêvão Willian's last-minute winning goal. Amid the chaos, it is Arne Slot who must now devise strategies to address the team's challenges. The incident highlights the need for effective leadership and tactical adjustments moving forward.",
    "published": "2025-10-04T21:30:52Z"
  },
  {
    "title": "Police make almost 500 arrests at Palestine Action protest in London",
    "url": "https://www.theguardian.com/world/2025/oct/04/palestine-action-protest-police-arrests-london-demo",
    "image": "https://media.guim.co.uk/51163e7da7d008c6cbcc9a4da5a69a6fa232b354/492_0_5196_4155/500.jpg",
    "summary": "Officers arrested activists during a silent vigil held in support of a banned organization. The demonstrations continued despite the Prime Minister's pleas for restraint. Tensions rose as authorities intervened to disperse the gathering.",
    "published": "2025-10-04T21:27:28Z"
  },
  {
    "title": "Pritzker warns Trump planning send national guard to Chicago as border patrol there shoots woman",
    "url": "https://www.theguardian.com/us-news/2025/oct/04/woman-shot-border-patrol-chicago",
    "image": "https://media.guim.co.uk/80ed7e704c0cf1b7b7d87183bb93072f59ef6a44/520_0_5200_4160/500.jpg",
    "summary": "The Illinois governor has accused the administration of increasing hostility towards the state's citizens and residents. He expressed concerns over policies and actions that could negatively impact the well-being of Illinoisans. The remarks aim to highlight growing tensions between the state government and federal policies.",
    "published": "2025-10-04T21:09:32Z"
  },
  {
    "title": "St Helens given police escort after ‘terrorist threat’ made during Hull KR match",
    "url": "https://www.theguardian.com/sport/2025/oct/04/st-helens-given-police-escort-after-terrorist-threat-made-during-hull-kr-match",
    "image": "https://media.guim.co.uk/2e574f3014165b07c65274292aa143f03e6fd347/308_0_3335_2669/500.jpg",
    "summary": "St Helens had to evacuate Hull KR's Craven Park under police escort due to a reported 'terror threat' received via their Instagram account. The situation prompted immediate security measures to ensure the safety of players and staff. Authorities are investigating the incident further.",
    "published": "2025-10-04T20:58:31Z"
  }
]