[
  {
    "title": "UN security council to hold emergency meeting as Poland plans no-fly zone after Russian drone incursion – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/sep/11/europe-live-news-updates-poland-russia-drones-ukraine-war-latest",
    "image": "https://media.guim.co.uk/3351505fa5cf93907799226bae00ea3615781a5c/338_0_3730_2984/500.jpg",
    "summary": "Poland is enhancing its national security by implementing measures to restrict air traffic in its eastern regions. This move aims to bolster the country's defenses amid ongoing geopolitical tensions. The government is focusing on improving readiness and response capabilities in the face of potential threats.",
    "published": "2025-09-11T11:12:57Z"
  },
  {
    "title": "Worcestershire v Nottinghamshire, Surrey v Warwickshire and more: county cricket, day four – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/11/worcestershire-v-nottinghamshire-surrey-v-warwickshire-and-more-county-cricket-day-four-live",
    "image": "https://media.guim.co.uk/1581c6001aa5286f6d2745bc3bd9765be03d277b/0_157_2449_1959/500.jpg",
    "summary": "Tanya Aldred provides updates on the concluding day of the latest County Championship matches. Fans can follow her rolling report for real-time insights and developments. Stay tuned for highlights and key moments from the matches.",
    "published": "2025-09-11T11:12:43Z"
  },
  {
    "title": "German exports threatened by trade war tariffs and weak demand; London tube strike enters fourth day – business live",
    "url": "https://www.theguardian.com/business/live/2025/sep/11/john-lewis-deeper-loss-london-tube-strike-fourth-day-ecb-interest-rates-us-inflation-business-live-news-updates",
    "image": "https://media.guim.co.uk/4edd889dd5fd475a8837f1e724df28f1c5277a7f/0_0_5652_4522/500.jpg",
    "summary": "John Lewis is reporting that it expects to achieve full-year profit growth, despite experiencing a larger loss in the first half of the year. The company remains optimistic about its financial performance moving forward. Ongoing updates will continue to provide insights into the economic landscape.",
    "published": "2025-09-11T11:11:13Z"
  },
  {
    "title": "Ideal review – stage return for Johnny Vegas’s TV weed dealer fails to score",
    "url": "https://www.theguardian.com/stage/2025/sep/11/ideal-review-johnny-vegas-tv-weed-dealer-lowry-salford",
    "image": "https://media.guim.co.uk/a3cbc426c08db63930eceb2bea91996b2b84d6be/2438_366_4377_3503/500.jpg",
    "summary": "The revival of Graham Duff's cult comedy brings joy to its dedicated fanbase, showcasing familiar characters and humor. However, those unfamiliar with the original series may find little to engage with. Overall, it caters primarily to existing fans rather than attracting new viewers.",
    "published": "2025-09-11T11:08:38Z"
  },
  {
    "title": "Peter Mandelson sacked for saying Epstein’s first conviction was wrong, minister says – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/11/peter-mandelson-keir-starmer-deputy-labour-leader-uk-politics-latest-news",
    "image": "https://media.guim.co.uk/c07d84b6f076607ac3574c51f6231bdbd5c70ef6/1437_592_5194_4154/500.jpg",
    "summary": "A Foreign Office minister has described the ex-ambassador's claim that Jeffrey Epstein's conviction was wrongful as \"new information.\" This statement brings fresh scrutiny to Epstein's legal history. The remark suggests potential implications for how Epstein's case is viewed in light of the ambassador's perspective.",
    "published": "2025-09-11T11:07:44Z"
  }
]