[
  {
    "title": "Keir Starmer says ‘Bollywood blockbusters’ will be made in the UK under new trade deal with India – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/oct/09/foreign-secretary-yvette-cooper-keir-starmer-gaza-ceasefire-uk-politics-live",
    "image": "https://media.guim.co.uk/a41de80fdf0029186fbd408645b8753da1032793/302_0_2913_2333/500.jpg",
    "summary": "British Prime Minister announces plans for three Bollywood films to be produced in the UK. Additionally, two more British universities are set to establish campuses in India. This initiative aims to strengthen cultural ties and educational collaboration between the two countries.",
    "published": "2025-10-09T14:17:57Z"
  },
  {
    "title": "National guard troops ‘protecting’ ICE and other federal property in Chicago area – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/09/national-guard-ice-federal-property-chicago-illinois-us-politics-live",
    "image": "https://media.guim.co.uk/16ef2ce5e57ef1c162b1416a80b73e341dd04e07/508_0_5033_4024/500.jpg",
    "summary": "Donald Trump has called for the imprisonment of Brandon Johnson, the mayor of Chicago, and JB Pritzker, the governor of Illinois. This announcement reflects escalating tensions between Trump and Democratic leaders in the state. The implications of Trump's remarks have generated significant media attention and public discussion.",
    "published": "2025-10-09T14:17:49Z"
  },
  {
    "title": "Zelenskyy says he will nominate Trump for Nobel peace prize if he secures Ukraine ceasefire – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/oct/09/russia-attacks-ukraine-energy-france-germany-europe-live-news-updates",
    "image": "https://media.guim.co.uk/48b7710afa6452197dd48cf020c807d6d9609e04/670_294_1776_1420/500.jpg",
    "summary": "The US president asserts that he should receive an award for his efforts in achieving \"numerous\" peace deals. He believes his contributions to diplomatic relations warrant recognition. This statement emphasizes his focus on international peace initiatives during his presidency.",
    "published": "2025-10-09T14:14:48Z"
  },
  {
    "title": "Pundits prove Disney’s plusses in Women’s Champions League bow but they need a studio | Tom Garry",
    "url": "https://www.theguardian.com/football/2025/oct/09/disney-plus-womens-champions-league-coverage-analysis",
    "image": "https://media.guim.co.uk/b73502dd53b3ba7ff0b63db2c9a7c37ac83d8b7e/415_0_4538_3630/500.jpg",
    "summary": "The broadcaster's opening week featured some gaps and technical issues, but it showcased a strong lineup of experts. Despite the challenges, the coverage aimed to provide in-depth analysis. Overall, it set ambitious goals for future broadcasts.",
    "published": "2025-10-09T14:13:31Z"
  },
  {
    "title": "Gaza ceasefire plan live: Israel says it is preparing to pull back troops; living hostages could be released within days",
    "url": "https://www.theguardian.com/world/live/2025/oct/09/gaza-ceasefire-live-trump-says-hostages-probably-released-monday-idf-says-gaza-city-still-extremely-dangerous",
    "image": "https://media.guim.co.uk/ac1babc39647947640e9097dc52d3072092c055f/108_0_3780_3024/500.jpg",
    "summary": "US President Donald Trump announced that Israel and Hamas have reached an agreement on the \"first phase\" of a plan to pause hostilities. This phase involves a temporary cessation of fighting alongside the release of certain hostages and prisoners. The development marks a significant step towards reducing tensions in the region.",
    "published": "2025-10-09T14:09:49Z"
  }
]