[
  {
    "title": "Australia news live: Ben Roberts-Smith’s final appeal bid rejected by high court; some Rip Curl and Kathmandu stores to close",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/04/australia-politics-live-bob-carr-daniel-andrews-beijing-putin-question-time-labor-coalition-anthony-albanese-sussan-ley-ntwnfb",
    "summary": "I'm sorry, but I need more context or content to summarize. Please provide the specific news article or details you'd like summarized.",
    "published": "2025-09-04T06:46:24Z"
  },
  {
    "title": "Global bond sell-off eases after weak US jobs report and smooth Japanese debt auction – business live",
    "url": "https://www.theguardian.com/business/live/2025/sep/04/global-bond-sell-off-eases-us-jobs-report-japan-debt-auction-car-sales-uk-construction-business-live-news-updates",
    "image": "https://media.guim.co.uk/5ee62c3d9ba104c37b687ade4d187cf8951511af/831_0_4169_3334/500.jpg",
    "summary": "Stay updated with ongoing reports on the latest economic and financial developments, including market trends, policy changes, and analysis. Key events and significant movements in various sectors will be highlighted. Continuous updates ensure you remain informed about the dynamic financial landscape.",
    "published": "2025-09-04T06:45:37Z"
  },
  {
    "title": "Afternoon Update: $475m win for robodebt victims; factchecking ‘mass migration’ claims; and Tony Abbott joins Substack",
    "url": "https://www.theguardian.com/australia-news/2025/sep/04/afternoon-update-thursday-ntwnfb",
    "image": "https://media.guim.co.uk/78a2ced81c92fc969dfad4acac88427e4e2757d9/868_596_6135_4908/500.jpg",
    "summary": "The Australian government has announced a significant increase in compensation for victims as part of the largest class action settlement in the country's history. This decision aims to address grievances and provide support to those affected. The settlement reflects a commitment to justice and accountability for the impacted individuals.",
    "published": "2025-09-04T06:32:18Z"
  },
  {
    "title": "Failure to tackle antisemitism should see organisations’ funding cut like subpar childcare centres, special envoy says",
    "url": "https://www.theguardian.com/australia-news/2025/sep/04/failure-tackle-antisemitism-organisations-funding-cut-subpar-childcare-centres-special-envoy-jillian-segal-ntwnfb",
    "image": "https://media.guim.co.uk/88788e964ebfce8713fad12cbc5d06993b0b75f6/657_275_4515_3614/500.jpg",
    "summary": "At a Gold Coast conference, Jillian Segal chose not to comment on the presence of neo-Nazis during the recent anti-immigration marches. Her decision not to address the issue has drawn attention. The marches have sparked controversy and raised concerns among various groups.",
    "published": "2025-09-04T06:16:16Z"
  },
  {
    "title": "Michael Jackson’s daughter Paris criticises ‘sugar-coated’ biopic about her father",
    "url": "https://www.theguardian.com/music/2025/sep/04/michael-jackson-daughter-paris-criticises-sugar-coated-biopic-about-her-father",
    "image": "https://media.guim.co.uk/307d2c84593b054c757229a6bf31626db9cf6382/187_116_1612_1289/500.jpg",
    "summary": "A 27-year-old individual has criticized the upcoming 2026 film \"Michael,\" claiming it caters to a niche segment of their father's fanbase that remains entrenched in fantasy. The individual also denied any personal involvement with the film. Their remarks highlight concerns about the film's target audience and authenticity.",
    "published": "2025-09-04T06:13:44Z"
  }
]