[
  {
    "title": "North Melbourne v Brisbane: 2025 AFLW grand final – live",
    "url": "https://www.theguardian.com/sport/live/2025/nov/29/aflw-grand-final-live-north-melbourne-kangaroos-v-brisbane-lions",
    "image": "https://media.guim.co.uk/c0ac87e8326e8d09fc6c62b48f5571619a681d82/561_0_4000_3200/500.jpg",
    "summary": "The report focuses on the matchup between the Lions and the Kangaroos, with the potential for the Lions to cause an upset against the reigning champions. The Kangaroos aim to extend their winning streak. Martin Pegan will provide live updates throughout the game.",
    "published": "2025-11-29T08:20:32Z"
  },
  {
    "title": "Manchester City look to bounce back in Premier League, Lionesses in action – matchday live",
    "url": "https://www.theguardian.com/football/live/2025/nov/29/manchester-city-look-to-bounce-back-in-premier-league-lionesses-in-action-matchday-live",
    "image": "https://media.guim.co.uk/1e361a820adc107e1f7d636768c365202e00b00d/0_0_3757_3005/500.jpg",
    "summary": "Yara El-Shaboury will host a news segment and discussion leading up to the day's events. The program aims to engage viewers with insights and updates. Tune in for an informative preview of what's ahead.",
    "published": "2025-11-29T08:14:33Z"
  },
  {
    "title": "Manchester United’s academy reeling from staff churn and Ratcliffe’s brickbats",
    "url": "https://www.theguardian.com/football/2025/nov/29/manchester-uniteds-academy-reeling-from-staff-churn-and-ratcliffes-brickbats",
    "image": "https://media.guim.co.uk/adc6c12e02489d269f7154dd89cc70808dac1f08/427_253_3755_3006/500.jpg",
    "summary": "Carrington, the renowned training ground for producing future football stars, is facing challenges amidst a leadership transition. The club is experiencing turmoil as it navigates changes in its management. This uncertainty raises questions about its ability to maintain its tradition of nurturing young talent.",
    "published": "2025-11-29T08:00:31Z"
  },
  {
    "title": "If we are witnessing the death spiral of the cult of Bazball, let’s savour what it created | Barney Ronay",
    "url": "https://www.theguardian.com/sport/2025/nov/29/if-we-are-witnessing-the-death-spiral-of-the-cult-of-bazball-lets-savour-what-it-created",
    "image": "https://media.guim.co.uk/2fe57f391d93a90219454b3be038b4abef2cc079/0_0_3543_2835/500.jpg",
    "summary": "The discussions around challenging traditional views and Ben Stokes' candid expressions of male emotions have sparked important conversations. Even the less favorable aspects of the discussions have remained noteworthy and impossible to overlook. Overall, the dialogue has provoked significant reflections on emotional openness.",
    "published": "2025-11-29T08:00:31Z"
  },
  {
    "title": "Cool Blues: Chelsea determined to stay grounded despite Barcelona demolition",
    "url": "https://www.theguardian.com/football/2025/nov/29/chelsea-barcelona-arsenal-premier-league",
    "image": "https://media.guim.co.uk/7add6b2b88458d3008f600ae6d264823b4aa3a87/825_123_4542_3634/500.jpg",
    "summary": "Enzo Maresca's young team is set to face league leaders Arsenal on Sunday, riding a wave of confidence. They have progressed from past emotional highs and lows. The squad’s recent performance suggests a more stable and mature approach.",
    "published": "2025-11-29T08:00:31Z"
  }
]