[
  {
    "title": "Israeli hostages released: all living captives freed as Trump receives standing ovation at Knesset – latest updates",
    "url": "https://www.theguardian.com/world/live/2025/oct/13/gaza-ceasefire-live-updates-israel-hostages-release-hamas-trump-middle-east",
    "image": "https://media.guim.co.uk/f7353bd190bb499ebb84df9b1e09e5b4a9ebdbcd/1318_0_6591_5273/500.jpg",
    "summary": "Donald Trump is scheduled to address the Israeli parliament amid ongoing developments regarding hostages. The first images of the released hostages have emerged, highlighting the situation's urgency. Trump's speech comes at a significant moment in the context of Israeli politics and hostage negotiations.",
    "published": "2025-10-13T10:22:48Z"
  },
  {
    "title": "MPs expected to grill minister over collapse of China spy trial as Commons resumes after recess – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/oct/13/china-spy-trial-keir-starmer-egypt-margaret-thatcher-anniversary-uk-politics-live-news-updates",
    "image": "https://media.guim.co.uk/f6125c2b2026546e29edcc14ff3a273a8a352ebb/0_349_1333_1066/500.jpg",
    "summary": "The Speaker of the House is expected to support MPs calling for increased scrutiny regarding issues surrounding government security adviser Jonathan Powell. This comes amid growing pressure on Powell. The situation highlights concerns about government accountability and oversight.",
    "published": "2025-10-13T10:20:11Z"
  },
  {
    "title": "Climate investment is growth opportunity of 21st century, says economist",
    "url": "https://www.theguardian.com/environment/2025/oct/13/climate-investment-is-biggest-growth-opportunity-of-21st-century-says-economist-nicholas-stern",
    "image": "https://media.guim.co.uk/286a84b8ef816a099951dc378f99d02d705969b6/655_0_3276_2621/500.jpg",
    "summary": "Lord Stern cautions that reliance on fossil fuel-driven growth ultimately leads to economic collapse due to the significant environmental damage it causes. He emphasizes the need for sustainable practices to prevent self-destructive outcomes. Stern’s remarks highlight the urgency of transitioning to greener alternatives for long-term economic stability.",
    "published": "2025-10-13T10:17:37Z"
  },
  {
    "title": "French political crisis continues as Lecornu unveils new government – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/oct/13/france-political-crisis-lecornu-macron-sarkozy-ukraine-russia-gaza-europe-news-latest-updates",
    "image": "https://media.guim.co.uk/40fda9c4fcc0ddae98a6037c30580e54954c3faf/947_0_6172_4938/500.jpg",
    "summary": "Marine Le Pen and Éric Ciotti have united to submit a joint motion of no confidence against the government. This move comes alongside the left-wing party France Unbowed, which is also aiming to challenge the government's stability. The coalition highlights a growing opposition to the current administration's policies.",
    "published": "2025-10-13T10:15:49Z"
  },
  {
    "title": "Nobel economics prize goes to three researchers for work explaining tech and innovation-driven growth – business live",
    "url": "https://www.theguardian.com/business/live/2025/oct/13/asian-stocks-tumble-fresh-us-china-trade-spat-chinese-exports-top-forecasts-business-live",
    "image": "https://media.guim.co.uk/49b2a292262cd54e918026d55fae6a5b572ab927/372_0_6876_5504/500.jpg",
    "summary": "European shares and US stock futures rose following a more conciliatory tone from Trump regarding trade with Beijing, described as the \"Taco trade.\" This shift in sentiment boosted investor confidence and market performance. Overall, the positive response highlights the impact of diplomatic relations on financial markets.",
    "published": "2025-10-13T10:13:32Z"
  }
]