[
  {
    "title": "Australia v New Zealand: women’s international football friendly – live",
    "url": "https://www.theguardian.com/football/live/2025/nov/28/matildas-game-australia-new-zealand-womens-international-football-friendly-live",
    "image": "https://media.guim.co.uk/51cdaa720d18aa74746e3cb90e4d41e1855f0e1c/377_0_3753_3003/500.jpg",
    "summary": "The Matildas face off against the Silver Ferns in Gosford as they prepare for the upcoming Asian Cup. Jo Khan will provide minute-by-minute updates on the match. Fans can stay tuned for live coverage of this important game.",
    "published": "2025-11-28T08:25:38Z"
  },
  {
    "title": "Consumers urged to watch out for Black Friday scams and bad deals – business live",
    "url": "https://www.theguardian.com/business/live/2025/nov/28/black-friday-consumers-scams-bad-deals-stock-market-ftse-pound-business-live",
    "image": "https://media.guim.co.uk/87b879cddcf7e9969d06f8f229817d494b80087c/303_0_3750_3000/500.jpg",
    "summary": "Stay updated with the latest developments in the economic and financial sectors, including market trends, policy changes, and financial performances. Key reports and analyses are being continuously provided to inform readers about current events. This coverage aims to keep audiences informed about significant shifts affecting economies globally.",
    "published": "2025-11-28T08:23:35Z"
  },
  {
    "title": "Ukraine’s anti-corruption authorities search properties linked to Zelenskyy’s chief of staff – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/nov/28/europe-latest-news-andriy-yermak-anti-corruption-zelenskyy-ukraine-russia-war-peace-talks-putin",
    "image": "https://media.guim.co.uk/597879bd9c804269eb6fdfb97ccc50ef89b4fafe/126_0_1621_1297/500.jpg",
    "summary": "Andriy Yermak reported that authorities have been granted full access to his apartment. He is cooperating with the officers during their investigation, accompanied by his lawyers. The situation indicates ongoing legal scrutiny involving Yermak.",
    "published": "2025-11-28T08:23:14Z"
  },
  {
    "title": "How Palmeiras and Flamengo became South America’s football superpowers ",
    "url": "https://www.theguardian.com/football/2025/nov/28/how-palmeiras-and-flamengo-became-south-americas-football-superpowers",
    "image": "https://media.guim.co.uk/0d537bb3969b06ff08fe3e00148f77cf6ddd8616/398_0_3420_2736/500.jpg",
    "summary": "The Libertadores Cup final highlights a growing rivalry in South American football, fueled by substantial European-level funding and player acquisition. This financial power is influencing competition dynamics on the continent. As a result, the final showcases the evolving landscape of South American soccer.",
    "published": "2025-11-28T08:00:05Z"
  },
  {
    "title": "Chess: Sindarov, 19, becomes youngest World Cup winner as London Classic begins",
    "url": "https://www.theguardian.com/sport/2025/nov/28/chess-sindarov-19-becomes-youngest-world-cup-winner-as-london-classic-begins",
    "image": "https://media.guim.co.uk/2fa8ecb8b47154a1846ed7f93833d1d0df31b141/341_0_5801_4641/500.jpg",
    "summary": "An Uzbek player won $120,000 and secured a spot in the 2026 Candidates tournament in Cyprus. This tournament will determine the official challenger for Gukesh Dommaraju's world championship title. The event is expected to draw significant attention in the chess community.",
    "published": "2025-11-28T08:00:05Z"
  }
]