[
  {
    "title": "Australia news live: Dezi Freeman’s partner arrested and released, police say; 450 police involved in search for alleged cop killer",
    "url": "https://www.theguardian.com/australia-news/live/2025/aug/29/australia-news-live-porepunkah-shooting-dezi-freeman-manhunt-police-latest-updates-ntwnfb",
    "image": "https://media.guim.co.uk/d670a4b4050501f126cf709653a1e8dccf32db05/209_0_3720_2976/500.jpg",
    "summary": "Please provide the news content you'd like summarized, and I'll be happy to help!",
    "published": "2025-08-29T06:49:14Z"
  },
  {
    "title": "UK business confidence rises despite jitters over economy – business live",
    "url": "https://www.theguardian.com/business/live/2025/aug/29/uk-business-confidence-rises-economy-fears-stock-market-bonds-inflation-business-live-news-updates",
    "image": "https://media.guim.co.uk/f9f48faa306af40f2e67443a8e4d50574e623b44/608_0_4264_3412/500.jpg",
    "summary": "The news highlights ongoing developments in the economic and financial sectors, focusing on key indicators, market trends, and policy changes. Analysts are closely monitoring fluctuations in stock markets, inflation rates, and interest rates. Additional insights include expert opinions on potential impacts for businesses and consumers.",
    "published": "2025-08-29T06:48:43Z"
  },
  {
    "title": "Hundreds of police join Porepunkah manhunt; PM criticises Katter’s outburst; and inside the world of pigeon racing",
    "url": "https://www.theguardian.com/australia-news/2025/aug/29/afternoon-update-friday-ntwnfb",
    "image": "https://media.guim.co.uk/d670a4b4050501f126cf709653a1e8dccf32db05/209_0_3720_2976/500.jpg",
    "summary": "On the fourth day of the manhunt for Dezi Freeman, police revealed that a woman who had been arrested and subsequently released is his wife. This information adds a personal dimension to the ongoing investigation. Authorities continue to search for Freeman as the manhunt intensifies.",
    "published": "2025-08-29T06:47:33Z"
  },
  {
    "title": "Transcendence for Beginners by Clare Carlisle review – a philosopher’s guide to enlightenment",
    "url": "https://www.theguardian.com/books/2025/aug/29/transcendence-for-beginners-by-clare-carlisle-review-a-philosophers-guide-to-enlightenment",
    "image": "https://media.guim.co.uk/a9edc9006f74a5bd9760a7da4b5998dffd0ba3f7/470_0_4680_3744/500.jpg",
    "summary": "The article explores the idea of finding moments of transcendence and connection to something larger than ourselves even amid our hectic daily routines. It emphasizes the importance of mindfulness and awareness in uncovering these profound experiences. Ultimately, it suggests that such moments can enhance our sense of purpose and fulfillment in life.",
    "published": "2025-08-29T06:01:07Z"
  },
  {
    "title": "Heatwaves, wildfires and the hot summers that could change how we holiday",
    "url": "https://www.theguardian.com/environment/2025/aug/28/down-to-earth-wildfires-holiday-tourism",
    "image": "https://media.guim.co.uk/c5aed37152ef6cdffb674a89aedab60c59adc680/138_0_2008_1608/500.jpg",
    "summary": "Rising global temperatures are leading to extreme weather events and disruptions, fundamentally impacting the tourism experience. Tourists may face challenges such as altered travel plans and heightened environmental awareness. This situation raises questions about responsible travel and the environmental impact of tourism in a climate-stricken world.",
    "published": "2025-08-29T06:00:10Z"
  }
]