[
  {
    "title": "‘Loyalty should be a two way street’: Marjorie Taylor Greene nods to rift with Trump in resignation letter – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/nov/21/donald-trump-democrats-republicans-zohran-mamdani-us-politics-latest-news-updates",
    "image": "https://media.guim.co.uk/65c26ec13f2d71c267cf618b714c7220092ab3c1/958_0_4788_3831/500.jpg",
    "summary": "Greene announced her departure from the Republican party in a video and statement on X, expressing her discontent with the party establishment. She criticized the leadership for not aligning with her values and concerns. The announcement marks a significant shift in her political alignment.",
    "published": "2025-11-22T03:03:55Z"
  },
  {
    "title": "From staunch Trump ally to ‘traitor’: key takeaways of Marjorie Taylor Greene’s career",
    "url": "https://www.theguardian.com/us-news/2025/nov/21/marjorie-taylor-greene-career-key-takeaways",
    "image": "https://media.guim.co.uk/b12e09992836859122b17314dda2b8c1a4c3ed57/865_0_7008_5607/500.jpg",
    "summary": "A Georgia representative announced her resignation from office, effective January 2026. The decision was made public on Friday. Further details regarding her reasons for stepping down were not disclosed.",
    "published": "2025-11-22T03:02:03Z"
  },
  {
    "title": "Australia v England: Ashes first Test, day two – live",
    "url": "https://www.theguardian.com/sport/live/2025/nov/22/australia-vs-england-live-ashes-first-1st-test-day-two-aus-v-eng-cricket-scores-updates-perth",
    "image": "https://media.guim.co.uk/b402a6a782a3c3d8abf8c409653601465d6b42fd/710_0_7500_6000/500.jpg",
    "summary": "In the series opener in Perth, the tourists have established a 40-run lead heading into their second innings. The action continues as writers provide live updates on the match. Fans are invited to follow the developments closely.",
    "published": "2025-11-22T03:00:44Z"
  },
  {
    "title": "Marjorie Taylor Greene to resign from Congress in January",
    "url": "https://www.theguardian.com/us-news/2025/nov/21/marjorie-taylor-greene-resigns",
    "image": "https://media.guim.co.uk/f77e660498bd99368208387da77d4cfeede17fd5/522_0_3184_2547/500.jpg",
    "summary": "A prominent Georgia Republican and key figure in the MAGA movement has announced the decision to relinquish their House seat following a significant rift with Donald Trump. This move signals a notable shift in political allegiances and dynamics within the party. The decision underscores the ongoing tensions between certain factions of the GOP and Trump’s influence.",
    "published": "2025-11-22T02:37:10Z"
  },
  {
    "title": "Trump news at a glance: president meets Mamdani at White House and it was … nice?",
    "url": "https://www.theguardian.com/us-news/2025/nov/21/trump-administration-news-updates-latest",
    "image": "https://media.guim.co.uk/83291e38e56f9e329974364c2396a18ed0b5df0f/847_647_3685_2948/500.jpg",
    "summary": "In a recent meeting, Trump expressed strong confidence in Mamdani's capabilities, stating he believes he can perform well in his role. The interaction was notably cordial, highlighting a positive tone between Trump and the press. This marks a departure from the often contentious relationship he has had with media representatives.",
    "published": "2025-11-22T02:09:04Z"
  }
]