[
  {
    "title": "Formula One: United States Grand Prix – live updatesi",
    "url": "https://www.theguardian.com/sport/live/2025/oct/19/formula-one-united-states-grand-prix-live-updates",
    "image": "https://media.guim.co.uk/1785f27b6325c4fc46be724c91e835a5e097b2ca/239_228_1783_1428/500.jpg",
    "summary": "The F1 season is ongoing at the Circuit of the Americas in Austin, Texas. Fans can stay updated on the latest developments and excitement of the race. Beau Dure is providing live coverage and insights throughout the event.",
    "published": "2025-10-19T19:14:09Z"
  },
  {
    "title": "Strictly Come Dancing: week four results – live",
    "url": "https://www.theguardian.com/tv-and-radio/live/2025/oct/18/strictly-come-dancing-week-four-live",
    "image": "https://media.guim.co.uk/699245c1c1163420b0391d1b8d565d1516ceedcc/382_0_3818_3055/500.jpg",
    "summary": "Following the movie special, the ballroom returned to normal with Alex Kingston’s Fast Car rumba scoring the highest. La Voix found themselves at the bottom following a poor cha-cha performance. The suspense remains regarding who will not advance to Icons Week.",
    "published": "2025-10-19T19:12:19Z"
  },
  {
    "title": "NFL week seven: Vikings v Eagles, Chiefs v Raiders and more after Rams rout Jaguars – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/19/nfl-week-seven-chiefs-raiders-vikings-eagles-titans-patriots-and-more-live",
    "image": "https://media.guim.co.uk/ffec60c619814a564fefcc8737a6d48bd18a8f4c/507_0_4174_3340/500.jpg",
    "summary": "Graham Searles will provide live updates as the Kansas City Chiefs take on their AFC West rivals. The Super Bowl champions will visit Minneapolis for the matchup. Fans can tune in for real-time coverage of the game.",
    "published": "2025-10-19T19:11:48Z"
  },
  {
    "title": "Israel says it has resumed enforcement of ceasefire after wave of airstrikes on Gaza – Middle East crisis live",
    "url": "https://www.theguardian.com/world/live/2025/oct/19/gaza-ceasefire-israel-hamas-rafah-hostages-middle-east-crisis-live-news-updates",
    "image": "https://media.guim.co.uk/b198308420febc1a936f813e41ce168bdbb75a0a/0_518_3913_3130/500.jpg",
    "summary": "The Israel Defense Forces (IDF) announced that they conducted \"significant strikes\" in retaliation for violations by Hamas. This military response comes amid ongoing tensions in the region. The IDF emphasized their actions were aimed at protecting Israeli security.",
    "published": "2025-10-19T19:09:36Z"
  },
  {
    "title": "Louvre heist: hunt on for thieves after eight ‘priceless’ jewellery pieces stolen",
    "url": "https://www.theguardian.com/world/2025/oct/19/louvre-closed-after-robbery-french-culture-minister-says",
    "image": "https://media.guim.co.uk/b977b9a80a56e7b7f4384fc63f4ce9eb5675fa6b/420_0_4583_3667/500.jpg",
    "summary": "A highly professional daylight robbery occurred at a Paris museum, where valuable items, including a necklace given by Napoleon to his wife, were stolen. The incident highlights significant security concerns surrounding art and heritage protection. Authorities are investigating the theft and seeking the culprits.",
    "published": "2025-10-19T19:07:50Z"
  }
]