[
  {
    "title": "Burst of positivity at Tottenham under Martin Ho is boost for WSL as a whole",
    "url": "https://www.theguardian.com/football/2025/oct/11/burst-of-positivity-at-tottenham-under-martin-ho-is-boost-for-wsl-as-a-whole",
    "image": "https://media.guim.co.uk/0b8ee6064742749d41d83b558ad8d4a51ef27930/434_0_2978_2383/500.jpg",
    "summary": "The new coach has successfully revitalized the team following two impactful summer signings. Their impressive performance so far sets high expectations. A significant challenge lies ahead with an upcoming match against Chelsea.",
    "published": "2025-10-11T07:00:19Z"
  },
  {
    "title": "Winter is coming: England’s cricketers fly out for long tour that will decide Ashes and World Cup",
    "url": "https://www.theguardian.com/sport/2025/oct/11/england-ashes-world-cup-schedule-cricket",
    "image": "https://media.guim.co.uk/428c6773ca307091b611f7ff5ca1b5efeab2edeb/153_81_2763_2211/500.jpg",
    "summary": "Mike Gatting expressed concern over a 30-game schedule four decades ago, highlighting the strain it placed on players. Although there have been improvements since then, concerns remain about the demanding nature of the upcoming season. Players are feeling apprehensive about the potential fatigue from a rigorous schedule.",
    "published": "2025-10-11T07:00:18Z"
  },
  {
    "title": "A World Cup preying on Fomo: Fifa’s 2026 ticket scheme is a late-capitalist hellscape",
    "url": "https://www.theguardian.com/football/2025/oct/11/fifa-2026-world-cup-tickets-dynamic-pricing-nft-resale",
    "image": "https://media.guim.co.uk/875af39c1fb8663de5554eb166c33f058254bb97/395_0_4596_3677/500.jpg",
    "summary": "The 2026 World Cup is transforming into a financial spectacle, characterized by NFTs and dynamic pricing strategies. Fans face double resale fees, highlighting the intersection of sports fandom and late-capitalist trends. This shift emphasizes the commercialization and monetization of sports entertainment.",
    "published": "2025-10-11T07:00:18Z"
  },
  {
    "title": "Baggy, skinny … or neither? Why ‘Goldilocks’ jeans are having a moment",
    "url": "https://www.theguardian.com/fashion/2025/oct/11/baggy-skinny-or-neither-why-goldilocks-jeans-are-having-a-moment",
    "image": "https://media.guim.co.uk/e2289c30e521e28cf5a47c240224a237384089a2/0_581_4379_3503/500.jpg",
    "summary": "Straight-cut denims are emerging as a classic staple, providing a versatile option amid the ever-changing fashion trends. Their enduring style appeals to those seeking a reliable wardrobe choice. This resurgence highlights a growing preference for timeless pieces over fleeting styles.",
    "published": "2025-10-11T07:00:17Z"
  },
  {
    "title": "Fifa seeks advice over banning league games staged overseas amid regulations redraft",
    "url": "https://www.theguardian.com/football/2025/oct/11/fifa-seeks-advice-over-banning-league-games-staged-overseas-amid-regulations-redraft",
    "image": "https://media.guim.co.uk/2d836b5cbbc2070ce08842e760342b5ffcd93184/479_182_4485_3588/500.jpg",
    "summary": "FIFA is revising its regulations regarding the staging of domestic league games in foreign countries. The organization is also seeking legal advice to determine if it can implement a ban on such practices. These moves come in response to concerns about the impact of foreign-hosted league games on domestic competitions.",
    "published": "2025-10-11T07:00:17Z"
  }
]