[
  {
    "title": "‘Not words that I would have used’: Stride distances himself from Jenrick’s ‘no white faces’ comments – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/oct/07/conservative-tory-conference-kemi-badenoch-jenrick-starmer-labour-protests-reform-uk-politics-live-news-updates",
    "image": "https://media.guim.co.uk/c8d959c76bf4e9a2d4507dee9b403b87fe8744a3/82_0_4484_3587/500.jpg",
    "summary": "The Shadow Chancellor has distanced himself from controversial remarks made by Robert Jenrick, which were labeled as racist regarding the area of Handsworth. This move comes after Jenrick faced backlash for his statements. The situation highlights ongoing discussions around race and representation in British politics.",
    "published": "2025-10-07T17:13:25Z"
  },
  {
    "title": "Pam Bondi spars with Democratic senator over Epstein ‘client list’ and national guard deployments in tense hearing – live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/07/donald-trump-national-guard-pam-bondi-mark-carney-government-shutdown-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/de6426e93a01b83337d36da9b73f1b82c59486bd/447_0_4583_3667/500.jpg",
    "summary": "Illinois Senator Dick Durbin questioned Trump’s former Attorney General regarding the Epstein investigation during a Senate hearing. In response, Attorney General Pam Bondi stated, \"the National Guard is on the way\" to address issues in Chicago. The exchange highlights ongoing concerns over crime and federal assistance in urban areas.",
    "published": "2025-10-07T17:08:00Z"
  },
  {
    "title": "DPD couriers face substantial earnings loss from cut in delivery payments",
    "url": "https://www.theguardian.com/business/2025/oct/07/dpd-rate-cut-couriers-substantial-earnings-loss",
    "image": "https://media.guim.co.uk/d1e48d72bbfc16bf17990325de58813470a506c3/0_708_4000_3200/500.jpg",
    "summary": "A company plans to implement a pay decrease in the upcoming year, impacting thousands of drivers. The reduction could cost each driver up to £25 daily. This decision has sparked concerns among the workforce about the financial implications.",
    "published": "2025-10-07T17:02:03Z"
  },
  {
    "title": "Marc Maron is the rare comedian who shows us how it should be done | Andrew Lawrence",
    "url": "https://www.theguardian.com/culture/2025/oct/07/marc-maron-are-we-good-wtf",
    "image": "https://media.guim.co.uk/46010a50e460e3410ef22760f2cff875afbdeb25/961_0_4805_3844/500.jpg",
    "summary": "In a recent documentary accompanying the conclusion of his WTF podcast, US comic Marc Maron demonstrates remarkable integrity and perspective. His insights stand out, offering valuable lessons for many of his fellow comedians. Maron's reflections highlight the importance of authenticity in the comedy world.",
    "published": "2025-10-07T17:01:01Z"
  },
  {
    "title": "Edgar Neufeld obituary",
    "url": "https://www.theguardian.com/technology/2025/oct/07/edgar-neufeld-obituary",
    "image": "https://media.guim.co.uk/5de3e742e84c80feccaf16f8ee51be859e61c06f/0_83_481_385/master/481.jpg",
    "summary": "A pioneering scientist who joined IBM during the early days of computing has passed away, having significantly contributed to the company's advancement in technology. He eventually rose to the position of director for Europe, influencing the growth of the tech industry. His legacy includes inspiring future generations in the field of computer science.",
    "published": "2025-10-07T16:56:50Z"
  }
]