[
  {
    "title": "Maresca short on Sterling sympathy, Arsenal make boardroom reshuffle: football – live",
    "url": "https://www.theguardian.com/football/live/2025/sep/19/champions-league-reaction-premier-league-news-and-more-football-live",
    "image": "https://media.guim.co.uk/41c34d8d2376d7603d71fc9720b48b3a75b4f5a8/1055_358_4180_3344/500.jpg",
    "summary": "Join our writers for the latest updates and insights as the weekend approaches. Stay informed with news, previews, and commentary on current events. Don't miss out on what's happening!",
    "published": "2025-09-19T15:31:56Z"
  },
  {
    "title": "Assisted dying bill to get further scrutiny by Lords committee",
    "url": "https://www.theguardian.com/society/2025/sep/19/assisted-dying-bill-to-get-further-scrutiny-by-lords-committee",
    "image": "https://media.guim.co.uk/8d4b113306bd777aa8af42aef4abb9cd9b8ff3a6/1282_0_6426_5141/500.jpg",
    "summary": "A special committee has been established to tackle concerns related to funding and implementation following the initial passage of legislation in the House of Lords. This initiative aims to ensure effective oversight and address potential issues. The move marks a significant step in the legislative process.",
    "published": "2025-09-19T15:29:52Z"
  },
  {
    "title": "Nato intercepted Russian aircraft over Estonia as EU calls violation an ‘extremely dangerous provocation’ – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/sep/19/eu-sanctions-russia-oil-ukraine-vladimir-putin-volodymyr-zelenskyy-donald-trump-france-macron-europe-live-news",
    "image": "https://media.guim.co.uk/045bb79b5e3c9a29294e2845edd35661a6e6be69/14_0_2526_2022/500.jpg",
    "summary": "NATO's spokesperson criticized Russia for its \"reckless behavior\" after three Mig-31 fighter jets briefly entered Estonian airspace for 12 minutes. The incident heightened tensions in the region amid ongoing concerns over Russian military activities. NATO continues to monitor the situation closely.",
    "published": "2025-09-19T15:29:06Z"
  },
  {
    "title": "House passes short-term funding bill to avert US government shutdown; legislation moves to Senate – live updates",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/19/donald-trump-jimmy-kimmel-suspension-abc-federal-reserve-lisa-cook-us-politics-live-news",
    "image": "https://media.guim.co.uk/343af67cda73260f73dbd41206390e8c8881f89e/1_0_3333_2667/500.jpg",
    "summary": "A Republican bill aimed at funding the government until November 21 has passed the House. The legislation now moves to the Senate, where its likelihood of approval is uncertain. This development underscores ongoing negotiations regarding government funding amid partisan disagreements.",
    "published": "2025-09-19T15:26:51Z"
  },
  {
    "title": "Hilary Benn: Troubles legacy agreement will deal with ‘unfinished business’",
    "url": "https://www.theguardian.com/uk-news/2025/sep/19/hilary-benn-troubles-legacy-agreement-deal-unfinished-business",
    "image": "https://media.guim.co.uk/4a8e2384840679c4025ba8792c3f8a395e5df086/0_24_2744_2195/500.jpg",
    "summary": "The Northern Ireland Secretary expressed optimism that new measures will provide answers for victims from all sides of the political divide. The initiatives are aimed at addressing the complexities of past conflicts. He emphasized the importance of acknowledging the experiences of all communities involved.",
    "published": "2025-09-19T15:24:52Z"
  }
]