[
  {
    "title": "No Kings protest live updates: millions march against Trump in nationwide day of protest",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/18/anti-trump-no-kings-protests-updates",
    "image": "https://media.guim.co.uk/b544d70659a5e98714ea6ff5f87559a6daf56971/458_0_4583_3667/500.jpg",
    "summary": "Democratic lawmakers, including Bernie Sanders, Raphael Warnock, Adam Schiff, Cory Booker, and Chuck Schumer, participated in rallies to promote party unity and address key issues. Their presence emphasized the importance of mobilizing support ahead of upcoming elections. The events highlighted their commitment to progressive policies and engaging with constituents.",
    "published": "2025-10-18T22:14:44Z"
  },
  {
    "title": "US Grand Prix qualifying: Verstappen wins pole ahead of Norris – live ",
    "url": "https://www.theguardian.com/sport/live/2025/oct/18/f1-united-states-grand-prix-sprint-race-and-qualifying-live",
    "image": "https://media.guim.co.uk/8b26747ca3aed9ea4b26e2830d1808d8165d21e8/379_0_3707_2966/500.jpg",
    "summary": "Beau Dure provides updates on the sprint race and qualifying events at the Circuit of the Americas. Fans can stay informed about the latest developments and results from the races. Don't miss the coverage to catch all the exciting action.",
    "published": "2025-10-18T22:13:41Z"
  },
  {
    "title": "Australia news live: counter-protests expected at anti-immigration rallies; Albanese heads to Washington for Trump meeting",
    "url": "https://www.theguardian.com/australia-news/live/2025/oct/19/anthony-albanese-donald-trump-washington-meeting-aukus-tariffs-counter-protests-anti-immigration-march-for-australia-rallies-ntwnfb",
    "image": "https://media.guim.co.uk/9c41a4139aec5df6323ead7718d84b13b3655de5/565_0_5819_4658/500.jpg",
    "summary": "I'm unable to summarize without specific content to reference. Please provide the news article or details you'd like summarized.",
    "published": "2025-10-18T22:13:08Z"
  },
  {
    "title": "Premier League top scorers 2025-26: who is leading race for golden boot?",
    "url": "https://www.theguardian.com/football/2025/sep/15/premier-league-top-scorers-2025-26-who-is-leading-race-for-golden-boot",
    "image": "https://media.guim.co.uk/98b6ebe9ac8a3bff1c9b8d5a6431c34aaccf4380/309_580_3267_2614/500.jpg",
    "summary": "This season, standout players in the English Premier League are vying for the top position in the goalscoring charts. The article highlights the leading scorers and their impressive performances. Fans are eager to see how the competition unfolds as the season progresses.",
    "published": "2025-10-18T21:34:23Z"
  },
  {
    "title": "‘Those final few hours were brutal’: British duo end epic journey in Australia after rowing across Pacific Ocean",
    "url": "https://www.theguardian.com/sport/2025/oct/19/those-final-few-hours-were-brutal-british-duo-end-epic-journey-in-australia-after-rowing-across-pacific-ocean",
    "image": "https://media.guim.co.uk/7b3b7cac40a04485e834ee14ff98ae362f5bf111/450_0_5100_4080/500.jpg",
    "summary": "Jess Rowe and Miriam Payne have achieved a remarkable feat by completing a five-and-a-half-month journey from Lima to Cairns. Their record-setting crossing showcases their endurance and teamwork. The duo's accomplishment highlights the spirit of adventure and exploration.",
    "published": "2025-10-18T21:32:30Z"
  }
]