[
  {
    "title": "Europe live: François Bayrou says lawmakers face ‘not a political, but historical question’ on France’s future, ahead of confidence vote",
    "url": "https://www.theguardian.com/world/live/2025/sep/08/europe-live-macron-france-prime-minister-francois-bayrou-confidence-vote-latest-news",
    "image": "https://media.guim.co.uk/27d25520fffb3884efcb6e72485f947141dc0929/132_0_5380_4304/500.jpg",
    "summary": "Bayrou's potential departure would mark the third prime ministerial loss in a year, complicating President Macron's political landscape. This situation creates a challenging vacancy for Macron to fill. It underscores instability within the French government and the difficulties currently facing the administration.",
    "published": "2025-09-08T14:40:08Z"
  },
  {
    "title": "Navarro files appeal to force justice department to vindicate him from subpoena conviction",
    "url": "https://www.theguardian.com/us-news/2025/sep/08/peter-navarro-appeal-trump-justice-department-subpoena-conviction",
    "image": "https://media.guim.co.uk/4f4fffbe3956f9fee39e994f32682ddbb3efddde/366_0_3660_2928/500.jpg",
    "summary": "The request raises concerns that the department may appear to have dismissed the case to protect Navarro following his appointment as a senior adviser to Trump. This could lead to accusations of bias and influence in the legal proceedings. Overall, the situation underscores the complexities involved in high-profile political cases.",
    "published": "2025-09-08T14:40:08Z"
  },
  {
    "title": "Lightning stops play at Somerset v Yorkshire: county cricket day one – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/08/county-championship-cricket-surrey-warwickshire-somerset-yorkshire-live",
    "image": "https://media.guim.co.uk/5bd8314df1c4395889e9e74ef0ec0907bcb1fce0/0_0_4978_3981/500.jpg",
    "summary": "Tanya Aldred provides live updates as the County Championship resumes after a month-long hiatus. Fans can expect comprehensive coverage from various match venues. The action is set to excite cricket enthusiasts as teams compete in the tournament's ongoing fixtures.",
    "published": "2025-09-08T14:37:54Z"
  },
  {
    "title": "New home secretary Shabana Mahmood says she will not run for deputy leader after Labour accused of ‘stitch-up’ over contest – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/08/labour-deputy-leadership-election-contest-keir-starmer-angela-rayner-uk-politics-live",
    "image": "https://media.guim.co.uk/ce5c9ae13f9192a7db62c9f1381de999825f24fe/449_0_4124_3299/500.jpg",
    "summary": "Wes Streeting and Jess Phillips have announced they will not run for leadership. Meanwhile, reports indicate Emily Thornberry is looking for supporters as she considers a candidacy. Candidates must gather 80 backers by 5pm on Thursday to qualify.",
    "published": "2025-09-08T14:36:54Z"
  },
  {
    "title": "Trump tells foreign firms to ‘respect’ immigration laws after Hyundai raid – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/08/donald-trump-immigration-hyundai-tariffs-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/206b6a050c7692b19e2a312a1b21419be68db1c9/224_0_2045_1636/500.jpg",
    "summary": "The President expressed support for foreign investments in the U.S., emphasizing the importance of hiring and training American workers. He highlighted that such practices would benefit the domestic workforce. The remarks underline a commitment to fostering a robust job market while attracting global capital.",
    "published": "2025-09-08T14:35:30Z"
  }
]