[
  {
    "title": "Manchester United v Chelsea: Premier League – live",
    "url": "https://www.theguardian.com/football/live/2025/sep/20/manchester-united-v-chelsea-premier-league-live",
    "image": "https://media.guim.co.uk/6f197007c28336db1801b854752935bc84a72d4d/232_158_2249_1798/500.jpg",
    "summary": "Ruben Amorim experienced a significant night at Old Trafford, as reported by Scott Murray. The minute-by-minute coverage highlights crucial moments and events from the match. Fans and analysts are keenly observing Amorim's tactics and performance in this high-stakes setting.",
    "published": "2025-09-20T18:39:00Z"
  },
  {
    "title": "Strictly Come Dancing: the launch show – live",
    "url": "https://www.theguardian.com/tv-and-radio/live/2025/sep/20/strictly-come-dancing-the-launch-show-live",
    "image": "https://media.guim.co.uk/afc3c2595039bacd2a2ca8b42af5ebb8752b030a/250_0_2500_2000/500.jpg",
    "summary": "The ballroom blockbuster is set to return in 2025 with 15 new celebrity contestants. Fans are eager to see which professional dancers they'll be paired with. Speculation is building on which contestants will impress with their moves and which might struggle.",
    "published": "2025-09-20T18:38:31Z"
  },
  {
    "title": "Heathrow flights delayed and cancelled as cyber-attack hits European airports",
    "url": "https://www.theguardian.com/uk-news/2025/sep/20/heathrow-airport-delays-cyber-attack-berlin-brussels-cancelled-delays",
    "image": "https://media.guim.co.uk/eff8d097c15e0b4c721dd1077de90a782d049f24/288_0_2923_2339/500.jpg",
    "summary": "A recent attack has compromised security at both Brussels and Berlin airports, disrupting their check-in and boarding systems. The incident has sparked concerns about the effectiveness of airport security measures. Authorities are investigating the breach to understand its implications and prevent future incidents.",
    "published": "2025-09-20T18:18:18Z"
  },
  {
    "title": "The students who debated with Charlie Kirk: ‘His goal was to verbally defeat us’",
    "url": "https://www.theguardian.com/us-news/ng-interactive/2025/sep/20/charlie-kirk-debate-style",
    "image": "https://media.guim.co.uk/71ca85b3c29512417bd36d12939f5117df2b3720/311_1054_2090_1671/500.jpg",
    "summary": "Young liberals confronted Kirk's conservative perspectives during the viral YouTube series \"Surrounded,\" which has been described as an unsettling experience by a rhetoric expert. The series highlights the clash between progressive and conservative ideologies. This engagement has sparked discussions about political discourse and the effectiveness of such confrontational formats.",
    "published": "2025-09-20T18:00:20Z"
  },
  {
    "title": "Graham Potter under serious threat of West Ham sack after Crystal Palace defeat",
    "url": "https://www.theguardian.com/football/2025/sep/20/graham-potter-under-serious-threat-of-west-ham-sack-after-crystal-palace-defeat",
    "image": "https://media.guim.co.uk/f7380da7e8fda521e5ec20119c6e81bce154ebaf/122_0_2143_1714/500.jpg",
    "summary": "Graham Potter's job is at risk following West Ham's poor start to the season. The team suffered a 2-1 home defeat to Crystal Palace. This loss has intensified scrutiny on Potter's position as manager.",
    "published": "2025-09-20T17:57:25Z"
  }
]