[
  {
    "title": "US Senate vote to end government shutdown fails for 10th time",
    "url": "https://www.theguardian.com/us-news/2025/oct/16/government-shutdown-aoc-bernie-sanders-republicans",
    "image": "https://media.guim.co.uk/ecd15a31647a1441d629820359d8d791f35bb374/771_507_2967_2373/500.jpg",
    "summary": "The second vote on Pentagon funding has failed, effectively stalling the process for initiating military operations. This setback hinders the government's ability to allocate necessary resources for defense. As a result, military operations remain uncertain and unaddressed.",
    "published": "2025-10-16T19:14:24Z"
  },
  {
    "title": "Benfica v Arsenal: Women’s Champions League – live",
    "url": "https://www.theguardian.com/football/live/2025/oct/16/benfica-v-arsenal-womens-champions-league-live",
    "image": "https://media.guim.co.uk/457d7ed167ad496899d42e97b2e2f19906aa1118/0_170_6603_5282/500.jpg",
    "summary": "Rob Smyth is providing live updates on the match between the reigning champions and the Portuguese champions. Fans can follow along for minute-by-minute coverage of the game. The event promises to be an exciting showdown.",
    "published": "2025-10-16T19:13:37Z"
  },
  {
    "title": "Atlético Madrid 0-1 Manchester United: Women’s Champions League – as it happened",
    "url": "https://www.theguardian.com/football/live/2025/oct/16/atletico-madrid-v-manchester-united-womens-champions-league-live",
    "image": "https://media.guim.co.uk/bcd86943a94c14ff1aa4c532f80f061912ec513c/117_0_4605_3684/500.jpg",
    "summary": "Manchester United secured a narrow victory against Atlético Madrid, surviving a late challenge after Dominique Janssen received a red card. Fridolina Rolfö scored a stunning volley, contributing to the team's win. The match highlighted United's resilience in the face of adversity.",
    "published": "2025-10-16T19:03:00Z"
  },
  {
    "title": "England and New Zealand find ‘special’ camaraderie amid hard graft",
    "url": "https://www.theguardian.com/sport/2025/oct/16/new-zealand-england-t20-cricket-fun-friendship",
    "image": "https://media.guim.co.uk/cabce5ec3741483243e3811b72fe96dfd4c9e1d7/265_0_4074_3261/500.jpg",
    "summary": "The 2025-26 sports season kicks off with a T20 series, marking the start of a demanding schedule. Both the visiting teams and hosts are highlighting the significance of enjoying the game amid the challenges. This emphasis on enjoyment aims to foster a positive atmosphere throughout the series.",
    "published": "2025-10-16T19:00:50Z"
  },
  {
    "title": "Oisin Murphy: ‘I found escapism but also an awful lot of trouble in the bottle’",
    "url": "https://www.theguardian.com/sport/2025/oct/16/oisin-murphy-jockey-interview-horse-racing-alcoholism",
    "image": "https://media.guim.co.uk/dc24f1615d87d62264f5bc5c3c5ba5c4d332e112/182_0_4640_3712/500.jpg",
    "summary": "Champion jockey discusses his journey towards sobriety, reflecting on a car crash in April and his intense desire for victory. He also shares insights into his appreciation for the poetry of Sylvia Plath. The conversation with Donald McRae highlights the intersection of personal struggles and professional ambition.",
    "published": "2025-10-16T19:00:50Z"
  }
]