[
  {
    "title": "ITV shares jump by 18% as it holds talks to sell media and entertainment operations to Sky – business live",
    "url": "https://www.theguardian.com/business/live/2025/nov/07/itv-talks-sell-broadcasting-arm-sky-shares-bank-of-england-stock-markets-business-live",
    "image": "https://media.guim.co.uk/00ce7b1fbe922b05084eb427bab3c5cca58210fc/239_0_3021_2417/500.jpg",
    "summary": "ITV is in early talks about potentially selling its Media and Entertainment (M&E) business to Sky. The deal is valued at £1.6 billion. Further details on the negotiation process have not been disclosed.",
    "published": "2025-11-07T08:22:43Z"
  },
  {
    "title": "Minister defends David Lammy and says ‘broken system’ to blame for prisoner releases – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/nov/07/uk-politics-latest-news-david-lammy-prisoners-labour-keir-starmer",
    "image": "https://media.guim.co.uk/b6359f3b609c171c0e308a5ba15b1cf0d7009ba7/323_0_4152_3323/500.jpg",
    "summary": "Steve Reed emphasized that addressing the issue at hand requires serious discussion rather than gossiping about David Lammy in the media. He advocates for focusing on effective solutions instead of engaging in trivial disputes. Reed's comments reflect a call for constructive dialogue rather than sensationalism.",
    "published": "2025-11-07T08:20:11Z"
  },
  {
    "title": "Protests outside match between Aston Villa and Maccabi Tel Aviv lead to 11 arrests",
    "url": "https://www.theguardian.com/football/2025/nov/06/six-arrested-during-protests-outside-match-between-aston-villa-and-maccabi-tel-aviv",
    "image": "https://media.guim.co.uk/e970d6628aeb53034af3fa459724ab24e135bcfb/45_0_4122_3298/500.jpg",
    "summary": "Independent MP Ayoub Khan addressed a pro-Palestine demonstration, advocating for Palestinian rights. Meanwhile, a small counter-demonstration occurred nearby, expressing opposing views. The events highlighted ongoing tensions surrounding the issue.",
    "published": "2025-11-07T08:11:23Z"
  },
  {
    "title": "Sports quiz of the week: champions, challengers, scorers, Ashes and Traitors",
    "url": "https://www.theguardian.com/sport/2025/nov/07/sports-quiz-week-football-rugby-baseball-cricket-boxing-tennis-ashes-traitors",
    "image": "https://media.guim.co.uk/26abff07722b60ee7319c9d81c06ab6581093bd4/0_0_5000_3999/500.jpg",
    "summary": "Recent sports headlines highlight key developments across various sports, including thrilling matches and notable player performances. In football, rugby, and cricket, teams are vying for championships, while hockey and boxing feature intense rivalries. Tennis showcases exciting tournaments as athletes compete for rankings and titles.",
    "published": "2025-11-07T08:00:23Z"
  },
  {
    "title": "‘Huge step in the right direction’: arts leaders hail move to boost creative subjects in England’s schools",
    "url": "https://www.theguardian.com/education/2025/nov/07/arts-leaders-hail-move-to-boost-creative-subjects-england-schools",
    "image": "https://media.guim.co.uk/26b115591ccb22368c29b33231326081d794a825/0_320_3140_2512/500.jpg",
    "summary": "Cultural leaders are advocating for a significant reform of the educational curriculum to address the long-standing undervaluation of the arts. They believe that this proposed change can help rejuvenate the importance of arts education. The initiative aims to counteract what they see as years of misguided priorities in the educational system.",
    "published": "2025-11-07T08:00:21Z"
  }
]