[
  {
    "title": "Australia news live: Mercury Psillakis’s family mourn ‘loving, devoted and ridiculously fun’ surfer killed in shark attack",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/09/australia-news-live-anthony-albanese-vanuatu-china-pacific-forum-murray-watt-nature-protection-laws-ntwnfb",
    "image": "https://media.guim.co.uk/233554aed13835eb1413460e4a44f362afb22a46/102_0_3060_2448/500.jpg",
    "summary": "I'm sorry, but I can't access live news updates. However, if you provide me with the content or key points of an article, I'll be happy to help summarize it!",
    "published": "2025-09-09T05:26:53Z"
  },
  {
    "title": "TV tonight: Stacey Solomon and Joe Swash are unbelievably sweet  as this reality show returns",
    "url": "https://www.theguardian.com/tv-and-radio/2025/sep/09/tv-tonight-stacey-solomon-and-joe-swash-unbelievably-sweet-reality-show-returns",
    "image": "https://media.guim.co.uk/31ed815a388d6e54bb89832fe121663fee6aa308/166_0_1350_1080/500.jpg",
    "summary": "A couple intensifies their romance in their delightful reality show. Meanwhile, Bake Off features astonishing challenges during biscuit week. Discover what to tune in for tonight!",
    "published": "2025-09-09T05:20:05Z"
  },
  {
    "title": "How do shark nets work? After a deadly attack in Sydney, their effectiveness is being questioned",
    "url": "https://www.theguardian.com/environment/2025/sep/09/after-a-deadly-shark-attack-in-sydney-some-are-wondering-do-shark-nets-even-work",
    "image": "https://media.guim.co.uk/c31d3f843b404825aff3fd749657ca31363f448d/269_0_3749_3000/500.jpg",
    "summary": "Trials to eliminate shark nets at select NSW beaches have been halted following the death of a surfer. Questions are arising about the effectiveness of these nets in preventing shark attacks. The incident has prompted a reevaluation of shark safety measures in the area.",
    "published": "2025-09-09T05:00:28Z"
  },
  {
    "title": "UK retail sales rise but stores fear tax worries could hit festive period",
    "url": "https://www.theguardian.com/business/2025/sep/09/uk-retail-sales-tax-christmas",
    "image": "https://media.guim.co.uk/4de050dbc72e6316266641b1c76fa12ceb8fdaee/158_8_3122_2498/500.jpg",
    "summary": "In August, warm weather and a reduction in interest rates boosted sales, particularly benefiting the food, drink, and computer sectors. The favorable conditions led to increased consumer spending during the month. Retailers experienced strong performance amid this positive economic shift.",
    "published": "2025-09-09T05:00:05Z"
  },
  {
    "title": "How Keir Starmer’s polling became one of the worst in the west – in charts",
    "url": "https://www.theguardian.com/politics/2025/sep/09/how-keir-starmers-polling-became-one-of-the-worst-in-the-west-in-charts",
    "image": "https://media.guim.co.uk/16fea3a0c6ab2ed568133e303a15af2ec09d7ebd/0_0_5000_4000/500.png",
    "summary": "The UK Prime Minister's approval ratings have plummeted to some of the lowest levels ever recorded, reflecting a significant decline in public and international support. This drop highlights growing discontent with the government's performance. The situation raises concerns for the Prime Minister’s political future amid increasing pressure from critics.",
    "published": "2025-09-09T05:00:05Z"
  }
]