[
  {
    "title": "Australia v England: Ashes second Test, day four – live",
    "url": "https://www.theguardian.com/sport/live/2025/dec/07/australia-vs-england-live-ashes-second-2nd-test-day-four-aus-v-eng-cricket-scores-updates-gabba-brisbane",
    "image": "https://media.guim.co.uk/81afa827432b62bbdba7c27c437364e745b0e386/560_0_2801_2241/500.jpg",
    "summary": "England faces a challenging situation in Brisbane, requiring an extraordinary turnaround to succeed. The team is under pressure as they contend with strong opposition at the Gabba. Join our writers for live updates and insights on the unfolding match.",
    "published": "2025-12-07T07:18:00Z"
  },
  {
    "title": "‘A move towards an authoritarian state’: what those with trial experience think of removing juries",
    "url": "https://www.theguardian.com/law/2025/dec/07/authoritarian-state-trial-by-jury-uk",
    "image": "https://media.guim.co.uk/d0fc0fe5ca398cfbe8c9873fd9c06c8b4b978f81/566_0_4750_3800/500.jpg",
    "summary": "David Lammy proposes reducing the number of jury trials in England and Wales, raising concerns among a broad spectrum of legal stakeholders, including defendants, victims, barristers, Kings Counsel, judges, and jurors. Critics fear this could impact fairness and justice in the legal process. The plan is set against ongoing discussions about improving court efficiency.",
    "published": "2025-12-07T07:00:15Z"
  },
  {
    "title": "Jess Cartner-Morley’s Christmas gift guide: 31 ideas, chosen by our fashion expert",
    "url": "https://www.theguardian.com/thefilter/2025/dec/07/jess-cartner-morleys-christmas-gift-guide",
    "image": "https://media.guim.co.uk/5e8d19164e34c0b8dc30d52f8f657a56c07bf863/0_0_4000_3198/500.jpg",
    "summary": "Our style guru has curated a selection of must-have gifts, featuring a cult-favorite lip oil, trendy earrings, and a sought-after T-shirt brand popular among the fashion-forward crowd. These picks reflect the latest in stylish essentials. Don't miss out on these fashionable recommendations!",
    "published": "2025-12-07T07:00:15Z"
  },
  {
    "title": "Don’t use ‘admin’: UK’s top 20 most-used passwords revealed as scams soar",
    "url": "https://www.theguardian.com/money/2025/dec/07/uk-top-20-most-used-passwords-scams-cybersecurity",
    "image": "https://media.guim.co.uk/5a7606cf38d1606752b721bfed098b36e4290f8e/937_0_4685_3748/500.jpg",
    "summary": "Cybersecurity experts are expressing concern as easy-to-guess words and figures continue to dominate password choices. This trend poses significant risks, as it makes accounts more vulnerable to hacks. Hackers are taking advantage of this issue, finding it easier to compromise security systems.",
    "published": "2025-12-07T07:00:15Z"
  },
  {
    "title": "‘No one knows where it came from’: first wild beaver spotted in Norfolk for 400 years",
    "url": "https://www.theguardian.com/environment/2025/dec/07/no-one-knows-where-it-came-from-first-wild-beaver-spotted-in-norfolk-for-400-years",
    "image": "https://media.guim.co.uk/3f670938e904e2248c0aba1d226835f9f9474953/285_0_1350_1080/500.jpg",
    "summary": "A solitary creature was seen gathering materials for its lodge in a riverside nature reserve. The event was documented by cameras set up in the area. This sighting highlights the unique wildlife present in the reserve.",
    "published": "2025-12-07T06:00:15Z"
  }
]