[
  {
    "title": "Australia news live: brumby law change ‘puts science above politics’; two arrests after fatal daylight shooting in Sydney",
    "url": "https://www.theguardian.com/australia-news/live/2025/nov/28/australia-news-live-storms-hail-queensland-environment-laws-anthony-albanese-labor-greens-sussan-ley-coalition-ntwnfb",
    "image": "https://media.guim.co.uk/ed448a0be12d31d96716b185d639f82af25e4557/903_0_5000_4000/500.jpg",
    "summary": "Please provide the news article or details you'd like summarized, and I'll be happy to help!",
    "published": "2025-11-28T03:07:56Z"
  },
  {
    "title": "‘A constant fear’: Myanmar nationals face imprisonment back home as US ends protected status",
    "url": "https://www.theguardian.com/world/2025/nov/28/usa-terminating-myanmar-protected-status-deportation-fears",
    "image": "https://media.guim.co.uk/218b21828f625461db68952d74954ef5a658e5ba/357_0_4515_3612/500.jpg",
    "summary": "Thousands of Myanmar nationals living in the U.S. face potential deportation following the government's decision to end their Temporary Protected Status (TPS). The move affects expatriates who fled violence and instability in Myanmar. Advocates are raising concerns about the safety and logistical challenges of returning to a troubled homeland.",
    "published": "2025-11-28T03:01:51Z"
  },
  {
    "title": "Bull shark that killed Swiss tourist on NSW beach unlikely to lash out again, experts say",
    "url": "https://www.theguardian.com/environment/2025/nov/28/bull-shark-killed-swiss-tourist-nsw-unlikely-attack-again",
    "image": "https://media.guim.co.uk/47390faa0904f8bf17dff7c568aab15537cc8a7e/384_0_2198_1760/500.jpg",
    "summary": "Police are examining GoPro footage from the scene of an attack to gather evidence and insights. The review aims to determine the circumstances surrounding the incident. Authorities hope the footage will provide valuable clues to aid their investigation.",
    "published": "2025-11-28T02:34:34Z"
  },
  {
    "title": "Millions in China cram for civil service exam and the hope of a job for life",
    "url": "https://www.theguardian.com/world/2025/nov/28/china-civil-service-exam-age-limit-changed",
    "image": "https://media.guim.co.uk/50e299eb9279f0da988d9fbe09080139722e98b9/495_76_3913_3132/500.jpg",
    "summary": "In light of challenging economic conditions, many individuals in China are increasingly favoring careers in the public sector. This shift represents a search for stability amid uncertainty. The trend highlights a growing preference for secure employment opportunities in government roles.",
    "published": "2025-11-28T02:27:56Z"
  },
  {
    "title": "Palestinian Australian assaulted and abused on Sydney train ‘shocked’ police charged assailant with assault but not hate speech",
    "url": "https://www.theguardian.com/world/2025/nov/28/palestinian-australian-assaulted-abused-sydney-train-not-hate-speech-ntwnfb",
    "image": "https://media.guim.co.uk/3c4e7e4b2ef19e70900b0fa436464d687f094aab/374_0_2461_1970/500.jpg",
    "summary": "A video has surfaced showing the assault on Shamikh Badra, which has drawn condemnation from the attorney general, who deemed the incident \"unacceptable.\" The sole charge related to the incident has raised concerns about the effectiveness of current hate speech laws. Advocacy for reform in these laws is being highlighted in light of this event.",
    "published": "2025-11-28T02:17:48Z"
  }
]