[
  {
    "title": "Guéhi to leave Palace, Nottingham Forest Q&A as heat on Postecoglou – matchday live",
    "url": "https://www.theguardian.com/football/live/2025/oct/18/premier-league-returns-postecoglou-arsenal-matchday-live",
    "image": "https://media.guim.co.uk/00f47bbe7e0c306035d7e512fdeb003379a53460/0_0_5000_4000/500.jpg",
    "summary": "Emillia Hawkins returns to cover the Premier League as it resumes following the international break. She will provide insights and updates on the upcoming matches. Fans can look forward to her analysis and commentary on the latest developments in the league.",
    "published": "2025-10-18T10:18:12Z"
  },
  {
    "title": "Nottingham Forest v Chelsea: Premier League – live",
    "url": "https://www.theguardian.com/football/live/2025/oct/18/nottingham-forest-v-chelsea-premier-league-live",
    "image": "https://media.guim.co.uk/0474d460df74a1fa38c356e8a0bae79529e410bd/728_0_5000_4000/500.jpg",
    "summary": "Chelsea is set to visit the City Ground for a match against Ange Postecoglou's struggling team. Rob Smyth will provide minute-by-minute updates on the game. Fans can expect insights and commentary throughout the match.",
    "published": "2025-10-18T10:15:46Z"
  },
  {
    "title": "Bristol’s backyard vineyards: foot-stomping grapes in the garden",
    "url": "https://www.theguardian.com/lifeandstyle/2025/oct/18/bristols-backyard-vineyards-foot-stomping-grapes-in-the-garden",
    "image": "https://media.guim.co.uk/27918145fade61e3fc76c45bb41c21e87341e7c6/0_0_4429_3543/500.jpg",
    "summary": "A group of winemakers in Bristol is harvesting grapes from their allotments and garden terraces. This initiative is part of a larger global trend of urban vintners embracing winemaking in city environments. The movement highlights a rising interest in local, sustainable wine production.",
    "published": "2025-10-18T10:00:43Z"
  },
  {
    "title": "French customs reject British shellfish shipments after UK ‘reset’ deal with EU",
    "url": "https://www.theguardian.com/business/2025/oct/18/french-customs-reject-british-shellfish-shipments-after-uk-reset-deal-with-eu",
    "image": "https://media.guim.co.uk/4b3ce965a063671041a4077d2ce307be0de7e041/0_806_3024_2419/500.jpg",
    "summary": "A major British mussel exporter suffered a loss of £150,000 due to the refusal of three lorries to enter the EU. The incident highlights ongoing challenges faced by UK exporters following Brexit. The company is seeking solutions to mitigate future trade disruptions.",
    "published": "2025-10-18T10:00:42Z"
  },
  {
    "title": "Are we living in a golden age of stupidity?",
    "url": "https://www.theguardian.com/technology/2025/oct/18/are-we-living-in-a-golden-age-of-stupidity-technology",
    "image": "https://media.guim.co.uk/daf6d4034b4d0a0721109d2dad8a2c2b98a6777e/452_0_3994_3195/500.jpg",
    "summary": "Recent technological advancements, including disruptive online content and emerging AI technologies, are increasingly hindering our ability to work, remember, think critically, and function independently. Critiques highlight the negative impact of these developments on mental acuity and overall cognitive health. There's a growing concern about how these changes affect daily life and individual autonomy.",
    "published": "2025-10-18T10:00:42Z"
  }
]