[
  {
    "title": "Home secretary suspends refugee family reunion applications until new, tighter rules are put in place – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/01/women-children-home-office-refugee-family-reunions-uk-politics-live-latest-updates-news",
    "image": "https://media.guim.co.uk/3ee18b90e03550120005d83bf16f70a29e34f1f2/214_0_3452_2761/500.jpg",
    "summary": "Yvette Cooper criticized the misuse of historical rules intended to assist families separated by war, highlighting that they are now being applied inappropriately. She emphasized the need for reforms to ensure that the original purpose of these regulations is upheld. The statement points to ongoing challenges faced by families in crisis.",
    "published": "2025-09-01T16:43:02Z"
  },
  {
    "title": "Transfer deadline day: Guéhi move hits snag; Isak, Jackson and Wissa deals agreed – live",
    "url": "https://www.theguardian.com/football/live/2025/sep/01/transfer-deadline-day-guehi-wissa-martinez-ederson-latest-and-more-live",
    "image": "https://media.guim.co.uk/aa4d060273b35ea2fcd3c48387d741cf266a6f87/472_0_2598_2079/500.jpg",
    "summary": "Join John Brewin for live updates and insights on the bustling deadline day, featuring the latest player transfers and key developments in the sports world. Stay tuned for real-time coverage of all significant moves. Don't miss any action as the excitement unfolds!",
    "published": "2025-09-01T16:39:51Z"
  },
  {
    "title": "US Open 2025: Swiatek, De Minaur, Musetti and Osaka v Gauff on day nine – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/01/us-open-tennis-2025-swiatek-osaka-gauff-de-minaur-musetti-day-nine-live",
    "image": "https://media.guim.co.uk/09d163a0ebb7b21d1b288a93dcf68a53f905439d/0_578_2973_2377/500.jpg",
    "summary": "Taha Hashim will provide live updates on day nine of the tournament. Former champions Naomi Osaka and Coco Gauff are set to compete in the fourth round. Fans can follow the action as these two well-known players clash on the court.",
    "published": "2025-09-01T16:39:45Z"
  },
  {
    "title": "Former Tory MP David Warburton found dead at west London flat",
    "url": "https://www.theguardian.com/politics/2025/sep/01/former-tory-mp-david-warburton-found-dead-at-west-london-flat",
    "image": "https://media.guim.co.uk/a3885b17d5a2c994cc256e100105ba10d28fae39/525_0_3083_2467/500.jpg",
    "summary": "The Member of Parliament for Somerton and Frome resigned in June 2023 following allegations of sexual misconduct and drug use. The claims prompted significant controversy and scrutiny. His departure marked a significant moment in the political landscape of the area.",
    "published": "2025-09-01T16:35:14Z"
  },
  {
    "title": "Revolut valuation jumps to $75bn with staff set for payout opportunity",
    "url": "https://www.theguardian.com/business/2025/sep/01/revolut-valuation-jumps-75bn-staff-set-for-payout-opportunity",
    "image": "https://media.guim.co.uk/651457aaf2681f614fff52f336f90da1277b954a/271_0_1768_1414/500.jpg",
    "summary": "A secondary share sale has increased the valuation of a fintech company by two-thirds. Despite this boost, the timing for its initial public offering (IPO) is still uncertain. Investors are closely watching for updates on the IPO plans.",
    "published": "2025-09-01T16:34:06Z"
  }
]