[
  {
    "title": "India v New Zealand: Women’s Cricket World Cup – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/23/india-v-new-zealand-womens-cricket-world-cup-live",
    "image": "https://media.guim.co.uk/208c46341f5409bd4da4c346d527d6711fc0126a/235_0_2032_1626/500.jpg",
    "summary": "India, facing three consecutive defeats, has a chance to secure the last semi-final spot with a win in their upcoming match. Hosts are hopeful as they battle for progression in the tournament. Follow our writers for live updates and analysis.",
    "published": "2025-10-23T12:39:11Z"
  },
  {
    "title": "French coastguards demand halt to ‘deadly plans’ to intercept small boats  ",
    "url": "https://www.theguardian.com/world/2025/oct/23/french-coastguards-demand-halt-plans-intercept-small-boats-channel",
    "image": "https://media.guim.co.uk/d3e597e98f2852ab0df2e709bf478a12dc489579/735_0_3845_3076/500.jpg",
    "summary": "The union has criticized the UK-French Channel deal, labeling it as inhumane. They argue that the agreement violates international conventions regarding the treatment of migrants. The statement highlights concerns over the ethical implications of the deal.",
    "published": "2025-10-23T12:35:57Z"
  },
  {
    "title": "Trump plans to send federal agents to San Francisco ‘right out of dictator’s handbook’, says Newsom – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/23/trump-san-francisco-federal-agents-white-house-ice-immigration-latest-news-updates",
    "image": "https://media.guim.co.uk/0bebb75a62a808ef197c1fd965bd019f47814be6/537_0_4820_3856/500.jpg",
    "summary": "California Governor has criticized the recent immigration enforcement operation, highlighting concerns over its impact on communities. This move is anticipated to incite a conflict between state administration and local leaders. The governor aims to protect immigrant rights and oppose federal overreach in state matters.",
    "published": "2025-10-23T12:35:56Z"
  },
  {
    "title": "King Charles becomes first head of Church of England to pray publicly with pope – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/oct/23/russia-sanctions-ukraine-loan-assets-zelenskyy-putin-european-council-latest-news-updates",
    "image": "https://media.guim.co.uk/51520e55a3f4567b09e75ce10e6b08023b520695/430_0_5906_4725/500.jpg",
    "summary": "King Charles and Pope Francis participated in a joint worship service at the Sistine Chapel during the King's visit to the Vatican with Queen Camilla. This event highlighted the ongoing relationship between the monarchy and the Catholic Church. The visit emphasizes the King's commitment to interfaith dialogue and collaboration.",
    "published": "2025-10-23T12:32:28Z"
  },
  {
    "title": "Jess Phillips has full confidence of PM, says minister, after grooming gang survivors call for her to quit inquiry – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/oct/23/jess-phillips-grooming-gangs-inquiry-keir-starmer-labour-uk-politics-latest-news",
    "image": "https://media.guim.co.uk/e305df662d157d3128a328e2cc7b3d9e8d48f583/461_0_5000_4000/500.jpg",
    "summary": "Four survivors of the inquiry panel announced their decision to resign, stating they would only reconsider returning if Phillips was removed from the panel. Their departure underscores ongoing tensions and dissatisfaction with the current inquiry leadership. The situation raises questions about the future of the inquiry process.",
    "published": "2025-10-23T12:30:34Z"
  }
]