[
  {
    "title": "Asian chipmakers tumble in global stock sell-off amid worries over AI bubble – business live",
    "url": "https://www.theguardian.com/business/live/2025/nov/05/china-ends-tariffs-us-imports-soy-bean-levies-ms-profits-cyber-attack-business-live",
    "image": "https://media.guim.co.uk/ef313969412c0efbaaf739ff575ab84507d5bf13/268_0_4400_3521/500.jpg",
    "summary": "Deutsche Bank has raised concerns about a potential equity correction, with increasing discussions surrounding this topic. In economic news, China has eliminated tariffs on various US imports, including agricultural products, though tariffs on soybeans remain in place. This shift in trade dynamics may impact market conditions and investor sentiment.",
    "published": "2025-11-05T10:22:07Z"
  },
  {
    "title": "British leftwingers elated by Zohran Mamdani’s victory in New York, with some saying election has lessons for Labour – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/nov/05/david-lammy-pmqs-rachel-reeves-tax-system-news-updates-uk-politics-live",
    "image": "https://media.guim.co.uk/a37d81a317bc872fdc2b9693af57296786e4ff9d/750_0_3750_3000/500.jpg",
    "summary": "Leftist figures, including Sadiq Khan, Zack Polanski, and Zarah Sultana, are commending the newly elected mayor for his approach. They see his election as a potential model for future elections in the UK. This highlights a strategic shift within the left as they seek to build on this success.",
    "published": "2025-11-05T10:21:02Z"
  },
  {
    "title": "New York mayor-elect Zohran Mamdani challenges Donald Trump in victory speech as Democrats win key US election races – live",
    "url": "https://www.theguardian.com/us-news/live/2025/nov/04/nyc-mayor-election-zohran-mamdani-andrew-cuomo-results-latest",
    "image": "https://media.guim.co.uk/a8a175efb88ab9a3e3fab71c8a0ee2e6bf4486ed/349_0_2972_2379/500.jpg",
    "summary": "Mamdani criticized the \"oligarchy and authoritarianism\" in a speech addressing Trump, highlighting the current political landscape. His remarks come after Democrats achieved a significant victory in California's redistricting vote, alongside wins in the gubernatorial elections in New Jersey and Virginia. These outcomes suggest a strengthening of Democratic influence in these key areas.",
    "published": "2025-11-05T10:12:22Z"
  },
  {
    "title": "Drones shut down Brussels airport overnight with further sightings reported over military airbases – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/nov/05/latest-europe-live-news-updates-brussels-drones-eu",
    "image": "https://media.guim.co.uk/48dd1461242e3df7968c537caedbbff535e85619/449_0_2771_2217/500.jpg",
    "summary": "Fighting has resumed but was interrupted on Wednesday morning as a Belgian security council meeting is set to take place. The meeting aims to address the ongoing violence and assess security concerns. Tensions remain high as the situation develops.",
    "published": "2025-11-05T10:10:33Z"
  },
  {
    "title": "Bosses at six water firms had £4m in bonuses blocked under new rules, Ofwat says",
    "url": "https://www.theguardian.com/business/2025/nov/05/bosses-at-six-water-firms-had-bonuses-blocked-under-new-rules-ofwat-says",
    "image": "https://media.guim.co.uk/50a1fc6dbabc72b018b9d40ed8511bb6b856f5ff/265_0_4557_3648/500.jpg",
    "summary": "Regulators are contemplating new rules that would require companies to disclose compensation received from their parent firms. This potential measure follows an investigation by The Guardian that highlighted transparency issues in corporate pay reporting. The changes aim to enhance accountability and provide clearer insights into financial relationships within corporate structures.",
    "published": "2025-11-05T10:06:22Z"
  }
]