[
  {
    "title": "Anti-ageing trousers? There really is no fashion or beauty claim too wild ",
    "url": "https://www.theguardian.com/fashion/2025/nov/09/anti-ageing-trousers-there-really-is-no-fashion-or-beauty-claim-too-wild",
    "image": "https://media.guim.co.uk/604e8dd373d5adfacea809e6d7fd0aa48c331661/64_0_3734_2987/500.jpg",
    "summary": "A neuroscientist claims that our brains are intrinsically predisposed to succumb to the latest beauty trends. This phenomenon serves as a cognitive \"booby trap\" that many people repeatedly encounter. The expert shares personal insight into this recurring allure.",
    "published": "2025-11-09T05:00:22Z"
  },
  {
    "title": "Crisafulli declares end to ‘cannoli diplomacy’ with Albanese over lack of hospital funding – as it happened",
    "url": "https://www.theguardian.com/australia-news/live/2025/nov/09/australia-news-live-sunday-politics-nsw-parliament-royal-tour-weather-ntwnfb",
    "image": "https://media.guim.co.uk/3ff43fbce357048a40a90ca1ff9c8aeea328b086/586_0_3342_2676/500.jpg",
    "summary": "The blog has officially ceased operations and will no longer provide updates or content. Readers are notified that no new posts or articles will be published moving forward. Thank you to all who engaged with the blog during its run.",
    "published": "2025-11-09T04:24:54Z"
  },
  {
    "title": "NSW police accused of ‘sickening’ double standard over neo-Nazi rally as Jewish groups demand answers",
    "url": "https://www.theguardian.com/australia-news/2025/nov/09/nsw-police-accused-of-sickening-double-standard-over-neo-nazi-rally-as-jewish-groups-demand-answers",
    "image": "https://media.guim.co.uk/8c7f9f3a362f185550b6afef5c32b76192064e62/546_0_5460_4368/500.jpg",
    "summary": "Pro-Palestine and climate activists are joining Jewish voices to condemn the inconsistent responses of police during recent protests. They highlight what they describe as \"unfathomable approval\" of certain actions while criticizing the handling of others. The coalition calls for accountability and a reassessment of law enforcement practices.",
    "published": "2025-11-09T03:35:47Z"
  },
  {
    "title": "Trump news at a glance: President suggests scrapping Obamacare as shutdown flight chaos continues",
    "url": "https://www.theguardian.com/us-news/2025/nov/09/trump-news-at-a-glance-president-suggests-scrapping-obamacare-as-shutdown-flight-chaos-continues",
    "image": "https://media.guim.co.uk/2c8b54cf5106c77a8ae86beeb4c5bd95e42c59df/728_0_4234_3388/500.jpg",
    "summary": "Trump called on Republican senators to shift federal funds towards direct payments for individuals. This move comes amidst ongoing discussions in U.S. politics. The appeal reflects Trump's continued influence within the party and focus on economic relief measures.",
    "published": "2025-11-09T02:00:54Z"
  },
  {
    "title": "Malo Gusto’s first professional goal sets up Chelsea cruise past winless Wolves",
    "url": "https://www.theguardian.com/football/2025/nov/08/chelsea-wolves-premier-league-match-report",
    "image": "https://media.guim.co.uk/926579f5921eb0304f788f0f358157ba444229da/614_549_3342_2673/500.jpg",
    "summary": "Chelsea secured a dominant 3-0 victory over Wolves in the Premier League. João Pedro and Pedro Neto each scored, with Neto netting against his former club. The win underscores Chelsea's strong performance in the league.",
    "published": "2025-11-09T01:31:15Z"
  }
]