[
  {
    "title": "Gaza ceasefire live: Israelis and Palestinians celebrate hostage and detainee releases as key truce issues remain ",
    "url": "https://www.theguardian.com/world/live/2025/oct/14/gaza-ceasefire-israel-hamas-palestine-hostages-detainees-truce-live-news-updates",
    "image": "https://media.guim.co.uk/5be2911711c669d7c6572cd223f0d8a43cf44200/961_0_6977_5582/500.jpg",
    "summary": "The ongoing truce between Israel and Hamas remains precarious, with critical issues like Hamas disarmament and future governance in Gaza yet to be resolved. These unanswered questions underscore the delicate nature of the ceasefire. The situation continues to evolve as parties navigate complex negotiations.",
    "published": "2025-10-14T08:24:07Z"
  },
  {
    "title": "Starmer to face MPs amid continued pressure over collapse of China spying trial – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/oct/14/keir-starmer-china-national-security-spying-gaza-nigel-farage-uk-politics-live-news-updates",
    "image": "https://media.guim.co.uk/a38a7e41dc8aedf48a464acd736dd81c787e7998/271_0_4583_3667/500.jpg",
    "summary": "The Prime Minister is scheduled to provide a statement regarding the Middle East and his recent trip to India. However, opposition MPs are expected to focus on allegations of government interference in the ongoing China case. Tensions are likely to rise as these controversial issues are addressed.",
    "published": "2025-10-14T08:23:36Z"
  },
  {
    "title": "US treasury secretary accuses Beijing of trying to damage global economy, as US and China roll out tit-for-tat port fees – business live",
    "url": "https://www.theguardian.com/business/live/2025/oct/14/us-treasury-secretary-beijing-rare-earths-us-china-port-fees-imf-tariffs-business-live-news",
    "image": "https://media.guim.co.uk/cff322cf52c19005da82b58a1d3f3740392f6326/301_0_2500_2000/500.jpg",
    "summary": "Current economic and financial news is being continuously updated, with a focus on key developments impacting markets and economies. Analysts are tracking significant trends and data releases that could influence investor sentiment. The coverage highlights both challenges and opportunities within the global financial landscape.",
    "published": "2025-10-14T08:19:45Z"
  },
  {
    "title": "Finding My Way by Malala Yousafzai review – growing up in public",
    "url": "https://www.theguardian.com/books/2025/oct/14/finding-my-way-by-malala-yousafzai-review-growing-up-in-public",
    "image": "https://media.guim.co.uk/b78f55a0e15817bc57d2ea86de19b443c1d274e2/709_0_5027_4020/500.jpg",
    "summary": "Malala Yousafzai, known for her activism, explores a more personal side of her life as she embraces new experiences like climbing bell towers, dancing, and finding love. Through these activities, she is forging a new identity beyond her public persona. This transition highlights her journey of self-discovery and empowerment.",
    "published": "2025-10-14T08:00:20Z"
  },
  {
    "title": "Sunlight review – monkey-suited woman goes on road trip in Nina Conti’s super-quirky directing debut",
    "url": "https://www.theguardian.com/film/2025/oct/14/sunlight-review-nina-conti-kinda-sexy-monkey-business",
    "image": "https://media.guim.co.uk/14ee87987b38c62eaa717f3e57026a396878f048/135_0_2105_1684/500.jpg",
    "summary": "A depressed man embarks on a cross-country journey with a woman who embodies monkey-like traits, blending humor with moments of emotional struggle. Their adventure highlights the challenges of navigating trauma while seeking connection and joy. The story juxtaposes comedy and serious themes, creating a unique exploration of mental health and companionship.",
    "published": "2025-10-14T08:00:14Z"
  }
]