[
  {
    "title": "Formula One: Qatar sprint race and grand prix qualifying – live updates",
    "url": "https://www.theguardian.com/sport/live/2025/nov/29/formula-one-qatar-sprint-race-grand-prix-qualifying-live-updates",
    "image": "https://media.guim.co.uk/34d1f5573bcf3240dc3fa50dda49aefb21590e4d/574_0_1734_1387/500.jpg",
    "summary": "A dramatic final round in Las Vegas has left spectators wondering who will emerge as the leader. Philip Cornwall provides insights into the potential frontrunners. Stay tuned for updates on the unfolding situation.",
    "published": "2025-11-29T14:17:55Z"
  },
  {
    "title": "Manchester City v Leeds, Sunderland v Bournemouth, and more – Premier League live",
    "url": "https://www.theguardian.com/football/live/2025/nov/29/football-manchester-city-v-leeds-sunderland-v-bournemouth-and-more-premier-league-live",
    "image": "https://media.guim.co.uk/03f6899d83144909dda880c1c5f5b80359b8e4ca/313_0_4690_3751/500.jpg",
    "summary": "Football updates are being provided by Barry Glendenning for Saturday's afternoon matches. Fans can follow live coverage of the game's developments. Stay tuned for the latest scores and highlights.",
    "published": "2025-11-29T14:16:56Z"
  },
  {
    "title": "Hangovers and skullets: welcome to Schoolies week 2025",
    "url": "https://www.theguardian.com/australia-news/2025/nov/30/hangovers-and-skullets-welcome-to-schoolies-week-2025",
    "image": "https://media.guim.co.uk/429707527f220c0270a3e760cb5a26e66606d97c/659_234_4231_3384/500.jpg",
    "summary": "The traditional rite of passage for Australian teenagers at Surfers Paradise has evolved since its inception at Broadbeach in the 1970s. Changes in cultural and social attitudes have transformed the way these celebrations are conducted. The shift reflects broader societal trends and expectations among youth today.",
    "published": "2025-11-29T14:00:39Z"
  },
  {
    "title": "‘Nature’s original engineers’: scientists explore the amazing potential of fungi",
    "url": "https://www.theguardian.com/science/2025/nov/29/fungi-scientists-innovations",
    "image": "https://media.guim.co.uk/39dc3526a7a4a0344efc7e96f17e4782f0dc2147/925_832_3539_2831/500.jpg",
    "summary": "Recent innovations leveraging the unique properties of fungi have led to significant developments in various industries, including sustainable materials for nappies and advancements in electronics. These discoveries highlight the potential of fungal applications in creating eco-friendly solutions. The exploration of fungi continues to drive creativity and sustainability in product design.",
    "published": "2025-11-29T14:00:38Z"
  },
  {
    "title": "Bread, diapers and hope: how Trinity church feeds New York’s hungry",
    "url": "https://www.theguardian.com/us-news/2025/nov/29/trinity-church-feeds-new-york-hungry",
    "image": "https://media.guim.co.uk/584d95f2f46ec0ae285895e33bece5c9269f566a/667_0_5602_4480/500.jpg",
    "summary": "US families are experiencing increased demand for groceries, hot meals, and baby supplies as they queue at Trinity’s Compassion Market. This surge reflects the growing need for assistance amidst economic challenges. The market aims to support those struggling to meet their basic needs.",
    "published": "2025-11-29T14:00:38Z"
  }
]