[
  {
    "title": "Australia politics live: Ley and Haines pressure Labor over delayed home care rollout; Greens call out ‘merchants of hate’ as Senate debates anti-immigration protests",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/01/australia-politics-live-labor-coalition-housing-net-zero-anthony-albanese-sussan-ley-question-time-ntwnfb",
    "image": "https://media.guim.co.uk/f213d4c61cdc5580c54960243f615035760e96f2/701_0_6293_5034/500.jpg",
    "summary": "Could you please provide the specific news article or details you would like summarized?",
    "published": "2025-09-01T04:45:56Z"
  },
  {
    "title": "Brothers, cousins, sons: the human stories behind four of the war’s fallen journalists ",
    "url": "https://www.theguardian.com/global-development/2025/sep/01/israel-gaza-war-targeted-palestinian-journalists-human-stories-families",
    "image": "https://media.guim.co.uk/48915702473e2fcc99027859ac23f2c9df672311/629_0_4307_3445/500.jpg",
    "summary": "On August 10, six Palestinian media workers, including four Al Jazeera journalists, were killed in a targeted Israeli airstrike near Gaza City's al-Shifa hospital. The attack struck their tent while they were covering events in the area. Families of the victims gathered to pay tribute to the fallen journalists.",
    "published": "2025-09-01T04:30:49Z"
  },
  {
    "title": "Country diary: Deep purple and fallen leaves at this mighty mountain | John Gilbey",
    "url": "https://www.theguardian.com/environment/2025/sep/01/country-diary-deep-purple-and-fallen-leaves-at-this-mighty-mountain",
    "image": "https://media.guim.co.uk/74fef76ac9e475bb301e337e5ecaf16f2d1ba3ec/417_0_3295_2636/500.jpg",
    "summary": "The climb up Cadair Idris in Gwynedd features lush heather dominating the slopes. Climbers are facing challenging conditions due to the heavy heat. The scenic landscape adds to the difficulty of the steep ascent.",
    "published": "2025-09-01T04:30:49Z"
  },
  {
    "title": "Pupils in England from low-income families ‘bounced out’ of costlier GCSEs",
    "url": "https://www.theguardian.com/education/2025/sep/01/pupils-in-england-from-low-income-families-bounced-out-of-costlier-gcses",
    "image": "https://media.guim.co.uk/604e2807ea24d8c718d646a42faa5117bce49c12/358_0_3539_2832/500.jpg",
    "summary": "A recent survey reveals that children are shying away from subjects like geography and languages due to concerns over potential extra costs associated with these courses. Many families worry about the financial burden that additional materials or resources may require. This trend highlights the impact of economic factors on educational choices for students.",
    "published": "2025-09-01T04:00:50Z"
  },
  {
    "title": "Ireland calls out the genocide in Gaza while profiting from Israeli war bonds. That’s why I’m joining the flotilla | Naoise Dolan",
    "url": "https://www.theguardian.com/commentisfree/2025/sep/01/ireland-israel-gaza-flotilla-war-bonds-eu-genocide",
    "image": "https://media.guim.co.uk/5e10acb2e73e8e4862dbf7f8be871c0dd9a67b92/13_0_3780_3024/500.jpg",
    "summary": "Naoise Dolan criticizes the Irish government for its contradictory stance on Palestine, claiming it offers only superficial support while being complicit in the situation. She emphasizes her rejection of this hypocrisy. Dolan's perspective reflects a broader discontent among Irish citizens regarding their government's policies toward Palestine.",
    "published": "2025-09-01T04:00:50Z"
  }
]