[
  {
    "title": "Australia politics live: Barnaby Joyce says he is ‘strongly considering’ One Nation move after quitting the National party",
    "url": "https://www.theguardian.com/australia-news/live/2025/nov/27/australia-politics-live-barnaby-joyce-one-nation-pauline-hanson-environment-nature-bill-deal-coalition-greens-murray-watt-question-time-anthony-albanese-sussan-ley-ntwnfb",
    "image": "https://media.guim.co.uk/746ed592185a8339f39f5cd0dd86ae82287192bb/313_0_3133_2506/500.jpg",
    "summary": "I'm sorry, but I need more context or specific news to summarize. Please provide the content or details of the news you'd like summarized.",
    "published": "2025-11-27T03:11:38Z"
  },
  {
    "title": "Jakarta overtakes Tokyo as world’s most populous city, according to UN",
    "url": "https://www.theguardian.com/world/2025/nov/27/jakarta-overtakes-tokyo-most-populous-city-world",
    "image": "https://media.guim.co.uk/ad55e4ad8ea34c9ae720f70b2efda9eb43a337a7/311_0_4361_3488/500.jpg",
    "summary": "The UN updated its criteria for ranking megacities to better reflect the impacts of rapid urbanization. This change aims to provide a more accurate assessment of city growth and dynamics. The new rankings highlight the evolving landscape of urban populations worldwide.",
    "published": "2025-11-27T03:07:43Z"
  },
  {
    "title": "Washington DC shooting: Trump calls shooting of national guard members ‘an act of terror’, vows new scrutiny of immigrants – latest updates",
    "url": "https://www.theguardian.com/us-news/live/2025/nov/26/us-politics-latest-news-pete-hegseth-donald-trump-marjorie-taylor-greene-mark-kelly",
    "image": "https://media.guim.co.uk/a4d09cc01567ffe2724bfd561024d79fad248401/356_0_4560_3648/500.jpg",
    "summary": "The President announced a renewed effort to tighten immigration policies regarding Afghan immigrants. This decision follows revelations that a suspect connected to a recent incident entered the U.S. from Afghanistan in 2021. The crackdown aims to enhance national security and address potential risks associated with the immigration process.",
    "published": "2025-11-27T03:06:09Z"
  },
  {
    "title": "How the Hong Kong fire unfolded – visual guide",
    "url": "https://www.theguardian.com/news/2025/nov/27/how-hong-kong-fire-unfolded-apartment-block-blaze-wang-court",
    "image": "https://media.guim.co.uk/baf523e164ff98cc9ce4a3600f60049901ba29fb/175_0_5000_4000/500.jpg",
    "summary": "A fire broke out in a densely packed area of 31-storey tower blocks, quickly spreading through bamboo scaffolding. Thousands of residents were affected by the rapid escalation of the blaze. Emergency services responded to the situation, but the extent of damage and casualties is still being assessed.",
    "published": "2025-11-27T03:04:50Z"
  },
  {
    "title": "Hong Kong fire live updates: rescue crews search apartment blocks for survivors; dozens killed and hundreds missing after blaze – latest",
    "url": "https://www.theguardian.com/world/live/2025/nov/27/hong-kong-fire-arrests-dead-killed-hundreds-missing-housing-complex-blaze",
    "image": "https://media.guim.co.uk/cfe6885eb8e18815f333c6e53cc6426c77efff4b/620_0_5000_4000/500.jpg",
    "summary": "For the most current information, please tune in to live updates as they unfold. Stay informed with real-time coverage of breaking news. Don’t miss out on important developments!",
    "published": "2025-11-27T03:04:18Z"
  }
]