[
  {
    "title": "Democratic senator who Trump accused of sedition says he’s ‘not backing down’ amid Pentagon investigation – live ",
    "url": "https://www.theguardian.com/us-news/live/2025/nov/26/us-politics-latest-news-pete-hegseth-donald-trump-marjorie-taylor-greene-mark-kelly",
    "image": "https://media.guim.co.uk/0760837a8b109edabbd8e28a9c7bcb4800046916/260_0_2609_2087/500.jpg",
    "summary": "Senator Mark Kelly criticized the investigation prompted by a video showing Democrats advising military members to ignore illegal orders, calling it \"so ridiculous.\" He expressed concern over the implications of such inquiries. Kelly's remarks highlight a broader debate on military conduct and political speech.",
    "published": "2025-11-26T17:16:18Z"
  },
  {
    "title": "Budget 2025 live: Reeves claims freezing tax thresholds in budget does not breach manifesto pledge",
    "url": "https://www.theguardian.com/uk-news/live/2025/nov/26/budget-2025-rachel-reeves-tax-cash-isa-minimum-wage-latest-news-updates",
    "image": "https://media.guim.co.uk/f9af88fa3130b46bcd2a03b7cb048f66c7f187a9/1188_0_6880_5504/500.jpg",
    "summary": "The Chancellor declined to engage in a semantic debate regarding her previous statement when pressed by reporters. She maintained her stance without elaborating further. The context of the statement remains unclear, leaving questions among the media.",
    "published": "2025-11-26T17:16:03Z"
  },
  {
    "title": "Reeves’s tax-raising budget is crash landing on an economy that is struggling for growth",
    "url": "https://www.theguardian.com/uk-news/2025/nov/26/rachel-reeves-tax-raising-budget-is-crash-landing-on-an-economy-that-is-struggling-for-growth",
    "image": "https://media.guim.co.uk/a24bd76ae0404ef41cc7a69488c0d3502cc7e21e/1165_68_2291_1835/500.jpg",
    "summary": "Bond vigilantes appear to be regaining confidence, indicating a more stable market outlook. However, uncertainties remain for households and businesses regarding economic conditions and financial stability. The contrasting sentiments suggest a complex landscape ahead for various sectors.",
    "published": "2025-11-26T17:10:49Z"
  },
  {
    "title": "Rachel Reeves says budget will cut living costs after shock OBR leak",
    "url": "https://www.theguardian.com/uk-news/2025/nov/26/rachel-reeves-poised-to-unveil-tax-rises-worth-26bn-in-budget-figures-reveal",
    "image": "https://media.guim.co.uk/4a00f54bac6b54529a04de502f7a89bc28a3ac6e/500_0_5000_4000/500.jpg",
    "summary": "The Chancellor announced measures addressing energy bills, rail fares, and the two-child benefit cap alongside a substantial £26 billion tax increase. These actions aim to alleviate financial pressures on households while raising government revenue. The changes are intended to support the economy during challenging times.",
    "published": "2025-11-26T17:01:51Z"
  },
  {
    "title": "Millions of savers and investors to face higher tax bills after Reeves’s budget",
    "url": "https://www.theguardian.com/uk-news/2025/nov/26/uk-savers-investors-tax-bills-isas-pensions-savings-rachel-reeves-budget",
    "image": "https://media.guim.co.uk/a078b7fdf776f28b9525145bae343bf37e913b1d/633_0_4167_3335/500.jpg",
    "summary": "The Chancellor has announced new measures impacting ISAs, pensions, and income sources such as dividends, property, and savings interest. These changes are intended to adjust tax regulations and encourage savings and investments. The reforms are set to influence personal finances for many citizens.",
    "published": "2025-11-26T17:01:36Z"
  }
]