[
  {
    "title": "Starmer refuses to say he is committed to manifesto pledges not to raise income tax, national insurance or VAT – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/oct/29/shabana-mahmood-home-office-immigration-pmqs-labour-keir-starmer-kemi-badenoch-conservatives-uk-politics-live-news",
    "image": "https://media.guim.co.uk/6a10a604e471275017371d316c556863929da706/0_0_1667_1333/500.jpg",
    "summary": "The Prime Minister avoided a direct question from the Conservative leader during a recent exchange. However, he highlighted positive developments in the economy, emphasizing optimistic trends. This occurred amid ongoing political tensions and scrutiny of government policies.",
    "published": "2025-10-29T12:42:19Z"
  },
  {
    "title": "England v South Africa: Women’s Cricket World Cup semi-final – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/29/england-v-south-africa-womens-cricket-world-cup-semi-final-live",
    "image": "https://media.guim.co.uk/185c8030614b4199a18c2cc4110c139778c18c7d/355_74_3097_2478/500.jpg",
    "summary": "England and South Africa face off in a crucial match for a spot in the Women’s Cricket World Cup final in India. The over-by-over report will provide updates and insights on the game as it unfolds. Fans can follow along to see which team secures their place in the final.",
    "published": "2025-10-29T12:40:20Z"
  },
  {
    "title": "‘No Trump’ protests in South Korea as US president finalises trade deal with Lee Jae Myung - US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/29/donald-trump-south-korea-china-latest-news-updates-live",
    "image": "https://media.guim.co.uk/a84044e61de74d5f35143cb140c2b0f118a74b07/1263_0_6830_5464/500.jpg",
    "summary": "Progressive groups and opposition politicians staged an anti-US protest in response to recent developments. Meanwhile, former President Donald Trump expressed optimism regarding an upcoming summit with China. The contrasting events highlight the ongoing tension in US political discourse and international relations.",
    "published": "2025-10-29T12:37:01Z"
  },
  {
    "title": "Hurricane Melissa live updates: hundreds of thousands evacuated as Cuba faces 120mph winds; disaster area declared in Jamaica",
    "url": "https://www.theguardian.com/world/live/2025/oct/29/hurricane-melissa-live-updates-strengthens-cuba-extensive-damage-parts-of-jamaica",
    "image": "https://media.guim.co.uk/db17c9f0ab5c21cd3a7f112ff55a697bb70dc87b/158_0_2245_1796/500.jpg",
    "summary": "Cuba is facing life-threatening flooding due to a powerful storm, prompting urgent warnings for residents. Meanwhile, Jamaica has experienced significant destruction as the storm passed through the island. Authorities are closely monitoring the situation as the storm continues to impact the region.",
    "published": "2025-10-29T12:35:06Z"
  },
  {
    "title": "Trump fires federal arts board in charge of reviewing White House ballroom and ‘Arc de Trump’",
    "url": "https://www.theguardian.com/us-news/2025/oct/29/trump-fires-arts-board-arc-ballroom",
    "image": "https://media.guim.co.uk/b8b71ad7c6baa478cfedf24d533444552778345e/237_0_4165_3333/500.jpg",
    "summary": "All six members of the independent Commission of Fine Arts were reportedly dismissed on Tuesday. This decision raises questions about the future direction and oversight of art and design in public projects. The reasons for the dismissals have not been disclosed.",
    "published": "2025-10-29T12:26:23Z"
  }
]