[
  {
    "title": "World Cup 2026 draw updates as Donald Trump awarded Fifa peace prize – live",
    "url": "https://www.theguardian.com/football/live/2025/dec/05/world-cup-2026-draw-updates-usa-mexico-canada",
    "image": "https://media.guim.co.uk/86716df183735bb67b9376f92ab480b6a4e61ce4/703_0_4240_3392/500.jpg",
    "summary": "Writers will provide updates from the draw in Washington DC for the upcoming 48-team tournament scheduled for next summer. Stay tuned for the latest news and developments as the event unfolds. Excitement builds as teams prepare for the competition.",
    "published": "2025-12-05T18:27:34Z"
  },
  {
    "title": "Musicians must embrace ‘unstoppable force’ of AI, Eurythmics’ Dave Stewart urges",
    "url": "https://www.theguardian.com/music/2025/dec/05/musicians-must-embrace-unstoppable-force-of-ai-eurythmics-dave-stewart-urges",
    "image": "https://media.guim.co.uk/ea1803a3168d14b1cfd0277df9def4c4db9ad825/0_1907_3840_3070/500.jpg",
    "summary": "A producer emphasizes the importance for creatives to retain ownership of their intellectual property, allowing them to license it to generative AI platforms. This approach could enable better control over how their work is used in AI-generated content. The move aims to ensure fair compensation and recognition for creators in the evolving landscape of AI technology.",
    "published": "2025-12-05T18:24:55Z"
  },
  {
    "title": "New York Times sues AI startup for ‘illegal’ copying of millions of articles",
    "url": "https://www.theguardian.com/technology/2025/dec/05/new-york-times-perplexity-ai-lawsuit",
    "image": "https://media.guim.co.uk/e836b3c9d9a0ed03c33364b86e05b0fe9c173305/342_0_3423_2739/500.jpg",
    "summary": "Perplexity AI is being sued by Dow Jones and the New York Post, both owned by Rupert Murdoch, over allegations of using copyrighted content without permission. The lawsuit highlights ongoing concerns about AI companies and their use of proprietary information. This legal action adds to the challenges faced by AI firms in navigating copyright issues.",
    "published": "2025-12-05T18:19:12Z"
  },
  {
    "title": "Democrats call for Pete Hegseth’s resignation amid scrutiny over deadly boat strikes and Signalgate: ‘a disgrace to the office he holds’ – live",
    "url": "https://www.theguardian.com/us-news/live/2025/dec/05/trump-pete-hegseth-signal-politics-updates",
    "image": "https://media.guim.co.uk/c034bd1e8a295b96aa0ef4cac92e34e4914022d1/295_0_2218_1775/500.jpg",
    "summary": "The largest ideological caucus within the House Democrats is urging the defense secretary to resign immediately. They believe his actions pose a direct threat to American lives. This call for resignation highlights significant dissent within the party regarding national security decisions.",
    "published": "2025-12-05T18:18:26Z"
  },
  {
    "title": "Former Dulwich pupil says Farage told him: ‘That’s the way back to Africa’",
    "url": "https://www.theguardian.com/politics/2025/dec/05/nigel-farage-former-dulwich-college-pupil-alleges-said-thats-the-way-back-to-africa",
    "image": "https://media.guim.co.uk/f3a580f9b75a2b661e6f403594c72b9a16ab506e/251_227_1447_1158/500.jpg",
    "summary": "Yinka Bankole spoke out regarding the dismissal of the pain experienced by alleged targets by the Reform leader. His decision to come forward was driven by a sense of responsibility to address these concerns. Bankole emphasized the need for acknowledging and validating the hurt caused.",
    "published": "2025-12-05T18:17:30Z"
  }
]