[
  {
    "title": "Donald Trump and Benjamin Netanyahu to discuss Gaza peace plan at the White House – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/29/donald-trump-benjamin-netanyahu-gaza-white-house-us-politics-live",
    "image": "https://media.guim.co.uk/440ea52046f18a25f6c4a5146e3c40c66843a7e3/469_0_4691_3753/500.jpg",
    "summary": "The US president plans to urge the Israeli prime minister to accept a new framework aimed at ending the war in Gaza. The initiative also seeks to facilitate the release of remaining hostages held by Hamas. This diplomatic move highlights ongoing efforts to address the conflict and protect civilian lives.",
    "published": "2025-09-29T15:19:32Z"
  },
  {
    "title": "Tony Harrison’s poem V to be performed in the Leeds cemetery that inspired it",
    "url": "https://www.theguardian.com/stage/2025/sep/29/tony-harrison-poem-v-performed-in-leeds-cemetery",
    "image": "https://media.guim.co.uk/66e9c2416bf90276ce766092e646491164c9f9cf/1010_308_3457_2765/500.jpg",
    "summary": "A planned site-specific performance of a controversial poem for its 40th anniversary in October will now serve as a tribute to the writer, who recently passed away. The event aims to honor both the poem's legacy and the author's contributions. This change reflects the profound impact of the writer’s death on the upcoming performance.",
    "published": "2025-09-29T15:09:21Z"
  },
  {
    "title": "Mourinho’s return looms large as Chelsea and Maresca endure untimely blip",
    "url": "https://www.theguardian.com/football/2025/sep/29/jose-mourinho-return-chelsea-benfica-enzo-maresca-champions-league",
    "image": "https://media.guim.co.uk/4698df85b7e11231fe0e59873d165164537a0913/693_0_3105_2484/500.jpg",
    "summary": "José Mourinho's return with Benfica draws parallels to his successful past at Chelsea, but the club's leadership remains supportive of the current manager. They are committed to backing him despite the nostalgia linked to Mourinho's tenure. The focus is on continuity rather than a potential reunion with Mourinho.",
    "published": "2025-09-29T15:08:18Z"
  },
  {
    "title": "Andy Burnham calls for UK to rejoin EU within his lifetime and rejects claim he is fiscally irresponsible – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/29/rachel-reeves-labour-party-conference-youth-guarantee-unemployment-uk-politics-live-latest-news",
    "image": "https://media.guim.co.uk/7f4fa57b50f9da13dfedb5e5551cca4faf72d55d/1301_524_4151_3320/500.jpg",
    "summary": "The Mayor of Greater Manchester expressed a strong commitment to the city, stating he would have to be \"wrenched\" out to leave. He also voiced his desire for the UK to rejoin the European Union. His comments highlight a significant stance on local and national issues regarding EU membership.",
    "published": "2025-09-29T15:04:09Z"
  },
  {
    "title": "‘Laughing at a libertarian crypto dragon? That rules’: Brennan Lee Mulligan on how Dungeons & Dragons took over the world",
    "url": "https://www.theguardian.com/games/2025/sep/30/games-master-brennan-lee-mulligan-interview-dungeons-dragons-endless-dungeon-live-show",
    "image": "https://media.guim.co.uk/e3aa5c93d0b2b688279e02b5a7df9884ba9ef4ad/0_364_4480_3584/500.jpg",
    "summary": "A popular games master has gained millions of fans and sold out Madison Square Garden with live Dungeons & Dragons performances featuring guest appearances. He expresses feelings of bewilderment regarding his unexpected success. The phenomenon highlights the growing interest in tabletop gaming as a form of entertainment.",
    "published": "2025-09-29T15:00:35Z"
  }
]