[
  {
    "title": "Atlético Madrid v Manchester United: Women’s Champions League – live",
    "url": "https://www.theguardian.com/football/live/2025/oct/16/atletico-madrid-v-manchester-united-womens-champions-league-live",
    "image": "https://media.guim.co.uk/bcd86943a94c14ff1aa4c532f80f061912ec513c/117_0_4605_3684/500.jpg",
    "summary": "Yara El-Shaboury provides live updates as Marc Skinner's team travels to the Spanish capital for a match. Fans can follow the game with minute-by-minute coverage. Stay tuned for key highlights and developments from the event.",
    "published": "2025-10-16T18:27:20Z"
  },
  {
    "title": "Benfica v Arsenal: Women’s Champions League – live",
    "url": "https://www.theguardian.com/football/live/2025/oct/16/benfica-v-arsenal-womens-champions-league-live",
    "image": "https://media.guim.co.uk/f23c2eda6ff8378ee4b778f1a8a8d04401b3c1ef/438_0_4726_3781/500.jpg",
    "summary": "Rob Smyth will provide a live minute-by-minute report as the current champions face off against the Portuguese champions. Stay tuned for real-time updates on the match. Don't miss any highlights from this exciting encounter!",
    "published": "2025-10-16T18:23:31Z"
  },
  {
    "title": "Trump says he will meet Putin in Hungary after ‘productive’ call – live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/16/trump-latest-shutdown-vote-jd-vance-republicans-democrats",
    "image": "https://media.guim.co.uk/036ce5b1a800ea4a9f2021e40c27155274b6e017/265_0_1795_1436/500.jpg",
    "summary": "The US president announced plans to meet with the Russian leader next week in an unspecified location in Budapest. This meeting aims to address ongoing diplomatic issues between the two nations. Further details about the agenda remain undisclosed.",
    "published": "2025-10-16T18:20:09Z"
  },
  {
    "title": "Al Pacino on co-star and ex-girlfriend Diane Keaton: ‘She lived without limits’",
    "url": "https://www.theguardian.com/film/2025/oct/16/al-pacino-diane-keaton",
    "image": "https://media.guim.co.uk/eaf1bf35a8e0d1ead004c47ad375544fe0b6fdd5/125_0_2083_1667/500.jpg",
    "summary": "The actor honored his Godfather co-star and former romantic partner with heartfelt tributes. He described her as possessing a \"once-in-a-lifetime gift.\" The tribute highlights their special connection and the impact she had on his life.",
    "published": "2025-10-16T18:11:06Z"
  },
  {
    "title": "Woman alleged to have tortured and killed 12-year-old to stand trial in France",
    "url": "https://www.theguardian.com/world/2025/oct/16/woman-alleged-to-have-tortured-and-killed-12-year-old-to-stand-trial-in-france",
    "image": "https://media.guim.co.uk/ed8d42a871d1d4cc01000fe5f32060cc5c4ac1d0/0_344_1960_1568/500.jpg",
    "summary": "The murder of Lola Daviet three years ago sparked significant public outrage, as some accused far-right factions of politicizing her death. The incident raised concerns about the exploitation of tragedies for political purposes. This event continues to resonate in discussions about political accountability and the ethics of exploiting personal tragedies.",
    "published": "2025-10-16T18:09:38Z"
  }
]