[
  {
    "title": "Harry Kane at Bayern: how a marriage of convenience turned into true love | Andy Brassell",
    "url": "https://www.theguardian.com/football/blog/2025/sep/29/harry-kane-bayern-munich-marriage-of-convenience-true-love-bundesliga",
    "image": "https://media.guim.co.uk/646ae65691a82f908a8c5d401eff01dc9384e2b1/363_0_3956_3165/500.jpg",
    "summary": "The striker, having reached an impressive milestone of 100 goals in record time, is considering extending his contract. He expresses a strong desire to remain at the club that values him highly. His remarkable performance has further solidified his status among fans and management.",
    "published": "2025-09-29T12:39:31Z"
  },
  {
    "title": "JLR to resume some manufacturing in coming days after hack: GSK shares rise 3% after surprise CEO change – business live",
    "url": "https://www.theguardian.com/business/live/2025/sep/29/moral-hazard-fears-jlr-jaguar-land-rover-government-loan-gsk-ceo-astrazeneca-listing-dollar-shutdown-business-live-news",
    "image": "https://media.guim.co.uk/f91f5a390fb4912042b9770554a8e23b7261cd22/994_0_5511_4409/500.jpg",
    "summary": "Jaguar Land Rover (JLR) is implementing a \"controlled, phased restart\" of its operations. Meanwhile, GlaxoSmithKline (GSK) has appointed a new leader to succeed Dame Emma Walmsley. These developments indicate notable changes in both companies' management and operational strategies.",
    "published": "2025-09-29T12:38:04Z"
  },
  {
    "title": "Reeves says she won’t take economic risks, hints at hard choices, and warns Reform will threaten living standards – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/29/rachel-reeves-labour-party-conference-youth-guarantee-unemployment-uk-politics-live-latest-news",
    "image": "https://media.guim.co.uk/943b6ad8a3245367ebb8ba7be337e9bc04be1abe/700_0_2836_2268/500.jpg",
    "summary": "The Chancellor highlighted the turmoil experienced during Liz Truss's time in office, emphasizing that it serves as a warning against neglecting economic responsibility. He stressed the importance of maintaining fiscal discipline despite contrary views from some individuals. The remarks aim to reinforce a commitment to sound economic policies moving forward.",
    "published": "2025-09-29T12:37:18Z"
  },
  {
    "title": "Putin ‘does not want a ceasefire and does not want peace for Ukraine’, says German defence minister – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/sep/29/moldova-voters-pro-eu-government-russia-drones-europe-live",
    "image": "https://media.guim.co.uk/953898f4ae3b7d965da1916ca6a56766ca8c19f3/293_0_4208_3367/500.jpg",
    "summary": "Boris Pistorius emphasized that Europe will avoid being drawn into a cycle of continuous escalation instigated by Putin. He questioned the effectiveness of Russia's tactics and called for a measured response. Pistorius underscored the importance of maintaining stability and resisting provocations.",
    "published": "2025-09-29T12:36:56Z"
  },
  {
    "title": "Donald Trump and Benjamin Netanyahu to discuss Gaza peace plan at the White House – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/29/donald-trump-benjamin-netanyahu-gaza-white-house-us-politics-live",
    "image": "https://media.guim.co.uk/dcac1da0ca83af83dab779b453431861fe887c0b/296_0_3770_3016/500.jpg",
    "summary": "The U.S. president is set to urge the Israeli prime minister to establish a new framework aimed at ending the ongoing war in Gaza. The initiative also seeks to secure the release of remaining hostages held by Hamas. This push reflects ongoing diplomatic efforts to stabilize the region.",
    "published": "2025-09-29T12:36:46Z"
  }
]