[
  {
    "title": "Pritzker warns Trump planning send national guard to Chicago as border patrol there shoots woman",
    "url": "https://www.theguardian.com/us-news/2025/oct/04/woman-shot-border-patrol-chicago",
    "image": "https://media.guim.co.uk/80ed7e704c0cf1b7b7d87183bb93072f59ef6a44/520_0_5200_4160/500.jpg",
    "summary": "Illinois Governor criticized the state administration for increasing \"aggression\" against its citizens and residents. He expressed concerns over policies perceived as harmful or oppressive. The statement highlights growing tensions between the state government and the public regarding governance.",
    "published": "2025-10-04T21:09:32Z"
  },
  {
    "title": "St Helens given police escort after ‘terrorist threat’ made during Hull KR match",
    "url": "https://www.theguardian.com/sport/2025/oct/04/st-helens-given-police-escort-after-terrorist-threat-made-during-hull-kr-match",
    "image": "https://media.guim.co.uk/2e574f3014165b07c65274292aa143f03e6fd347/308_0_3335_2669/500.jpg",
    "summary": "St Helens had to evacuate Hull KR’s Sewell Group Craven Park under police escort following a \"terror threat\" received via their Instagram account. The incident occurred during their Super League semi-final playoff match, which they lost 20-12. Authorities are investigating the threat as the team prioritizes safety.",
    "published": "2025-10-04T20:58:31Z"
  },
  {
    "title": "Salah and Isak will click, insists Slot after Liverpool slip to third defeat",
    "url": "https://www.theguardian.com/football/2025/oct/04/salah-and-isak-will-click-says-slot-after-liverpool-slip-to-third-defeat",
    "image": "https://media.guim.co.uk/6dee46e4a9be05760a6bff600855e2c9202265eb/250_0_2500_2000/500.jpg",
    "summary": "Arne Slot expressed confidence in Mohamed Salah and Alexander Isak's potential to develop a strong attacking partnership following Liverpool's recent stoppage-time loss to Chelsea. The coach believes they will improve their on-field chemistry over time. Slot remains optimistic despite the disappointing result.",
    "published": "2025-10-04T20:48:54Z"
  },
  {
    "title": "Strictly Come Dancing: week two – as it happened",
    "url": "https://www.theguardian.com/tv-and-radio/live/2025/oct/04/strictly-come-dancing-week-two-live",
    "image": "https://media.guim.co.uk/3a925c7ab0c93d0f7d458d2239e5605a30e357c3/395_0_3953_3162/500.jpg",
    "summary": "Amber Davies led the scoreboard in the latest dance competition, with Alex Kingston and Balvinder Sopal showing the most improvement. Meanwhile, Ross King and Thomas Skinner found themselves at the bottom. The competition heats up as viewers speculate who might be the first to leave.",
    "published": "2025-10-04T20:44:58Z"
  },
  {
    "title": "Police make almost 500 arrests at Palestine Action protest in London",
    "url": "https://www.theguardian.com/world/2025/oct/04/palestine-action-protest-police-arrests-london-demo",
    "image": "https://media.guim.co.uk/51163e7da7d008c6cbcc9a4da5a69a6fa232b354/492_0_5196_4155/500.jpg",
    "summary": "Police arrested activists during a silent vigil supporting a banned organization, despite Prime Minister's appeals for calm. Demonstrations continued across the region, reflecting ongoing tensions surrounding the organization. The clashes underscore the struggle between activism and governmental restrictions on dissent.",
    "published": "2025-10-04T20:31:03Z"
  }
]