[
  {
    "title": "Marseille v Newcastle, Manchester City v Bayer Leverkusen, and more: Champions League – live",
    "url": "https://www.theguardian.com/football/live/2025/nov/25/marseille-v-newcastle-manchester-city-v-bayer-leverkusen-and-more-champions-league-live",
    "image": "https://media.guim.co.uk/fda71bcc31d1c2dbf9f462c64abdeec5244ca18e/148_0_3661_2930/500.jpg",
    "summary": "Rob Smyth will provide live updates from various matches across Europe during a hectic evening of Champions League action. Fans can expect timely reports and analyses as games unfold. Stay tuned for insights and key moments from the matches.",
    "published": "2025-11-25T21:17:51Z"
  },
  {
    "title": "Chelsea v Barcelona: Champions League – live",
    "url": "https://www.theguardian.com/football/live/2025/nov/25/chelsea-v-barcelona-champions-league-live",
    "image": "https://media.guim.co.uk/cc6590f473092783221ca0c81fb8ad7792d25984/285_0_3430_2743/500.jpg",
    "summary": "Scott Murray will provide a live, minute-by-minute report for the exciting Champions League match taking place at Stamford Bridge. Fans can follow along for updates and insights throughout the game. Expect a thrilling showdown in this highly anticipated encounter.",
    "published": "2025-11-25T21:17:21Z"
  },
  {
    "title": "Australia politics live: Labor optimistic of nature laws deal with Greens; harsher fines and jail time for NDIS breaches under new bill",
    "url": "https://www.theguardian.com/australia-news/live/2025/nov/26/politics-live-labor-epbc-nature-laws-murray-watt-greens-coalition-anthony-albanese-sussan-ley-ted-obrien-national-press-club-ndis-fines-cpi-question-time-ntwnfb",
    "image": "https://media.guim.co.uk/8fbda2815db8a1e0b14169a4a6cec010b849b371/543_0_5431_4344/500.jpg",
    "summary": "I'm sorry, but I need more context or specific details about the news you want summarized. Please provide the article or its key points.",
    "published": "2025-11-25T21:13:08Z"
  },
  {
    "title": "‘We will not be bullied’: House Democrats involved in video to troops confirm FBI is seeking to question them - live",
    "url": "https://www.theguardian.com/us-news/live/2025/nov/25/us-politics-pam-bondi-appeal-james-comey-letitia-james-cases-donald-trump-venezuela-latest-updates",
    "image": "https://media.guim.co.uk/c80e794146daf750322a5653ee15a4e48875ed9e/225_0_3674_2939/500.jpg",
    "summary": "Lawmakers accuse President Trump of weaponizing the FBI to intimidate and harass them following his controversial remarks in a video. In the video, he urged military members to disobey illegal orders. The situation has raised concerns about the relationship between the executive branch and Congress.",
    "published": "2025-11-25T21:02:49Z"
  },
  {
    "title": "Corrections and clarifications",
    "url": "https://www.theguardian.com/news/2025/nov/25/corrections-and-clarifications",
    "summary": "The Sayce review examines the Wordwheel tool, assessing its effectiveness and user experience. Feedback highlights strengths in usability but identifies areas for improvement, particularly in functionality. The review aims to enhance the overall performance and accessibility of Wordwheel for users.",
    "published": "2025-11-25T21:00:31Z"
  }
]