[
  {
    "title": "Nottinghamshire v Warwickshire, tributes paid to Dickie Bird, and more: county cricket – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/24/nottinghamshire-v-warwickshire-hampshire-v-surrey-and-more-county-cricket-live",
    "image": "https://media.guim.co.uk/f7c819d4564a071a70a2cdc4eb76f9843b27575e/282_0_4767_3814/500.jpg",
    "summary": "Nottinghamshire is vying to secure the County Championship title against Surrey in the season's final round. Tanya Aldred is providing live updates on the unfolding match. The outcome will determine if Notts can hold off Surrey to clinch the championship.",
    "published": "2025-09-24T11:25:34Z"
  },
  {
    "title": "Trump says he ‘can’t believe’ Kimmel back on ABC as he hints at action against network – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/24/donald-trump-jimmy-kimmel-freedom-of-speech-immigration-government-shutdown-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/56fb6b189f6b91d884a847478837039262927599/260_0_3240_2593/500.jpg",
    "summary": "President accuses a comedian's show of acting as a tool for the Democratic National Committee (DNC). He also highlights that ABC had previously compensated the comedian millions due to defamation claims. This statement underscores ongoing tensions between the president and media figures.",
    "published": "2025-09-24T11:25:26Z"
  },
  {
    "title": "Royal Parks say no evidence to back Nigel Farage’s claim that migrants are eating their swans – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/24/labour-tories-conservatives-reform-uk-politics-live-news-updates",
    "image": "https://media.guim.co.uk/0ff5243ef03ba438a063a5e6c5a8e7dad5f42601/383_0_3289_2632/500.jpg",
    "summary": "Reform UK leader made controversial statements alleging that swans and carp in parks are being consumed by individuals from various cultural backgrounds. This claim has sparked criticism and debate regarding cultural perceptions and wildlife conservation. The remarks highlight ongoing discussions around immigration and cultural integration in the UK.",
    "published": "2025-09-24T11:24:51Z"
  },
  {
    "title": "Typhoon Ragasa live: deadly cyclone makes landfall in China after devastating Hong Kong, Taiwan and Philippines",
    "url": "https://www.theguardian.com/world/live/2025/sep/24/typhoon-ragasa-live-china-hong-kong-taiwan-philippines-latest-storm-news-updates",
    "image": "https://media.guim.co.uk/08e97b9bdc83bc743cba156fd6a74772f9b88251/295_0_2700_2160/500.jpg",
    "summary": "Nearly 2 million people have been evacuated in Guangdong, southern China's economic powerhouse, as the region prepares for an impending storm. Authorities are taking preventive measures to ensure the safety of residents. The evacuation reflects the seriousness of the weather threat facing the area.",
    "published": "2025-09-24T11:14:40Z"
  },
  {
    "title": "Adviser to UK minister claimed AI firms would never have to compensate creatives",
    "url": "https://www.theguardian.com/technology/2025/sep/24/adviser-uk-minister-claimed-ai-firms-never-compensate-creatives",
    "image": "https://media.guim.co.uk/a60307da4becfbbb6159d7dead4c19e4b44504de/457_0_5000_4000/500.jpg",
    "summary": "Kirsty Innes made a statement in a now-deleted post on X seven months prior to starting her position as an aide to Liz Kendall. The contents of the statement have drawn attention following her appointment. Further details about the statement and its implications have not been disclosed.",
    "published": "2025-09-24T11:07:45Z"
  }
]