[
  {
    "title": "Australia news live: dog-whistle politics ‘now a set of bagpipes’, Tony Burke says; controversial APY exhibition to return",
    "url": "https://www.theguardian.com/australia-news/live/2025/oct/16/australia-news-live-tony-burke-crypto-atms-crime-real-income-aihw-wellbeing-bluey-coins-mint-ntwnfb",
    "image": "https://media.guim.co.uk/3a27e062daf1aa33bee5afaf1c58c1e30d2911b9/39_0_4325_3460/500.jpg",
    "summary": "Sure, please provide the news article or details you'd like me to summarize, and I'll help you with that!",
    "published": "2025-10-16T04:10:32Z"
  },
  {
    "title": "Closure of GP clinics will leave thousands of vulnerable Victorians without ‘lifesaving healthcare’",
    "url": "https://www.theguardian.com/australia-news/2025/oct/16/gp-cohealth-clinics-close-victoria-healthcare",
    "image": "https://media.guim.co.uk/1a901eee1b310e183412002f60aebaa44b3393ef/452_0_2688_2150/500.jpg",
    "summary": "GP services at the Collingwood, Fitzroy, and Kensington sites will conclude in December. This decision impacts local healthcare access for residents in these areas. Patients will need to seek alternative medical services following the closure.",
    "published": "2025-10-16T04:07:24Z"
  },
  {
    "title": "French Socialist party to fight for wealth tax as it seeks to capitalise on crisis ",
    "url": "https://www.theguardian.com/world/2025/oct/16/french-socialist-party-to-fight-for-wealth-tax-as-it-seeks-to-capitalise-on-crisis",
    "image": "https://media.guim.co.uk/b7e3cb65aaf7a02100ff526294d562e3ad91813b/242_0_2451_1960/500.jpg",
    "summary": "The party has announced its intention to step aside as the embattled prime minister gears up for a critical no-confidence vote. This move signals a significant shift in political dynamics. The outcome of the vote could determine the prime minister's future leadership.",
    "published": "2025-10-16T04:00:58Z"
  },
  {
    "title": "Mediator in chief: how role of Qatar will be central to Gaza ceasefire holding",
    "url": "https://www.theguardian.com/world/2025/oct/16/how-role-of-qatar-will-be-central-to-gaza-ceasefire-holding",
    "image": "https://media.guim.co.uk/2a15bbc728b146efc5416938aa010a8dc50e5dc6/377_0_2887_2311/500.jpg",
    "summary": "Qatar's influence on Hamas has been significant, but it is seeking structured, multilateral processes to guide future developments. Doha aims to establish formal frameworks for managing the situation moving forward. This reflects Qatar's intent to play a pivotal role in regional stability and governance.",
    "published": "2025-10-16T04:00:57Z"
  },
  {
    "title": "Agnes Wanjiru’s niece urges Labour to extradite ex-soldier while still in power",
    "url": "https://www.theguardian.com/world/2025/oct/16/agnes-wanjiru-niece-urges-labour-extradite-ex-soldier-kenya",
    "image": "https://media.guim.co.uk/4d08201e7d7d59c50d15f76608f3a34e546dab7c/0_386_4000_3200/500.jpg",
    "summary": "Esther Njoki reports that her family has experienced significant improvements under the Labour government following a prolonged struggle for justice regarding her aunt's death in 2012. The government’s actions have brought hope and positive changes to their situation. This marks a notable shift in their pursuit of justice and support.",
    "published": "2025-10-16T04:00:57Z"
  }
]