[
  {
    "title": "The Guardian view on fishing and nature: bottom-trawling boats don’t belong in conservation zones | Editorial ",
    "url": "https://www.theguardian.com/commentisfree/2025/sep/12/the-guardian-view-on-fishing-and-nature-bottom-trawling-boats-dont-belong-in-conservation-zones",
    "image": "https://media.guim.co.uk/3493d9a4f26998fea7391a74900b6e26c53bb8d4/5_0_3239_2592/500.jpg",
    "summary": "The UK’s current marine management system is inadequate for protecting sea life. There is an urgent need for more effective strategies to ensure the preservation of marine ecosystems. Enhanced policies and practices are essential to safeguard ocean biodiversity.",
    "published": "2025-09-12T17:25:41Z"
  },
  {
    "title": "England v South Africa: second men’s T20 international – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/12/england-v-south-africa-second-mens-t20-international-live",
    "image": "https://media.guim.co.uk/9207ed662736bb0db6be9d3c2fee45d91fb85658/2038_148_2585_2068/500.jpg",
    "summary": "Harry Brook's team is aiming to equalize the series during the match at Old Trafford. Rob Smyth will provide live updates and commentary on the game. Fans can expect detailed over-by-over reports as the action unfolds.",
    "published": "2025-09-12T17:21:09Z"
  },
  {
    "title": "Charlie Kirk shooting latest: Utah governor confirms identity of suspect and says family friend turned him in",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/12/charlie-kirk-shooter-suspect-latest-news-updates-donald-trump-utah",
    "image": "https://media.guim.co.uk/b3900dee754cc4e9b61442cbd4826f211c47f0af/0_969_1693_1353/500.jpg",
    "summary": "Spencer Cox reported that Tyler Robinson, 22, confessed to a family friend about shooting Kirk. The FBI director confirmed that the suspect was apprehended on Thursday evening. Investigations into the incident are ongoing.",
    "published": "2025-09-12T17:21:08Z"
  },
  {
    "title": "Nato announces more air support to defend Poland against future Russian incursions",
    "url": "https://www.theguardian.com/world/2025/sep/12/nato-announces-enhanced-air-support-to-defend-poland-against-future-russian-incursions",
    "image": "https://media.guim.co.uk/a88fcbf9cb7928591cac97a1dc5fae8e84f0c25b/395_0_4068_3254/500.jpg",
    "summary": "France, Germany, and Denmark have announced plans to contribute fighter jets and additional military assets for a joint mission. This initiative is also anticipated to include participation from the United Kingdom. The collaboration aims to enhance defense capabilities among the allied nations.",
    "published": "2025-09-12T17:13:41Z"
  },
  {
    "title": "Rick Davies obituary",
    "url": "https://www.theguardian.com/music/2025/sep/12/rick-davies-obituary",
    "image": "https://media.guim.co.uk/3c106c0f1de86b3b327edd9afe6dcfbe800873a1/230_0_2616_2092/500.jpg",
    "summary": "The singer and songwriter from Supertramp, known for his gritty voice and impactful lyrics, played a crucial role in the band's success during the 1970s and 80s. His contributions helped define the band's sound and resonate with audiences. Supertramp became one of the iconic bands of that era, largely due to his artistic influence.",
    "published": "2025-09-12T17:13:09Z"
  }
]