[
  {
    "title": "Australia news live: nation’s first Indigenous treaty passes Victorian parliament: Coalition to meet on net zero policy",
    "url": "https://www.theguardian.com/australia-news/live/2025/oct/31/australia-news-live-politics-parliament-coalition-labor-net-zero-anthony-albanese-sussan-ley-epbc-nature-laws-ntwnfb",
    "image": "https://media.guim.co.uk/95c32ae2b6cb2cfc853523883457aa6ce1b5d27f/667_0_6641_5316/500.jpg",
    "summary": "Please provide the specific news article or details you'd like summarized, and I'll be happy to help!",
    "published": "2025-10-30T21:14:05Z"
  },
  {
    "title": "Apple to report earnings as new iPhone lineup reignites worldwide demand",
    "url": "https://www.theguardian.com/technology/2025/oct/30/apple-earnings-iphone-demand",
    "image": "https://media.guim.co.uk/1fc1a320d74b828af31c3c8eeaaf7159afc8f36b/1115_0_5573_4460/500.jpg",
    "summary": "Analysts anticipate robust growth for Apple following its milestone achievement of surpassing a $4 trillion market value this week. This significant landmark reflects investor confidence and the company's strong performance. Expectations are high for continued success as Apple expands its product offerings and services.",
    "published": "2025-10-30T21:09:30Z"
  },
  {
    "title": "Corrections and clarifications",
    "url": "https://www.theguardian.com/news/2025/oct/30/corrections-and-clarifications",
    "summary": "Sara Sharif, a key figure in the Dutch elections, has emerged as a prominent candidate in the political landscape. She is expected to influence the outcome with her policies and vision. Voter engagement and the response to her campaign will play a crucial role in the upcoming election results.",
    "published": "2025-10-30T21:00:06Z"
  },
  {
    "title": "Senate passes bill to nullify Trump’s sweeping global tariffs on more than 100 nations – US politics live",
    "url": "https://www.theguardian.com/world/live/2025/oct/30/donald-trump-xi-jinping-meeting-live-updates",
    "image": "https://media.guim.co.uk/97046f776aac162b3e42421270440d729ca4c94c/918_0_6827_5464/500.jpg",
    "summary": "The Senate has passed a vote 51-47 in a bipartisan effort aimed at ending tariffs. This follows earlier resolutions which successfully repealed tariffs on Canada and Brazil. The move signifies progress in addressing trade barriers with these neighboring countries.",
    "published": "2025-10-30T20:55:06Z"
  },
  {
    "title": "Amazon reports strongest cloud growth since 2022 after major outage",
    "url": "https://www.theguardian.com/technology/2025/oct/30/aws-revenue-outage",
    "image": "https://media.guim.co.uk/e5c47002ec1889a47119f82b2fc5e97da92969d4/428_0_4267_3415/500.jpg",
    "summary": "Amazon Web Services (AWS) reported a 20% year-over-year revenue increase, surpassing Wall Street expectations. This growth highlights the continued demand for cloud computing services. The strong performance reflects AWS's pivotal role in Amazon's overall business strategy.",
    "published": "2025-10-30T20:50:40Z"
  }
]