[
  {
    "title": "‘No cause exists under the law’: Federal Reserve governor Lisa Cook responds to Trump’s move to fire her – live",
    "url": "https://www.theguardian.com/us-news/live/2025/aug/26/trump-federal-reserve-lisa-cook-news-updates-us-politics-live",
    "image": "https://media.guim.co.uk/bb80bf6325afd21c5ae02bce7d87dc97c1a4eea9/0_0_3000_2400/500.jpg",
    "summary": "Lisa Cook announced she will not resign following accusations from Trump suggesting she had fabricated mortgage fraud allegations against him. Cook is standing firm amid the controversy, maintaining her position. The situation highlights ongoing tensions between Trump and key figures in the legal framework.",
    "published": "2025-08-26T14:38:41Z"
  },
  {
    "title": "UK retail stocks tumble as Deutsche Bank cuts ratings, French market drops on political fears - business live",
    "url": "https://www.theguardian.com/business/live/2025/aug/26/trump-fire-federal-reserve-governor-dollar-falls-markets-business-live-news",
    "image": "https://media.guim.co.uk/7fbea4014b19db09e1bfa1684a2ca222ee7681df/421_0_4840_3872/500.jpg",
    "summary": "Economic and financial news features ongoing updates on market trends, policy changes, and economic indicators. Analysts are closely monitoring developments that could impact global economies. Key topics include inflation rates, interest rate adjustments, and geopolitical influences on financial markets.",
    "published": "2025-08-26T14:38:14Z"
  },
  {
    "title": "Oregon wildfire begins stabilizing as California blaze threatens vineyards",
    "url": "https://www.theguardian.com/us-news/2025/aug/26/oregon-california-wildfires",
    "image": "https://media.guim.co.uk/c007d399c040b8d6986cc438daf3993b15474b3d/762_0_4001_3200/500.jpg",
    "summary": "Rain has aided in cooling the Flat fire in Oregon, which has resulted in the destruction of several homes. Meanwhile, the Pickett fire in Napa County has burned approximately 10 square miles. Firefighters are continuing to manage these incidents as conditions improve.",
    "published": "2025-08-26T14:32:25Z"
  },
  {
    "title": "Old master painting looted by Nazis spotted in Argentinian property listing",
    "url": "https://www.theguardian.com/world/2025/aug/26/old-master-painting-giuseppe-ghislandi-looted-by-nazis-argentina-property-listing",
    "image": "https://media.guim.co.uk/c9fe99b2c95712d54197f8ca319d95bfb45dfafa/224_0_856_685/500.jpg",
    "summary": "Dutch newspaper AD reports that Giuseppe Ghislandi’s Portrait of a Lady has been located in a house near Buenos Aires. The tracing of the artwork marks a significant development in its provenance. Further details about the painting's history and current ownership are still emerging.",
    "published": "2025-08-26T14:27:13Z"
  },
  {
    "title": "Hundreds of senior diplomats call for EU to take urgent action over Gaza crisis – Middle East crisis live",
    "url": "https://www.theguardian.com/world/live/2025/aug/26/israel-gaza-protest-hostage-war-hospital-benjamin-netanyahu-latest-live-news-updates",
    "image": "https://media.guim.co.uk/2fd2fbaeced4fb68307e556f9280705f495c3fe2/457_0_4583_3667/500.jpg",
    "summary": "An open letter has been signed by 209 former EU ambassadors and senior diplomatic officials from EU member states. The letter emphasizes a collective concern or stance on a significant issue. Its content reflects the views of experienced diplomats regarding EU policies or international relations.",
    "published": "2025-08-26T14:25:12Z"
  }
]