[
  {
    "title": "Minister calls Burnham ‘regional politician’ as Manchester mayor defends interviews following leadership speculation – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/25/andy-burnham-steve-reed-keir-starmer-labour-news-updates-uk-politics-live",
    "image": "https://media.guim.co.uk/3d33381f6da48c2fca3926a72dc63bcfa12e069b/629_0_4303_3442/500.jpg",
    "summary": "Housing Secretary Steve Reed has suggested that Greater Manchester Mayor Andy Burnham should focus on his responsibilities as mayor rather than engaging in media discussions about policy ideas. Reed's comments imply a distraction from local governance. The remarks highlight an ongoing debate about the role of local officials in broader policy conversations.",
    "published": "2025-09-25T09:33:54Z"
  },
  {
    "title": "Former French president found guilty but acquitted of some charges in criminal case linked to Gaddafi regime – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/sep/25/aalborg-airport-denmark-drones-oslo-sarkozy-meloni-news-updates-europe-live",
    "image": "https://media.guim.co.uk/3cf4e7e4c694fc025679cb8d7a76860b99327383/230_0_1960_1568/500.jpg",
    "summary": "Former French President Nicolas Sarkozy has been acquitted of passive corruption and illegal campaign financing but found guilty of criminal conspiracy related to alleged favors granted to the late Libyan dictator Muammar Gaddafi. The case revolves around accusations of receiving illicit funds for his presidential campaign in 2007. Sarkozy faces a potential prison sentence following the conviction.",
    "published": "2025-09-25T09:32:02Z"
  },
  {
    "title": "Nottinghamshire close on title against Warwickshire: county cricket final round – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/25/nottinghamshire-close-on-title-against-warwickshire-county-cricket-final-round-live",
    "image": "https://media.guim.co.uk/262a8e45cc6679c08f0d353e9dc445b0b4ad8200/12_0_2250_1800/500.jpg",
    "summary": "Tanya Aldred will provide live updates from various venues during the final round of the County Championship matches this season. Fans can follow her coverage for the latest developments and scores. Stay tuned for the concluding action as teams compete for their final standings.",
    "published": "2025-09-25T09:28:48Z"
  },
  {
    "title": "Cyber-attacks latest: Co-op expects hack will wipe out £120m of profits; government urged to give loans to Jaguar Land Rover suppliers – business live",
    "url": "https://www.theguardian.com/business/live/2025/sep/25/co-op-cyber-attack-cost-it-80m-profits-loss-government-support-jlr-suppliers-business-live-news",
    "image": "https://media.guim.co.uk/c655d5a52167670d2af5de42723cd3f8ecb6f950/588_0_4072_3257/500.jpg",
    "summary": "Co-op disclosed that a recent cyberattack resulted in a loss of £206 million in revenue. The company is now providing ongoing updates regarding the incident's financial impact. Stakeholders are closely monitoring the situation for further developments in the aftermath of the hack.",
    "published": "2025-09-25T09:25:56Z"
  },
  {
    "title": "Co-op says ‘malicious’ cyber-attack has hit profits by £80m",
    "url": "https://www.theguardian.com/business/2025/sep/25/co-op-says-malicious-cyber-attack-has-hit-profits-by-80m",
    "image": "https://media.guim.co.uk/a2cf1b6c71c4fe14bd657abda31c417d2b29faf0/115_0_4998_4000/500.jpg",
    "summary": "A retailer has announced plans to address weaknesses in its food business that resulted in empty shelves in its stores. The company aims to improve supply chain issues and inventory management. This focus is part of a broader strategy to enhance overall customer experience and product availability.",
    "published": "2025-09-25T09:08:49Z"
  }
]