[
  {
    "title": "Brentford v Chelsea: Premier League – live",
    "url": "https://www.theguardian.com/football/live/2025/sep/13/brentford-v-chelsea-premier-league-live",
    "image": "https://media.guim.co.uk/12ae00ea38651eb8e73f6375812b1ef34a8380b2/779_0_4404_3523/500.jpg",
    "summary": "Chelsea is set to face Brentford in a local west London derby at the Gtech Community Stadium. Xaymaca Awoyungbo will be covering the match. The clash promises to be an exciting encounter between the two rivals.",
    "published": "2025-09-13T20:24:55Z"
  },
  {
    "title": "Charlie Kirk’s US campus tour will continue despite his death, widow says – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/13/charlie-kirk-suspect-tyler-robinson-erika-kirk-us-politics-latest-news-donald-trump",
    "image": "https://media.guim.co.uk/4ef3a1799aa47a877a94ba4204664a5c985dac29/210_0_1333_1067/500.jpg",
    "summary": "Erika Kirk expressed that her husband's legacy will endure through his voice, even after his passing. She emphasized the emotional impact he had on her life and the importance of his memory. Kirk remains determined to keep his spirit alive in her heart and through shared memories.",
    "published": "2025-09-13T20:08:41Z"
  },
  {
    "title": "Bottles thrown at police as 100 officers clash with ‘unite the kingdom’ marchers – UK politics live as it happened",
    "url": "https://www.theguardian.com/politics/live/2025/sep/13/uk-politics-latest-news-unite-the-kingdom-march-far-right-rally-london-labour-keir-starmer",
    "image": "https://media.guim.co.uk/42917aaac388a66b0457a04458b3f2bc3a1a04ac/1037_202_4023_3218/500.jpg",
    "summary": "The Metropolitan Police estimated that around 110,000 people participated in a rally, while a smaller group of counter-protesters was contained nearby. The event showcased significant public engagement on the issue at hand. The police maintained oversight to ensure safety during the gatherings.",
    "published": "2025-09-13T20:05:17Z"
  },
  {
    "title": "Josh Pyke: ‘I turned around and throat-punched the guy – and the whole gig stopped’",
    "url": "https://www.theguardian.com/culture/2025/sep/14/josh-pyke-10-questions-interview",
    "image": "https://media.guim.co.uk/9cac7ad93d3e7ef1fbe948968492ea8aaec90e9a/0_1443_3151_2519/500.jpg",
    "summary": "An Australian musician shares insights on developing survival skills and his experience working as a door-to-door salesman. He reflects on the challenges of balancing his music career with other jobs. Additionally, he reveals his thoughts on a particular pop star whose appeal he struggles to understand.",
    "published": "2025-09-13T20:00:15Z"
  },
  {
    "title": "After four decades of stalled attempts, there’s a new plan to ‘transform’ Sydney’s ugliest road",
    "url": "https://www.theguardian.com/australia-news/2025/sep/14/after-four-decades-of-stalled-attempts-theres-a-new-plan-to-transform-sydneys-ugliest-road",
    "image": "https://media.guim.co.uk/b538442a36ba1e6edc6b64b8a14829a4626b168d/115_1_1013_811/500.jpg",
    "summary": "The NSW government plans to rezone the Parramatta Road corridor to accommodate 8,000 new homes. However, the proposed development does not include the previously suggested light rail project. This decision has sparked discussions about transportation and urban planning in the region.",
    "published": "2025-09-13T20:00:15Z"
  }
]