[
  {
    "title": "Potter sacked, Brentford v Manchester United buildup, Madrid derby – matchday live",
    "url": "https://www.theguardian.com/football/live/2025/sep/27/brentford-v-manchester-united-buildup-madrid-derby-and-wsl-action-matchday-live",
    "image": "https://media.guim.co.uk/d53934446e07ffe23418a5768b721a58d05dd52d/0_0_5000_4000/500.jpg",
    "summary": "Football discussions are heating up as Ruben Amorim seeks a much-needed win amid a busy schedule. The anticipation builds for the upcoming Madrid derby. Fans and analysts alike are eager to see how these matches unfold.",
    "published": "2025-09-27T10:17:34Z"
  },
  {
    "title": "Hampshire in relegation peril after Surrey defeat, Yorkshire v Durham: county cricket final day – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/27/hampshire-v-surrey-yorkshire-v-durham-and-more-county-cricket-final-day-live",
    "image": "https://media.guim.co.uk/6d642d99fe762aae2dd0f231a749d0ab9bd05766/277_0_2250_1800/500.jpg",
    "summary": "James Wallace will provide updates on the last day of the season's final round. Stay tuned for the latest developments and outcomes. Don't miss the concluding events of the season!",
    "published": "2025-09-27T10:13:05Z"
  },
  {
    "title": "‘A cottage of one’s own’: Newly unearthed Virginia Woolf stories to be published",
    "url": "https://www.theguardian.com/books/2025/sep/27/a-cottage-of-ones-own-newly-unearthed-virginia-woolf-stories-to-be-published",
    "image": "https://media.guim.co.uk/021922667b0afd13becd7b4c8da45a86696715a4/531_0_2538_2030/500.jpg",
    "summary": "A hidden find at a country house uncovered three humorous and surreal interlinked stories. These tales were penned nearly a decade prior to Virginia Woolf's first published work. The discovery sheds new light on Woolf's literary landscape and influences.",
    "published": "2025-09-27T10:08:33Z"
  },
  {
    "title": "More railway operators to be returned to public ownership next year, says Labour – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/27/railway-operators-trains-public-ownership-labour-party-conference-uk-politics-live-latest-news",
    "image": "https://media.guim.co.uk/565527e809a9f8364f67b2e409bc660d4b1006f4/246_0_2953_2362/500.jpg",
    "summary": "Transport Secretary announces that Govia Thameslink, Chiltern, and Great Western will transition into public ownership in 2026, following the example set by West Midlands Trains. The announcement will be made at the Labour Party conference. This move reflects a broader shift towards nationalization in the UK's rail services.",
    "published": "2025-09-27T10:08:01Z"
  },
  {
    "title": "‘Hell on earth’: immigrants held in new California detention facility beg for help",
    "url": "https://www.theguardian.com/us-news/2025/sep/27/immigrants-california-detention-facility",
    "image": "https://media.guim.co.uk/5150e221465b6ab3dcc76888055b989e289cc604/738_0_3699_2958/500.jpg",
    "summary": "Six individuals at a remote Ice facility in California City report experiencing medical issues and poor sanitation conditions. The facility's operator, CoreCivic, has denied these claims. Critics highlight the need for improved standards in immigrant detention centers.",
    "published": "2025-09-27T10:00:43Z"
  }
]