[
  {
    "title": "Australia v India: second men’s Twenty20 international – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/31/australia-v-india-t20-live-second-twenty20-international-cricket-aus-vs-ind-latest",
    "image": "https://media.guim.co.uk/38bce22d0442ced17fa269f3398c8062cf4f0534/655_0_4339_3471/500.jpg",
    "summary": "Australia is aiming to chase down 126 runs to secure a victory at a sold-out Melbourne Cricket Ground (MCG) and take an early lead in the T20I series. Martin Pegan will provide live updates on the match progress. The atmosphere is electric as fans eagerly anticipate the outcome.",
    "published": "2025-10-31T10:19:36Z"
  },
  {
    "title": " UK housing market ‘resilient’ in October; Nvidia boss says selling chips in China is Trump’s call – business live",
    "url": "https://www.theguardian.com/business/live/2025/oct/31/uk-house-prices-rise-asian-stocks-mixed-tech-earnings-business-live-news",
    "image": "https://media.guim.co.uk/60944f899cc10b02cb5609c621a120d10fe98739/666_0_5798_4639/500.jpg",
    "summary": "This news provides continuous updates on the latest developments in the economy and financial markets. It encompasses key indicators, trends, and significant events that impact global economic conditions. The coverage aims to keep readers informed on critical financial issues in real-time.",
    "published": "2025-10-31T10:19:31Z"
  },
  {
    "title": "Ukraine reports fresh Russian attacks and says Moscow has used ‘secret’ missile in recent months – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/oct/31/ukraine-russian-attacks-secret-missile-netherlands-dutch-elections-europe-live-latest-news-updates",
    "image": "https://media.guim.co.uk/97b92369719435dfe021905cda7094521b5b4592/279_0_1187_950/500.jpg",
    "summary": "The 9M729 cruise missile's development led Donald Trump to withdraw from a nuclear arms control agreement with Russia. This decision occurred during his first term in office. The move raised concerns about escalating nuclear tensions between the two countries.",
    "published": "2025-10-31T10:19:29Z"
  },
  {
    "title": "Slot targets Liverpool recovery; weekend team news and previews: football – live",
    "url": "https://www.theguardian.com/football/live/2025/oct/31/weekend-team-news-and-previews-football-live",
    "image": "https://media.guim.co.uk/37eda24d18a567a671c31eb159ff2f2f449dbbd6/0_0_6313_5051/500.jpg",
    "summary": "Join our writers for updates and insights as the weekend's football matches approach. Stay informed on team news, player performances, and key match previews. Don't miss out on the latest developments in the world of football!",
    "published": "2025-10-31T10:19:05Z"
  },
  {
    "title": "First Thing: US to limit refugee numbers to 7,500 with priority for white South Africans",
    "url": "https://www.theguardian.com/us-news/2025/oct/31/first-thing-us-to-limit-refugee-numbers-to-7500-with-priority-for-white-south-africans",
    "image": "https://media.guim.co.uk/842a79a618012ac871e131964f5684ae7d22c156/341_0_4358_3486/500.jpg",
    "summary": "US refugee organizations criticize recent government actions for diminishing the country's moral leadership in humanitarian issues. Meanwhile, unionized Starbucks employees are preparing to vote on potential strike actions in response to concerns about wages and working conditions. Both situations highlight rising tensions around social justice and labor rights.",
    "published": "2025-10-31T10:16:34Z"
  }
]