[
  {
    "title": "NFL week 12: Chiefs v Colts, Packers v Vikings and Bears v Steelers – live",
    "url": "https://www.theguardian.com/sport/live/2025/nov/23/nfl-week-12-chiefs-v-colts-packers-v-vikings-and-bears-v-steelers-live",
    "image": "https://media.guim.co.uk/e091f4c4fbca04ab122f1a61ca4f386cc20d366c/1000_0_5000_4000/500.jpg",
    "summary": "Graham Searles provides live updates on the 6pm UK time kick-offs. Stay tuned for minute-by-minute coverage of all the action. Keep informed on the latest developments in the matches.",
    "published": "2025-11-23T18:27:06Z"
  },
  {
    "title": "Arsenal v Tottenham: Premier League – live",
    "url": "https://www.theguardian.com/football/live/2025/nov/23/arsenal-v-tottenham-premier-league-live",
    "image": "https://media.guim.co.uk/a468ee0344fefd06e4d2baa7b122ffaa2a13eb14/1238_238_2962_2369/500.jpg",
    "summary": "North London rivals Tottenham Hotspur aim to secure their first Premier League victory at the Emirates Stadium since 2010. The upcoming match against Arsenal is stirring excitement among fans. Daniel Harris will be covering the event as anticipation builds.",
    "published": "2025-11-23T18:26:46Z"
  },
  {
    "title": "England 27-23 Argentina: Autumn Nations Series rugby union – live",
    "url": "https://www.theguardian.com/sport/live/2025/nov/23/england-v-argentina-autumn-nations-series-rugby-union-live",
    "image": "https://media.guim.co.uk/fa560891aa80cf07493c4586219d7340d8096ad1/1000_0_5000_4000/500.jpg",
    "summary": "Max Ojomoh starred for England, scoring one try and assisting on two others in their match against Argentina. Despite a late push from Argentina, England managed to secure the victory. Ojomoh's contributions were key to maintaining England's lead throughout the game.",
    "published": "2025-11-23T18:26:42Z"
  },
  {
    "title": "Hospitals must get smaller to stop NHS ‘permacrisis’, report urges",
    "url": "https://www.theguardian.com/society/2025/nov/23/hospitals-must-get-smaller-to-stop-nhs-permacrisis-report-urges",
    "image": "https://media.guim.co.uk/253269438d307d259c2b03898017c8b8b288ae86/493_136_2312_1850/500.jpg",
    "summary": "A new report from Re:State thinktank emphasizes that hospitals require a fundamental reinvention to improve patient care. It suggests that current practices are outdated and calls for innovative approaches to healthcare delivery. The thinktank highlights the need for a shift in how hospitals operate to enhance patient outcomes effectively.",
    "published": "2025-11-23T18:22:20Z"
  },
  {
    "title": "Many prominent Maga personalities on X are based outside US, new tool reveals",
    "url": "https://www.theguardian.com/us-news/2025/nov/23/rightwing-influencers-outside-us-x-twitter-tool",
    "image": "https://media.guim.co.uk/a338eac046aa114957575b6aa9f4bc97874ff552/417_0_3775_3020/500.jpg",
    "summary": "The platform's transparency feature reveals that users impersonating rightwing Americans are engaging in operations on an international scale. These deceptive activities have raised concerns about misinformation and foreign influence. The findings underscore the complexities of managing online identities and the potential impacts on political discourse.",
    "published": "2025-11-23T18:17:20Z"
  }
]