[
  {
    "title": "Polish president meeting with Donald Trump as Putin calls on Zelenskyy to ‘come to Moscow’ for peace talks – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/sep/03/volodymyr-zelenskyy-denmark-support-ukraine-karol-nawrocki-meet-donald-trump-europe-latest-updates-news",
    "image": "https://media.guim.co.uk/4e67279d3c1ebbb97f33f10cc7cff685c471c638/813_0_6880_5504/500.jpg",
    "summary": "Karol Nawrocki accompanied Trump on his first overseas visit to the White House. Russian President Putin has warned that Russia may resort to military action to achieve its goals if diplomatic efforts do not succeed. This statement signals heightened tensions regarding international negotiations.",
    "published": "2025-09-03T15:33:28Z"
  },
  {
    "title": "US Open tennis 2025: Auger-Aliassime v De Minaur, Anisimova v Swiatek on day 11 – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/03/us-open-tennis-2025-auger-aliassime-v-de-minaur-anisimova-v-swiatek-on-day-11-live",
    "image": "https://media.guim.co.uk/a706ed293eb79dd4af469c24f7e09e501c9b762e/435_0_4295_3437/500.jpg",
    "summary": "Daniel Harris provides live updates from the singles quarter-finals at Flushing Meadows. Follow along for the latest developments in the matches as they unfold. Stay tuned for continuous coverage and insights.",
    "published": "2025-09-03T15:33:22Z"
  },
  {
    "title": "Farage a ‘Putin-loving, free speech impostor’ says Democrat before Reform head’s US speech – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/03/farage-starmer-badenoch-pmqs-news-updates-uk-politics-live",
    "image": "https://media.guim.co.uk/6015fae3e517fdff1435548d88f3150d00bc8b00/255_0_3332_2665/500.jpg",
    "summary": "Jamie Raskin criticized Nigel Farage as \"a Trump sycophant\" prior to Farage's appearance before the House Judiciary Committee in Washington. Raskin's remarks highlight ongoing tensions and political divisions related to Trump's influence. Farage's testimony is anticipated to address various political issues in the US and UK.",
    "published": "2025-09-03T15:30:25Z"
  },
  {
    "title": "UK parents and teachers: share your experiences of the use of screens in schools",
    "url": "https://www.theguardian.com/education/2025/sep/03/uk-parents-and-teachers-share-your-experiences-of-the-use-of-screens-in-schools",
    "image": "https://media.guim.co.uk/5cb60553964266c93eaad2ffe202ad1b62cc43a9/2579_992_2800_2240/500.jpg",
    "summary": "The article seeks feedback on the use of technology and screens in educational settings. It invites educators to share their experiences and perspectives on classroom teaching with these tools. The aim is to gain insights into the impact of technology on learning environments.",
    "published": "2025-09-03T15:30:03Z"
  },
  {
    "title": "Budget compromise needed if PM ousted, says French finance minister",
    "url": "https://www.theguardian.com/world/2025/sep/03/france-budget-eric-lombard-francois-bayrou",
    "image": "https://media.guim.co.uk/e63a19b5f44b011794da71365c52d7be7bc4713d/0_466_2143_1713/500.jpg",
    "summary": "Éric Lombard expressed optimism that François Bayrou will prevail in an upcoming vote. He also downplayed concerns regarding a potential debt crisis. Lombard's comments reflect confidence in the political situation and fiscal stability.",
    "published": "2025-09-03T15:28:55Z"
  }
]