[
  {
    "title": "Tottenham v Aston Villa: Premier League – live",
    "url": "https://www.theguardian.com/football/live/2025/oct/19/tottenham-hotspur-v-aston-villa-premier-league-live",
    "image": "https://media.guim.co.uk/cc8eef299564488388391bf7adfd16e8932ea12c/292_0_3480_2783/500.jpg",
    "summary": "Spurs are looking to continue their strong performance in the Premier League season, and Michael Butler will provide a minute-by-minute report of the match. Fans can follow the action as it unfolds live. Stay tuned for updates on the team's progress.",
    "published": "2025-10-19T13:23:03Z"
  },
  {
    "title": "Gaza ceasefire under pressure as Israeli army carries out airstrikes in Rafah – Middle East crisis live",
    "url": "https://www.theguardian.com/world/live/2025/oct/19/gaza-ceasefire-israel-hamas-rafah-hostages-middle-east-crisis-live-news-updates",
    "image": "https://media.guim.co.uk/398671f0afb4441ffe48a367e1d392166c958c9a/593_0_4585_3668/500.jpg",
    "summary": "The army reported that their actions were a response to an attack on troops who were targeted with anti-tank missiles and gunfire. This incident underscores ongoing tensions and violence against military forces. Further details regarding the location and consequences of the attack have not been disclosed.",
    "published": "2025-10-19T13:22:54Z"
  },
  {
    "title": "Shobana Jeyasingh Dance: We Caliban review – postcolonial take on The Tempest is difficult to pin down",
    "url": "https://www.theguardian.com/stage/2025/oct/19/shobana-jeyasingh-dance-we-caliban-review-york-theatre-royal",
    "image": "https://media.guim.co.uk/99d91587ff90c70b1474cd68978c45b3a21e7bb7/199_0_2003_1603/500.jpg",
    "summary": "Jeyasingh’s choreography is skillfully crafted and executed, but the character Caliban's challenges seem lost among the multitude of concepts presented. The performance showcases technical excellence yet lacks focus in conveying Caliban's narrative. Overall, while impressive, the piece feels unanchored.",
    "published": "2025-10-19T13:21:11Z"
  },
  {
    "title": "India v England: Women’s Cricket World Cup – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/19/india-v-england-womens-cricket-world-cup-live",
    "image": "https://media.guim.co.uk/eb011cb724977ec56e2f8b09908480fd36a0cfba/512_0_6485_5191/500.jpg",
    "summary": "James Wallace reports on the pivotal match between England and co-hosts at Holkar Stadium. Both teams are vying for a spot in the semi-finals. The outcome will be crucial for their tournament aspirations.",
    "published": "2025-10-19T13:18:11Z"
  },
  {
    "title": "Police looking into claims Prince Andrew asked officer to find information on Virginia Giuffre",
    "url": "https://www.theguardian.com/uk-news/2025/oct/19/met-prince-andrew-police-bodyguard-information-virginia-giuffre",
    "image": "https://media.guim.co.uk/12464cb05971f958e1717bb9daa17c80672f9a33/0_98_2821_2256/500.jpg",
    "summary": "Leaked emails reveal that Andrew allegedly shared the details of his accuser with a Metropolitan Police bodyguard shortly before a controversial photo emerged. The emails raise concerns about potential misconduct and the timing of the information exchange. This situation adds to the ongoing scrutiny surrounding Andrew's legal battles.",
    "published": "2025-10-19T13:10:31Z"
  }
]