[
  {
    "title": "Brighton v Manchester City: Premier League updates – live",
    "url": "https://www.theguardian.com/football/live/2025/aug/31/brighton-v-manchester-city-premier-league-updates-live",
    "image": "https://media.guim.co.uk/f2ca3081fad7c5ef5b3614c2062f2d73645277ad/877_0_3905_3124/500.jpg",
    "summary": "Tim de Lisle will provide detailed minute-by-minute coverage of the Premier League match between Brighton and Manchester City. Fans can stay updated on all the action as it unfolds. Tune in for insights and live commentary throughout the game.",
    "published": "2025-08-31T14:31:57Z"
  },
  {
    "title": "F1: Dutch Grand Prix updates – live",
    "url": "https://www.theguardian.com/sport/live/2025/aug/31/f1-formula-one-dutch-grand-prix-updates-live",
    "image": "https://media.guim.co.uk/c82e60601675da82335529226017ee4074230ad5/1010_869_3145_2516/500.jpg",
    "summary": "Dominic Booth will provide comprehensive lap-by-lap coverage of the Dutch Grand Prix taking place at Zandvoort. Fans can expect detailed insights and updates throughout the race. Stay tuned to follow the action as it unfolds.",
    "published": "2025-08-31T14:31:45Z"
  },
  {
    "title": "Liverpool v Arsenal: Premier League updates – live",
    "url": "https://www.theguardian.com/football/live/2025/aug/31/liverpool-v-arsenal-premier-league-updates-live",
    "image": "https://media.guim.co.uk/038bdc9a0cf9b2a8cd8d6ad45807e9fa36a40f0b/494_0_4938_3951/500.jpg",
    "summary": "Will Unwin provides live, minute-by-minute coverage of the key match in the Premier League this weekend. Fans can stay updated on all the action as it unfolds. Tune in for detailed insights and commentary throughout the game.",
    "published": "2025-08-31T14:24:51Z"
  },
  {
    "title": "Vladimir Putin meets Xi Jinping arrives in China for security summit – Ukraine war live",
    "url": "https://www.theguardian.com/world/live/2025/aug/31/russia-ukraine-war-control-major-ukrainian-city-latest-updates-news-live",
    "image": "https://media.guim.co.uk/544de0f374aa00a9bf9f9df3cc80afaf27bdb9ee/438_0_3683_2946/500.jpg",
    "summary": "Russian President Vladimir Putin and Chinese President Xi Jinping met during the Shanghai Cooperation Organisation summit in Tianjin. The event was attended by over 20 world leaders, highlighting the group's significance in international cooperation. The summit showcases growing ties between Russia and China amidst global geopolitical changes.",
    "published": "2025-08-31T14:00:41Z"
  },
  {
    "title": "First the great migration, now the big hold: why workers are staying put",
    "url": "https://www.theguardian.com/business/2025/aug/31/great-migration-big-hold-job-growth-down-workers",
    "image": "https://media.guim.co.uk/8c89cc91461565a5ce72058c84bebfc903e02816/199_0_2003_1602/500.jpg",
    "summary": "A Robert Half survey reveals that 73% of workers intend to remain in their current jobs until 2025. Key factors influencing this decision include workplace culture, salary, and a challenging job market. The findings suggest a trend of stability among employees amid economic uncertainties.",
    "published": "2025-08-31T14:00:32Z"
  }
]