[
  {
    "title": "Australia news live: Cash accuses PM of ‘double standards’ over trip to UK Labour conference; police investigate fatal plane crash",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/28/australia-news-live-albanese-king-charles-afl-brisbane-coalition-liberals-western-australia-gst-queensland-nsw-victoria-labor-ntwnfb",
    "image": "https://media.guim.co.uk/e1468a7b3c77896d39cb2dd8838ad02b473e621d/598_0_5955_4767/500.jpg",
    "summary": "I'm sorry, but I need more specific information about the news you're referring to in order to provide a summary. Please share details or a specific article, and I'll be happy to help!",
    "published": "2025-09-28T03:04:22Z"
  },
  {
    "title": "Albanese rules out holding Australian republic referendum while he is prime minister",
    "url": "https://www.theguardian.com/australia-news/2025/sep/28/albanese-rules-out-holding-australian-republic-referendum-while-he-is-prime-minister",
    "image": "https://media.guim.co.uk/f556a644632eecffeda475ed4ca361b67f434eae/898_173_1762_1409/500.jpg",
    "summary": "The Prime Minister, who once supported establishing a republic, has recently softened his stance on pursuing constitutional reform. This shift indicates a possible retreat from his earlier advocacy for change. The decision reflects a broader political strategy rather than a firm commitment to republicanism.",
    "published": "2025-09-28T02:14:53Z"
  },
  {
    "title": "Trump news at a glance: Trump orders deployment of national guard to ‘war ravaged’ Portland",
    "url": "https://www.theguardian.com/us-news/2025/sep/28/trump-administration-news-updates-today",
    "image": "https://media.guim.co.uk/aad2f66553a277d987e11c51f1bdc8522f90e8f3/1188_7_2646_2118/500.jpg",
    "summary": "Portland officials have opposed the announcement regarding the deployment of military troops, asserting that there is \"no need\" for such intervention. The situation reflects ongoing tensions in local governance and federal involvement. This development is part of broader discussions in U.S. politics regarding law enforcement and public safety measures.",
    "published": "2025-09-28T00:58:27Z"
  },
  {
    "title": "Keegan Bradley defends US Ryder Cup fans as just ‘passionate’ amid chaos ",
    "url": "https://www.theguardian.com/sport/2025/sep/28/keegan-bradley-us-ryder-cup-fans-passionate-chaos",
    "image": "https://media.guim.co.uk/f408d9786a038daa14d2fd7e2e8617fb3a64e981/361_0_2405_1924/500.jpg",
    "summary": "Keegan Bradley declined to criticize American Ryder Cup fans despite the unsettling events as his team faced an 11 ½-4 ½ deficit. He emphasized the need to keep the focus on the game and the positive aspects of the competition. Bradley's remarks reflect a desire to maintain team spirit amidst challenging circumstances.",
    "published": "2025-09-28T00:48:52Z"
  },
  {
    "title": "Vast and spectacular: a five-day hike to Smitt Rock and Eighth Gorge in Nitmiluk national park",
    "url": "https://www.theguardian.com/travel/2025/sep/28/smitt-rock-eighth-gorge-nitmiluk-national-park-five-day-hike-northern-territory-spectacular",
    "image": "https://media.guim.co.uk/23d9af7cc3366eca3097951066e8215eaa65b8de/174_0_1159_927/500.jpg",
    "summary": "Tegan Forder explores the rugged and remote landscapes of the Northern Territory, discovering lush ravines and scenic trails. Along her journey, she encounters delicate native flowers and breathtaking sunsets. Her adventure highlights the region's natural beauty and diverse ecosystems.",
    "published": "2025-09-28T00:00:05Z"
  }
]