[
  {
    "title": "Trump says list of ‘Democrat programs’ to be released on Friday as shutdown drags into third week – live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/14/donald-trump-government-shutdown-national-guard-javier-milei-charlie-kirk-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/3ab122a2a36c1f04ee66b06e3b5355b45727e1f6/285_0_4282_3424/500.jpg",
    "summary": "The President stated that planned cuts to various programs will be permanent, indicating they will not return. This announcement comes as Congress struggles to reach an agreement on a stopgap funding bill needed to reopen the government. The ongoing impasse highlights the challenges lawmakers face in reaching a consensus.",
    "published": "2025-10-14T21:16:13Z"
  },
  {
    "title": "News live: Paterson warns Liberals to end ‘apology tour’; IMF predicts slows growth for Australian economy",
    "url": "https://www.theguardian.com/australia-news/live/2025/oct/15/australia-news-live-liberals-infighting-james-paterson-sussan-ley-andrew-hastie-superannuation-jim-chalmers-ntwnfb",
    "image": "https://media.guim.co.uk/dfd7988fe758d025b3b19de104a7ff42114393d8/703_0_6534_5230/500.jpg",
    "summary": "Please provide the news content you would like summarized, and I'll be happy to help!",
    "published": "2025-10-14T21:10:18Z"
  },
  {
    "title": "Trump threatens removal of World Cup games from Boston, Olympics from LA",
    "url": "https://www.theguardian.com/sport/2025/oct/14/trump-world-cup-olympics-threat-boston",
    "image": "https://media.guim.co.uk/3d0a3a8fa06dc79816f12f6aa7fabaa5863a338b/1429_759_3754_3003/500.jpg",
    "summary": "The US president cited safety concerns related to Boston street takeovers and LA wildfires as potential reasons for relocating upcoming global sporting events. He emphasized the need to prioritize public safety amid these issues. Discussions about the events' locations are ongoing due to these safety considerations.",
    "published": "2025-10-14T21:06:47Z"
  },
  {
    "title": "Latvia 0-5 England: England qualify for 2026 World Cup – as it happened",
    "url": "https://www.theguardian.com/football/live/2025/oct/14/latvia-v-england-world-cup-2026-qualifier-live",
    "image": "https://media.guim.co.uk/54afe0631b4a8cad6cd6c128016f83beb62160c4/379_0_4510_3608/500.jpg",
    "summary": "England secured their spot in the World Cup 2026 with a decisive victory over Latvia in Riga, achieving qualification with two games remaining in the qualifying round. The match showcased England's dominance, highlighting their strong performance throughout the campaign. Scott Murray provided a detailed minute-by-minute report of the game.",
    "published": "2025-10-14T21:04:05Z"
  },
  {
    "title": "Witches of Essex review – Rylan’s look at real-life witch trials treats us like idiots",
    "url": "https://www.theguardian.com/tv-and-radio/2025/oct/14/witches-of-essex-review-rylan-real-life-witch-trials",
    "image": "https://media.guim.co.uk/fc9175edb81d7f6cd28aae8c5c6cec90c2fdece1/210_0_1350_1080/500.jpg",
    "summary": "The X Factor star and Professor Alice Roberts serve as a mismatched pair in a new history show. Critics label the program as superficial, questioning its approach to exploring historical mindsets. The review implies that the presenters underestimate the audience's ability to understand past perspectives.",
    "published": "2025-10-14T21:00:04Z"
  }
]