[
  {
    "title": "Australia news live: AMA president says ‘no studies’ support Trump claim about paracetamol; PM remembers Zomi Frankcom in UN speech",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/23/australia-news-live-albanese-new-york-palestine-united-nations-donald-trump-mark-butler-paracetamol-pregnancy-ntwnfb",
    "image": "https://media.guim.co.uk/b09ed64d2e866d48885bb7465c5820885307a3c2/684_0_5461_4369/500.jpg",
    "summary": "Sure! Please provide the news you'd like me to summarize.",
    "published": "2025-09-22T22:27:02Z"
  },
  {
    "title": "Trump attacks Tylenol as officials unveil highly contentious conclusions on autism",
    "url": "https://www.theguardian.com/us-news/2025/sep/22/trump-administration-autism-causes",
    "image": "https://media.guim.co.uk/d4b7b33815b9dd48f8a2e1c0d7ccab1ac10d78b8/540_0_5419_4335/500.jpg",
    "summary": "A president has claimed that acetaminophen poses increased risks for pregnant women, suggesting potential harm. However, this assertion is contradicted by existing research, which does not support the idea that acetaminophen significantly raises risks during pregnancy. The statement has sparked controversy and debate over the safety of the medication for expectant mothers.",
    "published": "2025-09-22T22:22:12Z"
  },
  {
    "title": "France recognises state of Palestine, Macron tells UN; Abbas says Hamas to ‘surrender their weapons’ – Middle East crisis live",
    "url": "https://www.theguardian.com/world/live/2025/sep/22/palestinian-state-gaza-israel-middle-east-hamas-benjamin-netanyahu-latest-live-updates",
    "image": "https://media.guim.co.uk/944e804bb81f5a77f0d68dd7363ee27724e20944/29_0_4598_3681/500.jpg",
    "summary": "France announced a stance that was echoed by Morocco, Belgium, Malta, and Luxembourg, emphasizing a unified position on the situation in Gaza. Palestinian President Mahmoud Abbas stated that Hamas should not play a role in the governance of the territory. The statements reflect ongoing international discussions regarding the future of governance in Gaza.",
    "published": "2025-09-22T22:16:59Z"
  },
  {
    "title": "Monchi poised to leave winless Aston Villa in blow for Unai Emery",
    "url": "https://www.theguardian.com/football/2025/sep/22/aston-villa-monchi-unai-emery-football-premier-league",
    "image": "https://media.guim.co.uk/3c684b550b395846f0b4532d5c8d2c6f3907b697/417_0_4167_3333/500.jpg",
    "summary": "Monchi, Aston Villa's president of football operations, is set to depart the club after a brief tenure of just over two years in the Premier League. His exit marks a significant change in the club's leadership as they navigate the football landscape. The reasons for his departure have not been disclosed.",
    "published": "2025-09-22T22:05:08Z"
  },
  {
    "title": "Top US medical body criticizes Trump’s statements on Tylenol and autism as ‘irresponsible’ – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/22/donald-trump-charlie-kirk-autism-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/5575e702c456e7484aca274f2f22e2453f0c92d6/86_0_5478_4385/500.jpg",
    "summary": "The American College of Obstetricians and Gynecologists warns that connecting acetaminophen use in pregnancy to autism conveys a \"harmful\" message. They emphasize the importance of accurate information regarding medication safety during pregnancy. The organization seeks to prevent misinformation that could lead to unnecessary fear among expectant mothers.",
    "published": "2025-09-22T22:02:23Z"
  }
]