[
  {
    "title": "Tories call for Reeves to quit after breaking home rental rules but PM rules out investigation – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/oct/30/rachel-reeves-labour-keir-starmer-uk-politics-latest-news-updates",
    "image": "https://media.guim.co.uk/042e4d5b2b45b212202ef947cf7e2b8fe3ba3099/295_103_1834_1467/500.jpg",
    "summary": "Reeves has been renting her south London home without obtaining the necessary £945 license from the local council. This situation has raised concerns regarding compliance with local housing regulations. Authorities may take action against her for the unlicensed rentals.",
    "published": "2025-10-30T10:19:52Z"
  },
  {
    "title": "India v Australia: Women’s Cricket World Cup semi-final – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/30/india-v-australia-womens-cricket-world-cup-semi-final-live",
    "image": "https://media.guim.co.uk/2c001294bb541cfc583d3fdf0a9948a4f9dce7a4/113_121_1955_1565/500.jpg",
    "summary": "In Navi Mumbai, the second semi-final features co-hosts facing off against the defending champions. Follow our writers for live updates and commentary throughout the match. Excitement builds as both teams aim for victory.",
    "published": "2025-10-30T10:18:17Z"
  },
  {
    "title": "Dutch election results: far-right and centrist parties in tight race to top as vote count continues – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/oct/30/dutch-election-results-netherlands-geert-wilders-rob-jetten-france-louvre-russia-poland-ukraine-latest-news-updates",
    "image": "https://media.guim.co.uk/45fbaede82341f8794063ed809523495da4345cf/592_0_5000_4000/500.jpg",
    "summary": "Geert Wilders's Party for Freedom (PVV) has gained a slight lead over the D66 party in recent polls. Despite this, the centrist D66 is anticipated to spearhead negotiations for the formation of the next coalition government. The political landscape remains dynamic as parties navigate coalition possibilities.",
    "published": "2025-10-30T10:14:48Z"
  },
  {
    "title": "Trump is using the shutdown to make life tougher for millions of workers | Steven Greenhouse",
    "url": "https://www.theguardian.com/commentisfree/2025/oct/30/trump-snap-food-stamps-federal-workers",
    "image": "https://media.guim.co.uk/f87c165b893afee8dbb2df58856b82e1d6c29df3/59_0_6229_4984/500.jpg",
    "summary": "Food stamp programs face potential funding cuts, putting benefits at risk for many recipients. Additionally, hundreds of thousands of federal workers could miss paychecks due to budget constraints. Meanwhile, layoffs continue to affect thousands, exacerbating the financial strain on families.",
    "published": "2025-10-30T10:00:04Z"
  },
  {
    "title": "Can I learn to be cool – even though I am garrulous, swotty and wear no-show socks?",
    "url": "https://www.theguardian.com/lifeandstyle/2025/oct/30/can-i-learn-to-be-cool-even-though-i-am-garrulous-swotty-and-wear-no-show-socks",
    "image": "https://media.guim.co.uk/b8f9bc27efda56f9c4e6cd747f00bbb4aec4e7db/1673_559_6120_4898/500.jpg",
    "summary": "An international study identified traits associated with \"coolness,\" including being extroverted, open, hedonistic, adventurous, autonomous, and powerful. The author reflects on their own traits, recognizing they possess only a few of these qualities. They wonder if it's possible to cultivate the traits they lack.",
    "published": "2025-10-30T10:00:03Z"
  }
]