[
  {
    "title": "Liverpool v Everton: Premier League – live",
    "url": "https://www.theguardian.com/football/live/2025/sep/20/liverpool-v-everton-premier-league-live",
    "image": "https://media.guim.co.uk/ea8e7d6d72987b8fcd0874545ac82fc859e0446e/74_84_2653_2121/500.jpg",
    "summary": "Liverpool aims to uphold their flawless league record in the highly anticipated Merseyside derby. Barry Glendenning provides a minute-by-minute report on the unfolding match. Fans eagerly await to see if Liverpool can secure another victory.",
    "published": "2025-09-20T13:02:54Z"
  },
  {
    "title": "Formula One: Azerbaijan Grand Prix qualifying updates – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/20/formula-one-azerbaijan-grand-prix-qualifying-updates-live",
    "image": "https://media.guim.co.uk/1c72bdd032977d683d88119716169e59d58b9fec/26_110_7063_5650/500.jpg",
    "summary": "Lando Norris dominated the final practice session ahead of the Baku Grand Prix, raising questions about who will secure pole position. Fans can follow Niall McVeigh for live updates on the qualifying session. The excitement builds as teams prepare for a competitive race weekend.",
    "published": "2025-09-20T13:02:42Z"
  },
  {
    "title": "World Athletics Championships 2025: heptathlon gold for USA’s Hall; GB flop in men’s 4x100m; men’s 800m final – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/20/world-athletics-championships-2025-heptathlon-mens-800m-final-and-more-live",
    "image": "https://media.guim.co.uk/2029b031c6e1ee88080c0bbe8fc7934540ebf82c/169_0_1616_1293/500.jpg",
    "summary": "Night eight in Tokyo features exciting events in the decathlon and heptathlon, along with thrilling relay competitions. Our writers will provide updates on all the action. Stay tuned for the latest results and highlights from the performances!",
    "published": "2025-09-20T13:01:36Z"
  },
  {
    "title": "Even Tucker Carlson is worried about Trump’s free speech crackdown | Arwa Mahdawi",
    "url": "https://www.theguardian.com/commentisfree/2025/sep/20/tucker-carlson-trump-free-speech-crackdown",
    "image": "https://media.guim.co.uk/3c35540cebe5b341e68c57e3bd4fdd4580dfbadf/393_0_3928_3142/500.jpg",
    "summary": "The former Fox News host criticizes the administration's handling of the Charlie Kirk shooting incident. He expresses discontent with the government's response and believes it falls short. The commentary reflects growing concern over the political implications surrounding the event.",
    "published": "2025-09-20T13:00:14Z"
  },
  {
    "title": "Poland scrambles aircraft as Russia attacks Ukraine with hundreds of drones and missiles – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/sep/20/poland-russia-estonia-ukraine-war-europe-latest-news-updates",
    "image": "https://media.guim.co.uk/9de5578fe9d20bd6356e8ddd441f42a976ebaa2a/87_0_1091_873/500.jpg",
    "summary": "Poland has deployed aircraft to safeguard its airspace amid escalating tensions. This action follows Ukraine's report of a Russian assault that involved over 600 drones and missiles. The situation highlights increasing threats in the region as both nations respond to aerial attacks.",
    "published": "2025-09-20T12:59:44Z"
  }
]