[
  {
    "title": "Conservative MP Danny Kruger says party is ‘over’ as he defects to Reform – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/15/keir-starmer-peter-mandelson-labour-reform-tories-uk-politics-live-news-updates",
    "image": "https://media.guim.co.uk/bc7af4c24ea7442af8687304ddc9b3655ed665cc/253_0_2503_2003/500.jpg",
    "summary": "A tech billionaire incited crowds on Saturday, urging them to \"fight back or die.\" His controversial remarks sparked widespread criticism and concern over potential violence. The implications of his statements have raised questions about accountability and the role of influential figures in public discourse.",
    "published": "2025-09-15T13:29:21Z"
  },
  {
    "title": "World Athletics Championships 2025: Duplantis claims pole vault gold, Kambundji wins 100m hurdles – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/15/world-athletics-championships-2025-armand-duplantis-goes-for-pole-vault-gold-hurdles-finals-and-more-live",
    "image": "https://media.guim.co.uk/0ede86e1d653538322e9fe38d0271c01b3c640c2/490_0_3239_2591/500.jpg",
    "summary": "On the third day of events in Tokyo, Yara El-Shaboury reports on significant updates and developments. The coverage highlights key performances and emerging stories from the ongoing action. Stay tuned for more insights and highlights as the events unfold.",
    "published": "2025-09-15T13:29:18Z"
  },
  {
    "title": "US’s Rubio says efforts to recognise Palestinian state make it harder to end war – Middle East crisis live",
    "url": "https://www.theguardian.com/world/live/2025/sep/15/israel-gaza-hamas-qatar-marco-rubio-netanyahu-middle-east-crisis-live-news-updates",
    "image": "https://media.guim.co.uk/fddb7ab0a9b69e8ce9e3c0f19cb06b88eac70042/159_0_1238_990/500.jpg",
    "summary": "During a visit to Jerusalem, the Secretary of State conducted a press conference alongside Israeli Prime Minister Benjamin Netanyahu. The discussions emphasized shared interests and cooperation between the U.S. and Israel. Key topics likely included security and diplomatic relations in the region.",
    "published": "2025-09-15T13:28:45Z"
  },
  {
    "title": "Surrey v Nottinghamshire, Sussex v Yorkshire, and more: county cricket, day one – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/15/surrey-v-nottinghamshire-sussex-v-yorkshire-and-more-county-cricket-day-one-live",
    "image": "https://media.guim.co.uk/027cb4b2165737228df1f412442457907b2fa7e3/0_0_4518_3616/500.jpg",
    "summary": "Tanya Aldred will be providing updates from the Oval during the latest round of County Championship matches. Stay tuned for insights and highlights from the games. Follow along for the latest developments in the cricketing action.",
    "published": "2025-09-15T13:28:43Z"
  },
  {
    "title": "Chinese economy slows amid Trump trade war and weaker consumer spending",
    "url": "https://www.theguardian.com/business/2025/sep/15/chinese-economy-weakens-as-consumer-spending-and-factory-output-slows",
    "image": "https://media.guim.co.uk/316ecf4c7da2d379aa27bbaf0b8b048f0adf3185/130_0_3900_3120/500.jpg",
    "summary": "Slower growth in factory output and retail sales has raised concerns about the economy's performance. This has led to increasing calls for new economic stimulus measures to support recovery. Policymakers are being urged to take action to address these challenges.",
    "published": "2025-09-15T13:24:59Z"
  }
]