[
  {
    "title": "Australia news live: pro-Palestine Opera House protest could go to supreme court; AEC takes legal action against man allegedly behind unauthorised Wentworth pamphlets",
    "url": "https://www.theguardian.com/australia-news/live/2025/oct/03/png-agreement-aukus-submarines-pact-anthony-albanese-richard-marles-retired-admiral-slams-aukus-deal-gaza-flotilla-intercepted-ntwnfb",
    "image": "https://media.guim.co.uk/5d6d20e881eed1e6de67dca503c9df21d1201ab0/418_77_2418_1935/500.jpg",
    "summary": "I'm sorry, but I can't summarize without specific news content provided. Please share the details or key points you'd like summarized!",
    "published": "2025-10-03T04:14:08Z"
  },
  {
    "title": "No traces of banned chemical thiometon found in blueberries, NSW authorities say, contradicting previous claim",
    "url": "https://www.theguardian.com/australia-news/2025/oct/03/further-blueberries-testing-shows-no-traces-of-banned-chemical-thiometon-nsw-authorities-say",
    "image": "https://media.guim.co.uk/d62f3657d87f19c459283ab5d88752f7fd8a1768/989_158_2006_1605/500.jpg",
    "summary": "The State EPA and food safety authority reported no evidence of insecticide in their findings. They deemed the researcher's results from 2024 as \"unreliable.\" This conclusion raises questions about the validity of the initial claims surrounding the issue.",
    "published": "2025-10-03T04:00:48Z"
  },
  {
    "title": "The Irish language is a joy not a burden: in what other tongue is a penis a wild carrot? | Una Mullally",
    "url": "https://www.theguardian.com/commentisfree/2025/oct/03/the-irish-language-is-a-joy-not-a-burden-in-what-other-tongue-is-a-penis-a-wild-carrot",
    "image": "https://media.guim.co.uk/991b4b67df536c9cadcfd7a7f5ded2da10deaa43/207_0_2427_1941/500.jpg",
    "summary": "Record numbers of students in Ireland are opting out of compulsory Irish language classes, which journalist Una Mullally critiques as a misguided choice. She emphasizes that the Irish language offers access to rich cultural and imaginative experiences. Mullally advocates for the importance of maintaining Irish as a vital part of education.",
    "published": "2025-10-03T04:00:26Z"
  },
  {
    "title": "Taylor Swift: The Life of a Showgirl review – dull razzle-dazzle from a star who seems frazzled",
    "url": "https://www.theguardian.com/music/2025/oct/03/taylor-swift-the-life-of-a-showgirl-review",
    "image": "https://media.guim.co.uk/af9b6966e3218c836374decaeb672910651a03b7/1473_748_2643_2114/500.jpg",
    "summary": "The latest release deviates from the anticipated pop hits, presenting a soft-rock tribute to domestic life that lacks memorable melodies and is underpinned by underlying grievances. Additionally, the mention of her fiancé's 'magic wand' is viewed unfavorably. Overall, the album may disappoint fans seeking a more upbeat, catchy sound.",
    "published": "2025-10-03T04:00:26Z"
  },
  {
    "title": "Bossing it! The makers of Springsteen: Deliver Me from Nowhere on turning Jeremy Allen White into the rock icon",
    "url": "https://www.theguardian.com/film/2025/oct/03/bossing-it-the-makers-of-springsteen-deliver-me-from-nowhere-on-turning-jeremy-allen-white-into-the-rock-icon",
    "image": "https://media.guim.co.uk/4e75e36d8aea5f61c6a994654779661b1e1031e8/2029_273_6611_5289/500.jpg",
    "summary": "Bruce Springsteen's 1982 lo-fi album \"Nebraska,\" created during his struggle with depression just before his rise to stardom, is now being adapted for the screen. The film depicts this crucial time in his life, capturing the essence of the album. Springsteen has given his approval for the project.",
    "published": "2025-10-03T04:00:25Z"
  }
]