[
  {
    "title": "Gaza ceasefire plan live: Israel says it is preparing to pull back troops; living hostages could be released within days",
    "url": "https://www.theguardian.com/world/live/2025/oct/09/gaza-ceasefire-live-trump-says-hostages-probably-released-monday-idf-says-gaza-city-still-extremely-dangerous",
    "image": "https://media.guim.co.uk/6238a15ffab0f5711e9c9f617b1025b9c4e042b8/29_0_5307_4245/500.jpg",
    "summary": "President Donald Trump announced that Israel and Hamas have reached an agreement on the \"first phase\" of a plan to halt fighting while facilitating the release of certain hostages and prisoners. This development marks a step toward easing tensions in the region. Further details on the implementation of this plan are yet to be revealed.",
    "published": "2025-10-09T13:29:46Z"
  },
  {
    "title": "‘You’re like: who am I?’ Katie Chapman on the challenges and danger of football retirement",
    "url": "https://www.theguardian.com/football/2025/oct/09/katie-chapman-on-challenges-danger-of-football-retirement-moving-the-goalposts",
    "image": "https://media.guim.co.uk/59e9458ca4d1f1f62f72d0b6b88ef640a79bc43e/1325_365_6373_5099/500.jpg",
    "summary": "A former England international is participating in a legends match to raise funds for former Chelsea players in need. The event aims to provide support to players facing difficulties after their careers. Proceeds from the match will directly benefit those in the Chelsea alumni community.",
    "published": "2025-10-09T13:21:46Z"
  },
  {
    "title": "Keir Starmer says ‘Bollywood blockbusters’ will be made in the UK under new trade deal with India – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/oct/09/foreign-secretary-yvette-cooper-keir-starmer-gaza-ceasefire-uk-politics-live",
    "image": "https://media.guim.co.uk/a41de80fdf0029186fbd408645b8753da1032793/302_0_2913_2333/500.jpg",
    "summary": "The British Prime Minister announced that three Bollywood films will be produced in the UK. Additionally, two British universities are set to establish campuses in India. This initiative aims to strengthen cultural and educational ties between the two countries.",
    "published": "2025-10-09T13:17:57Z"
  },
  {
    "title": "Entry-level workers face AI ‘job-pocalypse’; US probes Tesla’s self-driving system – business live",
    "url": "https://www.theguardian.com/business/live/2025/oct/09/water-customers-bill-hike-winter-blackouts-risk-falls-stock-markets-pound-ftse-business-live-news",
    "image": "https://media.guim.co.uk/71e8f4e87476fe967048ac31ed7765cdc6f9a9cf/458_0_4583_3667/500.jpg",
    "summary": "A recent survey reveals that business leaders are increasingly focusing on automation powered by AI to address skills shortages. This shift indicates a preference for technology solutions over investing in training for junior employees. As a result, companies are adapting their strategies to leverage AI for efficiency and productivity.",
    "published": "2025-10-09T13:17:42Z"
  },
  {
    "title": "Zelenskyy says he will nominate Trump for Nobel peace prize if he secures Ukraine ceasefire – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/oct/09/russia-attacks-ukraine-energy-france-germany-europe-live-news-updates",
    "image": "https://media.guim.co.uk/48b7710afa6452197dd48cf020c807d6d9609e04/670_294_1776_1420/500.jpg",
    "summary": "The U.S. president has asserted that he is deserving of an award due to his efforts in facilitating several peace deals. He highlights these achievements as significant contributions to global stability. This statement reflects his commitment to diplomacy and international relations.",
    "published": "2025-10-09T13:12:54Z"
  }
]