[
  {
    "title": "House speaker Mike Johnson accuses Democrats of ‘political theater’ as shutdown enters day nine – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/09/national-guard-ice-federal-property-chicago-illinois-us-politics-live",
    "image": "https://media.guim.co.uk/17cbe0d9eb9df6950da23d0e1ce551e50cbd2065/672_696_5129_4104/500.jpg",
    "summary": "Donald Trump has called for the imprisonment of Chicago's Mayor Brandon Johnson and Illinois Governor JB Pritzker. This statement comes amid ongoing political tensions. The implications of Trump's remarks highlight divisions within the state's leadership.",
    "published": "2025-10-09T16:22:47Z"
  },
  {
    "title": "Gaza ceasefire plan live: Trump claims Israeli hostages should be released on Monday or Tuesday",
    "url": "https://www.theguardian.com/world/live/2025/oct/09/gaza-ceasefire-live-trump-says-hostages-probably-released-monday-idf-says-gaza-city-still-extremely-dangerous",
    "image": "https://media.guim.co.uk/ac1babc39647947640e9097dc52d3072092c055f/108_0_3780_3024/500.jpg",
    "summary": "Trump announced the supposed \"end of the war in Gaza,\" expressing optimism about the region's future. He stated that Gaza will be \"redone,\" suggesting plans for rebuilding and revitalization. The remarks reflect his views on Middle Eastern policy and reconstruction efforts.",
    "published": "2025-10-09T16:18:14Z"
  },
  {
    "title": "Sally Seymour obituary",
    "url": "https://www.theguardian.com/environment/2025/oct/09/sally-seymour-obituary",
    "image": "https://media.guim.co.uk/e21ae8cf2d2a90dc75e4e7339fe43ead1804b115/59_0_1243_995/500.jpg",
    "summary": "A smallholder, potter, and illustrator has inspired thousands to embrace self-sufficiency through their creative efforts. Their work has encouraged individuals to pursue sustainable living practices. This legacy highlights the importance of community and innovation in fostering independence.",
    "published": "2025-10-09T16:17:21Z"
  },
  {
    "title": "The bills are water torture – and so is the regulatory process | Nils Pratley",
    "url": "https://www.theguardian.com/business/nils-pratley-on-finance/2025/oct/09/bills-water-torture-so-is-regulatory-process-england",
    "image": "https://media.guim.co.uk/9d164a43242947dc45fbe174ce51c83ca423be41/571_39_2548_2038/500.jpg",
    "summary": "Five suppliers have been granted the ability to increase their charges, allowing for some financial flexibility. Meanwhile, Ofwat, the water regulator, experiences a small moral victory amidst the developments. The overall situation has a surreal quality, reflecting complexities in the industry.",
    "published": "2025-10-09T16:10:04Z"
  },
  {
    "title": "Anti-abortion activists pardoned by Trump face trial for new clinic ‘invasion’",
    "url": "https://www.theguardian.com/us-news/2025/oct/09/anti-abortion-activists-pardoned-trump-trial",
    "image": "https://media.guim.co.uk/26e3379db62de9e19474c8315718e531447327a4/749_0_3751_3000/500.jpg",
    "summary": "In Pennsylvania, six activists, including two who received presidential pardons, have been charged with trespass and conspiracy. The charges stem from their actions during a protest. The case highlights ongoing legal issues for activists involved in high-profile demonstrations.",
    "published": "2025-10-09T16:10:03Z"
  }
]