[
  {
    "title": "Porepunkah shooting live: loud bangs heard near property where suspected gunman was living as specialised paramedics enter roadblocks",
    "url": "https://www.theguardian.com/australia-news/live/2025/aug/27/porepunkah-shooting-live-updates-victoria-police-manhunt-latest-news-ntwnfb",
    "image": "https://media.guim.co.uk/a38a1d553f20a98e6c1833327acb744078f5b267/585_0_3840_3072/500.jpg",
    "summary": "I'm sorry, but I don't have access to live news updates. However, if you provide me with a news article or specific details, I can help summarize that information for you!",
    "published": "2025-08-27T08:41:13Z"
  },
  {
    "title": "Tory chair says party would consider deal with Taliban to return Afghan migrants – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/aug/27/conservatives-consider-deal-afghanistan-migrants-uk-politics-latest-updates-news",
    "image": "https://media.guim.co.uk/3ad4c223194faed8b0d96489fb7df90509d30478/0_29_1741_1394/500.jpg",
    "summary": "Kevin Hollinrake indicates that the party may establish a returns agreement with a country as part of a more extensive deportation plan compared to that of Reform. He emphasizes the thoroughness of their proposed approach. The plan aims to enhance immigration control and streamline the deportation process.",
    "published": "2025-08-27T08:39:56Z"
  },
  {
    "title": "What scoreline has occurred most in a football gameweek? | The Knowledge",
    "url": "https://www.theguardian.com/football/2025/aug/27/what-scoreline-has-occurred-most-in-a-football-gameweek-the-knowledge",
    "image": "https://media.guim.co.uk/33d762107f5efbf1d13181b23d71ae5b73f80c3a/134_0_1771_1417/500.jpg",
    "summary": "The news highlights ongoing challenges with lengthy title droughts in capital cities, emphasizing impacts on various sectors. It also mentions a gathering of exceptionally young individuals exchanging innovative ideas. Additionally, it features an individual recognized for their exceptional passing skills in a particular context, likely related to sports or academics.",
    "published": "2025-08-27T08:35:06Z"
  },
  {
    "title": "Donald Trump to chair meeting on Gaza as US says it expects ‘to settle this before the end of this year’ – Middle East crisis live",
    "url": "https://www.theguardian.com/world/live/2025/aug/27/donald-trump-meeting-white-house-gaza-israel-middle-east-crisis-latest-updates-news",
    "image": "https://media.guim.co.uk/14257060759189e256012480593eb6627e45dde5/574_0_5600_4480/500.jpg",
    "summary": "US special envoy Steve Witkoff expresses optimism about reaching a resolution regarding an unspecified issue. Meanwhile, Senator Marco Rubio is set to meet with Israeli politician Gideon Saar. Both developments indicate ongoing diplomatic efforts.",
    "published": "2025-08-27T08:34:31Z"
  },
  {
    "title": "Victoria shooting update: alleged gunman fled with ‘powerful firearms’ and ‘understands bushcraft well’, police say",
    "url": "https://www.theguardian.com/australia-news/2025/aug/27/victoria-police-shooting-update-porepunkah-alleged-suspect-gunman-bush-high-country-ntwnfb",
    "image": "https://media.guim.co.uk/8fe665ea384a8f5733b83c492039c39192f0782f/0_0_5000_4000/500.jpg",
    "summary": "Police reported that suspect Dezi Freeman has extensive knowledge of the Victorian high country bushland, presenting challenges for the ongoing investigation. Tributes have poured in for two officers who lost their lives during the operation related to Freeman. The community mourns their sacrifice while law enforcement continues to seek justice.",
    "published": "2025-08-27T08:34:17Z"
  }
]