[
  {
    "title": "Buildup to Chelsea v Fulham, Bayern agree Jackson loan, and more – matchday live",
    "url": "https://www.theguardian.com/football/live/2025/aug/30/buildup-to-chelsea-v-fulham-in-the-premier-league-transfer-latest-and-more-matchday-live",
    "image": "https://media.guim.co.uk/36ff84da35fa7135de5e4fa0c389b73ce973f8b6/0_0_5000_4000/500.jpg",
    "summary": "Emillia Hawkins provides a live update on the latest happenings as the Premier League action heats up this afternoon. Fans can stay informed on key matches and developments. Tune in for real-time insights and news.",
    "published": "2025-08-30T09:23:47Z"
  },
  {
    "title": "Children among dozens injured after Russian attack on Zaporizhzhia – Ukraine war live",
    "url": "https://www.theguardian.com/world/live/2025/aug/30/russia-ukraine-war-live-news-updates-zaporizhzhia",
    "image": "https://media.guim.co.uk/30390121f92efe33dc9b1434dbdc35e1ac6bf668/427_111_1126_901/500.jpg",
    "summary": "Ukrainian President Volodymyr Zelenskyy reported that one person has died and dozens have been injured following an attack on a five-story residential building. The incident highlights the ongoing conflict and its impact on civilians. Zelenskyy condemned the attack as part of the broader violence affecting the country.",
    "published": "2025-08-30T09:05:53Z"
  },
  {
    "title": "A desperate, opportunist press and vicious politicians: no wonder the debate on refugees is so awful | Jane Martinson",
    "url": "https://www.theguardian.com/commentisfree/2025/aug/30/press-politicians-debate-refugees-migration-uk",
    "image": "https://media.guim.co.uk/24f3226e31f9f9eb6d4da2a7a5d8205f234c7865/833_0_4167_3333/500.jpg",
    "summary": "Guardian columnist Jane Martinson emphasizes the critical importance of migration as a pressing issue that deserves serious attention. She criticizes the UK media for its inadequate coverage of the topic, suggesting that history will hold them accountable for this failure. The call is for a more thoughtful and responsible discourse on migration.",
    "published": "2025-08-30T08:00:55Z"
  },
  {
    "title": "‘Literature can be a form of resistance’: Lea Ypi talks to Elif Shafak about writing in the age of demagogues",
    "url": "https://www.theguardian.com/books/2025/aug/30/literature-can-be-a-form-of-resistance-lea-ypi-talks-to-elif-shafak-about-writing-in-the-age-of-demagogues",
    "image": "https://media.guim.co.uk/bc9397126270ec7b03efcc091df6c3aa940884df/957_1831_5155_4123/500.jpg",
    "summary": "Albanian author and Turkish novelist engage in a discussion on the rise of populism and censorship. They explore how contemporary conflicts are rooted in unresolved historical traumas. Their conversation highlights the impact of these issues on society and literature today.",
    "published": "2025-08-30T08:00:55Z"
  },
  {
    "title": "Suspected Porepunkah gunman Dezi Freeman had deteriorating mental health and a black belt in karate, former friend says",
    "url": "https://www.theguardian.com/australia-news/2025/aug/30/porepunkah-shooting-dezi-freeman-victoria-police-deteriorating-mental-health-black-belt-karate-ntwnfb",
    "image": "https://media.guim.co.uk/7bfa1dc97e7fddde4b5195df4d88a0ffadd42a8e/166_0_3858_3086/500.jpg",
    "summary": "A longtime acquaintance of a 56-year-old man, Freeman, criticized the decision to deploy 10 Victoria police officers to execute a warrant against him, suggesting it would have been detrimental to Freeman. The statement highlights concerns regarding the potential escalation and negative impact of such a heavy-handed approach. The acquaintance believes a more measured response would have been appropriate.",
    "published": "2025-08-30T07:45:33Z"
  }
]