[
  {
    "title": "Trump celebrates Jimmy Kimmel suspension; some networks replace show with Charlie Kirk tribute – live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/17/donald-trump-charlie-kirk-free-speech-nyt-cdc-rfk-epstein-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/a0ec82d4c0a9a9af63cf1322209564376de0853a/839_0_3689_2953/500.jpg",
    "summary": "ABC has announced that a show will be off-air indefinitely due to complaints regarding the host's remarks about the killing of right-wing activist Kirk. The decision follows backlash over the comments made. Further details on the situation have not been provided.",
    "published": "2025-09-18T03:04:13Z"
  },
  {
    "title": "China’s ‘temple economy’ in the spotlight as scandals rock influential religious leaders ",
    "url": "https://www.theguardian.com/world/2025/sep/18/chinas-temple-economy-in-the-spotlight-as-scandals-rock-influential-religious-leaders",
    "image": "https://media.guim.co.uk/15ce42c4f7d83ec932fbd0763cc70cb3c7dabd17/345_0_4310_3448/500.jpg",
    "summary": "The government is intensifying its crackdown on wealthy Buddhist monks, who have previously evaded consequences for their actions. This move targets allegations of corruption and excessive wealth within the monastic community. The campaign is part of a broader effort to address issues of corruption across various sectors.",
    "published": "2025-09-18T02:20:10Z"
  },
  {
    "title": "Eddie Hearn threatens to sue Chris Eubank Jr over ‘sabotage’ claim before Conor Benn rematch",
    "url": "https://www.theguardian.com/sport/2025/sep/18/chris-eubank-jr-accuses-conor-benns-team-of-sabotage-before-grudge-rematch",
    "image": "https://media.guim.co.uk/946078368e147bf71f0bf3623b8651402547e28c/179_0_4427_3541/500.jpg",
    "summary": "Chris Eubank Jr accused Matchroom of wrongdoing during the initial pre-fight press conference. In response, promoter Eddie Hearn warned of potential legal action against Eubank Jr. The allegations have intensified tension ahead of their upcoming bout.",
    "published": "2025-09-18T01:55:08Z"
  },
  {
    "title": "Laneway festival 2026: Chappell Roan leads lineup featuring Wet Leg, Wolf Alice and PinkPantheress",
    "url": "https://www.theguardian.com/culture/2025/sep/18/laneway-festival-2026-chappell-roan-leads-lineup-featuring-wet-leg-wolf-alice-and-pinkpantheress",
    "image": "https://media.guim.co.uk/29186016a9c57f4f57fcce77a9071ab84a9f0f56/189_0_2083_1667/500.jpg",
    "summary": "The US pop star is set to embark on their first full Australian tour, highlighting the festival's impressive lineup. This follows the 2024 festival, which featured Charli XCX as a headliner. The event continues to attract prominent artists and generate excitement among fans.",
    "published": "2025-09-18T01:39:24Z"
  },
  {
    "title": "‘Censoring you in real time’: suspension of Jimmy Kimmel show sparks shock and fears for free speech",
    "url": "https://www.theguardian.com/tv-and-radio/2025/sep/18/jimmy-kimmel-suspension-sparks-shock-fears-for-free-speech-censoring-realtime",
    "image": "https://media.guim.co.uk/f2f3e94e2bb2be79cf1ec1882b9095a3faf07955/250_0_2500_2000/500.jpg",
    "summary": "Following comments made by Jimmy Kimmel regarding Charlie Kirk's killing, ABC's decision on the matter emerged shortly after the Trump-appointed chair of the US media regulator threatened the broadcaster's license. This incident highlights ongoing tensions between media figures and regulatory bodies. The situation underscores the contentious relationship between politics and media in the current landscape.",
    "published": "2025-09-18T01:30:06Z"
  }
]