[
  {
    "title": "Chelsea v Arsenal: Premier League – live",
    "url": "https://www.theguardian.com/football/live/2025/nov/30/chelsea-v-arsenal-premier-league-live",
    "image": "https://media.guim.co.uk/dccfa058256dc75ad2a3c5475a8bc4dffac9ac8a/1290_668_3652_2922/500.jpg",
    "summary": "Enzo Maresca's team aims to close the gap on Arsenal, who currently lead the table. The match is closely watched as it unfolds, with updates provided by Rob Smyth. Key moments and developments are highlighted in a minute-by-minute report.",
    "published": "2025-11-30T17:17:12Z"
  },
  {
    "title": "Formula One: Qatar Grand Prix 2025 – live updates",
    "url": "https://www.theguardian.com/sport/live/2025/nov/30/formula-one-qatar-grand-prix-2025-live-updates-norris-piastri-verstappen-f1",
    "image": "https://media.guim.co.uk/99a9e460b96eca1eb0fcfdd70c98da569a7d035d/660_0_6597_5278/500.jpg",
    "summary": "In a rolling report, Luke McLaughlin analyzes which teams are in contention for crucial points that could bolster their chances for the title. He examines the performance and strategies of teams as the competition intensifies. Stay tuned for updates on key matchups and developments.",
    "published": "2025-11-30T17:16:10Z"
  },
  {
    "title": "Love Actually star says romcoms have lost their magic",
    "url": "https://www.theguardian.com/film/2025/nov/30/love-actually-star-says-romcoms-have-lost-their-magic",
    "image": "https://media.guim.co.uk/e0501ce2493d23119095168f7b7a6c8ec7637e1d/489_0_2247_1799/500.jpg",
    "summary": "Thomas Brodie-Sangster, known for his role as Sam in Richard Curtis's film \"Love Actually,\" believes that streaming platforms have contributed to the decline of romantic comedies. He argues that the genre has struggled to find its footing in a market dominated by streaming content. Brodie-Sangster's remarks highlight the changing landscape of film consumption and its impact on genre popularity.",
    "published": "2025-11-30T17:14:59Z"
  },
  {
    "title": "Arundell crowns Bath comeback victory at Saracens to advance England claims",
    "url": "https://www.theguardian.com/sport/2025/nov/30/saracens-bath-prem-rugby-match-report",
    "image": "https://media.guim.co.uk/3c250f650c0cc9611bcd3d05d24fcbcb5a14326a/405_0_4050_3240/500.jpg",
    "summary": "Henry Arundell showcased his potential for the England team by scoring two tries for Bath. His performance contributed to Bath's exciting 36-29 victory over Saracens. The win highlights Bath’s strength in the Premiership.",
    "published": "2025-11-30T17:13:24Z"
  },
  {
    "title": "Your Party is voted to be called … Your Party, Jeremy Corbyn announces – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/nov/30/rachel-reeves-defend-budget-deficit-claims-keir-starmer-your-party-uk-politics-live",
    "image": "https://media.guim.co.uk/40861801607f941dfcc71ddd200e9dfd3627a90a/322_0_4120_3296/500.jpg",
    "summary": "The former Labour leader revealed the official name of the party at a conference in Liverpool. This announcement follows a vote by the party's members. The event marks a significant moment in the party's rebranding efforts.",
    "published": "2025-11-30T17:11:11Z"
  }
]