[
  {
    "title": "Prix de l’Arc de Triomphe 2025: horse racing – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/05/prix-de-larc-de-triomphe-2025-longchamp-horse-racing-live",
    "image": "https://media.guim.co.uk/dbf21c7d6b4bd1a714a5f4682dcecb8df54bdb11/777_124_2768_2215/500.jpg",
    "summary": "Tony Paley provides updates from Longchamp, where flat racing enthusiasts gather for one of the major events in the racing calendar. The day promises excitement and high-stakes competition. Stay tuned for live updates and insights on the races.",
    "published": "2025-10-05T12:34:28Z"
  },
  {
    "title": "Singapore Grand Prix 2025: F1 – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/05/singapore-grand-prix-2025-f1-live",
    "image": "https://media.guim.co.uk/a7f027ec8cfa7712146dd47bd34bc04e58f3c4d2/403_0_3342_2673/500.jpg",
    "summary": "Dominic Booth will provide a lap-by-lap report on the race at Marina Bay, focusing on whether pole-sitter George Russell can maintain his lead. The competition includes several key title challengers. Fans can follow the updates to see how the race unfolds.",
    "published": "2025-10-05T12:32:42Z"
  },
  {
    "title": "WSL clockwatch: Spurs v Brighton, London City Lionesses v Liverpool and more – live",
    "url": "https://www.theguardian.com/football/live/2025/oct/05/postecoglou-nottingham-forest-wsl-ipswich-norwich-matchday-live",
    "image": "https://media.guim.co.uk/e977d0c6b3d546023aac76b9c2581055fc33f11d/332_0_3500_2800/500.jpg",
    "summary": "Join our team of writers as they provide updates and engage in discussions about the latest happenings in football on an eventful day of matches. Stay tuned for insightful commentary and analysis. Don’t miss out on the excitement!",
    "published": "2025-10-05T12:32:26Z"
  },
  {
    "title": "Youth-led US climate activists widen focus to fight authoritarianism",
    "url": "https://www.theguardian.com/us-news/2025/oct/05/sunrise-movement-climate-activism-authoritarianism",
    "image": "https://media.guim.co.uk/929655c384ae88c495de56bd271f6ca03192426f/422_0_4217_3374/500.jpg",
    "summary": "The Sunrise Movement, known for advocating a Green New Deal, plans to mobilize against former President Trump's criticism of universities. The organization aims to defend educational institutions from what they view as harmful rhetoric and policies. Their efforts will focus on promoting climate justice and sustainable solutions in the face of political opposition.",
    "published": "2025-10-05T12:30:34Z"
  },
  {
    "title": "Newcastle v Nottingham Forest, Everton v Crystal Palace and more: Premier League clockwatch – live",
    "url": "https://www.theguardian.com/football/live/2025/oct/05/newcastle-nottingham-forest-everton-crystal-palace-premier-league-clockwatch-live",
    "image": "https://media.guim.co.uk/0799fce60f527bb9bec99cebdafdccde8a5db216/321_0_4510_3606/500.jpg",
    "summary": "Rob Smyth will provide live updates and goal announcements from four Premier League matches. Fans can follow the latest developments and scores as the games unfold. Stay tuned for comprehensive coverage of the action on the pitch.",
    "published": "2025-10-05T12:28:13Z"
  }
]