[
  {
    "title": "TV tonight: a delightful French travelogue with Sandi Toksvig",
    "url": "https://www.theguardian.com/tv-and-radio/2025/nov/29/tv-tonight-a-delightful-french-travelogue-with-sandi-toksvig",
    "image": "https://media.guim.co.uk/d3bc40dd5fd38b7bc57ca7974a60b8dec96d16af/351_0_3538_2832/500.jpg",
    "summary": "This evening's highlights include a journey along the French Riviera exploring the legacy of artists, writers, and freethinkers with Sandi. Additionally, \"Strictly\" attempts to overcome its recent challenges with a new time-pressured challenge for participants. Don't miss these engaging shows!",
    "published": "2025-11-29T07:03:51Z"
  },
  {
    "title": "My cultural awakening: Thelma & Louise made me realise I was stuck in an unhappy marriage",
    "url": "https://www.theguardian.com/culture/2025/nov/29/my-cultural-awakening-thelma-louise",
    "image": "https://media.guim.co.uk/a10dc5281b6019740ee8561aa83c97c557b1aa05/125_16_5237_4191/500.jpg",
    "summary": "Inspired by a line from Ridley Scott's classic film, a woman found the courage to leave her controlling husband after years of enduring his behavior. This revelation marked a pivotal moment in her life, leading to her decision to prioritize her well-being. The transformative power of cinema helped her reclaim her independence.",
    "published": "2025-11-29T07:00:33Z"
  },
  {
    "title": "How big is an elephant’s brain and why are cacti spiky? The kids’ quiz",
    "url": "https://www.theguardian.com/lifeandstyle/2025/nov/29/how-big-elephants-brain-why-cactus-spiky-kids-quiz",
    "image": "https://media.guim.co.uk/ed58a075758569541a094f859bb068d855e50dbe/0_0_1714_1371/500.jpg",
    "summary": "A quiz featuring five multiple-choice questions created by children is available to challenge your knowledge. Participants can also submit their own junior brainteasers for upcoming quizzes. This initiative encourages creativity and engagement in learning through fun challenges.",
    "published": "2025-11-29T07:00:33Z"
  },
  {
    "title": "What could be putting young women off marriage? It really isn’t that much of a mystery | Naoise Dolan",
    "url": "https://www.theguardian.com/commentisfree/2025/nov/29/marriage-women-men-survey-data-girls",
    "image": "https://media.guim.co.uk/53c0b81c4e35b451595c941faf9defba2066b7f8/312_0_4560_3648/500.jpg",
    "summary": "Recent survey data reveals a growing trend among girls who struggle to envision marriage, contrasting with their male counterparts who exhibit a greater interest in the institution. Writer Naoise Dolan suggests this disparity may provide insights into evolving gender perspectives on relationships. The findings reflect broader societal shifts in attitudes toward marriage and commitment.",
    "published": "2025-11-29T07:00:32Z"
  },
  {
    "title": "What links Marc Almond and chemist John Farrow? The Saturday quiz",
    "url": "https://www.theguardian.com/lifeandstyle/2025/nov/29/what-links-marc-almond-chemist-john-farrow-saturday-quiz",
    "image": "https://media.guim.co.uk/b879f6c77b7b047ecdd6f82d715753897bfd7e29/902_0_4020_3215/500.jpg",
    "summary": "Test your knowledge with the Saturday quiz featuring questions about celestial bodies like Charon, Styx, and Nix. Additionally, the quiz includes references to notable figures such as Dr. Fink and Bobby Z. Challenge yourself and see how much you know!",
    "published": "2025-11-29T07:00:32Z"
  }
]