[
  {
    "title": "Bledisloe Cup: Australia v New Zealand – Rugby Championship live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/04/bledisloe-cup-australia-v-new-zealand-rugby-championship-live",
    "image": "https://media.guim.co.uk/704d98cd22882604eb38b25fddf6ab3ba5164b8d/649_395_4409_3527/500.jpg",
    "summary": "The Wallabies aim to defeat the All Blacks in Perth to move closer to claiming the Rugby Championship. A minute-by-minute report will cover the unfolding action of the match. Join Jonathan Howcroft for live updates and analysis.",
    "published": "2025-10-04T09:16:00Z"
  },
  {
    "title": "Women’s Cricket World Cup – Australia v Sri Lanka – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/04/womens-cricket-world-cup-australia-v-sri-lanka-colombo-live-updates",
    "image": "https://media.guim.co.uk/82d9f66c0f684e4e8cab07c45a1125bb1270f075/350_0_3500_2800/500.jpg",
    "summary": "Australia begins their campaign with a strong performance against New Zealand and is set to face Sri Lanka next. The match will take place on Australian soil, adding to the excitement. Megan Maurice will provide updates throughout the game.",
    "published": "2025-10-04T09:15:25Z"
  },
  {
    "title": "New Zealand v Australia: men’s third T20 international cricket – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/04/new-zealand-v-australia-mens-third-t20-international-cricket-live",
    "image": "https://media.guim.co.uk/fd04a07844446cf68f4b7c0cd1de11eb652e2962/460_0_4167_3334/500.jpg",
    "summary": "James Wallace provides continuous updates in an over-by-over report, keeping readers informed on the latest developments. The coverage offers real-time insights and analysis. Stay tuned for live commentary throughout the match.",
    "published": "2025-10-04T09:14:59Z"
  },
  {
    "title": "Amorim faces crunch clash, Premier League buildup and more – matchday live",
    "url": "https://www.theguardian.com/football/live/2025/oct/04/amorim-faces-crunch-clash-premier-league-buildup-and-more-matchday-live",
    "image": "https://media.guim.co.uk/cda7d0a172bc3b05a3ebda10268822d4be006bd2/0_0_5000_4000/500.jpg",
    "summary": "Get ready for an exciting day of football with our news updates, previews, and discussions. Stay tuned for insights and analysis on the upcoming matches. Don't miss out on the action!",
    "published": "2025-10-04T09:12:13Z"
  },
  {
    "title": "‘No reason not to be all in’: is Saturday Night Live ready to meet a major political moment? ",
    "url": "https://www.theguardian.com/tv-and-radio/2025/oct/04/saturday-night-live-return-trump",
    "image": "https://media.guim.co.uk/435b24a698961b5eea117e331779a5ab4592c264/114_0_834_667/500.jpg",
    "summary": "The long-running series is returning during a challenging period for late-night comedy and discussions on free speech. Its comeback raises questions about the evolving landscape of humor and expression. This timing could influence how the show addresses contemporary issues and audiences' expectations.",
    "published": "2025-10-04T09:02:01Z"
  }
]