[
  {
    "title": "Wales v Belgium: World Cup 2026 qualifying – live",
    "url": "https://www.theguardian.com/football/live/2025/oct/13/wales-v-belgium-world-cup-2026-qualifying-live",
    "image": "https://media.guim.co.uk/1ba63701a85b232f9bbec675d1a1ae25617fde0c/576_0_2807_2246/500.jpg",
    "summary": "Craig Bellamy’s team is looking to secure a crucial win against Belgium to advance towards next summer’s finals. The match is seen as a significant opportunity for the team. Michael Butler will provide coverage of the event.",
    "published": "2025-10-13T20:20:13Z"
  },
  {
    "title": "Australia news live: Chalmers reveals Keating influence on super tax backdown; cost of cybercrime soars",
    "url": "https://www.theguardian.com/australia-news/live/2025/oct/14/australia-news-live-jim-chalmers-superannuation-concession-tax-cybercrime-anthony-albanese-sussan-ley-coalition-penny-wong-israel-gaza-ntwnfb",
    "image": "https://media.guim.co.uk/a38f8e191ed26265328e735f2c58872a9fdbd5f1/1230_473_5776_4624/500.jpg",
    "summary": "I'm sorry, but I cannot access live news or external content directly. However, if you provide me with the text or main points from the news article you want summarized, I'd be happy to help!",
    "published": "2025-10-13T20:16:33Z"
  },
  {
    "title": "Thomas Tuchel tells Marcus Rashford to push himself to the limit",
    "url": "https://www.theguardian.com/football/2025/oct/13/thomas-tuchel-marcus-rashford-bellingham-england",
    "image": "https://media.guim.co.uk/5b585c16bfb5b87d336e3edce0706edfb83e5f7e/431_0_4175_3340/500.jpg",
    "summary": "Thomas Tuchel praised Marcus Rashford, stating he has the potential to become one of the best players in the world. However, Tuchel emphasized that consistency is key for Rashford to reach that level. The comments highlight Rashford's talent and the need for continual improvement in his performance.",
    "published": "2025-10-13T20:00:00Z"
  },
  {
    "title": "Corrections and clarifications",
    "url": "https://www.theguardian.com/news/2025/oct/13/corrections-and-clarifications",
    "summary": "Lufthansa flight 181 was hijacked in 1977, leading to a significant political crisis in Germany and the eventual enactment of anti-protest powers to enhance security measures. The incident prompted discussions on civil liberties versus national safety, highlighting the tensions between the right to protest and governmental responses to threats. Over time, the case has become a pivotal moment in Germany's approach to handling similar situations.",
    "published": "2025-10-13T20:00:00Z"
  },
  {
    "title": "Trump joins world leaders to sign peace deal, CSIRO plans more cuts, Abbott’s history lesson reviewed",
    "url": "https://www.theguardian.com/australia-news/2025/oct/14/morning-mail-tuesday-ntwnfb",
    "image": "https://media.guim.co.uk/cacd3713f927dd343a8fb4422ace44d3883abe83/0_0_4455_3564/500.jpg",
    "summary": "Donald Trump received a warm ovation from the Knesset ahead of a summit in Egypt. Meanwhile, a science agency is being urged to identify additional savings due to declining funding. The contrasting events highlight political celebrations alongside financial challenges in the science sector.",
    "published": "2025-10-13T19:59:07Z"
  }
]