[
  {
    "title": "Skyhooks guitarist Bob ‘Bongo’ Starkie dies aged 73",
    "url": "https://www.theguardian.com/music/2025/nov/29/skyhooks-guitarist-bob-bongo-starkie-dies-aged-73",
    "image": "https://media.guim.co.uk/5d0a19b12747f23185ab298861060c3286b05774/0_0_2506_2006/500.jpg",
    "summary": "Starkie has passed away from leukaemia while surrounded by loved ones. His daughter revealed that he spent his final moments listening to Chuck Berry. The family shared their grief over his loss.",
    "published": "2025-11-29T03:51:33Z"
  },
  {
    "title": "‘Call us rubbish’: Ben Stokes hits back at claims that England approach is ‘arrogant’",
    "url": "https://www.theguardian.com/sport/2025/nov/29/ashes-cricket-ben-stokes-england-arrogant-brisbane",
    "image": "https://media.guim.co.uk/6e97eb9bbfd06acdbb9d06c4d77f95e9cc1a5a81/253_70_2863_2292/500.jpg",
    "summary": "The captain dismisses terminology used by ex-Ashes adversary Mitchell Johnson while the touring team starts their training with a pink Kookaburra ball in Brisbane. Tensions from past encounters seem to surface as the team prepares. The focus is on enhancing skills for upcoming matches.",
    "published": "2025-11-29T03:46:10Z"
  },
  {
    "title": "Ukraine war briefing: one killed and seven wounded as Russia launches another overnight attack on Kyiv",
    "url": "https://www.theguardian.com/world/2025/nov/29/ukraine-war-briefing-russia-launches-deadly-overnight-attack-on-kyiv",
    "image": "https://media.guim.co.uk/08419292acfea8b9b487b3587fc3ad48bb70bbd2/404_0_4583_3667/500.jpg",
    "summary": "Explosions were reported in the capital around midnight, damaging residential buildings. The situation unfolds as a key ally of President Zelenskyy resigns due to an anti-corruption investigation. This marks day 1,375 of the ongoing conflict.",
    "published": "2025-11-29T03:21:12Z"
  },
  {
    "title": "What is an autopen and why can’t Trump stop talking about it?",
    "url": "https://www.theguardian.com/us-news/2025/nov/29/what-is-an-autopen-and-why-cant-trump-stop-talking-about-it",
    "image": "https://media.guim.co.uk/e76f429e377cc11182cd629ed59c306c52ba565d/447_0_6864_5496/500.jpg",
    "summary": "The first autopen was patented in the 1800s and has since been utilized by numerous American presidents. This device allows for the automatic signing of documents, saving time and effort. Its use reflects the need for efficient presidential administration throughout history.",
    "published": "2025-11-29T01:35:52Z"
  },
  {
    "title": "Trump news at a glance: president goes after Biden executive orders with baseless autopen claims",
    "url": "https://www.theguardian.com/us-news/2025/nov/29/trump-administration-news-updates-today",
    "image": "https://media.guim.co.uk/fcd85e45c85cbde48cae498f511144a64392e654/581_0_5000_4000/500.jpg",
    "summary": "Donald Trump alleges, without providing evidence, that President Biden did not personally authorize certain orders, marking a continuation of his criticism of the Biden administration. This claim adds to Trump's recent attacks on his predecessor. The statement reflects ongoing tensions and discourse in U.S. politics.",
    "published": "2025-11-29T01:21:58Z"
  }
]