[
  {
    "title": "Nigel Farage ‘doesn’t like Britain’, Starmer tells Labour conference – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/30/labour-conference-starmer-speech-streeting-nhs-reform",
    "image": "https://media.guim.co.uk/a533235f15b2adce2c55c64678e3737f52da87c6/836_95_3626_2901/500.jpg",
    "summary": "The Prime Minister criticized Reform UK's migration plan, labeling it as an obstacle to national renewal. He emphasized that fostering economic growth is essential for addressing societal divisions. The statement underscores the importance of a cohesive approach to migration and economic policy.",
    "published": "2025-09-30T14:18:20Z"
  },
  {
    "title": "Donald Trump addresses military leaders as Pete Hegseth declares war on diversity efforts – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/30/us-government-shutdown-funding-trump-vance-portland-hegseth-latest-updates",
    "image": "https://media.guim.co.uk/e5baf1745c004fc75fab53045db2ea8d37b6e99f/356_0_4342_3472/500.jpg",
    "summary": "US President addresses hundreds of military leaders in Virginia, emphasizing the need for improved fitness standards. The Defense Secretary has introduced a 'male-standard' fitness test in response to concerns about underperforming troops. This move aims to address issues related to military readiness and fitness among service members.",
    "published": "2025-09-30T14:17:18Z"
  },
  {
    "title": "Britain is facing a ‘fight for the soul of our country’, says Keir Starmer",
    "url": "https://www.theguardian.com/politics/2025/sep/30/britain-fight-for-soul-of-country-keir-starmer-labour-conference-reform-uk-nigel-farage",
    "image": "https://media.guim.co.uk/1f3b5ac66808b0c7dbeb1125ed8f241d5e0267eb/734_0_6830_5464/500.jpg",
    "summary": "During a recent conference, the Prime Minister emphasized that the upcoming political choices revolve around themes of \"decency or division, renewal or decline.\" This statement comes as Nigel Farage and his party, Reform UK, gain traction. The PM aims to present a united front against the challenges posed by Farage's rising influence.",
    "published": "2025-09-30T14:11:48Z"
  },
  {
    "title": "Jobs to go at Lincolnshire oil refinery; UK economy grew faster than thought under Labour – business live",
    "url": "https://www.theguardian.com/business/live/2025/sep/30/uk-economy-grew-faster-than-thought-six-months-labour-government-markets-pound-sterling-business-live",
    "image": "https://media.guim.co.uk/753dab227fb6f0e6e8af28205bf97cea39454d64/279_0_3042_2433/500.jpg",
    "summary": "The insolvency firm managing the Lindsey oil refinery has announced job losses following the collapse of its parent company, Prax Group. This development highlights the challenges facing the oil industry amid financial difficulties. Employees are facing uncertainty as the firm navigates the aftermath of the company's failure.",
    "published": "2025-09-30T14:10:24Z"
  },
  {
    "title": "Indonesia school collapse: three dead and over 90 missing as rescue effort continues",
    "url": "https://www.theguardian.com/world/2025/sep/30/indonesia-school-collapse-one-dead-65-buried-under-rubble-as-rescuers-race-to-find-survivors",
    "image": "https://media.guim.co.uk/7eff1998f35d62670ede699f19de03be2d1b2b42/127_0_4626_3701/500.jpg",
    "summary": "In East Java, the instability of a building has complicated the search efforts following an incident. Despite the challenges, it has been confirmed that 99 boys and school staff have survived. Rescuers are working to navigate the unsafe conditions to locate any remaining individuals.",
    "published": "2025-09-30T14:08:52Z"
  }
]