[
  {
    "title": "Backlash as White House chooses Robert F Kennedy Jr deputy to run CDC – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/aug/29/cdc-robert-f-kennedy-jr-donald-trump-federal-reserve-lisa-cook-latest-us-politics-news-live-updates",
    "image": "https://media.guim.co.uk/413dc232b37a3613e5c8b3e89e532ae1c69565d8/1429_0_7200_5760/500.jpg",
    "summary": "Senators expressed outrage over the appointment of Jim O'Neill to replace Susan Monarez at the US Centers for Disease Control and Prevention. The decision has sparked concerns regarding the agency's leadership and direction. Lawmakers are demanding accountability and clarity on the implications of this leadership change.",
    "published": "2025-08-29T13:19:10Z"
  },
  {
    "title": "Alexander-Arnold left out of England squad, Europa League draw and more: football news – live",
    "url": "https://www.theguardian.com/football/live/2025/aug/29/mourinho-sacked-by-fenerbahce-simmons-to-join-spurs-and-more-football-news-live",
    "image": "https://media.guim.co.uk/40e513886f03a0375292ab5c200b922dd5a1b822/0_0_5417_4332/500.jpg",
    "summary": "Writers will be providing updates on the latest developments in the top flight as the weekend approaches. Fans can expect timely news and insights. Stay tuned for comprehensive coverage of the upcoming matches.",
    "published": "2025-08-29T13:18:39Z"
  },
  {
    "title": "Judges ruling on whether asylum seekers can be removed from Epping hotel – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/aug/29/latest-live-uk-politics-news-updates-asylum-hotels-labour-conservatives-reform",
    "image": "https://media.guim.co.uk/69db6f531143c0c52f448704b7123eb50758b45e/396_137_3832_3066/500.jpg",
    "summary": "The Home Office and the owner of the Bell hotel are contesting a court injunction issued by the local council. This injunction aims to prevent the accommodation of numerous asylum seekers at the hotel. The legal challenge highlights ongoing debates over asylum housing in the region.",
    "published": "2025-08-29T13:15:22Z"
  },
  {
    "title": "All but one EU states demand Russia ‘stop the killing’ in Ukraine as Zelenskyy urges Monday deadline for Putin meeting – live",
    "url": "https://www.theguardian.com/world/live/2025/aug/29/ukraine-russia-war-zelenskyy-putin-latest-europe-news-updates-live",
    "image": "https://media.guim.co.uk/b961012bb38a96402656115733d4b5cb6b5d6520/249_0_2567_2053/500.jpg",
    "summary": "All EU member states, excluding Hungary, have issued a joint statement condemning Russia for its disregard for international law. The statement highlights concerns over Russia's actions and emphasizes the need for a united European response. Hungary's absence reflects its differing stance on the issue.",
    "published": "2025-08-29T13:13:22Z"
  },
  {
    "title": "Julia Roberts says humanity ‘losing art of conversation’ in defence of new #MeToo-themed film",
    "url": "https://www.theguardian.com/film/2025/aug/29/julia-roberts-says-humanity-losing-art-of-conversation-defence-metoo-film-venice-after-the-hunt",
    "image": "https://media.guim.co.uk/264a9552a21aab362a563ca1829244f285b8f1a3/266_0_4785_3828/500.jpg",
    "summary": "\"After the Hunt,\" directed by Luca Guadagnino, explores the complexities surrounding a sexual assault accusation at a university. The film delves into the emotional and societal impacts of the allegation on the involved parties. It aims to provoke discussions about justice and morality in the context of contemporary societal challenges.",
    "published": "2025-08-29T13:12:38Z"
  }
]