[
  {
    "title": "Zipcar, world’s biggest car-sharing company, to close UK operation",
    "url": "https://www.theguardian.com/business/2025/dec/01/zipcar-worlds-biggest-car-sharing-company-to-close-uk-operation",
    "image": "https://media.guim.co.uk/42fb406178c5f847a65760882ef8cd85185bf6cf/3328_1446_4794_3836/500.jpg",
    "summary": "Avis Budget's subsidiary will end access to its shared vehicle fleet in London by the end of the year. This decision affects users who rely on the service for transportation in the city. The move reflects broader trends in the shared mobility market.",
    "published": "2025-12-01T16:26:16Z"
  },
  {
    "title": "The 41+ best US Cyber Monday kitchen deals on blenders, pans, cleaning tools and more",
    "url": "https://www.theguardian.com/thefilter-us/2025/nov/17/best-black-friday-cyber-monday-kitchen-deals",
    "image": "https://media.guim.co.uk/52c230c04961c427ffe60d975656e38cfe97308d/0_0_6000_4800/500.jpg",
    "summary": "Early Black Friday kitchen deals are now available, featuring discounts from popular brands like Le Creuset, Vitamix, and Yeti. Shoppers can take advantage of these offers ahead of the official holiday sales. A selection of the best deals has been highlighted for easy browsing.",
    "published": "2025-12-01T16:22:08Z"
  },
  {
    "title": "Zelenskyy sets out Ukraine’s red lines in press conference with Macron – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/dec/01/zelenskyy-macron-us-ukraine-russia-steve-witkoff-jared-kushner-moscow-europe-live-latest-news-updates",
    "image": "https://media.guim.co.uk/d1c556ab86738b8d74a1b33507a98132d5083e27/282_117_988_791/500.jpg",
    "summary": "The Ukrainian president emphasizes that the nation's primary focus is on securing guarantees for its safety. He highlighted the importance of preserving Ukraine's sovereignty and territorial integrity. The statement underscores Ukraine's commitment to defending its national interests amidst ongoing challenges.",
    "published": "2025-12-01T16:22:06Z"
  },
  {
    "title": "OBR says its inadvertent release of budget report is ‘worst failure’ in its 15-year history – UK politics live ",
    "url": "https://www.theguardian.com/politics/live/2025/dec/01/keir-starmer-rachel-reeves-budget-labour-uk-politics-live-news-latest-updates",
    "image": "https://media.guim.co.uk/073f1a28438f4e8ddb39aa629eee89f82d5e0e78/157_0_2071_1656/500.jpg",
    "summary": "The Office for Budget Responsibility stated that Rachel Reeves was entitled to believe that the report would remain unpublished until she concluded her budget speech. This comment highlights concerns about the timing of information release. It underscores the importance of maintaining confidentiality in budget discussions.",
    "published": "2025-12-01T16:21:49Z"
  },
  {
    "title": "Trump backs Hegseth as defense secretary denies ordering second strike on boat – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/dec/01/donald-trump-pete-hegseth-caribbean-boats-venezuela-immigration-us-politics-latest-news-updates",
    "image": "https://media.guim.co.uk/ccf83b6240d623f31bd9c8fe59f660dac83fa46e/542_0_4800_3840/500.jpg",
    "summary": "President's comments arise as pressure mounts for a prompt investigation into claims that Hegseth directed a second strike on a boat suspected of drug smuggling. This follows allegations that raise serious concerns about military conduct. The situation has drawn attention and prompted calls for accountability.",
    "published": "2025-12-01T16:19:24Z"
  }
]