[
  {
    "title": "Man in serious condition after being shot by police in London",
    "url": "https://www.theguardian.com/uk-news/2025/oct/10/man-in-serious-condition-after-being-shot-by-police-in-london",
    "image": "https://media.guim.co.uk/819cb7352d1b4ce807680ca8cbf96d9da7205daf/414_0_4119_3297/500.jpg",
    "summary": "The Independent Office for Police Conduct (IOPC) is investigating an incident in Walthamstow involving a man who allegedly brandished a firearm and made threats to kill. The situation has raised concerns about police response and management of the incident. Further details are expected as the investigation progresses.",
    "published": "2025-10-10T22:16:42Z"
  },
  {
    "title": "‘Substantial’ federal layoffs begin as Congress remains deadlocked over funding to end shutdown – live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/10/letitia-james-donald-trump-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/84c7b03bccaa2922d85ef889e5129dcd2e773dba/475_0_5000_4000/500.jpg",
    "summary": "Various U.S. government agencies, including the Treasury, Health and Human Services (HHS), Department of Homeland Security (DHS), and the Education Department, have confirmed budget cuts. While no specific figures have been released, these reductions indicate significant fiscal adjustments. The agencies are preparing for the impacts of these cuts on their operations and services.",
    "published": "2025-10-10T21:49:19Z"
  },
  {
    "title": "Northern Ireland 2-0 Slovakia, Sweden 0-2 Switzerland: World Cup qualifying clockwatch – as it happened",
    "url": "https://www.theguardian.com/football/live/2025/oct/10/tuchel-criticises-silent-england-fans-world-cup-qualifying-news-and-more-football-live",
    "image": "https://media.guim.co.uk/bb47db6a5ef7edeb426acf0517b43bc1cd429554/540_0_4765_3813/500.jpg",
    "summary": "France and Switzerland advanced in their World Cup qualification efforts, solidifying their positions. Northern Ireland also showed notable improvement, enhancing their chances for qualification. The latest matches have created a more competitive atmosphere as the tournament approaches.",
    "published": "2025-10-10T21:24:55Z"
  },
  {
    "title": "Trump threatens 100% China tariffs as Beijing restricts rare-earth exports",
    "url": "https://www.theguardian.com/us-news/2025/oct/10/trump-china-tariffs",
    "image": "https://media.guim.co.uk/8e482f0db7c72148b29a33d4261daad28a938ca0/340_0_3407_2725/500.jpg",
    "summary": "The President has accused China of engaging in \"very hostile\" actions, indicating that the U.S. may implement additional tariffs as early as November 1st or possibly sooner. This statement reflects escalating tensions between the two nations. The potential tariffs are part of ongoing trade disagreements.",
    "published": "2025-10-10T21:11:36Z"
  },
  {
    "title": "Tom Roebuck hat-trick sets up demolition as Sale pile further misery on Newcastle ",
    "url": "https://www.theguardian.com/sport/2025/oct/10/sale-newcastle-prem-rugby-union-match-report",
    "image": "https://media.guim.co.uk/84a0666278008b1ed16660b6d5cb35bff033c592/925_0_4507_3605/500.jpg",
    "summary": "Tom Roebuck scored a hat-trick, leading Sale to a decisive victory over Newcastle. This match marked Newcastle's third consecutive defeat. Roebuck's outstanding performance highlighted Sale's dominance in the game.",
    "published": "2025-10-10T21:07:13Z"
  }
]