[
  {
    "title": "Australia news live: SA Liberal leader Vincent Tarzia steps down; emergency warning for bushfire near Dubbo",
    "url": "https://www.theguardian.com/australia-news/live/2025/dec/05/australia-news-live-skydivers-strike-aukus-review-anika-wells-travel-social-media-age-ban-coalition-labor-ntwnfb",
    "image": "https://media.guim.co.uk/6fd750fb606970042b28100a0371649907c11eae/1575_321_3931_3146/500.jpg",
    "summary": "I'm sorry, but I need the specific news content you want summarized. Could you please provide the details?",
    "published": "2025-12-05T03:17:41Z"
  },
  {
    "title": "Social media ban: when does it start, how will it work and what apps are getting banned for under-16s in Australia?",
    "url": "https://www.theguardian.com/media/2025/dec/05/social-media-ban-or-delay-australia-list-under-16-explainer-guide-when-what-apps-included-getting-banned",
    "image": "https://media.guim.co.uk/205ebdfcd9e147a641953a99f3784f8a54f48ce6/0_26_5000_4001/500.jpg",
    "summary": "The article discusses the potential delay or postponement of a new ban, focusing on the implementation of age verification measures. It outlines the implications for users and technology platforms. Key details on how these changes will impact the timeline and user experience are provided.",
    "published": "2025-12-05T03:09:25Z"
  },
  {
    "title": "Supreme court allows Texas to use new congressional map favoring Republicans in 2026 elections – as it happened",
    "url": "https://www.theguardian.com/us-news/live/2025/dec/04/us-politics-live-donald-trump-latest-news-updates-democrats-republicans",
    "image": "https://media.guim.co.uk/ed0b19203d5ac862995fd5a5fd6926cb9daed472/348_0_3280_2624/500.jpg",
    "summary": "The live blog has officially concluded, marking the end of updates and discussions. Readers are encouraged to check back later for future updates on the topic. Thank you for following along.",
    "published": "2025-12-05T02:48:52Z"
  },
  {
    "title": " Parts of Australia hit by severe heatwave as temperatures pass 40C in NSW and Tasmanian bushfires threaten properties",
    "url": "https://www.theguardian.com/australia-news/2025/dec/05/parts-of-australia-hit-by-severe-heatwave-as-temperature-surges-past-40c-in-nsw-and-tasmanian-bushfires-threaten-properties",
    "image": "https://media.guim.co.uk/0466e77142561e3869f4d06f31a277bfcdfb91c8/0_0_1920_1536/500.jpg",
    "summary": "Heatwave warnings have been issued for several regions in Australia, including parts of New South Wales, the Northern Territory, Queensland, and Western Australia. Authorities are urging residents to take precautions against extreme temperatures. The heatwave is expected to pose health risks, particularly for vulnerable populations.",
    "published": "2025-12-05T02:46:39Z"
  },
  {
    "title": "Pentagon announces it has killed four men in another boat strike in Pacific ",
    "url": "https://www.theguardian.com/us-news/2025/dec/04/pentagon-boat-strike-pacific",
    "image": "https://media.guim.co.uk/4451d39c35a2bcdb9dfa04750b19963fc2bd980d/424_0_2094_1676/500.jpg",
    "summary": "A strike targeting suspected drug smugglers occurred amidst ongoing congressional debates regarding the legality of U.S. military actions in such operations. Lawmakers are grappling with issues surrounding the authorization and extent of these attacks. The situation highlights tensions between national security concerns and legal oversight.",
    "published": "2025-12-05T02:27:10Z"
  }
]