[
  {
    "title": "US Open tennis 2025: Aryna Sabalenka v Amanda Anisimova, women’s singles final – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/06/us-open-tennis-2025-aryna-sabalenka-amanda-anisimova-womens-singles-final-live",
    "image": "https://media.guim.co.uk/53e7e841481fa2f9535438d8223056b715d3128c/667_0_3920_3136/500.jpg",
    "summary": "Aryna Sabalenka is vying to defend her title in the ongoing tournament, while Amanda Anisimova seeks to overcome her past challenges at Wimbledon. Katy Murrells provides live updates on their performances. Fans are eagerly watching the unfolding matches.",
    "published": "2025-09-06T21:23:55Z"
  },
  {
    "title": "World Cup qualifying roundup: Ronaldo scores twice as Portugal pay Jota tributes",
    "url": "https://www.theguardian.com/football/2025/sep/06/world-cup-qualifying-roundup-ronaldo-scores-twice-as-portugal-pay-jota-tributes",
    "image": "https://media.guim.co.uk/ce22b8bf979ffcb0311ea01d54dea9de564e8adc/302_0_2638_2110/500.jpg",
    "summary": "Cristiano Ronaldo scored two goals as Portugal defeated Armenia 5-0 in a World Cup qualifying match in Yerevan. The game was particularly emotional, highlighting the significance of the occasion. This victory strengthens Portugal's position in the qualifiers.",
    "published": "2025-09-06T21:22:38Z"
  },
  {
    "title": "Reshuffle of junior ministers raises fears over future of Labour’s workers’ rights bill",
    "url": "https://www.theguardian.com/politics/2025/sep/06/reshuffle-of-junior-ministers-raises-fears-over-future-of-labours-workers-rights-bill",
    "image": "https://media.guim.co.uk/c2e8d22909e2d7bcef2080f8b3a9a0aa725e25ac/0_0_1064_850/500.jpg",
    "summary": "Employment Rights Minister Justin Madders has been dismissed, raising concerns about potential conflicts over significant reforms. His departure may signal a shift in the government's approach to labor rights, as union allies appear to be marginalized. The situation is prompting speculation about upcoming tensions in the realm of employment legislation.",
    "published": "2025-09-06T21:08:50Z"
  },
  {
    "title": "Manchester United reach verbal agreement with Trabzonspor for André Onana loan deal",
    "url": "https://www.theguardian.com/football/2025/sep/06/manchester-united-reach-verbal-agreement-with-trabzonspor-for-andre-onana-loan-deal",
    "image": "https://media.guim.co.uk/a71555290110e1a52b1eef8c69e74cfc3cda489e/715_22_2772_2218/500.jpg",
    "summary": "Manchester United and Trabzonspor have reportedly reached a verbal agreement for André Onana's loan transfer. The goalkeeper is reportedly open to the move. Discussions are ongoing to finalize the deal.",
    "published": "2025-09-06T21:04:35Z"
  },
  {
    "title": "WA museum tells staff ‘almost all of us are guilty’ of burning fossil fuels in email defending Woodside partnership",
    "url": "https://www.theguardian.com/australia-news/2025/sep/07/western-australia-museum-woodside-partnership-staff-email-almost-all-of-us-guilty-burning-fossil-fuels-email-defending",
    "image": "https://media.guim.co.uk/360263722d46da4f9cf5783da3bdd6f7a920acfa/108_0_2835_2269/500.jpg",
    "summary": "Climate advocates have dismissed a CEO's assertion that he is \"not qualified\" to discuss the risks associated with the gas company's plan to extend production until 2070. They argue that his position requires accountability and engagement on environmental concerns. The controversy highlights ongoing tensions between corporate interests and climate advocacy.",
    "published": "2025-09-06T20:54:57Z"
  }
]