[
  {
    "title": "World Series Game 6: Los Angeles Dodgers v Toronto Blue Jays – live updates",
    "url": "https://www.theguardian.com/sport/live/2025/oct/31/world-series-game-6-los-angeles-dodgers-v-toronto-blue-jays-live-buildup",
    "image": "https://media.guim.co.uk/63fecc8fd8f472aa31f4c36758d40285db6074fc/282_0_2807_2246/500.jpg",
    "summary": "The Toronto Blue Jays are facing the Los Angeles Dodgers in Game 6 of the World Series. David Lengel is providing live updates on the game. Fans can follow the action as the championship unfolds.",
    "published": "2025-11-01T01:41:24Z"
  },
  {
    "title": "New Zealand v England: third men’s cricket one-day international – live",
    "url": "https://www.theguardian.com/sport/live/2025/nov/01/new-zealand-v-england-third-mens-cricket-one-day-international-live",
    "image": "https://media.guim.co.uk/8f289e61ec3a939c4e19dee846600b23d2fabd9a/479_0_4689_3752/500.jpg",
    "summary": "Wellington hosts the third ODI between New Zealand and England, with reporters providing live updates throughout the match. Fans can follow the game through an over-by-over report for real-time insights. Stay tuned for key moments and player performances as the teams compete.",
    "published": "2025-11-01T01:39:56Z"
  },
  {
    "title": "Trump news at a glance: Friday rulings hamper administration on food stamps, voting access",
    "url": "https://www.theguardian.com/us-news/2025/oct/31/trump-administration-news-updates-today",
    "image": "https://media.guim.co.uk/3d29c5de3952fdcd7665b87c11f5c5a61443192b/609_0_5000_4000/500.jpg",
    "summary": "On October 31, President Trump faced significant legal challenges, including unfavorable rulings in three separate cases. These setbacks could have major implications for his political career and ongoing legal issues. The events highlight the continued scrutiny and legal battles surrounding the former president.",
    "published": "2025-11-01T01:01:09Z"
  },
  {
    "title": "Breeders’ Cup 2025 horse racing: day one – as it happened",
    "url": "https://www.theguardian.com/sport/live/2025/oct/31/breeders-cup-2025-horse-racing-day-one-live",
    "image": "https://media.guim.co.uk/798636ab4e29cb726193c4e2d86bcbd904330a4d/384_0_3537_2830/500.jpg",
    "summary": "Gstaad won the Juvenile Turf, marking a successful day for the O'Brien family. This victory highlights their continued excellence in horse racing. Overall, it adds to their impressive legacy in the sport.",
    "published": "2025-11-01T00:42:00Z"
  },
  {
    "title": "‘G’day Australia. Did you miss us?’ Oasis kicks off Australia tour with euphoric show",
    "url": "https://www.theguardian.com/music/2025/nov/01/gday-australia-did-you-miss-us-oasis-kicks-off-australia-tour-with-euphoric-show",
    "image": "https://media.guim.co.uk/90a9273eb3c1578dbd717993600021b38aba5756/929_137_6128_4905/500.jpg",
    "summary": "Liam and Noel Gallagher made a notable return to Melbourne, showcasing their signature bucket hats at Marvel Stadium. The performance was polished and carried a warm, affectionate vibe. Fans were treated to a memorable show from the iconic duo.",
    "published": "2025-11-01T00:05:59Z"
  }
]