[
  {
    "title": "Palmer fit to start against Arsenal, Gueye red card appeal rejected – football live",
    "url": "https://www.theguardian.com/football/live/2025/nov/28/premier-league-news-europa-league-reaction-previews-and-more-football-live",
    "image": "https://media.guim.co.uk/0e30b458e27f21ee2f3bd5b38a1f8f356bf5deba/0_810_3878_3103/500.jpg",
    "summary": "A rolling report provides up-to-date football news and analysis as the weekend approaches. Join our writers for insights and reactions to the latest developments in the sport. Stay informed on the key stories and matches ahead.",
    "published": "2025-11-28T15:19:52Z"
  },
  {
    "title": "No 10 dismisses claim that OBR revelations show Reeves misled public about need for tax rises in budget – UK politics live ",
    "url": "https://www.theguardian.com/politics/live/2025/nov/28/workers-rights-bill-unfair-dismissal-uk-politics-latest-news-updates-labour-budget-keir-starmer",
    "image": "https://media.guim.co.uk/c0bd7148a2ad825edf852af383dc2802df685233/1033_0_6880_5504/500.jpg",
    "summary": "Downing Street has dismissed allegations that the chancellor misled voters regarding the public finances prior to the budget announcement. The claims suggest a lack of transparency in financial reporting. Government officials maintain the integrity of the chancellor’s statements.",
    "published": "2025-11-28T15:15:16Z"
  },
  {
    "title": "National guard shooting suspect to be charged with murder as Trump steps up immigration crackdown – US politics live ",
    "url": "https://www.theguardian.com/us-news/live/2025/nov/28/trump-washington-dc-shooting-politics-updates",
    "image": "https://media.guim.co.uk/5fa5bb189a8fcb56fe806c3c88ffb49a8864babf/0_0_3156_2525/500.jpg",
    "summary": "The US attorney for Washington, D.C., announced that charges against a suspect have been upgraded to first-degree murder following the death of a National Guard member. In response to ongoing migration issues, the US president declared a \"permanent pause\" on immigration from certain \"third world countries.\" These developments reflect escalating tensions surrounding public safety and immigration policy.",
    "published": "2025-11-28T15:15:09Z"
  },
  {
    "title": "Congratulations everyone! Starmer survives another week, and it’s only cost us £26bn | Marina Hyde",
    "url": "https://www.theguardian.com/commentisfree/2025/nov/28/congratulations-keir-starmer-survives-26bn",
    "image": "https://media.guim.co.uk/a708a949931a98ddb3391f95be86d12f605a0042/344_0_5000_4000/500.jpg",
    "summary": "Marina Hyde, a Guardian columnist, critiques the Labour Party's budget, suggesting it favors those in high-ranking positions, particularly the prime minister. She implies that while Labour claims to take care of working people, its policies may not genuinely reflect the needs of the wider workforce. The commentary highlights a disconnect between political rhetoric and the realities faced by everyday workers.",
    "published": "2025-11-28T15:14:32Z"
  },
  {
    "title": "Nicola Benedetti and friends review – delicious bite-sized musical snacks from a violinist still top of her game",
    "url": "https://www.theguardian.com/music/2025/nov/28/nicola-benedetti-and-friends-review-royal-albert-hall",
    "image": "https://media.guim.co.uk/c3392db6f205481c4780ee13d6304406ce2cfb2d/250_0_4680_3744/500.jpg",
    "summary": "A violinist performed alongside a unique ensemble featuring cello, guitar, and accordion. The event had a laid-back atmosphere reminiscent of a highly polished jam session. The evening showcased a blend of talent and creativity in an enjoyable setting.",
    "published": "2025-11-28T15:14:20Z"
  }
]