[
  {
    "title": "The 27 best fashion gifts in the US – curated by our favorite stylists and creators",
    "url": "https://www.theguardian.com/thefilter-us/2025/nov/28/best-fashion-gift-ideas-guide",
    "image": "https://media.guim.co.uk/ee6fb413ad235b74435e503683e2f3523fbea058/1_0_3998_3200/500.jpg",
    "summary": "This holiday season, impress the fashion-forward individuals in your life with curated gift selections from popular brands like Reformation, J Crew, and Sézane. These thoughtfully chosen items are sure to appeal to their stylish tastes. Elevate their wardrobe with these trendy and chic options.",
    "published": "2025-11-28T20:19:26Z"
  },
  {
    "title": "Trump says he will cancel all Biden executive orders signed by autopen – live ",
    "url": "https://www.theguardian.com/us-news/live/2025/nov/28/trump-washington-dc-shooting-politics-updates",
    "image": "https://media.guim.co.uk/fcd85e45c85cbde48cae498f511144a64392e654/581_0_5000_4000/500.jpg",
    "summary": "The US president intensified efforts to depict his predecessor as incapable and disconnected from reality through a recent social media post. This move aligns with a longstanding campaign questioning the former leader's competence. The messaging aims to reinforce perceptions of the predecessor's mental acuity as his term ended.",
    "published": "2025-11-28T20:11:48Z"
  },
  {
    "title": "The best Black Friday deals in the UK under £50: eye serum, headphones and the ultimate travel mug",
    "url": "https://www.theguardian.com/thefilter/2025/nov/26/best-black-friday-deals-under-50-uk",
    "image": "https://media.guim.co.uk/c69508cef25a82a81a758c8fb3c2d0c149d78a9d/0_0_5000_4000/500.jpg",
    "summary": "Black Friday offers great deals beyond just expensive electronics, with plenty of options available for under £50. The highlights include a variety of affordable gifts and everyday items. Shoppers can find quality bargains that won’t break the bank.",
    "published": "2025-11-28T20:04:41Z"
  },
  {
    "title": "Former Ukip MEP denies taking money to promote Russian interests",
    "url": "https://www.theguardian.com/politics/2025/nov/28/ukip-mep-denies-taking-money-promote-russian-interests-daivd-coburn-nathan-gill",
    "image": "https://media.guim.co.uk/35725af63ffd19fcedfa0552ad8c290eda295497/0_169_3289_2631/500.jpg",
    "summary": "David Coburn, former leader of Ukip in Scotland, has denied any involvement following the sentencing of Nathan Gill, who was imprisoned for accepting bribes. Coburn's statement comes as the party faces scrutiny over Gill's actions. The situation raises concerns about ethical practices within the party.",
    "published": "2025-11-28T19:56:20Z"
  },
  {
    "title": "Woman jailed for harassing Rachel Reeves’ sister",
    "url": "https://www.theguardian.com/politics/2025/nov/28/woman-jailed-harassing-rachel-reeves-sister-ellie",
    "image": "https://media.guim.co.uk/ee6dbd3c98f93b677f59c351a6b74191f3b90d4a/211_0_2560_2048/500.jpg",
    "summary": "Tracey Smith communicated with government minister and MP Ellie Reeves by sending 22 emails and leaving 10 voicemails. The details surrounding the content and purpose of these messages are not specified. The correspondence highlights Smith's efforts to engage with the MP.",
    "published": "2025-11-28T19:23:06Z"
  }
]