[
  {
    "title": "‘Completely unacceptable’ that mistaken prisoner releases have gone up under Labour, minister says – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/nov/09/mistaken-prisoner-releases-labour-budget-uk-politics-live",
    "image": "https://media.guim.co.uk/d2626fa7b0d4d18e66c4469d33712fe2db127ff9/23_0_3934_3149/500.jpg",
    "summary": "Culture Secretary Lisa Nandy emphasized the need to address the issue of harmful content online, stating, \"Even one is too many,\" during an interview with Sky News. She advocated for stronger regulations to protect individuals from online dangers. Her comments reflect ongoing concerns about online safety and the government's commitment to tackling this pressing issue.",
    "published": "2025-11-09T10:13:12Z"
  },
  {
    "title": "Liverpool travel to Manchester City, Premier League buildup and more – matchday live",
    "url": "https://www.theguardian.com/football/live/2025/nov/09/liverpool-travel-to-manchester-city-premier-league-buildup-and-more-matchday-live",
    "image": "https://media.guim.co.uk/66cda8a0623858319074a7d0ea823f4a72958e16/0_0_5000_4000/500.png",
    "summary": "Join us for updates, engaging discussions, and sneak peeks ahead of the day's events. Stay informed and connected with all the latest news. Don't miss out on what's happening!",
    "published": "2025-11-09T10:10:46Z"
  },
  {
    "title": "Last youth centre in one of England’s most deprived coastal areas faces closure",
    "url": "https://www.theguardian.com/environment/2025/nov/09/last-youth-centre-in-one-of-englands-most-deprived-coastal-areas-faces-closure",
    "image": "https://media.guim.co.uk/782d790184261669974e8abef79f97d988f79f78/0_0_9371_7493/500.jpg",
    "summary": "Pie Factory Music in Ramsgate, Kent, is known for its creative projects and support services. However, the building that accommodates the center is set to be sold in February. This could impact the services they offer to the community.",
    "published": "2025-11-09T10:00:29Z"
  },
  {
    "title": "How Mamdani is defying immigrant expectations by embracing his identity: ‘His boldness resonates’",
    "url": "https://www.theguardian.com/us-news/2025/nov/09/zohran-mamdani-politics-immigrant-identity",
    "image": "https://media.guim.co.uk/5433924ee75badf025106afe3c9ef83a65cbd185/418_0_4164_3333/500.jpg",
    "summary": "New York City's mayor-elect has pledged to confront Islamophobia head-on, rejecting the notion of remaining silent amid rising anti-Muslim sentiments. He emphasizes the importance of standing against hate and ensuring all communities feel safe and included. His commitment aims to foster unity and support for marginalized groups.",
    "published": "2025-11-09T10:00:29Z"
  },
  {
    "title": "Novels I haven’t finished reading are piling up by my bedside. What if that’s a good thing? | Hanna Thomas Uose",
    "url": "https://www.theguardian.com/commentisfree/2025/nov/09/novels-authors-modern-attention-span",
    "image": "https://media.guim.co.uk/d7bc00d5790267d8725050bc3096c9f6b492ecbd/0_2757_5464_4369/500.jpg",
    "summary": "Author Hanna Thomas Uose discusses the contemporary debate surrounding decreasing attention spans, suggesting that her personal experiences of abandonment reflect deeper issues beyond mere distraction. She emphasizes the need to consider the implications of these trends on our understanding of focus and engagement. Uose calls for a broader examination of societal factors influencing our attention and connections.",
    "published": "2025-11-09T10:00:29Z"
  }
]