[
  {
    "title": "Lecornu attempts to rally French cabinet before addressing parliament – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/oct/14/france-lecornu-macron-ukraine-russia-zelenskyy-europe-latest-news-updates",
    "image": "https://media.guim.co.uk/79b35aa00c06d4df2c48da32db7a90bc518fc02a/1008_0_6236_4988/500.jpg",
    "summary": "The Prime Minister is seeking to gain support from Socialist party members to prevent a potential no-confidence vote. This vote poses a threat to the government's stability and could exacerbate France's ongoing political crisis. The outcome is crucial for the PM to maintain power and address the challenges facing the nation.",
    "published": "2025-10-14T12:42:28Z"
  },
  {
    "title": "‘Instability and confusion’ as CDC slashes 1,300 jobs before reinstating half",
    "url": "https://www.theguardian.com/us-news/2025/oct/14/cdc-job-cuts-partial-reversal",
    "image": "https://media.guim.co.uk/7d1d936b22c00e7cb731a6d5beb6aa1ef75e9897/526_0_5261_4209/500.jpg",
    "summary": "In a recent decision, the health agency deleted entire offices, leading to confusion as the Trump administration announced that 700 notices were mistakenly sent out. This move has raised concerns about the handling of sensitive information. The agency is now working to rectify the situation amidst public scrutiny.",
    "published": "2025-10-14T12:40:23Z"
  },
  {
    "title": "Gaza ceasefire live: Red Cross warns of ‘massive challenge’ in returning bodies of hostages as key truce issues remain",
    "url": "https://www.theguardian.com/world/live/2025/oct/14/gaza-ceasefire-israel-hamas-palestine-hostages-detainees-truce-live-news-updates",
    "image": "https://media.guim.co.uk/b911994cfbf7f44c97869341e06f2dc62d4b1759/794_0_4680_3744/500.jpg",
    "summary": "The Israeli defense minister asserts that delays in returning bodies would breach the ceasefire agreement. In northern Gaza, Israeli forces have opened fire on individuals approaching their troops. This situation highlights ongoing tensions amid the conflict.",
    "published": "2025-10-14T12:37:02Z"
  },
  {
    "title": "Starmer tells MPs Middle East peace deal would not have been possible without Trump – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/oct/14/keir-starmer-china-national-security-spying-gaza-nigel-farage-uk-politics-live-news-updates",
    "image": "https://media.guim.co.uk/7a13a8e80c4b8024ee43539c94fe7860f893f440/140_0_1343_1074/500.jpg",
    "summary": "The Prime Minister emphasized that while the recent Middle East peace deal is historic, the focus must now shift to its implementation. He stressed the importance of actionable steps to ensure the agreement leads to lasting peace. The statement reflects a commitment to moving beyond negotiations to tangible outcomes.",
    "published": "2025-10-14T12:36:36Z"
  },
  {
    "title": "Letitia James warns of ‘powerful voices trying to silence the truth’ – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/14/donald-trump-government-shutdown-national-guard-javier-milei-charlie-kirk-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/1d3e072276c0ff4f682fe8b2c7b44ca04e009481/347_0_3333_2667/500.jpg",
    "summary": "New York Attorney General Letitia James made her first public appearance since her indictment at a rally supporting activist Mohamad Mamdani. She expressed determination and resilience, vowing to continue her work despite legal challenges. Her speech emphasized a commitment to justice and social advocacy.",
    "published": "2025-10-14T12:32:38Z"
  }
]