[
  {
    "title": "Kairat v Celtic, Leeds v Sheffield Wednesday: Champions League and Carabao Cup clockwatch – live",
    "url": "https://www.theguardian.com/football/live/2025/aug/26/kairat-v-celtic-leeds-v-sheffield-wednesday-champions-league-and-carabao-cup-clockwatch-live",
    "image": "https://media.guim.co.uk/d143f57a281a219b3f915388a3ccc4dc37e4e455/108_0_2642_2113/500.jpg",
    "summary": "Simon Burnton delivers the latest scores and updates from football matches across Europe and England. Fans can stay informed about key developments and match results. Keep an eye on the ongoing action as teams compete for victory.",
    "published": "2025-08-26T19:24:09Z"
  },
  {
    "title": "US Open tennis day three: Sinner in action, Swiatek through, Boulter and Kartal exit – live",
    "url": "https://www.theguardian.com/sport/live/2025/aug/26/us-open-tennis-day-three-jannik-sinner-and-iga-swiatek-in-action-live",
    "image": "https://media.guim.co.uk/78dcbff344ddcb8b74af1b40a32e52741ca7ef5c/0_0_4353_3484/500.jpg",
    "summary": "The article anticipates the performance of two favored teams in their opening matches. Writers will provide updates on the games as they unfold. Stay tuned for insights and analysis on how these teams compete.",
    "published": "2025-08-26T19:21:35Z"
  },
  {
    "title": "Trump says he would ‘like to be asked’ by Democratic governors to send troops to their cities – live",
    "url": "https://www.theguardian.com/us-news/live/2025/aug/26/trump-federal-reserve-lisa-cook-news-updates-us-politics-live",
    "image": "https://media.guim.co.uk/03bf0ccbbfbff11068846f1a1db409ff3e138f13/880_0_7200_5760/500.jpg",
    "summary": "The president faces backlash over federal interventions involving police and National Guard deployments. He asserts that Democratic leaders should advocate for such measures. Critics remain outspoken regarding the implications of federal oversight in law enforcement.",
    "published": "2025-08-26T19:20:02Z"
  },
  {
    "title": "‘He loved his work deeply’: profiles of five Palestinian journalists killed in Gaza airstrike",
    "url": "https://www.theguardian.com/world/2025/aug/26/he-loved-his-work-deeply-profiles-of-five-palestinian-journalists-killed-in-gaza-airstrike",
    "image": "https://media.guim.co.uk/e1f49a3fb9271b89f85ef690193821b3092ca1a5/0_0_5906_4724/500.jpg",
    "summary": "Israel faced significant international backlash after conducting a 'double-tap' airstrike on Nasser hospital in southern Gaza on Monday. The attack drew severe criticism due to the risk it posed to civilians and medical facilities. Humanitarian groups have called for accountability and protection for non-combatants in conflict zones.",
    "published": "2025-08-26T19:18:37Z"
  },
  {
    "title": "The unlikeliest of tactical chameleons: how Howe is holding Newcastle together",
    "url": "https://www.theguardian.com/football/2025/aug/26/newcastle-eddie-howe-tactics-transfers-alexander-isak",
    "image": "https://media.guim.co.uk/009309c52a6f1eb2056e2d4ad83c9be663ece18e/766_0_6107_4886/500.jpg",
    "summary": "Liverpool's manager, previously seen as a purist, has caused concern within the team due to a direct playing style amidst the ongoing stand-off involving Alexander Isak. This shift in approach has led to unease among players and fans alike. The situation highlights tensions in the team's dynamics and strategy.",
    "published": "2025-08-26T19:00:13Z"
  }
]