[
  {
    "title": "Trump celebrates Jimmy Kimmel suspension as some networks replace show with Charlie Kirk tribute – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/18/jimmy-kimmel-charlie-kirk-comments-show-cancelled-suspended-monologue-trump-us-politics-live",
    "image": "https://media.guim.co.uk/306674dfc9eced5d884c681dfe68c36b08dcafbe/518_0_3084_2469/500.jpg",
    "summary": "The indefinite removal of \"Jimmy Kimmel Live!\" has sparked public outrage, coinciding with a broader crackdown on commentary by the Trump administration. This surge in tensions follows the recent killing of conservative commentator Charlie Kirk. Critics argue that the show's removal reflects an alarming trend against free speech.",
    "published": "2025-09-18T07:18:09Z"
  },
  {
    "title": "Australia news live: Waters says climate risk report scenarios ‘will come to pass’ as a result of Labor’s ‘weak’ emissions target",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/18/australia-news-live-santos-takeover-2035-emissions-target-chris-bowen-anthony-albanese-sussan-ley-environment-climate-crisis-ntwnfb",
    "image": "https://media.guim.co.uk/8f3141603c3e19c25d8805463261e555658d61cf/839_0_5666_4535/500.jpg",
    "summary": "Could you please provide the news article or details you would like summarized?",
    "published": "2025-09-18T07:08:20Z"
  },
  {
    "title": "Bank of England expected to leave UK interest rates on hold and slow bond-selling QT programme – business live",
    "url": "https://www.theguardian.com/business/live/2025/sep/18/bank-of-england-uk-interest-rates-bond-selling-qt-programme-andrew-bailey-business-live",
    "image": "https://media.guim.co.uk/1569d81fc094ab2948d99c38fcb53b3898d72b72/610_0_4591_3674/500.jpg",
    "summary": "This summary captures ongoing developments in the economic and financial sectors, highlighting key market movements, economic indicators, and significant events impacting global markets. It emphasizes the importance of staying informed on trends that could affect investments and economic policies. Stay tuned for real-time updates as the situation evolves.",
    "published": "2025-09-18T07:07:51Z"
  },
  {
    "title": "Screamers, treble and ‘let me talk’: Kevin De Bruyne’s memorable Etihad moments",
    "url": "https://www.theguardian.com/football/2025/sep/18/screamers-treble-let-me-talk-kevin-de-bruyne-memorable-etihad-moments-manchester-city",
    "image": "https://media.guim.co.uk/d9d462009acf2109189bee86865fb7c8fa27375c/0_0_5000_4000/500.jpg",
    "summary": "Manchester City legend prepares to return for a memorable match against his former team. Fans reminisce about unforgettable moments from his time at the club. The anticipation builds as the iconic player reconnects with his roots on the field.",
    "published": "2025-09-18T07:00:37Z"
  },
  {
    "title": "Counties in dark over fate as Championship restructure vote is delayed",
    "url": "https://www.theguardian.com/sport/2025/sep/18/county-championship-restructure-vote-delayed-cricket",
    "image": "https://media.guim.co.uk/f748ce7c31c9b425b73c795a2a73cb7c57a7380f/277_46_3438_2750/500.jpg",
    "summary": "The vote to restructure the County Championship has been postponed until the season's end. As a result, counties are uncertain about their objectives for the final two rounds. This delay adds confusion to the competition's conclusion.",
    "published": "2025-09-18T07:00:37Z"
  }
]