[
  {
    "title": "Strictly Come Dancing: week two results – live",
    "url": "https://www.theguardian.com/tv-and-radio/live/2025/oct/04/strictly-come-dancing-week-two-live",
    "image": "https://media.guim.co.uk/3a925c7ab0c93d0f7d458d2239e5605a30e357c3/395_0_3953_3162/500.jpg",
    "summary": "Amber Davies led the joint scoreboard, showcasing impressive performances, while Alex Kingston and Balvinder Sopal showed notable improvement. Ross King and Thomas Skinner found themselves at the bottom of the rankings. The question remains: who will be the first to leave the competition?",
    "published": "2025-10-05T19:13:49Z"
  },
  {
    "title": "Gaza ceasefire talks live: Trump warns Hamas faces ‘complete obliteration’ if it refuses to cede power",
    "url": "https://www.theguardian.com/world/live/2025/oct/05/gaza-ceasefire-israel-palestine-hamas-trump-cairo-negotiations-middle-east-crisis-live-news-updates",
    "image": "https://media.guim.co.uk/547b7a5cc18105a953b48919cda03551a19b5e0f/886_0_4554_3642/500.jpg",
    "summary": "Negotiators are traveling to Egypt after Hamas expressed willingness to accept some aspects of Trump's plan for Gaza. This development could potentially lead to new peace discussions in the region. The agreement marks a significant shift in Hamas's stance on the proposed framework for Gaza's future.",
    "published": "2025-10-05T19:12:16Z"
  },
  {
    "title": "Eagles v Broncos, Texans v Ravens, Jets v Cowboys, and more: NFL week five – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/05/nfl-week-five-eagles-broncos-texans-ravens-jets-cowboys-live",
    "image": "https://media.guim.co.uk/d280344b0c84c09c4e7a05f901c4c292e0c0d56b/14_0_3943_3155/500.jpg",
    "summary": "On Sunday, the Philadelphia team, currently undefeated at 4-0, faced off against Denver. Meanwhile, Baltimore and Houston are both seeking to improve their performance as they continue their seasons. Graham Searles provided updates on the action.",
    "published": "2025-10-05T19:11:17Z"
  },
  {
    "title": "Troilus and Cressida review – history repeats as farce in Pythonesque takedown of ancient heroes",
    "url": "https://www.theguardian.com/stage/2025/oct/05/troilus-and-cressida-review-shakespeares-globe",
    "image": "https://media.guim.co.uk/af23259cf7bbf2c002fd607343f1dbb43c31f04a/383_0_3839_3070/500.jpg",
    "summary": "Owen Horsley's production presents Achilles as a messy character and Ajax as a simplistic brute, utilizing inventive staging and humor. The performance cleverly reinterprets the classic themes with comic twists. Overall, the play captivates audiences with its fresh and engaging approach.",
    "published": "2025-10-05T19:00:42Z"
  },
  {
    "title": "Civil liberty groups express concern over plan for more anti-protest powers",
    "url": "https://www.theguardian.com/uk-news/2025/oct/05/police-to-get-new-powers-to-crack-down-on-repeated-protests-says-home-office",
    "image": "https://media.guim.co.uk/3c8dec7e8b1e2b12aa93520900de6772e9edd72c/497_0_2503_2003/500.jpg",
    "summary": "The Home Secretary announced that police can evaluate the \"cumulative impact\" of demonstrations as tensions rise around the ongoing protests. Opponents of the Palestine Action ban are threatening to escalate their actions in response. This development highlights increasing concerns about public order amid contentious protests.",
    "published": "2025-10-05T18:27:16Z"
  }
]