[
  {
    "title": "Trump says Hamas is ready for peace and Israel ‘must immediately stop bombing of Gaza’ – live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/03/shutdown-congress-trump-senate-latest-updates",
    "image": "https://media.guim.co.uk/9b4205aea3f4fabc735b6ffe16d553a37b6532ec/580_0_5802_4644/500.jpg",
    "summary": "Donald Trump expressed approval of Hamas's response to his Gaza plan, indicating a positive reception. However, Hamas has stated that further negotiations are necessary to work out specific details. The exchange highlights ongoing complexities in addressing the Gaza situation.",
    "published": "2025-10-03T23:07:45Z"
  },
  {
    "title": "Sean ‘Diddy’ Combs sentenced to more than four years in prison and given $500,000 fine – live updates",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/03/sean-diddy-combs-sentencing-trial-conviction-latest-updates",
    "image": "https://media.guim.co.uk/275587ab041d168427a6e4ce98fef167deb4dc24/105_0_2812_2250/500.jpg",
    "summary": "Combs has been sentenced in New York after being convicted of transportation to engage in prostitution. The case underscores the legal ramifications of human trafficking-related offenses. The specifics of the sentence have not been disclosed in the report.",
    "published": "2025-10-03T23:01:52Z"
  },
  {
    "title": "Prize crossword No 29,817",
    "url": "https://www.theguardian.com/crosswords/prize/29817",
    "summary": "I'm unable to access specific crossword puzzles or their content, including \"Prize crossword No 29,817.\" However, if you provide me with details or specific clues from the crossword, I can help summarize or provide information based on that!",
    "published": "2025-10-03T23:00:03Z"
  },
  {
    "title": "Weekend crossword No 769",
    "url": "https://www.theguardian.com/crosswords/weekend/769",
    "summary": "I'm sorry, but I cannot access external content such as specific crossword puzzles or other documents directly. However, if you provide me with the details or main points of the Weekend crossword No. 769, I can help summarize or analyze that information!",
    "published": "2025-10-03T23:00:02Z"
  },
  {
    "title": "‘Let’s embrace change’: Nuno believes West Ham can turn season around",
    "url": "https://www.theguardian.com/football/2025/oct/03/west-ham-nuno-espirito-santo-arsenal",
    "image": "https://media.guim.co.uk/35904e6b91cdacb6e2db2e95d1ad2cb282e9351b/0_86_2003_1602/500.jpg",
    "summary": "Nuno Espírito Santo expressed optimism about West Ham's players, noting their willingness to change. He emphasized the importance of embracing this mindset for improvement. The coach is focused on fostering a positive transformation within the team.",
    "published": "2025-10-03T22:11:46Z"
  }
]