[
  {
    "title": "Ryder Cup 2025: USA 1-3 Europe after day-one foursomes – live updates",
    "url": "https://www.theguardian.com/sport/live/2025/sep/26/ryder-cup-2025-day-one-golf-europe-usa-bethpage-black-live",
    "image": "https://media.guim.co.uk/edc0a159ccb5b64ef5eb29bd87ecd3426d12560a/2300_63_4979_3983/500.jpg",
    "summary": "Europe is off to a strong start in their title defense at Bethpage Black, showcasing impressive performances. Live updates provide hole-by-hole coverage as the competition unfolds. Follow our writers for the latest developments in the tournament.",
    "published": "2025-09-26T20:18:16Z"
  },
  {
    "title": "Meet the 75-year-old powerlifter headed to the world championships",
    "url": "https://www.theguardian.com/wellness/2025/sep/26/powerlifting-kate-evert-world-championships",
    "image": "https://media.guim.co.uk/798b5c4710a19921adfd261a185270e6e01b7b24/0_0_2500_2000/500.jpg",
    "summary": "Kate Evert began exercising to set a positive example for her children. Through her fitness journey, she has gained confidence in her strength and capabilities. Her experience highlights the benefits of physical activity for personal empowerment.",
    "published": "2025-09-26T20:17:37Z"
  },
  {
    "title": "Trump jokingly asked Rolex executives if tariffs would’ve affected US Open invite, CEO says",
    "url": "https://www.theguardian.com/us-news/2025/sep/26/trump-rolex-tariffs-us-open",
    "image": "https://media.guim.co.uk/e5552085ca6ef8ab17b2b8f4a70ac940e6ce23cc/0_0_6827_5464/500.jpg",
    "summary": "Rolex's CEO clarified in a letter to Elizabeth Warren that comments made by the US president were intended as humor. Warren had expressed concerns regarding the president's remarks. The CEO emphasized that the statements should not be taken seriously.",
    "published": "2025-09-26T20:11:51Z"
  },
  {
    "title": "Democrats release tranche of Jeffrey Epstein records, including diaries and flight logs – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/26/james-comey-fbi-indictment-donald-trump-executive-orders-tariffs-us-politics-live",
    "image": "https://media.guim.co.uk/20f07dd53b3392c858bee1649b5d229fd1e34f8b/420_0_4774_3817/500.jpg",
    "summary": "Partially redacted documents have emerged that reference prominent figures including Steve Bannon, Peter Thiel, Elon Musk, and Prince Andrew. The revelations in these documents may shed light on their connections and activities. Further details surrounding the implications of these mentions remain unclear as the documents are still being analyzed.",
    "published": "2025-09-26T20:02:07Z"
  },
  {
    "title": "Corrections and clarifications",
    "url": "https://www.theguardian.com/news/2025/sep/26/corrections-and-clarifications",
    "summary": "Personalized number plates are gaining popularity as a unique way to express individuality. Goodfella's Pizza is launching new flavors to cater to diverse taste preferences. Meanwhile, a delicious orzo recipe highlights the versatility of this pasta, perfect for versatile meals.",
    "published": "2025-09-26T20:00:22Z"
  }
]