[
  {
    "title": "Australia news live: Minns considered scrapping Metro station over $2bn cost blowout; Victorian Liberals struggle to find election candidates",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/30/australia-news-live-albanese-supermarket-united-arab-emirates-uae-coalition-sussan-ley-andrew-hastie-reserve-bank-rba-chalmers-interest-rates-decision-ntwnfb",
    "image": "https://media.guim.co.uk/1e5a83d22485fdfaec2a60829efac80532a7a5f5/158_399_6382_5105/500.jpg",
    "summary": "Please provide the news article or details you would like summarized, and I'll be happy to help!",
    "published": "2025-09-30T04:19:21Z"
  },
  {
    "title": "‘There is hope’: Australia welcomes Trump’s 20-point peace plan for Gaza",
    "url": "https://www.theguardian.com/world/2025/sep/30/australia-welcomes-trump-20-point-peace-plan-gaza-there-is-hope",
    "image": "https://media.guim.co.uk/242dd04c8f8f16e77ca0b0f99cb146128838769d/376_0_6880_5504/500.jpg",
    "summary": "Anthony Albanese supports the commitment to exclude Hamas from future governance in Gaza. He emphasizes the importance of Hamas agreeing to the proposed terms. The statement reflects a broader effort to shape the political future of the region.",
    "published": "2025-09-30T04:19:12Z"
  },
  {
    "title": "Germany’s anti-diversity backlash isn’t fatigue – it’s strategy masquerading as neutrality | Fatma Aydemir",
    "url": "https://www.theguardian.com/commentisfree/2025/sep/30/germany-anti-diversity-backlash-trump-afd",
    "image": "https://media.guim.co.uk/67ac2e9e46e07fa31158bc82f15caa9bf82872f9/0_1049_3649_2919/500.jpg",
    "summary": "Guardian Europe columnist Fatma Aydemir suggests that the issues faced in society are not solely due to Trump’s America or the rise of the AfD. She argues that self-styled progressives in the arts need to reflect critically on their own roles and contributions. Aydemir calls for a deeper introspection among progressives to address broader societal challenges.",
    "published": "2025-09-30T04:00:49Z"
  },
  {
    "title": " ‘It’s more than martial arts – we teach courage‘: the Afghan sisters honing karate skills in Iran",
    "url": "https://www.theguardian.com/global-development/2025/sep/30/its-more-than-martial-arts-we-teach-courage-the-afghan-sisters-honing-karate-skills-in-iran",
    "image": "https://media.guim.co.uk/23bb0d866a26b36edb17f7fe0f98ddbb977ed793/352_0_4167_3333/500.jpg",
    "summary": "Three girls in exile are using sports as a means to empower women amid increasing deportations and growing hostility towards migrants. Their initiative highlights resilience and the positive impact of sports in challenging environments. Despite the difficulties they face, they focus on fostering strength and community among women.",
    "published": "2025-09-30T04:00:49Z"
  },
  {
    "title": "Chad Powers review – Glen Powell gives one of the most magnetic and magical performances in memory",
    "url": "https://www.theguardian.com/tv-and-radio/2025/sep/30/chad-powers-review-glen-powell",
    "image": "https://media.guim.co.uk/cf37dd5ff9dd3c7fc9da6b09607adde39fea6da1/1076_0_3146_2518/500.jpg",
    "summary": "This quirky sports sitcom, reminiscent of Ted Lasso, transforms a zany premise into an engaging mix of humor and heartfelt moments. Its deliberate discomfort adds to its charm, making it a captivating watch. Overall, it's a remarkable achievement in comedy.",
    "published": "2025-09-30T04:00:48Z"
  }
]