[
  {
    "title": "Australia news live: Pocock says Bishop should be ‘reflecting on her position’ as ANU chancellor",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/11/australia-news-live-sydney-storm-weather-anthony-albanese-solomon-islands-pacific-sussan-ley-jacinta-nampijinpa-price-ntwnfb",
    "image": "https://media.guim.co.uk/d895d181615c8c79082c9f50b637f7cf78f7da5b/911_0_6340_5075/500.jpg",
    "summary": "I'm sorry, but I need more specific information regarding the news you're referring to in order to provide a summary. Please provide the details or a link to the story you want summarized.",
    "published": "2025-09-11T07:25:51Z"
  },
  {
    "title": "Two Victorian police officers charged with negligent manslaughter over man’s fatal 2024 arrest",
    "url": "https://www.theguardian.com/australia-news/2025/sep/11/two-victoria-police-officers-charged-with-negligent-manslaughter-luke-briggs-arrest-ntwnfb",
    "image": "https://media.guim.co.uk/1ebfc759b5901e30cbe2d0cb757b6be496ad393d/557_17_3138_2510/500.jpg",
    "summary": "Luke Briggs, 35, died in police custody after his arrest in a Hoppers Crossing car park, leaving his family \"utterly distraught.\" The circumstances surrounding his death are under investigation. His family is seeking answers and justice regarding the incident.",
    "published": "2025-09-11T07:24:26Z"
  },
  {
    "title": "Rising costs push John Lewis Partnership into deeper loss; London tube strike enters fourth day – business live",
    "url": "https://www.theguardian.com/business/live/2025/sep/11/john-lewis-deeper-loss-london-tube-strike-fourth-day-ecb-interest-rates-us-inflation-business-live-news-updates",
    "image": "https://media.guim.co.uk/786143db12f1911f45f9116c23f50a7aac93d90f/477_0_4426_3541/500.jpg",
    "summary": "Stay updated with real-time coverage of current economic trends and financial developments, highlighting key market movements, policy changes, and significant economic indicators. Experts provide insights into the implications of these changes on global and local economies. Understand the latest updates to make informed financial decisions.",
    "published": "2025-09-11T07:24:21Z"
  },
  {
    "title": "Charlie Kirk shooting latest: Trump blames ‘radical left’, but does not mention attacks on Democrats as search for suspect continues",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/10/donald-trump-jeffrey-epstein-tariffs-immigration-crime-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/2673fb19ee0d09b38b7c9c4de993bd283a9eb6e7/313_215_3046_2437/500.jpg",
    "summary": "In a recent Oval Office address, former President Trump promised retribution without referencing the murder of Melissa Hortman, the attack on Paul Pelosi, or threats made against Mike Pence. His remarks focused on other issues, leaving these significant incidents unaddressed. Critics have pointed out this omission as a failure to confront recent violence in politics.",
    "published": "2025-09-11T07:18:38Z"
  },
  {
    "title": "Gareth Evans scolds ‘bone-headed’ Meanjin publisher as imminent closure sparks protest",
    "url": "https://www.theguardian.com/australia-news/2025/sep/11/gareth-evans-meanjin-journal-melbourne-university-publishing-closure-protest",
    "image": "https://media.guim.co.uk/f04d4fef5cefcafa6b3400b0f88aa8c135d12380/1681_333_2480_1985/500.jpg",
    "summary": "Critics are urging Melbourne University Publishing to transfer ownership of the literary journal Meanjin rather than dissolve it. However, the CEO has stated that \"the journal is not for sale.\" The debate reflects concerns about the journal's future and its value to the literary community.",
    "published": "2025-09-11T07:01:01Z"
  }
]