[
  {
    "title": "Australia news live: Labor’s goal of building 1.2m homes in a decade was a ‘pipe dream’, experts say; Trump officials have ‘strong enthusiasm’ for Aukus, Conroy says",
    "url": "https://www.theguardian.com/australia-news/live/2025/oct/15/australia-news-live-liberals-infighting-james-paterson-sussan-ley-andrew-hastie-superannuation-jim-chalmers-ntwnfb",
    "image": "https://media.guim.co.uk/7f08ebe6f2af548ddb9a0368768e6341aef05ec5/0_0_3749_3000/500.jpg",
    "summary": "Please provide the news article or details you'd like summarized, and I'll be happy to help!",
    "published": "2025-10-15T06:24:03Z"
  },
  {
    "title": "Use trials, threaten to cancel: how to get a good deal on UK TV streaming services",
    "url": "https://www.theguardian.com/money/2025/oct/15/uk-tv-streaming-services-deals-trials-netflix-amazon-prime-apple-tv-sky-now",
    "image": "https://media.guim.co.uk/24890ea84a870fc93f8ffdc1e400ffbc8d4e7316/13_0_2422_1937/500.jpg",
    "summary": "Consumers can access better pricing on streaming services like Netflix, Amazon Prime, Apple TV+, and Sky's Now TV through various promotional offers and subscription plans. Different strategies, such as annual subscriptions or bundled services, can lead to significant savings. It's advisable for users to explore all available options to maximize value for their entertainment needs.",
    "published": "2025-10-15T06:00:15Z"
  },
  {
    "title": "Humanish by Justin Gregg review – how much of a person is your pet?",
    "url": "https://www.theguardian.com/books/2025/oct/15/humanish-by-justin-gregg-review-how-much-of-a-person-is-your-pet",
    "image": "https://media.guim.co.uk/38b5064e03552da97b806624080391bd659fad07/104_0_2475_1980/500.jpg",
    "summary": "A behavioral scientist sheds light on common misconceptions and insights regarding animal cognition, covering topics like prosthetic testicles for dogs and the sociability of reptiles. The discussion highlights the complexities of animal minds and their emotional and social needs. This exploration challenges conventional views and encourages a deeper understanding of animal behavior.",
    "published": "2025-10-15T06:00:15Z"
  },
  {
    "title": "A moment that changed me: I nearly died when I was hit by a car – then started to relish life’s little luxuries",
    "url": "https://www.theguardian.com/lifeandstyle/2025/oct/15/a-moment-that-changed-me-i-nearly-died-when-i-was-hit-by-a-car-then-started-to-relish-lifes-little-luxuries",
    "image": "https://media.guim.co.uk/ab91d363d561014ab78d22325f5e12c4ee362a83/518_4_5360_4288/500.jpg",
    "summary": "After years of saving special items for a future occasion, a personal accident prompted a shift in perspective. The experience encouraged embracing the present and using those treasured items now. This newfound outlook emphasizes the importance of living in the moment rather than waiting for ideal circumstances.",
    "published": "2025-10-15T05:55:15Z"
  },
  {
    "title": "Afternoon Update: rightwinger’s visa refusal upheld; record Indigenous deaths in NSW custody; and Trump’s ‘super bad’ magazine cover",
    "url": "https://www.theguardian.com/australia-news/2025/oct/15/afternoon-update-wednesday-ntwnfb",
    "image": "https://media.guim.co.uk/460307f8d0276c057dc85897177ebe560edece01/304_0_3040_2432/500.jpg",
    "summary": "The Australian High Court's full bench upheld the decision by Tony Burke to deny Candace Owens a visa, ruling that it did not violate the implied constitutional freedom of political communication. The court emphasized that government decisions can consider the political impact of visa approvals. This ruling reinforces the government's authority in immigration matters concerning political figures.",
    "published": "2025-10-15T05:41:38Z"
  }
]