[
  {
    "title": "Polish PM says it would be ‘good to know’ who wrote plan to end war in Ukraine, amid concerns over Moscow involvement – live",
    "url": "https://www.theguardian.com/world/live/2025/nov/23/ukrainian-us-emergency-talks-plan-war-russia-live",
    "image": "https://media.guim.co.uk/c82b9742a207341ec5c4ce1982ad3037ee8f2495/511_0_6651_5321/500.jpg",
    "summary": "Ukrainian President Zelenskyy emphasized the urgent need to counter \"wicked Russian attacks\" as he convened with U.S. officials for emergency discussions. The talks aim to strengthen support for Ukraine amidst ongoing aggression. Both sides are focused on strategies to enhance defense and security measures.",
    "published": "2025-11-23T13:20:54Z"
  },
  {
    "title": "Arsenal v Tottenham buildup, Liverpool lose again, and Sheffield derby updates – matchday live",
    "url": "https://www.theguardian.com/football/live/2025/nov/23/arsenal-v-tottenham-hotspur-buildup-and-sheffield-derby-updates-matchday-live",
    "image": "https://media.guim.co.uk/277e9fa0a0fc1ddf50aa5502adbfe322f7bcf84a/1399_1251_1664_1331/500.jpg",
    "summary": "Join our writers for updates and insights as a packed weekend of domestic football gets underway. Stay informed on the latest news and developments in the sport. Don't miss any action as teams prepare to compete.",
    "published": "2025-11-23T13:18:56Z"
  },
  {
    "title": "UK launches critical minerals strategy to reduce dependency on China",
    "url": "https://www.theguardian.com/world/2025/nov/23/uk-launches-critical-minerals-strategy-to-reduce-dependency-on-china",
    "image": "https://media.guim.co.uk/b65ca47c50e8eb167521f4415571b48b96f0d41a/381_0_4164_3333/500.jpg",
    "summary": "A standoff has emerged between China and the EU regarding the supply of chips crucial for the automobile industry. This conflict highlights the significant financial investment needed in the semiconductor sector. The situation underscores the strategic importance of chip manufacturing in global automotive supply chains.",
    "published": "2025-11-23T13:18:22Z"
  },
  {
    "title": "Leeds v Aston Villa: Premier League – live",
    "url": "https://www.theguardian.com/football/live/2025/nov/23/leeds-v-aston-villa-premier-league-live",
    "image": "https://media.guim.co.uk/54c942a970b81c439e1cbdb7187615512198a9af/0_0_4625_3702/500.jpg",
    "summary": "Leeds is looking to improve their standings in the league, while Aston Villa aims to break into the top five. The match-up is highly anticipated. Billy Munday provides the latest updates on both teams' performances.",
    "published": "2025-11-23T13:17:52Z"
  },
  {
    "title": "Bereaved parents face ‘harrowing’ delays for NHS postmorterms",
    "url": "https://www.theguardian.com/society/2025/nov/23/beareaved-parents-face-harrowing-delays-for-nhs-postmorterms",
    "image": "https://media.guim.co.uk/dd8b078db8c3d975b15ca1b697c805eaf608a192/366_0_3333_2667/500.jpg",
    "summary": "The chair of the Royal College of Pathologists committee has warned of a crisis in healthcare services due to a shortage of specialist doctors. This deficit is significantly impacting patient care and service delivery. Urgent action is needed to address the growing gap in specialist medical professionals.",
    "published": "2025-11-23T13:03:05Z"
  }
]