[
  {
    "title": "England chasing 320 to beat South Africa: Women’s Cricket World Cup semi-final – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/29/england-v-south-africa-womens-cricket-world-cup-semi-final-live",
    "image": "https://media.guim.co.uk/d2d75918abc841faa0ab0d64a64219a395b5722c/778_123_1158_927/500.jpg",
    "summary": "England is set to chase a challenging target of 320 runs after South Africa's Laura Wolvaardt scored an impressive 169 runs. The match has intensified with England's innings underway. Tune in for an over-by-over report as the game unfolds.",
    "published": "2025-10-29T15:22:38Z"
  },
  {
    "title": "Voting under way in Netherlands parliamentary election – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/oct/29/netherlands-parliamentary-election-geert-wilders-europe-latest-news-updates",
    "image": "https://media.guim.co.uk/9964bdaa150516fc5de5b166ea337859a6a3eef1/0_606_6442_5154/500.jpg",
    "summary": "Polls indicate that Geert Wilders' far-right Freedom Party (PVV) may secure the top position in upcoming elections. This vote was prompted by Wilders' decision to exit a right-wing coalition in June. The political landscape is shifting in favor of the PVV as the elections approach.",
    "published": "2025-10-29T15:19:08Z"
  },
  {
    "title": "Labour MPs furious after being told to abstain on Farage’s 10-minute rule bill proposing ECHR withdrawal – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/oct/29/shabana-mahmood-home-office-immigration-pmqs-labour-keir-starmer-kemi-badenoch-conservatives-uk-politics-live-news",
    "image": "https://media.guim.co.uk/09245e6279f27cb50c4ff8a126094c43766d4d7b/563_0_1685_1348/500.jpg",
    "summary": "Labour MPs are worried that their decision to abstain from a vote may signal a lack of commitment to key issues, suggesting that only the Liberal Democrats and Greens are genuinely concerned. This concern arises from the fear of losing public perception and support on critical matters. The situation highlights internal party tensions regarding strategy and representation on pressing issues.",
    "published": "2025-10-29T15:16:59Z"
  },
  {
    "title": "CBS News staffers to be laid off as part of massive round of cuts from Paramount",
    "url": "https://www.theguardian.com/media/2025/oct/29/cbs-news-layoffs-paramount",
    "image": "https://media.guim.co.uk/97fa3e8309f3bf8182a9747d8333ca4d3d503cca/480_0_3334_2667/500.jpg",
    "summary": "Paramount plans to lay off approximately 1,000 employees on Wednesday as part of a broader strategy to reduce costs. This move is aimed at streamlining operations amidst financial pressures. The layoffs reflect ongoing challenges within the media industry.",
    "published": "2025-10-29T15:16:08Z"
  },
  {
    "title": "Hurricane Melissa live updates: hundreds of thousands evacuated as Cuba faces 120mph winds; disaster area declared in Jamaica",
    "url": "https://www.theguardian.com/world/live/2025/oct/29/hurricane-melissa-live-updates-strengthens-cuba-extensive-damage-parts-of-jamaica",
    "image": "https://media.guim.co.uk/db17c9f0ab5c21cd3a7f112ff55a697bb70dc87b/158_0_2245_1796/500.jpg",
    "summary": "A powerful storm has struck Cuba, prompting urgent warnings about potentially life-threatening flooding. Meanwhile, Jamaica has experienced significant destruction due to the storm's impact. Authorities are on high alert as the storm continues to pose risks to the affected regions.",
    "published": "2025-10-29T15:14:20Z"
  }
]