[
  {
    "title": "Southampton name Tonda Eckert as manager after successful interim spell",
    "url": "https://www.theguardian.com/football/2025/dec/05/southampton-name-tonda-eckert-as-manager-after-successful-interim-spell",
    "image": "https://media.guim.co.uk/052aa00428efcd8ca752c89417ca3611188439ab/766_156_4619_3695/500.jpg",
    "summary": "Southampton has announced the appointment of Tonda Eckert, the club's under-21 coach, as their new manager. He has signed a contract that will keep him at the club until 2027. This move marks a significant step in Eckert's coaching career.",
    "published": "2025-12-05T23:16:40Z"
  },
  {
    "title": "‘No mistrust’ between Europe and US over Ukraine, Macron says",
    "url": "https://www.theguardian.com/world/2025/dec/05/no-mistrust-between-europe-and-us-over-ukraine-macron-says",
    "image": "https://media.guim.co.uk/17ed87370a7f7a8356acf0be553d91b5967b300c/1295_340_3602_2882/500.jpg",
    "summary": "French President Emmanuel Macron addressed concerns about the U.S. commitment to Ukraine, emphasizing solidarity with Kyiv. His comments followed a report suggesting he cautioned that Washington might not uphold its support. The remarks highlight ongoing anxieties regarding international alliances amid the conflict.",
    "published": "2025-12-05T23:13:24Z"
  },
  {
    "title": "Kendrick Lamar review – with Doechii revving up the crowd, this is an extraordinary show for the ages",
    "url": "https://www.theguardian.com/music/2025/dec/06/kendrick-lamar-aami-park-malbourne-review-doechii-extraordinary-show",
    "image": "https://media.guim.co.uk/2b201756ee894ee7441c282d240cddd1a59751a7/659_1520_4978_3982/500.jpg",
    "summary": "The rap scene shines as the \"swamp princess\" captivates the audience with her performance, showcasing her talent. Lamar follows with an electrifying display of pyrotechnics, adding flair to the event. Meanwhile, Drake delivers a pointed diss, heightening the competitive atmosphere among artists.",
    "published": "2025-12-05T23:00:37Z"
  },
  {
    "title": "How many spiders and pseudoscorpions does it take to make one of the world’s greatest taxonomists?",
    "url": "https://www.theguardian.com/science/2025/dec/05/legacy-one-of-worlds-greatest-taxonomists-perth",
    "image": "https://media.guim.co.uk/3960e7eb48ab5be95e69d96a8f6e07844502611a/443_0_4433_3546/500.jpg",
    "summary": "Mark Harvey, a former Perth curator, has identified over 1,000 new species, primarily focusing on arachnids. His contributions to the field are deemed 'unquantifiable' by colleagues. Harvey's work places him among a select few globally with such a significant discovery record.",
    "published": "2025-12-05T23:00:36Z"
  },
  {
    "title": "From man babies to giant pregnant women: star sculptor Ron Mueck’s larger than life Sydney exhibition ",
    "url": "https://www.theguardian.com/artanddesign/2025/dec/06/sculptor-ron-mueck-new-exhibition-sydney-art-gallery-new-south-wales",
    "image": "https://media.guim.co.uk/8573ea3f6d85a3f1e3eb753b275ab41cebd81b5e/128_0_3016_2414/500.jpg",
    "summary": "The Art Gallery of New South Wales is hosting the largest Australian exhibition of an expat artist and former puppet maker. The exhibition features a blend of popular past works and impressive new creations. Visitors can expect a captivating showcase that highlights the artist's evolution and creativity.",
    "published": "2025-12-05T23:00:36Z"
  }
]