[
  {
    "title": "Australia news live: Greens say climate report a ‘wake-up call’ for Labor ahead of 2035 target decision",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/15/australia-news-live-updates-albanese-png-climate-crisis-defence-rooftop-solar-power-energy-politics-ntwnfb",
    "image": "https://media.guim.co.uk/8bf56cc749e2edd0dd2c08eba7fda23d3f22873c/670_0_5913_4730/500.jpg",
    "summary": "Sure! Please provide the news article or information you would like summarized.",
    "published": "2025-09-15T04:34:24Z"
  },
  {
    "title": "Country diary: Mussels and salmon in a most fragile harmony | Mary Montague",
    "url": "https://www.theguardian.com/environment/2025/sep/15/country-diary-mussels-and-salmon-in-a-most-fragile-harmony",
    "image": "https://media.guim.co.uk/d823d2c3d29334920c232b7f5dd7ab62d619a9c3/41_0_2183_1746/500.jpg",
    "summary": "Freshwater pearl mussels thrive in the Owenkillew River, County Tyrone, playing a crucial role in water purification. Their presence helps restore the ecosystem and promotes the return of their host species. Conservation efforts are essential to protect these vital populations.",
    "published": "2025-09-15T04:30:52Z"
  },
  {
    "title": "Hannah Einbinder and Javier Bardem among Emmy stars to call for Gaza ceasefire",
    "url": "https://www.theguardian.com/tv-and-radio/2025/sep/15/emmys-2025-israel-gaza-speeches-hannah-einbinder-javier-bardem",
    "image": "https://media.guim.co.uk/72494d9f6b598072f55bdd0fed2c45539f1908af/0_103_3381_2705/500.jpg",
    "summary": "In her Emmys acceptance speech, \"Hacks\" star Hannah Einbinder advocated for a free Palestine, stating she felt a duty to differentiate between Jewish people and the actions of the state of Israel. Her comments have sparked discussions surrounding the complexities of identity and political statements. Einbinder emphasizes the importance of compassion and dialogue amidst ongoing conflicts.",
    "published": "2025-09-15T04:04:38Z"
  },
  {
    "title": "China, climate crisis and Cop31: five takeaways from the Pacific Islands Forum",
    "url": "https://www.theguardian.com/world/2025/sep/15/pacific-islands-forum-pif-2025-five-key-takeaways",
    "image": "https://media.guim.co.uk/0d10fee4245aacdecaf74ae9169defeb39b3b95f/229_0_1956_1565/500.jpg",
    "summary": "Pacific leaders have supported Australia's bid to host COP31, despite concerns over its environmental policies. This support comes alongside the establishment of a crucial treaty for funding addressing the climate crisis. The move highlights a complex balance between regional partnerships and environmental accountability.",
    "published": "2025-09-15T04:02:37Z"
  },
  {
    "title": "Gout Gout says he is ‘ready to rumble’ ahead of World Athletics Championships debut",
    "url": "https://www.theguardian.com/sport/2025/sep/15/gout-gout-race-world-athletics-championships-debut",
    "image": "https://media.guim.co.uk/4de4b25c41a39c22e595fee9f23d89269d7f44bf/308_0_2468_1975/500.jpg",
    "summary": "Australian teenage sprint sensation Gout Gout is poised for his international debut on Wednesday. He expressed confidence, stating his legs are \"ready to rumble.\" Excitement surrounds his entry into the competitive sprinting scene.",
    "published": "2025-09-15T04:01:02Z"
  }
]