[
  {
    "title": "Chelsea 3-0 Wolves: Premier League – live reaction",
    "url": "https://www.theguardian.com/football/live/2025/nov/08/chelsea-v-wolves-premier-league-live",
    "image": "https://media.guim.co.uk/abf6e6dc427ffafab452d669ee21663365418b59/568_174_4264_3413/500.jpg",
    "summary": "In a turnaround after a disappointing first half marked by boos, the hosts secured a victory against their visitors with second-half goals from Malo Gusto, Joao Pedro, and Pedro Neto. The match showcased a strong performance from the home team after a lackluster start. The final score reflected their improved play in the second half.",
    "published": "2025-11-08T22:10:28Z"
  },
  {
    "title": "Malo Gusto’s first professional goal sets up Chelsea cruise past winless Wolves",
    "url": "https://www.theguardian.com/football/2025/nov/08/chelsea-wolves-premier-league-match-report",
    "image": "https://media.guim.co.uk/25f551ecf440f9620a5fb931ad2a1ea6361ebb9e/1065_319_4384_3508/500.jpg",
    "summary": "Chelsea secured a convincing 3-0 home victory against Wolves in the Premier League. João Pedro and Pedro Neto both scored, with Neto facing his former club. The win strengthens Chelsea's position in the league.",
    "published": "2025-11-08T22:07:04Z"
  },
  {
    "title": "Russian missile attacks on Ukrainian energy facilities kill at least seven",
    "url": "https://www.theguardian.com/world/2025/nov/08/russia-ukraine-drone-missile-attacks-energy-infrastructure-casualties",
    "image": "https://media.guim.co.uk/2f966ab2ba850888050940628e63df1080fd6dc5/831_0_4169_3334/500.jpg",
    "summary": "Ukrainian President Volodymyr Zelenskyy has urged for increased sanctions against Moscow following a significant attack involving 45 missiles and 450 drones targeted at Ukraine. He emphasizes the need for stronger international measures to counteract Russian aggression. The escalation highlights ongoing tensions and the urgency for global support for Ukraine.",
    "published": "2025-11-08T22:01:20Z"
  },
  {
    "title": "Freewheeling England play Fiji at their own game – and win in style | Andy Bull",
    "url": "https://www.theguardian.com/sport/2025/nov/08/england-fiji-autumn-nations-series-rugby-union",
    "image": "https://media.guim.co.uk/d93d24ffac8fd45fad186611d595ba4dac321841/188_0_4445_3556/500.jpg",
    "summary": "Steve Borthwick's team showcased impressive skills by responding to a classic try with a brilliant one of their own. Their performance highlighted their readiness and talent on the field. The match underscored their ability to adapt and excel in dynamic situations.",
    "published": "2025-11-08T21:38:21Z"
  },
  {
    "title": "Senate Republicans embrace Trump’s call – from his Florida golf course – to replace Obamacare",
    "url": "https://www.theguardian.com/us-news/2025/nov/08/senate-republicans-trump-obamacare",
    "image": "https://media.guim.co.uk/ed706d98e3ba028513a2757a07fa07d2b926517d/1692_1623_2531_2025/500.jpg",
    "summary": "Amid a historic government shutdown, some senators are dedicating their weekend to negotiating an unpopular bill. The shutdown has created urgency in addressing funding issues and legislative priorities. Tensions and public discontent continue to rise as the deadline approaches.",
    "published": "2025-11-08T21:31:37Z"
  }
]