[
  {
    "title": "No early election despite Rayner resignation and Farage claims, says prime minister’s key adviser – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/06/no-early-election-angela-rayner-resignation-nigel-farage-reform-uk-politics-live-news-latest",
    "image": "https://media.guim.co.uk/ef89e6d973b2d1173f1dff0d29de38013d336ef3/393_0_3928_3143/500.jpg",
    "summary": "Darren Jones, the chief secretary, stated that the resignation of Rayner accelerated a planned reshuffle within the Labour party. He emphasized that there is no division within the party despite the changes. The reshuffle aims to strengthen the party's position moving forward.",
    "published": "2025-09-06T11:19:59Z"
  },
  {
    "title": "World Cup qualifying buildup to England v Andorra, WSL Q&A  and Football League – matchday live",
    "url": "https://www.theguardian.com/football/live/2025/sep/06/world-cup-qualifying-buildup-to-england-v-andorra-wsl-qa-and-football-league-matchday-live",
    "image": "https://media.guim.co.uk/6bbdd2e6e47c70dd6499708786934a74327eed03/0_0_5000_4000/500.jpg",
    "summary": "Key updates in football include crucial World Cup qualifying matches and the buildup to upcoming Women's Super League (WSL) games scheduled for Saturday. Teams are finalizing their preparations as they aim for important victories. Fans are eagerly anticipating the performances of their favorite players in these competitive fixtures.",
    "published": "2025-09-06T11:18:55Z"
  },
  {
    "title": "One year after Ayşenur Ezgi Eygi was killed, the US has not investigated. Her family wants answers",
    "url": "https://www.theguardian.com/us-news/2025/sep/06/aysenur-ezgi-eygi-west-bank",
    "image": "https://media.guim.co.uk/a1cd411fd6edad825b44e42cc175e95bc1d9a231/182_0_1236_989/500.jpg",
    "summary": "A 26-year-old American Turkish woman was shot in the head by an Israeli sniper in the West Bank on September 6, 2024. The incident has raised concerns about violence in the region. Further investigations and reactions are expected in response to her shooting.",
    "published": "2025-09-06T11:00:51Z"
  },
  {
    "title": "‘Food is political’: the TikTok star shining a light on South African cuisine’s hidden gems",
    "url": "https://www.theguardian.com/world/2025/sep/06/tiktok-star-nick-hamman-south-african-cuisine-local-food-economy",
    "image": "https://media.guim.co.uk/fc5addd91614729d1aeb7887c4bc631b9ae8c8f8/1146_290_3932_3145/500.jpg",
    "summary": "Nick Hamman aims to boost the local economy by encouraging residents and visitors to explore township barbecues and family-owned sandwich shops. His efforts are focused on promoting community engagement and support for local businesses. Through these initiatives, he hopes to foster a vibrant local dining culture.",
    "published": "2025-09-06T11:00:50Z"
  },
  {
    "title": "How an 18th-century portrait stolen by the Nazis was recovered 80 years later in Argentina",
    "url": "https://www.theguardian.com/world/2025/sep/06/18th-century-portrait-stolen-by-nazis-recovered-in-argentina",
    "image": "https://media.guim.co.uk/5910b252ebddb1b2643061e98d642dd81bae4434/0_378_5350_4279/500.jpg",
    "summary": "A painting by a renowned artist was discovered online by Dutch journalists when the daughter of a former Nazi official listed her house for sale in Mar del Plata. The artwork's revelation has sparked interest due to its historical context. This situation raises ethical questions regarding the sale of art linked to controversial figures.",
    "published": "2025-09-06T11:00:50Z"
  }
]