[
  {
    "title": "US Open tennis 2025: Swiatek and Osaka through, Sinner in action on day five – as it happened",
    "url": "https://www.theguardian.com/sport/live/2025/aug/28/us-open-tennis-2025-swiatek-sinner-osaka-musetti-day-five-live",
    "image": "https://media.guim.co.uk/faf8e797ae61d150d41d911d009565e5bfe1f245/132_0_2988_2390/500.jpg",
    "summary": "Iga Swiatek and Jannik Sinner advance to the third round of their tournament, joined by Naomi Osaka, Lorenzo Musetti, and Andrey Rublev. Each player showcased strong performances to secure their progression. The competition intensifies as these top athletes continue their pursuit of victory.",
    "published": "2025-08-28T20:22:32Z"
  },
  {
    "title": "CDC leaders who quit say ‘get politics out of public health’, hitting out against RFK Jr’s anti-vaccine messaging – live",
    "url": "https://www.theguardian.com/us-news/live/2025/aug/28/cdc-susan-monarez-trump-news-updates-us-politics-live",
    "image": "https://media.guim.co.uk/cb2af99715c9142cb335af8e0b458562b08211b8/608_0_5413_4333/500.jpg",
    "summary": "Daniel Jernigan, Debra Houry, and Demetre Daskalakis, who recently resigned from a public health organization, were celebrated as heroes by supporters at a demonstration outside CDC headquarters. The event highlighted their contributions to public health. Their resignations have sparked discussions about leadership and accountability in health organizations.",
    "published": "2025-08-28T20:13:13Z"
  },
  {
    "title": "Corrections and clarifications",
    "url": "https://www.theguardian.com/news/2025/aug/28/corrections-and-clarifications",
    "summary": "Andrew Bailey, the Governor of the Bank of England, discussed projections for the UK adult population, highlighting trends and potential economic implications. The analysis underscores the importance of demographic changes in shaping monetary policy and addressing future economic challenges. Insights reveal that population dynamics will significantly influence labor markets and economic growth in the coming years.",
    "published": "2025-08-28T20:00:55Z"
  },
  {
    "title": "Police say ‘countless lives’ saved during Minneapolis school shooting due to locked doors",
    "url": "https://www.theguardian.com/us-news/2025/aug/28/minnneapolis-wakes-to-aftermath-of-catholic-school-shooting",
    "image": "https://media.guim.co.uk/c0149b41d2c6de261ec75ad316b78daeeab7f0f3/350_0_2500_2000/500.jpg",
    "summary": "A shooter attempted to enter a church to launch an attack but was thwarted when the doors were locked as mass commenced. Officials reported that the quick action of securing the doors likely prevented a potential tragedy. The incident underscores ongoing concerns about safety in places of worship.",
    "published": "2025-08-28T19:59:06Z"
  },
  {
    "title": "Jay Kelly review – even a George Clooney sizzle reel can’t save this dire Noah Baumbach effort",
    "url": "https://www.theguardian.com/film/2025/aug/28/jay-kelly-review-even-a-george-clooney-sizzle-reel-cant-save-this-dire-noah-baumbach-effort",
    "image": "https://media.guim.co.uk/1a2c3f003273813ec1bc17bdd2ec207952357603/505_0_2537_2030/500.jpg",
    "summary": "In a self-reflective and sentimental narrative, the charming star portrays a version of himself at a Tuscan film festival. The story explores themes of life and career, blending real and fictional elements. It evokes a sense of cine-narcissism as he examines his experiences.",
    "published": "2025-08-28T19:45:01Z"
  }
]