[
  {
    "title": "Reshuffle of junior ministers raises fears over future of Labour’s workers’ rights bill",
    "url": "https://www.theguardian.com/politics/2025/sep/06/reshuffle-of-junior-ministers-raises-fears-over-future-of-labours-workers-rights-bill",
    "image": "https://media.guim.co.uk/c2e8d22909e2d7bcef2080f8b3a9a0aa725e25ac/0_0_1064_850/500.jpg",
    "summary": "Concerns have emerged that a proposed package addressing worker rights may lose its effectiveness following the dismissal of Employment Rights Minister Justin Madders. His removal has raised fears that union allies may be marginalized in the decision-making process. This situation has prompted skepticism about the potential impact of the legislative changes on workers' protections.",
    "published": "2025-09-06T18:35:23Z"
  },
  {
    "title": "Trump’s former surgeon general urges president to fire RFK Jr",
    "url": "https://www.theguardian.com/us-news/2025/sep/06/jerome-adams-trump-surgeon-blasts-rfk-jr",
    "image": "https://media.guim.co.uk/8096b83e324d978808f13b0aae49dd5887d079c0/242_0_3982_3185/500.jpg",
    "summary": "Jerome Adams has criticized the current vaccine policies and the disarray within the CDC, expressing concerns over their impact on public health. He joins other officials in asserting that Robert F. Kennedy Jr.'s actions and rhetoric could jeopardize health efforts in the U.S. The remarks highlight growing tensions regarding vaccine hesitancy and public health communication.",
    "published": "2025-09-06T18:35:03Z"
  },
  {
    "title": "England 2-0 Andorra: World Cup qualifier player ratings for Thomas Tuchel’s side",
    "url": "https://www.theguardian.com/football/2025/sep/06/england-2-0-andorra-world-cup-qualifier-player-ratings-for-thomas-tuchels-side",
    "image": "https://media.guim.co.uk/8916609321240fd0093d9a5299d35f816685a43a/460_0_2918_2335/500.jpg",
    "summary": "Elliot Anderson excelled in his debut for England, earning the title of man of the match. However, overall, the performance of the home team was lackluster, with few players standing out. The match highlighted a disappointing showing despite Anderson's individual success.",
    "published": "2025-09-06T18:29:45Z"
  },
  {
    "title": "England 2-0 Andorra: Rice header helps hosts cruise to win in World Cup 2026 qualifying – as it happened",
    "url": "https://www.theguardian.com/football/live/2025/sep/06/england-v-andorra-world-cup-2026-qualifying-live",
    "image": "https://media.guim.co.uk/839859e33467a30a4b1d5c8877b607550770d745/364_0_2881_2305/500.jpg",
    "summary": "England secured a victory against Andorra with an own goal and a header from Declan Rice. Despite the win, the team struggled to effectively penetrate the opposition's defense. The performance highlighted ongoing challenges in breaking down limited opponents.",
    "published": "2025-09-06T18:24:32Z"
  },
  {
    "title": "England 47-7 Australia: Women’s Rugby World Cup – rugby union as it happened",
    "url": "https://www.theguardian.com/sport/live/2025/sep/06/england-v-australia-womens-rugby-world-cup-rugby-union-live",
    "image": "https://media.guim.co.uk/63f03ebb4348dd75e056dfff2a374b8396592669/11_205_2291_1833/500.jpg",
    "summary": "England's forwards excel in a dominant performance, scoring six of the team's seven tries to defeat Australia. This victory secures their spot in the quarterfinals. They will face Scotland in the next round.",
    "published": "2025-09-06T18:24:03Z"
  }
]