[
  {
    "title": "GSK announces surprise change of CEO; ‘Moral hazard’ fears over Jaguar Land Rover’s £1.5bn government loan guarantee – business live",
    "url": "https://www.theguardian.com/business/live/2025/sep/29/moral-hazard-fears-jlr-jaguar-land-rover-government-loan-gsk-ceo-astrazeneca-listing-dollar-shutdown-business-live-news",
    "image": "https://media.guim.co.uk/93a963962303e4034d3bdd8149d02e3940fdd356/333_0_3333_2668/500.jpg",
    "summary": "Rolling coverage highlights the latest developments in economic and financial news, tracking market trends, policy changes, and economic indicators. It provides real-time updates on stock performance, interest rates, and key government decisions impacting the economy. This ongoing analysis helps investors and the public stay informed about the financial landscape.",
    "published": "2025-09-29T06:29:26Z"
  },
  {
    "title": "Australia news live: cold case closes as coroner finds NSW woman Leisl Smith killed by partner; former Optus CEO gets new top job",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/29/australia-news-live-optus-suffers-fresh-triple-zero-glitch-labors-first-deficit-not-as-bad-as-feared",
    "image": "https://media.guim.co.uk/1e671da8d12229149c2b8632054a43951f0a1cf8/1147_0_5735_4588/500.jpg",
    "summary": "I'm sorry, but I need more specific information or the text of the news article you'd like summarized. Please provide the content or details, and I'll be happy to help!",
    "published": "2025-09-29T06:18:24Z"
  },
  {
    "title": "Can you solve it? Ungoogleable and unhinged – ten hilarious visual teasers",
    "url": "https://www.theguardian.com/science/2025/sep/29/can-you-solve-it-ungoogleable-and-unhinged-ten-hilarious-visual-teasers",
    "image": "https://media.guim.co.uk/2e1e0d381cb25fcc3f0bcbdf457b6840077bed6c/98_304_1625_1300/500.jpg",
    "summary": "\"Riotous rebus riddles\" likely refers to a playful and chaotic collection of visual puzzles that combine words and images to convey humorous or clever meanings. These riddles encourage creative thinking and engagement as participants decode the messages. The trend showcases the joy of wordplay and visual language, making it a popular activity for entertainment or social media.",
    "published": "2025-09-29T06:10:32Z"
  },
  {
    "title": "When Everyone Knows That Everyone Knows by Steven Pinker review – communication breakdown",
    "url": "https://www.theguardian.com/books/2025/sep/29/when-everyone-knows-that-everyone-knows-by-steven-pinker-review-communication-breakdown",
    "image": "https://media.guim.co.uk/86ebfd1d74657b5583c53e58808888fcaf10acc1/828_765_4044_3235/500.jpg",
    "summary": "The article explores the importance of unwritten rules and social contracts in society, highlighting how they provide structure and coherence in interactions. It discusses the consequences that arise when these implicit agreements break down, leading to confusion and conflict. Ultimately, the piece emphasizes the need to understand and uphold these shared norms to maintain social harmony.",
    "published": "2025-09-29T06:00:34Z"
  },
  {
    "title": "A new start after 60: I rented out my flat and bought a bike. Now home is a tent and the open road",
    "url": "https://www.theguardian.com/lifeandstyle/2025/sep/29/a-new-start-after-60-i-rented-out-my-flat-and-bought-a-bike-now-home-is-a-tent-and-the-open-road",
    "image": "https://media.guim.co.uk/f5ee907e2fa47572614f0728ce244c36112c050d/561_0_5611_4489/500.jpg",
    "summary": "Sarah Cook has cycled over 24,000 miles in the past seven years since her departure from England to the US and beyond. Her adventures have spanned multiple countries and landscapes. Cook has no intentions of halting her journey anytime soon.",
    "published": "2025-09-29T06:00:34Z"
  }
]