[
  {
    "title": "House begins debate on release of Epstein files; Mike Johnson says he’ll back release – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/nov/18/house-vote-jeffrey-epstein-files-donald-trump-republicans-democrats-us-politics-live-news",
    "image": "https://media.guim.co.uk/160648c5e628d6c1d5463a797c324c36b335584b/329_0_3110_2488/500.jpg",
    "summary": "Donald Trump has changed his stance and no longer opposes the release of documents related to the late convicted sex offender Jeffrey Epstein. This decision has paved the way for a potential vote on the matter. The move could bring new information to light regarding Epstein and his connections.",
    "published": "2025-11-18T19:15:27Z"
  },
  {
    "title": "England turn to Noah Caluori for Argentina Test after triple injury blow",
    "url": "https://www.theguardian.com/sport/2025/nov/18/england-noah-caluori-argentina-test-triple-injury-blow",
    "image": "https://media.guim.co.uk/1cb64d9cc980e3436bc8b26524aa8d30d23609f9/469_0_4690_3752/500.jpg",
    "summary": "England has suffered a major setback ahead of their Test match against Argentina, as Ollie Lawrence, Jamie George, and Tom Roebuck have all been ruled out due to injuries. This triple injury blow poses a challenge for the team's preparation and strategy. The absence of these key players will impact England's lineup for the upcoming match.",
    "published": "2025-11-18T19:11:35Z"
  },
  {
    "title": "Scotland v Denmark: World Cup 2026 qualifying – live",
    "url": "https://www.theguardian.com/football/live/2025/nov/18/scotland-v-denmark-world-cup-2026-qualifying-live",
    "image": "https://media.guim.co.uk/36462bea07b6b7ddbd14db5157f9849d00948198/761_0_4927_3943/500.jpg",
    "summary": "Scotland and Denmark face off at Hampden Park in a crucial match where the winner secures automatic qualification for the World Cup. The event is being reported minute-by-minute by Rob Smyth. Both teams are vying for a coveted spot on the world stage.",
    "published": "2025-11-18T19:11:24Z"
  },
  {
    "title": "Trump defends Saudi crown prince over Khashoggi killing, claiming he ‘knew nothing about it’ and ‘things happen’ - live",
    "url": "https://www.theguardian.com/world/live/2025/nov/18/donald-trump-mbs-saudi-arabia-meeting-f35-jets-latest",
    "image": "https://media.guim.co.uk/eff19c5c7096d3aaa8a77b9b3a71cc515d836b96/688_0_4335_3468/500.jpg",
    "summary": "President Biden contradicted U.S. intelligence reports regarding the killing of a regime critic during a meeting with Saudi Crown Prince Mohammed bin Salman in the Oval Office. Biden's comments raised questions about the reliability of the intelligence community's assessments. The discussion highlights ongoing tensions between U.S. diplomatic relations and human rights concerns in the region.",
    "published": "2025-11-18T19:07:23Z"
  },
  {
    "title": "Cop30 live: Ministers from global north and south unite in call for a roadmap away from fossil fuels",
    "url": "https://www.theguardian.com/environment/live/2025/nov/18/cop30-climate-protests-latest-news-live-updates-brazil-belem",
    "image": "https://media.guim.co.uk/33adf97862b2e7d19e9ee3ffa319b4def763fe53/458_0_4583_3667/500.jpg",
    "summary": "Representatives from Germany, the UK, the Marshall Islands, and several other nations convened to advocate for a comprehensive roadmap to transition away from fossil fuels. The initiative aims to address climate change and promote sustainable energy practices. This collaborative effort underscores the growing urgency for global action on environmental issues.",
    "published": "2025-11-18T19:05:56Z"
  }
]