[
  {
    "title": "Merseyside derby in WSL, England reaction and Germany v Northern Ireland – matchday live",
    "url": "https://www.theguardian.com/football/live/2025/sep/07/merseyside-derby-in-wsl-england-reaction-and-germany-v-northern-ireland-matchday-live",
    "image": "https://media.guim.co.uk/3342438d93190f4f8805a32db14d81dc78d896c6/0_0_5000_4000/500.jpg",
    "summary": "The latest football news highlights an exciting week in the Women's Super League (WSL) as teams prepare for tightly-scheduled matches. Additionally, Northern Ireland's national team gears up for a challenging World Cup qualifier against Germany. Fans can anticipate thrilling matches and significant moments in both leagues.",
    "published": "2025-09-07T08:33:50Z"
  },
  {
    "title": "Ministers considering human rights reform in bid to head off Reform as defence secretary say Starmer going ‘up a gear’ – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/07/latest-live-uk-politics-news-updates-keir-starmer-labour-nigel-farage-kemi-badenoch-angela-rayner-updates",
    "image": "https://media.guim.co.uk/6a5c9e37c5a858ad84046dc71d429eff06407f08/0_296_3168_2534/500.jpg",
    "summary": "New home secretary Shabana Mahmood plans to relocate asylum seekers currently housed in hotels to barracks. This move aims to address accommodation shortages and manage the growing number of asylum applications. Mahmood's announcement is part of a broader strategy to revamp the UK's immigration system.",
    "published": "2025-09-07T08:32:57Z"
  },
  {
    "title": "From pop producer to activist: Robin Millar on the barriers disabled people still face",
    "url": "https://www.theguardian.com/world/2025/sep/07/from-pop-producer-to-activist-robin-millar-on-the-barriers-disabled-people-still-face",
    "image": "https://media.guim.co.uk/745aac72ff27d1e59bb90a916efc41b2d2cfa2ea/699_0_6827_5464/500.jpg",
    "summary": "The chair of Scope, a disability charity, aims to reshape societal perceptions of disability, leveraging his experience as a successful musician known for chart-topping hits. His focus is on promoting inclusivity and challenging stereotypes surrounding disabled individuals. Through advocacy and awareness efforts, he seeks to foster a more positive and understanding view of disability in society.",
    "published": "2025-09-07T08:00:16Z"
  },
  {
    "title": "‘There is only one player’: why China is becoming a world leader in green energy",
    "url": "https://www.theguardian.com/environment/2025/sep/07/china-fossil-fuel-us-climate-environment-energy",
    "image": "https://media.guim.co.uk/e15ae8a33c3fce2a09a434aa480021c97716990d/625_0_3750_3000/500.png",
    "summary": "The U.S. has failed to meet its climate pledges, raising concerns about global efforts to combat climate change. China's actions in response to this crisis will significantly influence international relations and future environmental policies. The outcome will be critical for global geopolitics and the planet's sustainability.",
    "published": "2025-09-07T08:00:15Z"
  },
  {
    "title": "Brainless bodies and pig organs: does science back up Putin and Xi’s longevity claims?",
    "url": "https://www.theguardian.com/science/2025/sep/07/science-putin-xi-longevity-immortality-get-younger-organ-claims",
    "image": "https://media.guim.co.uk/628d6012e1b0faa050e43a4e61a4e684c3555bf5/224_0_4167_3333/500.jpg",
    "summary": "Russian leader's assertion that repeated organ transplants can make people \"get younger\" has sparked skepticism and concern among experts. This unconventional claim challenges established medical understanding and raises ethical questions. Critics emphasize the risks and limitations associated with organ transplants.",
    "published": "2025-09-07T08:00:14Z"
  }
]