[
  {
    "title": "Tottenham v Brentford, Manchester City v Sunderland, and more: football – live",
    "url": "https://www.theguardian.com/football/live/2025/dec/06/tottenham-v-brentford-manchester-city-v-sunderland-and-more-football-live",
    "image": "https://media.guim.co.uk/b84276e759f65d8d2de5a25eefd2c7277aeac0f9/359_345_3293_2635/500.jpg",
    "summary": "John Brewin will provide live updates on goals and key actions from the Premier League and other matches during the 3pm kick-offs. Stay tuned for real-time coverage of the exciting football action. Don’t miss any critical moments from the games.",
    "published": "2025-12-06T16:23:21Z"
  },
  {
    "title": "‘Don’t say we didn’t warn you’: Beijing tells Hong Kong foreign media not to cause trouble after fire",
    "url": "https://www.theguardian.com/news/2025/dec/06/dont-say-we-didnt-warn-you-beijing-summons-journalists-in-hong-kong-after-fire",
    "image": "https://media.guim.co.uk/4ec5c1f6c7d90ddd48fcf05a505dab318b051aa6/27_0_3822_3058/500.jpg",
    "summary": "A security agency has criticized international journalists for allegedly misrepresenting facts and engaging in defamatory reporting about the government. The agency claims that such actions undermine the credibility of news coverage. The statement highlights tensions between authorities and the media over reporting practices.",
    "published": "2025-12-06T16:22:53Z"
  },
  {
    "title": "Leeds United v Liverpool: Premier League – live ",
    "url": "https://www.theguardian.com/football/live/2025/dec/06/leeds-v-liverpool-premier-league-live",
    "image": "https://media.guim.co.uk/4957a524ccf1849349c648a28038cf226d5809cc/217_0_3737_2989/500.jpg",
    "summary": "The defending champions are set to visit Elland Road, facing challenges in their current performance. Scott Murray will provide live updates on the match. Fans are eager to see how the team will perform against their opponents.",
    "published": "2025-12-06T16:22:43Z"
  },
  {
    "title": "Charlton’s match against Portsmouth abandoned after supporter’s death",
    "url": "https://www.theguardian.com/football/2025/dec/06/charlton-portsmouth-abandoned-championship-leicester-derby-watford-norwich-football",
    "image": "https://media.guim.co.uk/577317e48da5f88ad5ab1a014ccc9331bf6af36d/0_0_4655_3724/500.jpg",
    "summary": "The Championship match between Charlton and Portsmouth was abandoned due to the tragic death of a fan at the Valley. The incident prompted immediate action, prioritizing the safety and well-being of those at the event. Support and condolences have since been extended to the affected family and the football community.",
    "published": "2025-12-06T16:14:02Z"
  },
  {
    "title": "Reform UK gains its first peer after Conservative party defection",
    "url": "https://www.theguardian.com/politics/2025/dec/06/reform-uk-gains-its-first-peer-after-conservative-party-defection-malcolm-offord",
    "image": "https://media.guim.co.uk/3a68f034deffc6832a357bd9a01394fff62bf772/421_13_4334_3468/500.jpg",
    "summary": "Malcolm Offord has joined Reform UK, with party leader Nigel Farage announcing his recruitment in Falkirk. Offord's addition is part of the party's efforts to strengthen its position. This move highlights the party's ongoing expansion and strategy ahead of upcoming political challenges.",
    "published": "2025-12-06T16:08:56Z"
  }
]