[
  {
    "title": "Trump says he doesn’t think Ukraine will win back land taken by Russia during war – live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/20/james-comey-donald-trump-charges-shutdown-albanese-politics-live-updates",
    "image": "https://media.guim.co.uk/573f5205b5354a03231ed58da798edfec5f7ff13/66_145_3777_3024/500.jpg",
    "summary": "US President highlights unpredictability in the Russia-Ukraine war during a meeting with the Australian Prime Minister. The two leaders have signed a deal focused on rare earth minerals, emphasizing their strategic partnership. This agreement aims to strengthen supply chains and enhance economic cooperation between the nations.",
    "published": "2025-10-20T18:29:43Z"
  },
  {
    "title": "Amazon battles to fix Web Services outage after millions of users report disruption to websites and apps – business live",
    "url": "https://www.theguardian.com/business/live/2025/oct/20/china-economic-growth-gdp-low-house-prices-fall-stock-markets-ftse-business-live-news",
    "image": "https://media.guim.co.uk/ad093e8329a29aecba6f1623b63fcffeb49c4113/368_0_3879_3106/500.jpg",
    "summary": "Several popular online services, including Fortnite, Roblox, SnapChat, Lloyds Bank, and Ring doorbells, experienced significant outages. Users reported difficulties accessing these platforms, causing disruptions in service. The cause of the outage has not yet been publicly detailed.",
    "published": "2025-10-20T18:24:41Z"
  },
  {
    "title": "China spy case gives MPs the opportunity to discuss their favourite topic: themselves | John Crace",
    "url": "https://www.theguardian.com/politics/2025/oct/20/china-spy-case-gives-mps-the-opportunity-to-discuss-their-favourite-topic-themselves",
    "image": "https://media.guim.co.uk/e8f249b15064bc546f64406f13f4c5805c395dfd/439_0_4643_3714/500.jpg",
    "summary": "The case has escalated to a national security concern due to allegations of espionage involving two Conservative MPs. This involvement of government officials heightens the seriousness of the situation. As the investigation unfolds, it raises significant implications for political integrity and security.",
    "published": "2025-10-20T18:24:23Z"
  },
  {
    "title": "West Ham v Brentford: Premier League – live",
    "url": "https://www.theguardian.com/football/live/2025/oct/20/west-ham-v-brentford-premier-league-live",
    "image": "https://media.guim.co.uk/dd4638f6909e7e7e15d35e489a0391f235eeebcf/617_0_6880_5504/500.jpg",
    "summary": "In a highly anticipated east versus west London derby, hosts are seeking their first home points of the season. The match is being reported minute-by-minute by Niall McVeigh. Fans are eager to see how the teams perform in this competitive clash.",
    "published": "2025-10-20T18:19:00Z"
  },
  {
    "title": "Starmer’s grooming gang inquiry left in turmoil after two survivors quit panel",
    "url": "https://www.theguardian.com/society/2025/oct/20/starmer-grooming-gang-inquiry-left-in-turmoil-after-two-survivors-quit-panel",
    "image": "https://media.guim.co.uk/5d1371cb8bb8342cca688cc65ad52565b2fd40b8/88_439_3003_2402/500.jpg",
    "summary": "Fiona Goddard and Ellie-Ann Reynolds have expressed concerns over the management of a national inquiry, highlighting delays and a lack of leadership. They pointed out that the inquiry has not yet appointed a chair, causing frustration and uncertainty. Their criticism underscores the urgent need for effective oversight in the inquiry process.",
    "published": "2025-10-20T18:03:58Z"
  }
]