[
  {
    "title": "Israel warned not to annex parts of West Bank in response to recognition of Palestinian state – Middle East crisis live",
    "url": "https://www.theguardian.com/world/live/2025/sep/22/palestinian-state-gaza-israel-middle-east-hamas-benjamin-netanyahu-latest-live-updates",
    "image": "https://media.guim.co.uk/b3e994dcbc1989bd01ae3af5616680d9708aaf72/11_0_4458_3566/500.jpg",
    "summary": "On Sunday, the UK, Australia, Canada, and Portugal officially recognized Palestinian statehood, marking a significant diplomatic move. France is also expected to follow suit in granting similar recognition. This development reflects growing international support for Palestinian statehood amidst ongoing conflicts in the region.",
    "published": "2025-09-22T17:30:21Z"
  },
  {
    "title": "Lawmakers decry Trump’s pressure campaign on justice department to investigate his political opponents – live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/22/donald-trump-charlie-kirk-autism-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/654e1502c2ebbcd6a0e9e4aabe463a0b8d3143b8/677_0_7200_5760/500.jpg",
    "summary": "Republicans and Democrats have criticized Donald Trump's request for the attorney general to investigate his political opponents, including Letitia James, Adam Schiff, and James Comey. Both parties expressed concerns over the implications of such a demand on political norms and justice. The bipartisan backlash highlights a growing unease about the politicization of legal investigations.",
    "published": "2025-09-22T17:29:01Z"
  },
  {
    "title": "British-Egyptian activist Alaa Abd el-Fattah to be freed from prison",
    "url": "https://www.theguardian.com/world/2025/sep/22/british-egyptian-activist-alaa-abd-el-fattah-to-be-freed-from-prison",
    "image": "https://media.guim.co.uk/acdabbdbe0d492bda8983086c5a149625e8adb2b/746_0_3008_2407/500.jpg",
    "summary": "A writer who spent six years in prison for sharing a Facebook post has received a presidential pardon. The decision highlights issues surrounding freedom of expression and the consequences of social media use. The pardon allows the writer to reintegrate into society without the burden of a criminal record.",
    "published": "2025-09-22T17:26:38Z"
  },
  {
    "title": "We will confront Russian planes in Nato airspace, UK foreign secretary says, and warns Putin risks armed clash – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/sep/22/latest-europe-news-russia-estonia-un-united-nations-security-live-latest-updates",
    "image": "https://media.guim.co.uk/a034a60ee7b98731cd7869d36b73098b6855408f/488_0_4210_3368/500.jpg",
    "summary": "Yvette Cooper has accused Russia of threatening the sovereignty of nations in Europe through its incursions by fighter jets. She emphasized that these actions undermine the territorial integrity of affected countries. Cooper's remarks highlight ongoing concerns about regional security amid rising tensions with Russia.",
    "published": "2025-09-22T17:26:30Z"
  },
  {
    "title": "Race-fixing cases a reminder of skullduggery that has stained horse racing",
    "url": "https://www.theguardian.com/sport/blog/2025/sep/22/race-fixing-cases-a-reminder-of-skullduggery-that-has-stained-horse-racing-talking-horses",
    "image": "https://media.guim.co.uk/b8699fc65c43637ce3a7247ff8420150ecf6b412/819_406_3013_2411/500.jpg",
    "summary": "The Hillsin affair highlights the challenges of executing a conspiracy to hinder a runner successfully. While plotting such actions may be feasible, evading consequences proves to be more complex. Ultimately, the incident underscores the difficulties of carrying out and escaping accountability for unethical plans.",
    "published": "2025-09-22T17:26:13Z"
  }
]