[
  {
    "title": "Australia news live: RBA holds interest rate at 3.6% as Chalmers acknowledges many homeowners may be disappointed",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/30/australia-news-live-albanese-supermarket-united-arab-emirates-uae-coalition-sussan-ley-andrew-hastie-reserve-bank-rba-chalmers-interest-rates-decision-ntwnfb",
    "image": "https://media.guim.co.uk/f68bdbfd771f72fd50fa1527805a69bd9f4f9d04/671_357_6428_5142/500.jpg",
    "summary": "Please provide the specific news article or details you'd like summarized, and I'll be happy to help!",
    "published": "2025-09-30T05:18:33Z"
  },
  {
    "title": "Georgina Hayden’s recipe for cavolo nero risotto",
    "url": "https://www.theguardian.com/food/2025/sep/30/cavolo-nero-risotto-recipe-georgina-hayden",
    "image": "https://media.guim.co.uk/ba971a235fae945d7b4046f91dd89b06cd8fa3cd/214_2031_3833_3067/500.jpg",
    "summary": "Introducing \"monster sauce,\" a delicious new condiment that enhances cavolo nero dishes. It's perfect for tossing with pasta and mixing into a flavorful risotto. This versatile sauce is set to become your new favorite addition to meals.",
    "published": "2025-09-30T05:00:48Z"
  },
  {
    "title": "Biomethane not viable for widespread use in UK home heating, report finds",
    "url": "https://www.theguardian.com/environment/2025/sep/30/biomethane-not-viable-for-widespread-use-in-uk-home-heating-report-finds",
    "image": "https://media.guim.co.uk/cbe0fe27ea4cab75e5827c3f4280e7ac4973d945/681_0_6830_5464/500.jpg",
    "summary": "A new study reveals that gas produced from agricultural waste is projected to fulfill only 18% of the gas demand by 2050. This finding contradicts assertions made by fossil fuel advocates about the potential of bioenergy. The research highlights the limited capacity of farm waste-derived gas in addressing future energy needs.",
    "published": "2025-09-30T05:00:48Z"
  },
  {
    "title": "Now we know what patriotism means to Shabana Mahmood – can she harness that to unite rather than divide us? | Gaby Hinsliff",
    "url": "https://www.theguardian.com/commentisfree/2025/sep/30/shabana-mahmood-labour-conference-immigration",
    "image": "https://media.guim.co.uk/0414c19d72a249c412526994fab75b7dd4939e03/110_0_2332_1867/500.jpg",
    "summary": "Home Secretary is shifting the focus of the ongoing debate towards themes of integration and belonging, according to Guardian columnist Gaby Hinsliff. This pivot aims to address issues surrounding community cohesion and identity. Hinsliff highlights the importance of fostering a sense of belonging in current societal discussions.",
    "published": "2025-09-30T05:00:48Z"
  },
  {
    "title": "Ukraine war briefing: Europe ‘no longer at peace’ with Russia, says German chancellor",
    "url": "https://www.theguardian.com/world/2025/sep/30/ukraine-war-briefing-europe-no-longer-at-peace-with-russia-says-german-chancellor",
    "image": "https://media.guim.co.uk/73400961680c199c75f025f7b7d63dd4617bb672/341_0_4836_3868/500.jpg",
    "summary": "Germany has affirmed its commitment to defend the Baltic region amidst rising tensions. Meanwhile, Hungarian Prime Minister Viktor Orbán controversially stated that Ukraine is \"not a sovereign country.\" These developments unfold on the 1,315th day of the ongoing conflict in Ukraine.",
    "published": "2025-09-30T04:59:56Z"
  }
]