[
  {
    "title": "India v New Zealand: Women’s Cricket World Cup – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/23/india-v-new-zealand-womens-cricket-world-cup-live",
    "image": "https://media.guim.co.uk/208c46341f5409bd4da4c346d527d6711fc0126a/235_0_2032_1626/500.jpg",
    "summary": "India seeks to secure the final semi-final spot in the tournament after suffering three consecutive defeats. A win in their upcoming match is crucial for the hosts to advance. Follow our writers for live updates on the game.",
    "published": "2025-10-23T10:19:22Z"
  },
  {
    "title": "Israel’s West Bank annexation moves threatening Gaza peace deal, says Marco Rubio – Middle East live",
    "url": "https://www.theguardian.com/world/live/2025/oct/23/israel-west-bank-gaza-rubio-middle-east-latest-news-updates",
    "image": "https://media.guim.co.uk/35ccc57c7099b61bd464feeaa638672f83a8336f/904_58_4152_3322/500.jpg",
    "summary": "The US Secretary of State criticized the Knesset's votes on imposing sovereignty in Israel, labeling them as \"counterproductive.\" His remarks came during the start of his two-day visit to the country. The comments reflect ongoing tensions regarding Israeli policies and their implications for peace efforts.",
    "published": "2025-10-23T10:14:15Z"
  },
  {
    "title": "Australia v India: second men’s one-day international – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/23/australia-v-india-cricket-odi-live-scores-aus-vs-ind-scorecard-second-mens-one-day-international",
    "image": "https://media.guim.co.uk/78f25461fbf0a1994ec9d034ff32f308fac545de/105_0_2755_2205/500.jpg",
    "summary": "Australia is chasing a target of 265 runs to win the ODI at Adelaide Oval and secure a series victory. Live updates and analysis are provided by our writers. Follow along for the latest developments in the match.",
    "published": "2025-10-23T10:13:50Z"
  },
  {
    "title": "Trump plans to send federal agents to San Francisco ‘right out of dictator’s handbook’, says Newsom – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/23/trump-san-francisco-federal-agents-white-house-ice-immigration-latest-news-updates",
    "image": "https://media.guim.co.uk/0bebb75a62a808ef197c1fd965bd019f47814be6/537_0_4820_3856/500.jpg",
    "summary": "California Governor condemns a recent immigration enforcement operation, indicating it may lead to tensions between state administration and local leaders. He argues the operation undermines trust and cooperation within communities. The situation is anticipated to escalate as local officials respond to the federal actions.",
    "published": "2025-10-23T10:11:30Z"
  },
  {
    "title": "Oil price jumps after US sanctions Russia’s Rosneft and Lukoil; White House considers software curbs on China – business live",
    "url": "https://www.theguardian.com/business/live/2025/oct/23/oil-price-us-sanctions-rosneft-lukoil-software-curbs-china-trade-war-business-live",
    "image": "https://media.guim.co.uk/4bc562560051b8f747672fea5d8ed7cbd30c260c/115_0_4477_3583/500.jpg",
    "summary": "The latest economic and financial news highlights ongoing market trends, fluctuations in stock prices, and key economic indicators. Analysts are closely monitoring central bank policies and inflation rates as they impact investor sentiment. Additionally, corporate earnings reports are shaping expectations for future growth and economic stability.",
    "published": "2025-10-23T10:10:27Z"
  }
]