[
  {
    "title": "Trump says US looking at land attacks in Venezuela after lethal strikes on boats – live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/15/donald-trump-federal-government-shutdown-redistricting-voting-rights-act-kash-patel-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/55713839944c40268b341b5f2518581252abdeae/484_0_4840_3872/500.jpg",
    "summary": "Trump asserts, without providing evidence, that each U.S. military strike on suspected drug-smuggling boats saves thousands of lives. His comments emphasize the administration's stance on drug trafficking and security. Critics may challenge the lack of substantiation for his claims.",
    "published": "2025-10-15T23:12:57Z"
  },
  {
    "title": "Australia news live: ‘life-threatening’ injury in Townsville ADF incident; Spirit of Tasmania hits fresh setback",
    "url": "https://www.theguardian.com/australia-news/live/2025/oct/16/australia-news-live-tony-burke-crypto-atms-crime-real-income-aihw-wellbeing-bluey-coins-mint-ntwnfb",
    "image": "https://media.guim.co.uk/86e5e61a5db1331102f3d9aae99ea80c97ffce2b/1028_0_5966_4778/500.jpg",
    "summary": "I'm sorry, but it seems you haven’t provided a specific news article or content to summarize. Please provide the text you'd like summarized, and I'll be happy to help!",
    "published": "2025-10-15T23:11:31Z"
  },
  {
    "title": "Border security officers sent to Balkans to disrupt people-smuggling networks",
    "url": "https://www.theguardian.com/uk-news/2025/oct/16/border-security-officers-sent-to-balkans-to-disrupt-people-smuggling-networks",
    "image": "https://media.guim.co.uk/3dbd98e9de5047b344854898a2c32738293c73c9/99_0_4561_3649/500.jpg",
    "summary": "A British team has been dispatched to explore innovative collaboration methods with Frontex, the EU's border agency. This initiative aims to enhance border management and strengthen cooperation. The move reflects the UK's ongoing commitment to cooperation on security and immigration issues post-Brexit.",
    "published": "2025-10-15T23:05:40Z"
  },
  {
    "title": "‘Gruesome videos’: social media pushes distressing news to children, experts say",
    "url": "https://www.theguardian.com/society/2025/oct/16/gruesome-videos-social-media-distressing-news-children-survey",
    "image": "https://media.guim.co.uk/72781d6c485a65b7073e63843db561a727836155/569_0_5002_4000/500.jpg",
    "summary": "A survey by Internet Matters reveals that children are increasingly distressed by exposure to violent content, including shootings, stabbings, and war. The findings highlight concerns over the impact of such media on young viewers' mental well-being. Parents and guardians are urged to monitor and discuss this content with their children to mitigate its effects.",
    "published": "2025-10-15T23:01:50Z"
  },
  {
    "title": "Some parents of special school pupils in England spending £5,000 on EHCPs",
    "url": "https://www.theguardian.com/education/2025/oct/16/some-parents-of-special-school-pupils-in-england-spending-5000-on-ehcps",
    "image": "https://media.guim.co.uk/4b84aa8138c74db6a8dd3f6e886354de905f4b3e/233_0_2535_2029/500.jpg",
    "summary": "The Sutton Trust's research highlights significant disparities in how parents manage the Special Educational Needs and Disabilities (SEND) system. As a result, government ministers are planning an overhaul to address these inequalities. The need for reform is driven by the challenges many families face in accessing support for their children.",
    "published": "2025-10-15T23:01:50Z"
  }
]