[
  {
    "title": "New Zealand v Australia: men’s third T20 international cricket – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/04/new-zealand-v-australia-mens-third-t20-international-cricket-live",
    "image": "https://media.guim.co.uk/86128cd69784cc5ca460b038c6758d66dd11f9e1/475_0_4167_3334/500.jpg",
    "summary": "James Wallace provides live updates in an over-by-over report, keeping fans informed with real-time commentary on the match. The report offers insights and details about key moments and player performances. Follow along for an engaging and detailed overview of the game.",
    "published": "2025-10-04T08:20:57Z"
  },
  {
    "title": "Amorim faces crunch clash, Premier League buildup and more – matchday live",
    "url": "https://www.theguardian.com/football/live/2025/oct/04/amorim-faces-crunch-clash-premier-league-buildup-and-more-matchday-live",
    "image": "https://media.guim.co.uk/cda7d0a172bc3b05a3ebda10268822d4be006bd2/0_0_5000_4000/500.jpg",
    "summary": "Join us for updates, previews, and discussions as we gear up for an exciting day of football action. Stay informed about the latest news and game highlights. Don’t miss out on the thrill of the matches!",
    "published": "2025-10-04T08:16:03Z"
  },
  {
    "title": "How to live a good life in difficult times: Yuval Noah Harari, Rory Stewart and Maria Ressa in conversation",
    "url": "https://www.theguardian.com/books/2025/oct/04/how-to-live-a-good-life-in-difficult-times-yuval-noah-harari-rory-stewart-and-maria-ressa-in-conversation",
    "image": "https://media.guim.co.uk/b4fb537427ebfe3b4122d7ced5db4003facc8985/371_1338_4568_3653/500.jpg",
    "summary": "Three prominent thinkers address the challenges of the future, focusing on the implications of superintelligent AI, climate change, and the integrity of democracy. They emphasize the need for careful navigation and thoughtful solutions to these pressing issues. Their discussions aim to provide insights and strategies for a sustainable future.",
    "published": "2025-10-04T08:01:00Z"
  },
  {
    "title": "There are plenty of ways to humanely control British borders. So why isn’t Keir Starmer using them? | Enver Solomon",
    "url": "https://www.theguardian.com/commentisfree/2025/oct/04/humanely-control-british-borders-keir-starmer-labour-refugees",
    "image": "https://media.guim.co.uk/a9c49f70619f5b71ef6c9232d6b9bda74b174b7a/308_0_4394_3515/500.jpg",
    "summary": "Enver Solomon from the Refugee Council criticizes Labour’s asylum policies for unfairly vilifying refugees. He argues that these policies lack coherence and need improvement. Solomon advocates for a more compassionate and effective approach to refugee issues.",
    "published": "2025-10-04T08:00:01Z"
  },
  {
    "title": "From cage to screen: The Smashing Machine and Mark Kerr’s second act with The Rock",
    "url": "https://www.theguardian.com/sport/2025/oct/04/mark-kerr-smashing-machine-dwayne-johnson-the-rock-film",
    "image": "https://media.guim.co.uk/e69e425b3e5d3315c15506b5ef33e9b67d6c6e97/688_0_6880_5504/500.jpg",
    "summary": "Former MMA heavyweight star Mark Kerr, known as \"The Smashing Machine,\" struggled with addiction for two decades after his fighting career. His life story is set to be revived in a new film produced by Dwayne \"The Rock\" Johnson. The film aims to shed light on Kerr's tumultuous journey and eventual path to recovery.",
    "published": "2025-10-04T08:00:01Z"
  }
]