[
  {
    "title": "Portugal 1-0 Republic of Ireland, Spain 2-0 Georgia, and more: World Cup 2026 qualifying – live",
    "url": "https://www.theguardian.com/football/live/2025/oct/11/portugal-v-republic-of-ireland-spain-v-georgia-world-cup-2026-qualifying-live",
    "image": "https://media.guim.co.uk/70e5282d4a8b36dcaa3d3277da2fc35f51762fd4/730_0_3790_3032/500.jpg",
    "summary": "John Brewin provides coverage of the reactions across Europe as teams compete for qualification in the upcoming tournament. Coaches and players share their thoughts on the intense matches. The atmosphere is charged as nations strive for success on the road to the event.",
    "published": "2025-10-11T21:14:40Z"
  },
  {
    "title": "Egypt confirms international leaders’ summit on Monday to discuss Gaza ceasefire - live",
    "url": "https://www.theguardian.com/world/live/2025/oct/11/israel-gaza-ceasefire-hamas-hostages-netanyahu-trump-middle-east-latest-news-updates",
    "image": "https://media.guim.co.uk/373bb91e694a157d575f69e59bb39001116b511f/704_0_6250_5000/500.jpg",
    "summary": "Over 500,000 Palestinians have returned to Gaza City to find widespread destruction amid ongoing conflict. Meanwhile, 20 world leaders, including Donald Trump, are set to convene for discussions regarding the situation. The humanitarian crisis in the region continues to escalate as international diplomatic efforts unfold.",
    "published": "2025-10-11T21:13:24Z"
  },
  {
    "title": "The Intruder review – the daftest thriller of the entire year",
    "url": "https://www.theguardian.com/tv-and-radio/2025/oct/11/the-intruder-review-bbc-four",
    "image": "https://media.guim.co.uk/a800efc570a28b54455597c7052fc370abd8ac92/912_0_2400_1920/500.jpg",
    "summary": "A French drama about a sinister au pair is criticized for relying heavily on clichés and poorly executed storytelling. The film's dim lighting adds to the lack of engagement, making it difficult for viewers to take the plot seriously. Overall, it fails to deliver a compelling narrative or entertainment value.",
    "published": "2025-10-11T20:55:33Z"
  },
  {
    "title": "Strictly Come Dancing: week three – as it happened",
    "url": "https://www.theguardian.com/tv-and-radio/live/2025/oct/11/strictly-come-dancing-week-three-live",
    "image": "https://media.guim.co.uk/9c81fe7a1bcb926f848a5f93e8bcaa9d407ee22f/254_0_3485_2788/500.jpg",
    "summary": "Lewis Cope achieved the first perfect score of the year with his impressive Zorro paso doble during Movie Week. Meanwhile, Thunderbird puppet Ross King found himself at the bottom of the standings. The episode raises speculation about which contestants may face elimination in the upcoming dance-off.",
    "published": "2025-10-11T20:27:38Z"
  },
  {
    "title": "Rangers could turn to Röhl after Steven Gerrard rules out return as manager",
    "url": "https://www.theguardian.com/football/2025/oct/11/rangers-could-turn-to-danny-rohl-after-steven-gerrard-rules-out-return-as-manager",
    "image": "https://media.guim.co.uk/d6d99cd52bfee9b6651f2efbfd33ba78d3c2f60e/594_0_4350_3481/500.jpg",
    "summary": "Steven Gerrard has decided not to pursue a return as manager of Rangers. The club may now consider Danny Röhl as a potential candidate for the position. This development comes as Rangers seek to fill their managerial vacancy.",
    "published": "2025-10-11T20:02:45Z"
  }
]