[
  {
    "title": "Ukrainian counteroffensive has derailed Russian plans to capture parts of Donetsk, says Zelenskyy – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/oct/09/russia-attacks-ukraine-energy-france-germany-europe-live-news-updates",
    "image": "https://media.guim.co.uk/5415c8af8b57b80fca0233089bf1980fb504252a/74_0_1918_1534/500.jpg",
    "summary": "Ukrainian President accuses Russia of attempting to create chaos through overnight attacks on energy and rail infrastructure. He also highlights that Ukrainian long-range strikes have led to gas shortages in Russia. The conflict continues to escalate with both sides targeting critical infrastructure.",
    "published": "2025-10-09T11:14:31Z"
  },
  {
    "title": "Gaza ceasefire plan live: Israel says it is preparing to pull back troops; living hostages could be released within days",
    "url": "https://www.theguardian.com/world/live/2025/oct/09/gaza-ceasefire-live-trump-says-hostages-probably-released-monday-idf-says-gaza-city-still-extremely-dangerous",
    "image": "https://media.guim.co.uk/6238a15ffab0f5711e9c9f617b1025b9c4e042b8/29_0_5307_4245/500.jpg",
    "summary": "US President Donald Trump announced that Israel and Hamas have agreed to a preliminary plan aimed at pausing hostilities. This agreement includes provisions for the release of certain hostages and prisoners. The development marks a significant step towards potential peace talks in the ongoing conflict.",
    "published": "2025-10-09T11:14:21Z"
  },
  {
    "title": "Increase sentence for Gisèle Pelicot rapist, prosecutor tells appeal court",
    "url": "https://www.theguardian.com/world/2025/oct/09/increase-sentence-for-gisele-pelicot-rapist-prosecutor-tells-appeal-court",
    "image": "https://media.guim.co.uk/9161cd210722a58c2607378731860fddd78a6b8f/1154_983_5356_4285/500.jpg",
    "summary": "Dominique Sie has proposed a 12-year prison sentence for Husamettin Dugan due to his refusal to take responsibility for an assault. The recommendation reflects concerns about Dugan's accountability for his actions. The case highlights ongoing discussions about accountability in violent incidents.",
    "published": "2025-10-09T11:14:00Z"
  },
  {
    "title": "UK ‘stands ready to play our part’ in Gaza ceasefire deal, says foreign secretary – politics live",
    "url": "https://www.theguardian.com/politics/live/2025/oct/09/foreign-secretary-yvette-cooper-keir-starmer-gaza-ceasefire-uk-politics-live",
    "image": "https://media.guim.co.uk/db2ec654b55302359bfa2150a4dd9115ddc131a2/358_0_5354_4284/500.jpg",
    "summary": "Yvette Cooper emphasizes the urgent need for a deal to end the assault on Gaza and secure the release of hostages. She stresses that this agreement should be implemented swiftly. The call reflects a broader demand for immediate humanitarian measures in the region.",
    "published": "2025-10-09T11:13:13Z"
  },
  {
    "title": "Nobel prize in literature 2025 live: László Krasznahorkai wins ‘for his compelling and visionary oeuvre’",
    "url": "https://www.theguardian.com/books/live/2025/oct/09/nobel-prize-in-literature-2025-live",
    "image": "https://media.guim.co.uk/abc9f55ded7fa74464e53ac0d5954f3c118e081d/293_0_2915_2333/500.jpg",
    "summary": "The Nobel Academy has awarded the literature prize to a Hungarian novelist for their impactful work. The academy praised the author for creating art that resonates amid themes of \"apocalyptic terror.\" This recognition highlights the enduring significance of art in challenging times.",
    "published": "2025-10-09T11:10:12Z"
  }
]