[
  {
    "title": "US Open tennis 2025: Swiatek through, Sinner and Osaka in action on day five – live",
    "url": "https://www.theguardian.com/sport/live/2025/aug/28/us-open-tennis-2025-swiatek-sinner-osaka-musetti-day-five-live",
    "image": "https://media.guim.co.uk/ee753454d41c508c22778c0dadcf9368b67cbda8/481_0_6315_5054/500.jpg",
    "summary": "Daniel Harris provides live updates from the second round of an event taking place in New York. Stay tuned for ongoing coverage and insights. Check back for the latest developments.",
    "published": "2025-08-28T18:48:16Z"
  },
  {
    "title": "White House says new CDC director nominee to be announced ‘very soon’ – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/aug/28/cdc-susan-monarez-trump-news-updates-us-politics-live",
    "image": "https://media.guim.co.uk/ba247cae7e2663c841d3eeadee12c7373f2f9c32/462_0_4583_3667/500.jpg",
    "summary": "Karoline Leavitt defended Trump's decision to fire Susan Monarez, stating he had \"every right\" to do so. She argued that Monarez was \"not aligned\" with Trump's agenda. This comment highlights internal disagreements within Trump's team regarding his leadership direction.",
    "published": "2025-08-28T18:41:12Z"
  },
  {
    "title": "Israeli forces raid former air-defence base near Syrian capital",
    "url": "https://www.theguardian.com/world/2025/aug/28/israeli-forces-former-air-defence-base-southern-syria-damascus",
    "image": "https://media.guim.co.uk/c736f26552752d678e412534c9e2f152229eafd8/822_605_4463_3573/500.jpg",
    "summary": "A military operation near Damascus marks the deepest incursion into Syrian territory since the ousting of Bashar al-Assad last year. This activity highlights ongoing tensions and conflicts in the region. The operation's details and implications for the local and international landscape remain closely watched.",
    "published": "2025-08-28T18:38:53Z"
  },
  {
    "title": "Champions League group-phase draw: Liverpool face Real Madrid and potential Alexander-Arnold reunion – as it happened",
    "url": "https://www.theguardian.com/football/live/2025/aug/28/champions-league-draw-2025-26-group-phase-fixtures-revealed-live",
    "image": "https://media.guim.co.uk/e7e8509750eb0084860214fe079c4eab3995da10/919_44_4798_3838/500.jpg",
    "summary": "Familiar rivals are set to face off once more in the group stage of the current season. Fans can anticipate exciting matchups as these teams renew their competitive rivalry. The upcoming games promise to be thrilling encounters for supporters and players alike.",
    "published": "2025-08-28T17:46:16Z"
  },
  {
    "title": "Judges to rule on Epping hotel injunction on Friday – as it happened",
    "url": "https://www.theguardian.com/politics/live/2025/aug/28/latest-uk-politics-news-keir-starmer-rachel-reeves-labour-live-updates",
    "image": "https://media.guim.co.uk/ce98a439324cf0ec721f78c26607e0cdcd8d57b5/137_0_2501_2001/500.jpg",
    "summary": "The Home Office and the owner of Bell Hotel are contesting a high court injunction that was approved last week by Epping Council. This legal action stems from disputes over regulatory compliance and operational standards. The case highlights tensions between local authorities and government agencies regarding control over facilities.",
    "published": "2025-08-28T17:26:46Z"
  }
]