[
  {
    "title": " Australia politics live: crossbench turns up heat on PM over free vote on gambling ad ban as two Liberals ejected from question time ",
    "url": "https://www.theguardian.com/australia-news/live/2025/nov/25/australia-politics-live-anthony-albanese-sussan-ley-tanya-plibersek-domestic-violence-helpline-pauline-hanson-burqa-net-zero-labor-coalition-greens-question-time-ntwnfb",
    "image": "https://media.guim.co.uk/59e52c356ee192cebad60b26dd0031a65d09f307/603_0_6010_4810/500.jpg",
    "summary": "I’m sorry, but I need more details about the news you want summarized. Could you please provide the content or specify the topic?",
    "published": "2025-11-25T05:16:40Z"
  },
  {
    "title": "Bevan Shields steps down as Sydney Morning Herald editor, chief reporter Jordan Baker named as replacement",
    "url": "https://www.theguardian.com/media/2025/nov/25/bevan-shields-steps-down-sydney-morning-herald-smh-editor-chief",
    "image": "https://media.guim.co.uk/51ba3ce1fc45d91887ed26132b86406233996995/392_0_4130_3304/500.jpg",
    "summary": "Shields expressed in an email to SMH staff that serving in his role was the greatest honor of his life. He conveyed gratitude for the experience and the opportunity to work with the team. His departure marks a significant moment for the publication.",
    "published": "2025-11-25T05:13:34Z"
  },
  {
    "title": "‘It fully changed my life!’ How young rewilders transformed a farm – and began a movement",
    "url": "https://www.theguardian.com/environment/2025/nov/25/it-fully-changed-my-life-how-young-rewilders-transformed-a-farm-and-began-a-movement",
    "image": "https://media.guim.co.uk/49c21d2a054cdaa59483b6b167f7e54f8f03ac5c/1347_401_6310_5048/500.jpg",
    "summary": "Maple Farm is witnessing a resurgence of wildlife, including nightingales, grass snakes, and bats. This revitalization is attributed to a dedicated group's efforts to enhance the area's natural recovery. Their vision is successfully attracting diverse species back to the farm.",
    "published": "2025-11-25T05:00:25Z"
  },
  {
    "title": "‘Fossil fuel giants finally in the crosshairs’: Cop30 avoids total failure with last-ditch deal",
    "url": "https://www.theguardian.com/environment/2025/nov/25/fossil-fuel-giants-finally-in-the-crosshairs-cop30-avoids-total-failure-with-last-ditch-deal",
    "image": "https://media.guim.co.uk/b66352c368f7781afabd57a57e70f6a73fbe8c8d/687_0_4220_3377/500.jpg",
    "summary": "Saudi Arabia has made a last-minute decision to sign a deal that signifies a significant shift for the upcoming COP (Conference of the Parties). The announcement was marked by vague phrasing, indicating a strategic approach to the agreement. This decision highlights Saudi Arabia's evolving stance on climate and environmental policies.",
    "published": "2025-11-25T05:00:24Z"
  },
  {
    "title": "UK charity records original music by people living with dementia",
    "url": "https://www.theguardian.com/society/2025/nov/25/uk-charity-record-original-music-people-with-dementia",
    "image": "https://media.guim.co.uk/e6af03cd795d8ee117c159ff60e8d81223c6eb8f/784_0_3821_3057/500.jpg",
    "summary": "A new project seeks to evoke memories and sensations in participants while producing a nine-track CD recorded at Glyndebourne. The initiative combines personal experiences with musical artistry. The CD aims to enhance emotional connections through sound.",
    "published": "2025-11-25T05:00:24Z"
  }
]