[
  {
    "title": "Trump to address UN general assembly as Israeli attacks on Gaza City continue – Middle East crisis live",
    "url": "https://www.theguardian.com/world/live/2025/sep/23/gaza-israel-palestinian-state-recognition-donald-trump-un-unga-latest-news-live-updates",
    "image": "https://media.guim.co.uk/0a53750903b79f83688de3607e10debccbe459d7/211_0_4680_3744/500.jpg",
    "summary": "The U.S. president is set to address the UN General Assembly in New York, following the recognition of a Palestinian state by several countries, including the UK, France, Belgium, Canada, Australia, and Portugal. This development indicates a shifting international stance on Palestinian statehood. The speech may address the implications of this recognition and the broader Middle East situation.",
    "published": "2025-09-23T10:38:04Z"
  },
  {
    "title": "Trinidadian fishers fear getting caught in the crossfire amid Trump’s Caribbean ‘war on drugs’",
    "url": "https://www.theguardian.com/world/2025/sep/23/trinidadian-fishers-trump-caribbean-war-on-drugs",
    "image": "https://media.guim.co.uk/eddff9a063013ab80ac071c29877e77c3ff52bdf/35_0_1200_960/500.jpg",
    "summary": "Caribbean governments are split on the role of US warships in regional diplomacy, with concerns over intensified military presence. Local fishermen fear they may be caught in the crossfire, potentially losing access to fishing grounds. The situation raises tensions between the need for security and the livelihoods of local communities.",
    "published": "2025-09-23T10:37:16Z"
  },
  {
    "title": "Ania Magliano: ‘My favourite gig? I did some material about vibrators and a 92-year-old gave me tips on different settings’",
    "url": "https://www.theguardian.com/stage/2025/sep/23/ania-magliano-taskmaster",
    "image": "https://media.guim.co.uk/38669e689ed3c113e17cdf45fefdfb64886a3f25/0_1117_3720_2974/500.jpg",
    "summary": "The news highlights a comedian's experiences performing standup on the show \"Taskmaster,\" her involvement with the Cambridge Footlights, and her reflections on the creative minds behind the popular confection Colin the Caterpillar. These elements showcase her diverse career in comedy and entertainment. The piece sheds light on her creative journey and the collaborative efforts that contribute to beloved cultural icons.",
    "published": "2025-09-23T10:36:42Z"
  },
  {
    "title": "New-look Pakistan are making up for lost time with British-born footballers",
    "url": "https://www.theguardian.com/football/2025/sep/23/pakistan-2026-asian-cup-qualifiers-womens-football-moving-the-goalposts",
    "image": "https://media.guim.co.uk/4c0bba13c273316020eff86cbb602ee345f4d860/0_189_2270_1817/500.jpg",
    "summary": "The Green Shirts improved their ranking following the 2026 Asian Cup qualifiers. Their success was bolstered by contributions from players who had not previously visited the country. This fresh talent has energized the team's performance on the international stage.",
    "published": "2025-09-23T10:35:10Z"
  },
  {
    "title": "Danish PM ‘cannot rule out’ Russian involvement in drone sightings that closed Copenhagen and Oslo airports – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/sep/23/copenhagen-oslo-airport-drones-denmark-norway-russia-nato-estonia-europe-live-latest-news-updates",
    "image": "https://media.guim.co.uk/3a2046c1b05f2c3d33d25b6814cef100f5cbcee9/566_0_5618_4495/500.jpg",
    "summary": "Copenhagen Airport was closed for four hours due to the sighting of large drones nearby. Similarly, Oslo Airport experienced a three-hour shutdown after two drone sightings. Both incidents raised concerns over air traffic safety and prompted immediate security responses.",
    "published": "2025-09-23T10:34:26Z"
  }
]