[
  {
    "title": "After uproar, Pete Hegseth clarifies Qatari air force facility in Idaho is not a foreign base – live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/10/letitia-james-donald-trump-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/43672fb93245ee90ef775f04f22e4ef176a2f23d/374_0_6399_5119/500.jpg",
    "summary": "The Pentagon chief announced plans for a location to host a contingent of Qatari F-15 fighter jets and pilots. This move is part of efforts to enhance military cooperation. The specifics regarding the location and deployment were not disclosed.",
    "published": "2025-10-11T01:20:46Z"
  },
  {
    "title": "Canada v Australia: international men’s football friendly – live",
    "url": "https://www.theguardian.com/football/live/2025/oct/11/canada-vs-australia-socceroos-live-updates-international-football-friendly-latest",
    "image": "https://media.guim.co.uk/2686fdf563ccf6ea38f20360bb00851dacbfd521/528_7_3725_2980/500.jpg",
    "summary": "The Socceroos begin their North America tour with a match against the World Cup co-hosts in Montreal. Martin Pegan provides minute-by-minute updates on the game. Fans can follow along for live coverage of the clash.",
    "published": "2025-10-11T01:20:25Z"
  },
  {
    "title": "Ukraine war briefing: Power restored to Kyiv after Russia drone attacks",
    "url": "https://www.theguardian.com/world/2025/oct/11/ukraine-war-briefing-power-restored-to-kyiv-after-russia-drone-attacks",
    "image": "https://media.guim.co.uk/bb36bdaf0b8340d4cf7b51561dcd8cb10a264774/439_0_4385_3508/500.jpg",
    "summary": "Ukrainian President Zelenskyy reported that recent attacks focused on energy infrastructure amid the approaching winter. A tragic incident in Zaporizhzhia resulted in the death of a boy due to drone and missile strikes. This marks day 1,326 of the ongoing conflict.",
    "published": "2025-10-11T01:20:06Z"
  },
  {
    "title": "Trump news at a glance: layoffs for federal workers begin and president threatens China with tariffs",
    "url": "https://www.theguardian.com/us-news/2025/oct/11/trump-administration-news-updates-today",
    "image": "https://media.guim.co.uk/042224f69354925660ce28455992de2040e41b85/530_160_3736_2989/500.jpg",
    "summary": "The President indicated that significant layoffs are likely, particularly in Democratic areas, amid ongoing tensions. Federal worker unions have responded by taking legal action regarding the matter. This development highlights ongoing struggles in US labor relations and political dynamics.",
    "published": "2025-10-11T00:53:49Z"
  },
  {
    "title": "Three people dead after light plane crashes on take-off near Wollongong",
    "url": "https://www.theguardian.com/australia-news/2025/oct/11/three-people-dead-after-light-plane-crashes-on-take-off-near-wollongong",
    "image": "https://media.guim.co.uk/ff164658512fbf593a7b520a45e3c8cf21a577e0/247_0_2471_1977/500.jpg",
    "summary": "An aircraft caught fire shortly after takeoff from Shellharbour Airport around 10am on Saturday. Emergency services responded to the incident, but no injuries were reported among passengers or crew. The cause of the fire is under investigation.",
    "published": "2025-10-11T00:20:46Z"
  }
]