[
  {
    "title": "Hurricane Melissa live updates: hundreds of thousands evacuated as Cuba faces 120mph winds; disaster area declared in Jamaica",
    "url": "https://www.theguardian.com/world/live/2025/oct/29/hurricane-melissa-live-updates-strengthens-cuba-extensive-damage-parts-of-jamaica",
    "image": "https://media.guim.co.uk/db17c9f0ab5c21cd3a7f112ff55a697bb70dc87b/158_0_2245_1796/500.jpg",
    "summary": "A powerful storm has struck Cuba, prompting warnings of life-threatening flooding. Meanwhile, Jamaica has already experienced significant destruction due to the storm's impact. Authorities are urging residents to take precautions as severe weather conditions continue.",
    "published": "2025-10-29T14:20:18Z"
  },
  {
    "title": "Nvidia becomes world’s first $5tn company; mortgage approvals hit nine-month high – business live",
    "url": "https://www.theguardian.com/business/live/2025/oct/29/donald-trump-cut-fentanyl-tariff-chinese-goods-expects-great-deal-with-xi-jinping-federal-reserve-rate-cut-business-live",
    "image": "https://media.guim.co.uk/1c28e3bf634da561d9c93ed086b4204f99554a12/471_0_4713_3770/500.jpg",
    "summary": "Donald Trump announced plans to reduce tariffs on Chinese goods related to fentanyl. He expressed optimism about reaching a significant agreement with Chinese President Xi Jinping. The move aims to enhance cooperation in addressing the fentanyl crisis.",
    "published": "2025-10-29T14:20:00Z"
  },
  {
    "title": "Labour MPs furious after being told to abstain on Farage’s 10-minute rule bill proposing ECHR withdrawal – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/oct/29/shabana-mahmood-home-office-immigration-pmqs-labour-keir-starmer-kemi-badenoch-conservatives-uk-politics-live-news",
    "image": "https://media.guim.co.uk/c37d2c1c8caf306dc1b6ca9cb2ab1c1939352b11/1699_381_3194_2555/500.jpg",
    "summary": "Labour MPs express concern that their party's decision to abstain on a key issue may give the impression that only the Liberal Democrats and Greens are committed to addressing it. This hesitation could diminish Labour's credibility on important matters. MPs worry that this could alienate voters who prioritize the issue at hand.",
    "published": "2025-10-29T14:19:47Z"
  },
  {
    "title": "England chasing 320 to beat South Africa: Women’s Cricket World Cup semi-final – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/29/england-v-south-africa-womens-cricket-world-cup-semi-final-live",
    "image": "https://media.guim.co.uk/d8cb40acea05b9a21e9f9c4a29ee14e340702a00/425_0_5363_4293/500.jpg",
    "summary": "England is set to chase a challenging target of 320 runs after South Africa's Laura Wolvaardt scored an impressive 169. The match highlights the pressure on England as they embark on this daunting run chase. Join our writers for an over-by-over report on the unfolding game.",
    "published": "2025-10-29T14:18:33Z"
  },
  {
    "title": "Violent protests erupt as Tanzanian president nears election victory",
    "url": "https://www.theguardian.com/world/2025/oct/29/tanzania-election-president-samia-suluhu-hassan-poised-to-retain-power",
    "image": "https://media.guim.co.uk/371564595dbd8742c1208ab9c66f658c7ccd6fbe/340_0_2169_1735/500.jpg",
    "summary": "In the lead-up to an election, government critics have faced abduction, killing, or arrest, raising concerns about political repression. Meanwhile, a global monitoring organization has reported an internet blackout in the affected region, limiting communication and access to information. These actions highlight the escalating tensions and human rights violations surrounding the electoral process.",
    "published": "2025-10-29T14:15:06Z"
  }
]