[
  {
    "title": "Peter Mandelson seen as ‘worth the risk’ as US ambassador, minister says",
    "url": "https://www.theguardian.com/politics/2025/sep/14/mandelson-was-worth-the-risk-as-us-ambassador-business-secretary-says",
    "image": "https://media.guim.co.uk/d737ce240f933be7970f82548f34b531c7cf72bd/468_0_4680_3744/500.jpg",
    "summary": "Peter Kyle acknowledges the need to balance \"singular talents\" with concerns raised by the family of an Epstein accuser regarding a recent appointment. The family's criticism highlights their apprehensions about the decision. Kyle emphasizes the importance of weighing both strengths and warnings in such situations.",
    "published": "2025-09-14T21:21:41Z"
  },
  {
    "title": "Coldwater review – Andrew Lincoln’s wild Scottish thriller is top quality nonsense",
    "url": "https://www.theguardian.com/tv-and-radio/2025/sep/14/coldwater-review-andrew-lincoln-wild-scottish-thriller-is-top-quality-nonsense",
    "image": "https://media.guim.co.uk/b3c64f44ccceb45eb2f01cc9483523b42b2c77f8/978_0_4998_4000/500.jpg",
    "summary": "In a new film, a star from The Walking Dead portrays a foolish character who unwittingly finds himself in a frightening situation in the woods. The storyline draws comparisons to the classic film Deliverance, but is set in the Highlands. The narrative promises intense and suspenseful moments as the protagonist navigates this perilous encounter.",
    "published": "2025-09-14T21:00:43Z"
  },
  {
    "title": "Morning Mail: Secret childcare ratings leave NSW parents in dark, Albanese poised for climate action, Sam Kerr scores on Chelsea return",
    "url": "https://www.theguardian.com/australia-news/2025/sep/15/morning-mail-monday-ntwnfb",
    "image": "https://media.guim.co.uk/54a6390419207d61bd14505b111e99319e182071/0_0_5322_4258/500.jpg",
    "summary": "Concerns are rising over potential safety deficiencies within New South Wales' childcare system. Meanwhile, the Labor Party is gearing up to make a series of climate-related announcements throughout the week. The dual focus highlights pressing issues in both childcare safety and environmental policy.",
    "published": "2025-09-14T20:55:25Z"
  },
  {
    "title": "Terence Crawford’s career-defining win over Canelo Álvarez was a victory for substance over style",
    "url": "https://www.theguardian.com/sport/2025/sep/14/terence-crawford-canelo-alvarez-boxing-las-vegas",
    "image": "https://media.guim.co.uk/b03cb409d968a94bf0f66c40058d3118ebaad923/59_0_5254_4204/500.jpg",
    "summary": "The Omaha native, who survived a near-fatal gunshot wound, has gained significant recognition after years of working on the fringes of mainstream fame. His resilience and talent have brought him into the spotlight. Now, he can no longer be overlooked in the entertainment industry.",
    "published": "2025-09-14T20:32:18Z"
  },
  {
    "title": "Ellie Kildunne hands England boost with return for Rugby World Cup semi-final",
    "url": "https://www.theguardian.com/sport/2025/sep/14/ellie-kildunne-england-womens-world-cup-semi-final-france",
    "image": "https://media.guim.co.uk/edade3014c26e1dba1c7ddf91d7842495c2f4798/262_0_2621_2097/500.jpg",
    "summary": "Ellie Kildunne is expected to play for England in their semi-final match against France. She missed the quarter-final victory over Scotland. Her return could bolster England's chances in the upcoming match.",
    "published": "2025-09-14T20:22:50Z"
  }
]