[
  {
    "title": "Pound on track for worst week since January as UK wage growth falls to four-year low – business live",
    "url": "https://www.theguardian.com/business/live/2025/oct/10/uk-wage-growth-slows-worker-demand-argentina-rescue-bessent-stock-markets-business-live-news",
    "image": "https://media.guim.co.uk/729b4c2759befb3fba1963b30f451a0770012732/1034_949_5150_4118/500.jpg",
    "summary": "Financial markets are experiencing volatility as investors react to economic indicators and central bank policies. Concerns over inflation and potential interest rate hikes continue to influence market sentiment. Analysts are closely monitoring developments to assess their impact on the global economy.",
    "published": "2025-10-10T11:14:07Z"
  },
  {
    "title": "Palestinians begin journey to Gaza’s north as Israel says ceasefire now in effect – live",
    "url": "https://www.theguardian.com/world/live/2025/oct/10/gaza-ceasefire-plan-israel-donald-trump-hamas-palestine-benjamin-netanyahu-middle-east-latest-news",
    "image": "https://media.guim.co.uk/715b6748a97400308c7ea16c85bbeab3a959e509/403_0_2204_1763/500.jpg",
    "summary": "Thousands of Palestinians have returned to northern areas of the territory following the withdrawal of IDF forces to their deployment lines. This movement comes as the situation in the region continues to evolve. The IDF's retreat may signal a change in military strategy or conditions on the ground.",
    "published": "2025-10-10T11:12:29Z"
  },
  {
    "title": "Millions of older Britons likely to have undiagnosed sight and hearing problems, study finds",
    "url": "https://www.theguardian.com/politics/2025/oct/10/millions-of-older-britons-likely-to-have-undiagnosed-sensory-problems-study-finds",
    "image": "https://media.guim.co.uk/bca53ff6977c15761bb3f14da91b0eeed525e7d6/407_0_4200_3360/500.jpg",
    "summary": "Doctors warn that individuals affected face increased risks of falls, mental health issues, and socially restricted lives. The concerns highlight the broader implications on health and well-being. Urgent attention is needed to address these challenges and support affected communities.",
    "published": "2025-10-10T11:11:03Z"
  },
  {
    "title": "‘Little lungs are paying’: Why the Dieselgate scandal is still running hot",
    "url": "https://www.theguardian.com/technology/2025/oct/10/dieselgate-scandal-air-pollution-cars",
    "image": "https://media.guim.co.uk/28938498c4b7125bfa190de9d9bc0422507b76b4/465_335_1288_1031/500.jpg",
    "summary": "Carmakers accused of violating air pollution regulations have largely evaded consequences for the past ten years. However, a landmark trial initiated by 1.8 million UK motorists is set to commence. This legal challenge may finally hold these companies accountable for their alleged misconduct.",
    "published": "2025-10-10T11:09:50Z"
  },
  {
    "title": "Yvette Cooper defends children as young as 13 needing digital ID – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/oct/10/uk-politics-latest-live-news-labour-reform-plaid-cymru-snp-conservatives",
    "image": "https://media.guim.co.uk/b89470e423fed5c8dcd44a6d00b035bc70b45338/1004_279_1890_1512/500.jpg",
    "summary": "The Foreign Secretary advocates for the implementation of digital IDs for young teenagers, describing it as a progressive step. This initiative is aimed at enhancing security and access to services for minors. The proposal is part of a broader effort to modernize identification methods in the digital age.",
    "published": "2025-10-10T11:07:36Z"
  }
]