[
  {
    "title": "Notts beat Worcestershire, Surrey v Warwickshire and more: county cricket, day four – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/11/worcestershire-v-nottinghamshire-surrey-v-warwickshire-and-more-county-cricket-day-four-live",
    "image": "https://media.guim.co.uk/1581c6001aa5286f6d2745bc3bd9765be03d277b/0_157_2449_1959/500.jpg",
    "summary": "Tanya Aldred provides live updates on the final day of the current County Championship matches. Fans can follow along for the latest scores and highlights. Stay tuned for key moments as the matches conclude.",
    "published": "2025-09-11T13:12:25Z"
  },
  {
    "title": "No 10 says Starmer found Mandelson’s emails to Epstein ‘reprehensible’ – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/11/peter-mandelson-keir-starmer-deputy-labour-leader-uk-politics-latest-news",
    "image": "https://media.guim.co.uk/c07d84b6f076607ac3574c51f6231bdbd5c70ef6/1437_592_5194_4154/500.jpg",
    "summary": "The UK Prime Minister's office has opted not to confirm whether the PM was misled by Peter Mandelson, despite facing multiple inquiries on the matter. This decision has sparked ongoing speculation and scrutiny regarding the situation. The lack of clarity from No. 10 has fueled further public interest and debate.",
    "published": "2025-09-11T13:11:39Z"
  },
  {
    "title": "Trump tariffs ‘clearly hitting‘ as US inflation rises to 2.9%; ECB leaves interest rates on hold – business live",
    "url": "https://www.theguardian.com/business/live/2025/sep/11/john-lewis-deeper-loss-london-tube-strike-fourth-day-ecb-interest-rates-us-inflation-business-live-news-updates",
    "image": "https://media.guim.co.uk/0fdd90226ca83eb0d3f5bc06de731a18c0e56e9d/512_0_4397_3518/500.jpg",
    "summary": "Economists report that the ongoing trade war is contributing to rising prices, with inflation in the U.S. increasing in August. The tariffs and trade tensions are cited as primary factors behind the price hikes. These developments raise concerns about the broader economic impact on consumers and businesses.",
    "published": "2025-09-11T13:10:16Z"
  },
  {
    "title": "‘A last resort’: is culling foxes the only way to save Britain’s vanishing curlews?",
    "url": "https://www.theguardian.com/environment/2025/sep/11/a-last-resort-is-culling-foxes-the-only-way-to-save-britains-vanishing-curlews",
    "image": "https://media.guim.co.uk/f4d591e22a6a771e035ad1220c930491ea69eeb7/628_0_2972_2378/500.jpg",
    "summary": "Efforts to reduce predator populations are being proposed as a solution to protect ground-nesting birds. However, critics argue that the root cause of the issue lies in agricultural practices. The debate highlights the need for more effective conservation strategies.",
    "published": "2025-09-11T13:07:22Z"
  },
  {
    "title": "UN security council to hold emergency meeting as Poland plans no-fly zone after Russian drone incursion – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/sep/11/europe-live-news-updates-poland-russia-drones-ukraine-war-latest",
    "image": "https://media.guim.co.uk/3351505fa5cf93907799226bae00ea3615781a5c/338_0_3730_2984/500.jpg",
    "summary": "Poland is enhancing its defense measures by planning to restrict air traffic in its eastern region. This move aims to bolster national security amid rising tensions in the area. The restrictions will likely involve tighter controls and monitoring of airspace.",
    "published": "2025-09-11T13:06:00Z"
  }
]