[
  {
    "title": "Epping sex offender back in custody after being released from prison in error",
    "url": "https://www.theguardian.com/uk-news/2025/oct/26/epping-sex-offender-back-in-custody-after-being-released-from-prison-in-error",
    "image": "https://media.guim.co.uk/9e732036dc4879dcab45acf1ad2974486c6eb2e2/103_5_2043_1635/500.jpg",
    "summary": "Hadush Gerberslasie Kebatu, whose release from HMP Chelmsford sparked summer protests in Essex, was reported to appear 'confused' after his release. The protests centered around concerns for his well-being and treatment within the system. His situation highlights ongoing issues related to mental health and the treatment of individuals in custody.",
    "published": "2025-10-26T11:14:16Z"
  },
  {
    "title": "Right to buy in reverse: how Brighton is tackling its social housing crisis | Richard Partington",
    "url": "https://www.theguardian.com/society/2025/oct/26/right-to-buy-reverse-brighton-tackling-social-housing-crisis",
    "image": "https://media.guim.co.uk/b1dd1fae38840a8387bf82886335db27790bd260/134_0_4639_3711/500.jpg",
    "summary": "The council is reversing a key aspect of Thatcher's policy by purchasing properties from private landlords. This move aims to increase affordable housing availability. Other local authorities are encouraged to consider similar actions.",
    "published": "2025-10-26T11:12:07Z"
  },
  {
    "title": "England beat New Zealand by eight wickets: Women’s Cricket World Cup – live reaction",
    "url": "https://www.theguardian.com/sport/live/2025/oct/26/england-v-new-zealand-womens-cricket-world-cup-live",
    "image": "https://media.guim.co.uk/d2b23e5131699a5c403e47b4898d196da6d4c3d6/100_0_2545_2036/500.jpg",
    "summary": "Amy Jones scored 86 runs, leading her team to a comfortable victory in Visakhapatnam. The over-by-over report captures the highlights and reactions to her performance. Join the writers for in-depth analysis and commentary.",
    "published": "2025-10-26T11:11:40Z"
  },
  {
    "title": "Clásico buildup, Hearts v Celtic, Arsenal host Crystal Palace and more – matchday live",
    "url": "https://www.theguardian.com/football/live/2025/oct/26/clasico-buildup-hearts-v-celtic-arsenal-host-crystal-palace-and-more-matchday-live",
    "image": "https://media.guim.co.uk/89de0d3e0b41600a9c8a83ec248a7e59587ca79d/0_0_5000_4000/500.jpg",
    "summary": "Emillia Hawkins is leading the coverage with news updates, previews, and discussions as we gear up for an exciting day of events. Stay tuned for the latest insights and highlights. Don't miss out on what's happening!",
    "published": "2025-10-26T11:07:11Z"
  },
  {
    "title": "This is how we do it: ‘When his grandma heard us having sex, she asked if we’d been “having a fun dance” upstairs’",
    "url": "https://www.theguardian.com/lifeandstyle/2025/oct/26/this-is-how-we-do-it-grandma-heard-us-having-sex",
    "image": "https://media.guim.co.uk/d3d3743698db7ab6d191ec93ab91ca3b1d56c9e8/0_0_2000_1600/500.jpg",
    "summary": "Zach and Luna are navigating the cost of living crisis by living with Zach's elderly grandparents, which has provided financial relief. However, the arrangement has negatively impacted their intimate life. The couple is finding it challenging to balance familial responsibilities with their relationship needs.",
    "published": "2025-10-26T11:00:02Z"
  }
]