[
  {
    "title": "Singapore Grand Prix qualifying: Formula One – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/04/singapore-grand-prix-qualifying-formula-one-live",
    "image": "https://media.guim.co.uk/e32f06be5095604b1dfc9dde4c9332300befcb15/474_0_7200_5760/500.jpg",
    "summary": "Max Verstappen aims to maintain competitive pressure on McLaren drivers Oscar Piastri and Lando Norris in the upcoming races. The rivalry highlights the ongoing battle in Formula 1. Insights from Niall McVeigh will provide more context on this dynamic.",
    "published": "2025-10-04T12:34:56Z"
  },
  {
    "title": "Manchester City v Arsenal: Women’s Super League – live",
    "url": "https://www.theguardian.com/football/live/2025/oct/04/manchester-city-v-arsenal-womens-super-league-live-wsl-updates",
    "image": "https://media.guim.co.uk/0ccb43022dbd5b0045c9a05f6833b6159bb16446/130_0_2741_2193/500.jpg",
    "summary": "A minute-by-minute report covers an early-season clash between two prominent teams in the Women's Super League (WSL). The match promises to showcase high-level competition as both teams aim to assert their dominance. Billy Munday provides live updates and insights throughout the game.",
    "published": "2025-10-04T12:34:49Z"
  },
  {
    "title": "Leeds United v Tottenham Hotspur: Premier League – live",
    "url": "https://www.theguardian.com/football/live/2025/oct/04/leeds-united-v-tottenham-hotspur-premier-league-live",
    "image": "https://media.guim.co.uk/65d1d9a5245f590f828b2174930f5a381c6ca3ec/156_119_1884_1507/500.jpg",
    "summary": "In a minute-by-minute report, the matchup between Leeds and Thomas Frank's team is highlighted as a key moment for both clubs. Leeds aims for a significant victory, while Frank looks to maintain momentum from recent successes. Scott Murray provides ongoing updates throughout the event.",
    "published": "2025-10-04T12:30:07Z"
  },
  {
    "title": "Arsenal v West Ham, Manchester United v Sunderland, and more: football – live",
    "url": "https://www.theguardian.com/football/live/2025/oct/04/arsenal-v-west-ham-manchester-united-v-sunderland-and-more-football-live-clockwatch-score-updates",
    "image": "https://media.guim.co.uk/db4d0df54bda698e7a8d7c7ef59c3352ad8fa9c1/872_0_6880_5504/500.jpg",
    "summary": "Tom Bassam will provide updates on goals and news from various football leagues. The coverage will include highlights and key moments from games happening across the grounds. Fans can expect comprehensive insights into the latest happenings in the sport.",
    "published": "2025-10-04T12:30:05Z"
  },
  {
    "title": "Bledisloe Cup live: Australia Wallabies 14-28 New Zealand All Blacks – as it happened",
    "url": "https://www.theguardian.com/sport/live/2025/oct/04/bledisloe-cup-australia-v-new-zealand-rugby-championship-live",
    "image": "https://media.guim.co.uk/bf53f0db6536292103e259ce236611febc165cfe/244_0_2158_1726/500.jpg",
    "summary": "The All Blacks are still competing for the Rugby Championship title, showing strong performance in recent matches. Jonathan Howcroft provided a detailed minute-by-minute report on the game's progress. The team's chances are alive as they continue to pursue victory.",
    "published": "2025-10-04T12:28:19Z"
  }
]