[
  {
    "title": "US Congress set to formally pass legislation to force release of Epstein files – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/nov/19/us-congress-epstein-files-donald-trump-saudi-arabia-redistricting-latest-news-updates",
    "image": "https://media.guim.co.uk/85dbf39880a2ecf803cb5ba62d8a3e6505e77ea3/628_0_5000_4000/500.jpg",
    "summary": "Donald Trump may sign the Epstein Files Transparency Act today, which aims to increase transparency around the Epstein case. Both Democrats and Republicans have praised the courage of Epstein survivors for advocating for the legislation. The act seeks to provide more access to information related to the Epstein scandal.",
    "published": "2025-11-19T14:18:24Z"
  },
  {
    "title": "Allegations about Farage’s conduct as schoolboy ‘disturbing’, says No 10 – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/nov/19/pmqs-uk-politics-latest-news-john-healey-rachel-reeves-keir-starmer-labour",
    "image": "https://media.guim.co.uk/b2143222c8c0c0313510a6d49d7c7bb60a8ecb2d/920_0_4618_3694/500.jpg",
    "summary": "The Guardian interviewed over a dozen of Nigel Farage's former classmates from Dulwich College, a prestigious public school in south London. Their insights provide a glimpse into Farage's early years and the influences that shaped his political views. The discussions highlight varying perspectives on his character and ambitions during his school days.",
    "published": "2025-11-19T14:13:56Z"
  },
  {
    "title": "Tropical cyclone Fina on torrential path to hit northern Australian coast this week",
    "url": "https://www.theguardian.com/environment/2025/nov/19/tropical-cyclone-fina-northern-territory-darwin",
    "image": "https://media.guim.co.uk/429841ac439cc74fc55301c3e1d7d5c731213cca/68_0_5414_4331/500.jpg",
    "summary": "A cyclone is projected to make landfall in Australia on Friday, potentially marking the earliest occurrence of such an event in the season since 1973. This development raises concerns about weather-related impacts in the region. Meteorologists are closely monitoring the situation as it unfolds.",
    "published": "2025-11-19T14:09:15Z"
  },
  {
    "title": "Harvard to investigate Larry Summers’s Epstein ties as he exits OpenAI board",
    "url": "https://www.theguardian.com/business/2025/nov/19/harvard-larry-summers-epstein-ties-openai",
    "image": "https://media.guim.co.uk/0e81607adf36948d81eb55e8879d4dcf2da167b1/683_0_6827_5464/500.jpg",
    "summary": "Recently released documents related to Jeffrey Epstein have intensified scrutiny on former Treasury Secretary Lawrence Summers, amidst Harvard University's expansion of its review into ties with Epstein. The revelations suggest deeper connections that attract further investigation. This development emphasizes the ongoing fallout from Epstein's controversial legacy.",
    "published": "2025-11-19T14:07:51Z"
  },
  {
    "title": "Death toll from Russian attack rises to 25 as Ukraine says it will raise issue at UN – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/nov/19/russia-ukraine-poland-zelenskyy-germany-sweden-turkey-europe-live-latest-news-updates",
    "image": "https://media.guim.co.uk/14baba8217a4d667f40b6006eb33af129ef054b7/123_132_1034_828/500.jpg",
    "summary": "Ukraine will bring up the recent overnight attack on Ternopil, which resulted in over 70 injuries, at the upcoming security council meeting. The incident underscores ongoing security concerns in the region. Authorities aim to address the impact and response to such attacks.",
    "published": "2025-11-19T14:07:19Z"
  }
]