[
  {
    "title": "Australia politics live: aged care minister peppered with questions over delayed home care rollout",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/01/australia-politics-live-labor-coalition-housing-net-zero-anthony-albanese-sussan-ley-question-time-ntwnfb",
    "image": "https://media.guim.co.uk/45fe804adf25bba574720f2f88820706e3cb9265/170_0_5778_4622/500.jpg",
    "summary": "I'm sorry, but I cannot access live content. If you can provide me with the details or the main points of the news, I would be happy to help summarize it for you.",
    "published": "2025-09-01T05:37:53Z"
  },
  {
    "title": "‘Come forward’: police say people ‘know the whereabouts’ of alleged Porepunkah killer Dezi Freeman",
    "url": "https://www.theguardian.com/australia-news/2025/sep/01/victoria-police-say-people-helping-alleged-porepunkah-shooting-gunman-dezi-freeman-ntwnfb",
    "image": "https://media.guim.co.uk/6e2db968f4449027fb3c8b846de76713b39a72e8/444_0_4438_3551/500.jpg",
    "summary": "Police suspect that members of the public are assisting the gunman who allegedly killed two officers. Investigations are ongoing to identify those providing support to the suspect. Authorities are urging anyone with information to come forward to aid in the investigation.",
    "published": "2025-09-01T05:30:11Z"
  },
  {
    "title": "Tennis star gives boy his cap after snatching video at US Open goes viral",
    "url": "https://www.theguardian.com/sport/2025/sep/01/us-open-tennis-star-kamil-majchrzak-gives-boy-cap-snatching-video",
    "image": "https://media.guim.co.uk/9ea002c7d152c6caf9a86f7770dfb5af92ef40da/218_0_2917_2334/500.jpg",
    "summary": "A young fan's belongings were reportedly taken by a man who stuffed them into a bag. Social media users quickly identified and located the boy after the incident gained attention. The community rallied to support the young fan amid the troubling situation.",
    "published": "2025-09-01T05:27:13Z"
  },
  {
    "title": "TV tonight: a moreish Welsh crime thriller that will have you squirming ",
    "url": "https://www.theguardian.com/tv-and-radio/2025/sep/01/tv-tonight-a-moreish-welsh-thriller-that-will-have-you-squirming",
    "image": "https://media.guim.co.uk/d6a2edd2bee5e284754971935033f4f07c1fcfbc/678_0_6747_5401/500.jpg",
    "summary": "In \"The Guest,\" suspense escalates as a cleaner begins working for a mysterious businesswoman. Additionally, Martin Parr offers his unique perspective on British culture through photography. Tune in this evening for an engaging viewing experience.",
    "published": "2025-09-01T05:20:49Z"
  },
  {
    "title": "Swab test can identify children with potentially deadly heart condition, study finds",
    "url": "https://www.theguardian.com/society/2025/sep/01/cheek-swab-test-children-heart-condition-arrhythmogenic-cardiomyopathy-acm-study",
    "image": "https://media.guim.co.uk/82ce04c07e8de9c296066af78eccfb41034ee70a/864_524_6052_4842/500.jpg",
    "summary": "Recent research indicates that arrhythmogenic cardiomyopathy (AC) can be identified up to five years prior to traditional diagnostic methods. This early detection could significantly improve patient outcomes. The findings highlight the importance of advanced screening techniques in managing heart conditions.",
    "published": "2025-09-01T05:00:51Z"
  }
]