[
  {
    "title": "Germany v Slovakia, Northern Ireland v Luxembourg, and more: World Cup 2026 qualifying – live",
    "url": "https://www.theguardian.com/football/live/2025/nov/17/germany-v-slovakia-northern-ireland-v-luxembourg-and-more-world-cup-2026-qualifying-live",
    "image": "https://media.guim.co.uk/2a6728e0f212a5412baa61dfac7edd8470ff0288/276_0_2745_2197/500.jpg",
    "summary": "Daniel Harris provides live updates on the ongoing qualifying rounds for next year's tournament. Keep an eye out for player performances and key match results. Stay tuned for the latest developments in the qualification process.",
    "published": "2025-11-17T21:18:48Z"
  },
  {
    "title": "Australia news live: Victorian Liberals prepare for leadership spill; Sydney harbour bridge may get two-way tolls",
    "url": "https://www.theguardian.com/australia-news/live/2025/nov/18/australia-news-live-victorian-liberal-leader-spill-libspill-coalition-nsw-brad-battin-mark-speakman-sussan-ley-killing-season-ntwnfb",
    "image": "https://media.guim.co.uk/01aba859b93ce943212da5cab35d2d48c0a09fec/469_0_4167_3335/500.jpg",
    "summary": "It seems you intended to refer to a specific news article or event for summarization, but the details are missing. Could you please provide the content or context you'd like summarized?",
    "published": "2025-11-17T21:17:43Z"
  },
  {
    "title": "Acting Fema head resigns after furor over handling of deadly Texas flooding",
    "url": "https://www.theguardian.com/us-news/2025/nov/17/fema-acting-administrator-resignation",
    "image": "https://media.guim.co.uk/7e1c922d3d1c224d547f718fe1e1483521ebdb46/455_0_4585_3667/500.jpg",
    "summary": "A Trump administration official has announced that David Richardson will leave his position at the agency after serving for six months. The specific reasons for his departure have not been disclosed. This change comes amid a period of significant turnover within the administration.",
    "published": "2025-11-17T21:17:21Z"
  },
  {
    "title": "Trump Gaza plan: UN security council to vote on resolution to set up international stabilisation force – live",
    "url": "https://www.theguardian.com/world/live/2025/nov/17/un-security-council-donald-trump-gaza-israel-palestine-middle-east-latest-news-updates",
    "image": "https://media.guim.co.uk/7867331227f208a826b6afcaf9a620ca9df15ae5/518_0_4496_3597/500.jpg",
    "summary": "A U.S.-drafted resolution emphasizes the potential establishment of a future Palestinian state as part of President Biden's plan. The proposal also calls for the deployment of an international security force to support stability in the region. This initiative aims to address ongoing tensions between Israel and Palestine.",
    "published": "2025-11-17T21:10:29Z"
  },
  {
    "title": "Cop30: UN accused of crackdown on Indigenous people – as it happened",
    "url": "https://www.theguardian.com/environment/live/2025/nov/17/cop30-belem-brazil-global-warming-latest-news-updates",
    "image": "https://media.guim.co.uk/5acfadcf5b4aa1d99697143df9bcd633c20e75d7/0_0_3333_2667/500.jpg",
    "summary": "As the summit progresses into its second week, participants face ongoing complex issues. Anxiety is rising regarding the potential outcomes of the conference. Key stakeholders are grappling with unresolved topics that could impact future decisions.",
    "published": "2025-11-17T21:03:36Z"
  }
]