[
  {
    "title": "The 25+ best Black Friday and Cyber Monday home deals in the US – so far",
    "url": "https://www.theguardian.com/thefilter-us/2025/nov/18/best-black-friday-cyber-monday-home-deals",
    "image": "https://media.guim.co.uk/11ab2f8fcf53abd6067324aa6fef1b2a98ef2a75/1_0_5763_4612/500.jpg",
    "summary": "A comprehensive review has highlighted notable sales on various home products, ranging from toilet paper to toolsets. The focus is on identifying deals that offer true value for consumers. This guide aims to help shoppers make informed purchasing decisions.",
    "published": "2025-11-28T19:15:28Z"
  },
  {
    "title": "The 20+ best US Black Friday tech deals on TVs, tablets, phones, smart watches and more",
    "url": "https://www.theguardian.com/thefilter-us/2025/nov/19/best-black-friday-cyber-monday-tech-deals",
    "image": "https://media.guim.co.uk/43eaf26d6c93bd98601a0c78042b6df5258e1244/1_0_5998_4800/500.jpg",
    "summary": "Major tech brands like Apple, Samsung, and Google are offering discounts on a range of gadgets, including smartphones, TVs, smart-home cameras, and headphones. Shoppers can find significant deals on popular electronics. This sale provides a great opportunity to upgrade or acquire new devices.",
    "published": "2025-11-28T19:15:04Z"
  },
  {
    "title": "The 33+ best US Black Friday kitchen deals on blenders, pans, cleaning tools and more",
    "url": "https://www.theguardian.com/thefilter-us/2025/nov/17/best-black-friday-cyber-monday-kitchen-deals",
    "image": "https://media.guim.co.uk/52c230c04961c427ffe60d975656e38cfe97308d/0_0_6000_4800/500.jpg",
    "summary": "Early Black Friday kitchen deals are now available, featuring discounts from popular brands like Le Creuset, Vitamix, and Yeti. Shoppers can take advantage of these offers ahead of the main event. Check out the best deals to upgrade your kitchen essentials.",
    "published": "2025-11-28T19:14:55Z"
  },
  {
    "title": "People deriving income solely from state pension won’t be taxed, says chancellor",
    "url": "https://www.theguardian.com/money/2025/nov/28/people-deriving-income-solely-from-state-pension-wont-be-taxed-says-chancellor",
    "image": "https://media.guim.co.uk/f2f9599d15cc295c15a25418367cb77c148c6a83/809_0_4033_3225/500.jpg",
    "summary": "Recent clarifications suggest a potential two-tier pension system, distinguishing between retirees dependent solely on the new state pension and those receiving benefits from private schemes. This change could lead to varying levels of financial security for retirees. The implications could significantly affect retirement planning and benefits distribution.",
    "published": "2025-11-28T19:13:45Z"
  },
  {
    "title": "National guard shooting suspect to be charged with murder as Trump steps up immigration crackdown – US politics live ",
    "url": "https://www.theguardian.com/us-news/live/2025/nov/28/trump-washington-dc-shooting-politics-updates",
    "image": "https://media.guim.co.uk/5fa5bb189a8fcb56fe806c3c88ffb49a8864babf/0_0_3156_2525/500.jpg",
    "summary": "The U.S. Attorney for D.C. has upgraded charges to first-degree murder following the death of a National Guard member. Meanwhile, the U.S. President announced plans to \"permanently pause\" migration from \"third world countries.\" These developments highlight ongoing issues related to crime and immigration policy in the U.S.",
    "published": "2025-11-28T19:09:53Z"
  }
]