[
  {
    "title": "US government shutdown live: House will return to DC next week, says speaker, as Democrats blame ‘unhinged’ Trump for shutdown",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/01/us-government-shutdown-update-2025-shutting-funding-trump-democrats-republicans-live-updates-latest-news",
    "image": "https://media.guim.co.uk/1cdaebff7784a2a7255d78dd53eaa0e4593e0934/634_0_5000_4000/500.jpg",
    "summary": "Mike Johnson announced that the House will reconvene, while Chuck Schumer and Hakeem Jeffries expressed concerns over President Biden's increasingly \"erratic\" behavior in recent days. The comments highlight growing tensions in the political landscape. This situation underscores potential challenges in governance and party unity.",
    "published": "2025-10-01T15:19:32Z"
  },
  {
    "title": "Powell victory in Labour’s deputy leader contest would mean ‘division and disunity’, Phillipson suggests – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/oct/01/keir-starmer-labour-conference-nigel-farage-reform-uk-politics-latest-news-updates",
    "image": "https://media.guim.co.uk/76ab272bb5d2ecfbb71be150d5f8572aba021427/254_0_3099_2480/500.jpg",
    "summary": "At Labour's conference on Wednesday, Lucy Powell and Bridget Phillipson presented their arguments to party members. Both emphasized their visions and strategies for the party moving forward. Their addresses aimed to rally support and energize the membership ahead of upcoming challenges.",
    "published": "2025-10-01T15:18:26Z"
  },
  {
    "title": "Europe ‘in most difficult and dangerous situation since second world war,’ Danish PM warns – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/oct/01/mette-frederiksen-denmark-europe-russia-vladimir-putin-volodymyr-zelenskyy-ukraine-hybrid-war-security-europe-live-news",
    "image": "https://media.guim.co.uk/e2203d0e9eb1fee0167cfb663bf6eb9a6c5b5af7/348_0_4680_3744/500.jpg",
    "summary": "Danish Prime Minister Mette Frederiksen supports the European Commission's initiative for a reparation loan to Ukraine, which would be secured by frozen Russian assets. This proposal aims to provide financial assistance to Ukraine amid ongoing conflicts. Frederiksen's endorsement highlights Denmark's commitment to aiding Ukraine's recovery.",
    "published": "2025-10-01T15:17:29Z"
  },
  {
    "title": "Women’s Cricket World Cup: Australia v New Zealand – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/01/womens-cricket-world-cup-live-australia-v-new-zealand",
    "image": "https://media.guim.co.uk/f09646df7b62f59fb7c410977b3e389941e49d84/198_110_3829_3063/500.jpg",
    "summary": "Australia begins their 50-over title defense at Holkar Stadium in Indore. James Wallace will provide live updates throughout the match. Fans can follow the action as the tournament unfolds.",
    "published": "2025-10-01T15:12:42Z"
  },
  {
    "title": "Sonay Kartal pulls off biggest win of career to stun world No 5 Mirra Andreeva",
    "url": "https://www.theguardian.com/sport/2025/oct/01/jannik-sinner-learner-tien-first-title-since-wimbledon-china-open-triumph-tennis",
    "image": "https://media.guim.co.uk/96e035966c711baa461d1c85ae48790ed188c461/342_0_4324_3459/500.jpg",
    "summary": "Sonay Kartal achieved a career-best performance at the China Open, defeating world No. 5 Mirra Andreeva. The match ended with scores of 7-5, 2-6, 7-5 in favor of Kartal. This victory marks a significant milestone in her tennis career.",
    "published": "2025-10-01T15:11:30Z"
  }
]