[
  {
    "title": "WTA Finals tennis: Jessica Pegula v Elena Rybakina in semi-finals – live",
    "url": "https://www.theguardian.com/sport/live/2025/nov/07/wta-finals-tennis-rybakina-pegula-sabalenka-anisimova-live",
    "image": "https://media.guim.co.uk/91d59229e30328539432ee29db89ce2ae33e08dc/145_0_2440_1952/500.jpg",
    "summary": "Niall McVeigh will host the semi-finals of the season-ending tournament in Riyadh. The event marks a significant conclusion to the competitive season. Fans can expect exciting matches as top players vie for a place in the finals.",
    "published": "2025-11-07T15:16:55Z"
  },
  {
    "title": "‘Musk is Tesla and Tesla is Musk’ – why investors are happy to pay him $1tn",
    "url": "https://www.theguardian.com/technology/2025/nov/07/tesla-why-us-investors-are-happy-to-pay-elon-musk-1-trillion",
    "image": "https://media.guim.co.uk/6cb8833e4592b9303ab0d6e5865b64e9e0c5596c/277_0_2586_2069/500.jpg",
    "summary": "Elon Musk is on track to become the world's first trillionaire, reflecting a U.S. investment culture that favors innovative and high-growth entrepreneurs. This trend highlights the willingness of investors to support visionary leaders in technology and other sectors. Such a milestone underscores the growing influence of wealth generated through innovation in the modern economy.",
    "published": "2025-11-07T15:15:38Z"
  },
  {
    "title": "Pauline Collins obituary",
    "url": "https://www.theguardian.com/film/2025/nov/07/pauline-collins-obituary",
    "image": "https://media.guim.co.uk/20154a91d166242e5e240a6e48c0dbcad0542141/0_768_2276_1820/500.jpg",
    "summary": "The actor famous for portraying the dissatisfied housewife Shirley Valentine, a role that led to an Oscar nomination due to her quest for romance in Greece, has passed away. She left a significant impact on film and theater with her iconic character. Tributes are pouring in for her contributions to the arts.",
    "published": "2025-11-07T15:15:15Z"
  },
  {
    "title": "Independent film festival in New York cancelled after China puts pressure on directors",
    "url": "https://www.theguardian.com/world/2025/nov/07/indiechina-independent-film-festival-new-york-cancelled-china-pressure-directors",
    "image": "https://media.guim.co.uk/452daf4e3bc15ed91fdfac9b41530cbdeceecd3a/141_0_1631_1304/500.jpg",
    "summary": "Several directors have requested that their films be withdrawn from the IndieChina festival, which was set to begin this weekend. This move raises concerns about the festival's direction and the filmmakers' dissatisfaction. The festival now faces uncertainty ahead of its opening.",
    "published": "2025-11-07T15:11:27Z"
  },
  {
    "title": "Tuchel open to England extension beyond World Cup; awards for Amorim and Mbeumo: football news – live",
    "url": "https://www.theguardian.com/football/live/2025/nov/07/thomas-tuchel-england-squad-jude-bellingham-weekend-team-news-and-more-football-live",
    "image": "https://media.guim.co.uk/ebb76a84122a9c852e04c56d3cdf2cb839d2ada5/1915_62_5548_4437/500.jpg",
    "summary": "England manager Thomas Tuchel has announced his latest squad ahead of a busy weekend in the Premier League. The announcement comes as teams prepare for critical matches. Fans await to see how the selections will impact upcoming games.",
    "published": "2025-11-07T15:10:48Z"
  }
]