[
  {
    "title": "Records tumble as England set South Africa target of 305: second men’s T20 international – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/12/england-v-south-africa-second-mens-t20-international-live",
    "image": "https://media.guim.co.uk/52b4adf10d5aeeaac8fe460b9fbe9868671bf366/132_0_1782_1425/500.jpg",
    "summary": "Harry Brook's team is aiming to level the series at Old Trafford, with Rob Smyth providing over-by-over updates. The match is crucial for the team's momentum in the series. Fans are eagerly following the live reports for the latest developments.",
    "published": "2025-09-12T20:31:18Z"
  },
  {
    "title": "Charlie Kirk shooting latest: Utah governor confirms identity of suspect and says family friend turned him in",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/12/charlie-kirk-shooter-suspect-latest-news-updates-donald-trump-utah",
    "image": "https://media.guim.co.uk/b3900dee754cc4e9b61442cbd4826f211c47f0af/0_969_1693_1353/500.jpg",
    "summary": "Spencer Cox reports that 22-year-old Tyler Robinson informed a family friend about shooting Kirk. The FBI Director confirmed that Robinson was apprehended on Thursday evening. Further details about the incident and the suspect's motives remain under investigation.",
    "published": "2025-09-12T20:29:35Z"
  },
  {
    "title": "US immigration officers kill man trying to flee vehicle stop near Chicago",
    "url": "https://www.theguardian.com/us-news/2025/sep/12/ice-agent-shooting-chicago",
    "image": "https://media.guim.co.uk/614880ebdc98251c09db7173da72829dc3822ce4/275_0_2735_2189/500.jpg",
    "summary": "An officer was shot after a suspect allegedly tried to drive his vehicle into an arrest team, hitting one of the officers. The incident occurred during an operation, prompting a swift response. The situation is under investigation by authorities.",
    "published": "2025-09-12T20:27:22Z"
  },
  {
    "title": "Senators say US is complicit in Israel’s ethnic cleansing of Gaza",
    "url": "https://www.theguardian.com/us-news/2025/sep/11/democratic-senators-gaza-ethnic-cleansing",
    "image": "https://media.guim.co.uk/1f73c95af9f44beec621c1d0d34374241a9e3db8/0_0_3573_2857/500.jpg",
    "summary": "Democratic senators Chris Van Hollen and Jeff Merkley have returned from a fact-finding trip to the region, concluding that urgent action is needed. They underscored serious concerns about the ongoing situation affecting local communities. Their findings highlight the pressing need for legislative responses to address the issues identified during their visit.",
    "published": "2025-09-12T20:25:20Z"
  },
  {
    "title": "Canelo Álvarez and Terence Crawford hit 167½lb ahead of Las Vegas megafight",
    "url": "https://www.theguardian.com/sport/2025/sep/12/canelo-alvarez-terence-crawford-weigh-in-las-vegas",
    "image": "https://media.guim.co.uk/522347afa1adb6923235f352c2fd95e031843380/430_0_4025_3221/500.jpg",
    "summary": "Álvarez and Crawford weighed in at 167½ pounds ahead of their highly anticipated fight at Allegiant Stadium. The match is scheduled to take place during the Mexican Independence weekend. This showdown marks a significant moment in boxing history.",
    "published": "2025-09-12T20:12:38Z"
  }
]