[
  {
    "title": "England v Argentina: Autumn Nations Series rugby union – live",
    "url": "https://www.theguardian.com/sport/live/2025/nov/23/england-v-argentina-autumn-nations-series-rugby-union-live",
    "image": "https://media.guim.co.uk/d74f3a73c67519743cd7efb435ec0a238facf049/456_0_7016_5613/500.jpg",
    "summary": "Daniel Gallan offers live updates on England's crucial final match of 2025. Stay tuned for minute-by-minute coverage of the team's performance and key moments. Follow along for the latest developments as the game unfolds.",
    "published": "2025-11-23T15:18:16Z"
  },
  {
    "title": "Leeds v Aston Villa: Premier League – live",
    "url": "https://www.theguardian.com/football/live/2025/nov/23/leeds-v-aston-villa-premier-league-live",
    "image": "https://media.guim.co.uk/cb0c365af91feabe73a6643323839aa9f8031ff8/0_832_2066_1652/500.jpg",
    "summary": "Leeds United faces a crucial match to improve their standings in the league, while Aston Villa aims to secure a spot in the top five. Billy Munday provides the latest updates on the teams' performances and prospects. The outcome will significantly impact both clubs' positions in the table.",
    "published": "2025-11-23T15:17:53Z"
  },
  {
    "title": "Cyril Ramaphosa bangs gavel to close G20 summit after US handover row",
    "url": "https://www.theguardian.com/world/2025/nov/23/cyril-ramaphosa-gavel-g20-summit-us-handover",
    "image": "https://media.guim.co.uk/7048e7bdebeefc1e85b73b14cba876e80e63b2d7/235_51_960_768/500.jpg",
    "summary": "South Africa has declined a proposal from the United States, which is set to host the next summit, for the South African president to transfer authority to an embassy official. The rejection highlights tensions between the two nations regarding the summit's organization and leadership. This decision underscores South Africa's desire to maintain its sovereignty and decision-making power in international affairs.",
    "published": "2025-11-23T15:08:20Z"
  },
  {
    "title": "Trump blasts Ukraine for ‘zero gratitude’ as Germany says deal to end war unlikely to be reached by Thursday deadline – live",
    "url": "https://www.theguardian.com/world/live/2025/nov/23/ukrainian-us-emergency-talks-plan-war-russia-live",
    "image": "https://media.guim.co.uk/c82b9742a207341ec5c4ce1982ad3037ee8f2495/511_0_6651_5321/500.jpg",
    "summary": "Chancellor Friedrich Merz stated that the situation regarding Ukraine is far from resolution. This comment comes as former President Trump criticized Ukrainian leadership on social media. The remarks highlight ongoing tensions and differing perspectives on the conflict's management.",
    "published": "2025-11-23T15:07:42Z"
  },
  {
    "title": "I Dream of Theresa May review – willing immigrant’s political conversion spurs stiff debate",
    "url": "https://www.theguardian.com/stage/2025/nov/23/i-dream-of-theresa-may-review-tara-theatre",
    "image": "https://media.guim.co.uk/516799198aa5ec05730f5ab2c3b4b206b533a3d9/295_0_4624_3701/500.jpg",
    "summary": "A young gay Indian man experiences a phantom vision of a Tory politician, which teaches him about Britishness. However, the story is more of a light-hearted exploration rather than a biting satire. The narrative offers a unique perspective on identity and cultural assimilation.",
    "published": "2025-11-23T15:00:13Z"
  }
]