[
  {
    "title": "Chelsea v Manchester City: WSL – football live",
    "url": "https://www.theguardian.com/football/live/2025/sep/05/chelsea-v-manchester-city-wsl-football-live",
    "image": "https://media.guim.co.uk/e3d7dbdcd8073bdcaece1de279903403cd8852c8/0_488_2960_2367/500.jpg",
    "summary": "Champions Chelsea are set to host Manchester City at Stamford Bridge to begin the new Women's Super League (WSL) season. Rob Smyth will provide minute-by-minute coverage of the match. The highly-anticipated game marks an exciting start to the league.",
    "published": "2025-09-05T18:43:51Z"
  },
  {
    "title": "Denmark v Scotland, Isak in action for Sweden and more: 2026 World Cup qualifiers - clockwatch",
    "url": "https://www.theguardian.com/football/live/2025/sep/05/denmark-v-scotland-isak-in-action-for-sweden-and-more-2026-world-cup-qualifiers-clockwatch",
    "image": "https://media.guim.co.uk/36462bea07b6b7ddbd14db5157f9849d00948198/761_0_4927_3943/500.jpg",
    "summary": "Barry Glendenning will provide updates on Scotland's match against Denmark in Copenhagen, along with coverage of nine other World Cup qualifiers. The event highlights key moments and scores from the qualification process. Fans can expect timely insights and analysis throughout the matches.",
    "published": "2025-09-05T18:43:17Z"
  },
  {
    "title": "Revisions and rising unemployment: what to know about the US jobs report",
    "url": "https://www.theguardian.com/business/2025/sep/05/august-us-jobs-report-explainer",
    "image": "https://media.guim.co.uk/42c09313cb2ef1cf817bcfb317e0a3711452ec5a/597_0_6042_4832/500.jpg",
    "summary": "August's labor market report indicates a slowdown, showing negative job growth for the first time since 2020. This signals potential economic challenges ahead as hiring cools. Analysts are closely monitoring these trends for future implications on the economy.",
    "published": "2025-09-05T18:43:04Z"
  },
  {
    "title": "Lammy made deputy PM with Cooper as foreign secretary and Mahmood at Home Office – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/05/angela-rayner-stamp-duty-labour-starmer-reform-nigel-farage-uk-politics-live-news-updates",
    "image": "https://media.guim.co.uk/913b9d574a8deaf211dcd44ce2b6bec9036a29d1/0_0_5000_4000/500.jpg",
    "summary": "Keir Starmer has restructured his senior team following Angela Rayner's resignation, which was prompted by a disagreement over stamp duty policies. Rayner's departure signifies a significant shift in Labour's internal dynamics as the party navigates policy disputes. Starmer's new appointments aim to strengthen his leadership and refocus the party's strategy.",
    "published": "2025-09-05T18:42:37Z"
  },
  {
    "title": "Most of 475 people arrested by US immigration agents at Georgia Hyundai facility are Korean nationals – live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/05/donald-trump-pentagon-department-of-war-immigration-tariffs-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/044eb5ce3fb7049437c4044c77272848f314af01/996_0_5000_4000/500.jpg",
    "summary": "ICE's investigative division carried out a warrant related to an ongoing criminal investigation, according to a spokesperson from Homeland Security. The specific details of the investigation have not been disclosed. This action underscores ICE's continued efforts to address potential violations of law.",
    "published": "2025-09-05T18:42:28Z"
  }
]