[
  {
    "title": "Trump announces Space Command will move from Colorado to Alabama – live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/02/congress-returns-government-shutdown-funding-trump-announcement-us-politics-live-latest-updates",
    "image": "https://media.guim.co.uk/37dd38e8ca0e0fcabf8e02a039a62a031d60968c/694_509_4364_3491/500.jpg",
    "summary": "In his first public appearance in several days, the president declared Huntsville, Alabama, as \"Rocket City.\" This designation aims to honor the city's significant contributions to aerospace and rocket development. The announcement underscores Huntsville’s importance in the aerospace industry.",
    "published": "2025-09-02T19:21:30Z"
  },
  {
    "title": "US Open quarter-finals: Alcaraz faces Lehecka after Pegula powers past Krejcikova – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/02/us-open-tennis-2025-pegula-alcaraz-quarter-finals-day-ten-live",
    "image": "https://media.guim.co.uk/1b7550eb3f8eff097bbe58cc292704566f2c59a1/170_0_1555_1244/500.jpg",
    "summary": "Carlos Alcaraz is set to compete against Jiri Lehecka in an upcoming match. This follows Jessica Pegula's victory over Barbora Krejcikova at Flushing Meadows. The event showcases exciting tennis action at the prestigious tournament.",
    "published": "2025-09-02T19:18:46Z"
  },
  {
    "title": "Tantrum transfers, hysteria and endless cash: the greatest window ever had it all | Barney Ronay",
    "url": "https://www.theguardian.com/football/2025/sep/02/tantrum-transfers-record-fees-greatest-transfer-window-premier-league",
    "image": "https://media.guim.co.uk/76f69a5a50f2beb4fc2d550c439c642ed845facd/778_103_4114_3291/500.jpg",
    "summary": "A groundbreaking three-month tracking shot has captivated audiences with its emotional depth and intricate storytelling. The innovative cinematography combines strategic elements with a compelling plot. This unique approach has garnered significant attention in the entertainment industry.",
    "published": "2025-09-02T19:01:01Z"
  },
  {
    "title": "What are Labour’s new asylum policies? And what are the political risks?",
    "url": "https://www.theguardian.com/uk-news/2025/sep/02/labour-new-asylum-measures-political-risks",
    "image": "https://media.guim.co.uk/6a85bea7f367fa243ad11e574ebcecfb4f435abb/208_0_1461_1169/500.jpg",
    "summary": "Yvette Cooper has unveiled a series of stringent policies in response to a summer influenced by Farage and Reform UK. The announcement aims to address pressing issues and counteract the impact of these political movements. Cooper's proposals signal a strategic shift within her party to regain political ground.",
    "published": "2025-09-02T19:00:35Z"
  },
  {
    "title": "UK hit by fresh sell-off in government bond markets as pound weakens",
    "url": "https://www.theguardian.com/business/2025/sep/02/uk-hit-by-fresh-sell-off-in-government-bond-markets-as-pound-weakens",
    "image": "https://media.guim.co.uk/cd564a102e737728c9ff5675ab8223327bff51ae/42_0_4195_3357/500.jpg",
    "summary": "The yield on 30-year gilts in the UK has reached its highest level since 1998, reflecting increasing borrowing costs for the government. This rise indicates that investors require higher returns due to perceived economic risks. Consequently, financing the UK's debt will become more expensive.",
    "published": "2025-09-02T19:00:04Z"
  }
]