[
  {
    "title": "West Ham v Tottenham: Premier League – live",
    "url": "https://www.theguardian.com/football/live/2025/sep/13/west-ham-v-tottenham-premier-league-live",
    "image": "https://media.guim.co.uk/8f59940a4e519de8354143a8b83d6696f14e2607/306_0_4560_3648/500.jpg",
    "summary": "Tottenham is set to begin the post-Daniel Levy era by facing West Ham at the London Stadium. Fans are eager to see if the team can secure a victory in this new chapter. Emillia Hawkins will provide updates on the match.",
    "published": "2025-09-13T16:35:21Z"
  },
  {
    "title": "Police say 110,000 attending ‘unite the kingdom’ rally in London, with some in crowd attacking officers – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/13/uk-politics-latest-news-unite-the-kingdom-march-far-right-rally-london-labour-keir-starmer",
    "image": "https://media.guim.co.uk/42917aaac388a66b0457a04458b3f2bc3a1a04ac/1037_202_4023_3218/500.jpg",
    "summary": "The Metropolitan Police reported that approximately 110,000 people attended a rally, though they found it challenging to confirm exact attendance numbers. Tensions escalated when a group in Whitehall threw projectiles at officers. The situation highlights concerns about safety and public order during large gatherings.",
    "published": "2025-09-13T16:33:21Z"
  },
  {
    "title": "Robin Roefs heroics earn Sunderland deserved point at Crystal Palace",
    "url": "https://www.theguardian.com/football/2025/sep/13/crystal-palace-sunderland-premier-league-match-report",
    "image": "https://media.guim.co.uk/99bd927eecd7cc6f59a7b246def5fd407366748b/492_0_2986_2389/500.jpg",
    "summary": "In a goalless draw between Sunderland and Crystal Palace, the goalkeeper showcased impressive skills by saving shots from Yeremy Pino, Christantus Uche, and Jean-Philippe Mateta. The match highlighted the goalkeeper's key role in maintaining a clean sheet. Despite several scoring opportunities, neither team managed to find the back of the net.",
    "published": "2025-09-13T16:31:50Z"
  },
  {
    "title": "Emiliano Martínez denies Everton and Grealish to secure a point for Aston Villa",
    "url": "https://www.theguardian.com/football/2025/sep/13/everton-aston-villa-premier-league-match-report",
    "image": "https://media.guim.co.uk/07684977dd1cb41485196440dc67daf1187e936b/362_0_3262_2610/500.jpg",
    "summary": "Everton and Aston Villa played to a 0-0 draw, marking Villa's third consecutive match without a goal this season. The result highlights Villa's ongoing struggles to find the back of the net. Both teams will be looking to improve their attacking performances in upcoming matches.",
    "published": "2025-09-13T16:31:00Z"
  },
  {
    "title": "Nick Woltemade makes instant impact on Newcastle debut to see off Wolves",
    "url": "https://www.theguardian.com/football/2025/sep/13/newcastle-wolves-premier-league-match-report",
    "image": "https://media.guim.co.uk/135afadea83866324d127fb5ec54ab6f4276bca4/1099_201_2918_2334/500.jpg",
    "summary": "Nick Woltemade made a successful debut for Newcastle after joining the team on deadline day. He scored the only goal in a 1-0 victory against Wolves. This win marked a positive start for the new signing.",
    "published": "2025-09-13T16:25:05Z"
  }
]