[
  {
    "title": "Lincoln v Chelsea, Liverpool v Southampton, and more: Carabao Cup – live",
    "url": "https://www.theguardian.com/football/live/2025/sep/23/lincoln-v-chelsea-liverpool-v-southampton-and-more-carabao-cup-live",
    "image": "https://media.guim.co.uk/aa7ea0542d78eebc6f7c19014d72e7c71bbc3080/1005_0_3048_2440/500.jpg",
    "summary": "Rob Smyth will provide coverage of the latest developments as more Premier League teams participate in the third round of the League Cup. Fans can expect updates and insights on the matches. Stay tuned for exciting action as teams vie for a spot in the next round.",
    "published": "2025-09-23T19:23:43Z"
  },
  {
    "title": "Trump says Nato countries should shoot down Russian aircraft entering their airspace – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/23/donald-trump-unga-autism-tylenol-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/a25b42e2be033e6f69d3a2acfe088ab740d153fb/1361_323_5481_4385/500.jpg",
    "summary": "US President comments follow multiple drone incursions by Russian fighter jets. He criticizes European countries regarding their handling of migration issues. The statements highlight ongoing geopolitical tensions and domestic challenges.",
    "published": "2025-09-23T19:11:56Z"
  },
  {
    "title": "Ryan Routh found guilty of 2024 attempted assassination of Trump in Florida",
    "url": "https://www.theguardian.com/us-news/2025/sep/23/ryan-routh-verdict-trump-assassination-attempt",
    "image": "https://media.guim.co.uk/75645feb31a36626bdd941333dbf2401bf34f6f4/421_0_2104_1683/500.jpg",
    "summary": "Routh conducted his own defense during the trial concerning his failed assassination attempt on former President Trump at a West Palm Beach golf course. The case highlighted his controversial decision to represent himself in court. The trial garnered significant media attention due to the high-profile nature of the defendant and the intentions behind the crime.",
    "published": "2025-09-23T19:06:58Z"
  },
  {
    "title": "Colorado lightning strikes kill two elk hunters caught in ‘horrific act of nature’",
    "url": "https://www.theguardian.com/us-news/2025/sep/23/colorado-lightning-strikes-elk-hunters",
    "image": "https://media.guim.co.uk/93cab2ba9907cb967804fffa88e7234bbfa0a475/0_0_3000_2400/500.jpg",
    "summary": "Rescue crews discovered the bodies of Andrew Porter and Ian Stasko following a storm that is believed to have caused their deaths almost instantly. The tragic incident highlights the storm's sudden and severe impact. Authorities are investigating the circumstances surrounding the event.",
    "published": "2025-09-23T19:04:01Z"
  },
  {
    "title": "Trump spoke to world leaders at the UN, but his digs at Europe were red meat for his base",
    "url": "https://www.theguardian.com/us-news/2025/sep/23/trump-un-speech-maga-base",
    "image": "https://media.guim.co.uk/11e454a9018130a50e3160f655d79faeadcf0289/596_0_5961_4771/500.jpg",
    "summary": "During a meeting with European leaders, Trump criticized their policies, asserting they were harming their own countries. His remarks were described as resembling \"Maga madlibs,\" reflecting a style of communication often associated with his political base. The comments highlight ongoing tensions between Trump and European leaders regarding governance and national policies.",
    "published": "2025-09-23T19:03:28Z"
  }
]