[
  {
    "title": "England v Sri Lanka: Women’s Cricket World Cup – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/11/england-v-sri-lanka-womens-cricket-world-cup-live",
    "image": "https://media.guim.co.uk/fda74251e186dfb2397a21560c219c9121d058a9/318_0_2661_2129/500.jpg",
    "summary": "Nat Sciver-Brunt's team is set to compete against Sri Lanka in an exciting match. Follow our writers for live updates and insights throughout the game. Stay tuned for an engaging over-by-over report.",
    "published": "2025-10-11T13:16:36Z"
  },
  {
    "title": "Trump says ‘for the most part, there is consensus’ on next stages of Gaza ceasefire plan – live",
    "url": "https://www.theguardian.com/world/live/2025/oct/11/israel-gaza-ceasefire-hamas-hostages-netanyahu-trump-middle-east-latest-news-updates",
    "image": "https://media.guim.co.uk/286e2b42409fca55e1390fbf503b01077dfa1bcb/252_0_3780_3024/500.jpg",
    "summary": "The US president stated that Hamas is currently gathering hostages, while displaced Palestinians are returning to northern Gaza. The situation highlights the ongoing tensions and humanitarian challenges in the region. Efforts to address the crisis continue amid escalating concerns.",
    "published": "2025-10-11T13:14:26Z"
  },
  {
    "title": "Democrats refuse to fold over shutdown as Republican outrage builds",
    "url": "https://www.theguardian.com/us-news/2025/oct/11/republicans-democrats-us-government-shutdown",
    "image": "https://media.guim.co.uk/a6c3459f9a92fac4bb646fc6445b3d99f18efadf/607_0_3333_2667/500.jpg",
    "summary": "The party remains steadfast in its healthcare policies, signaling a commitment to hold out for its principles. This decision has garnered enthusiasm from its progressive supporters. The firm stance reflects the party's dedication to advancing its agenda.",
    "published": "2025-10-11T13:00:57Z"
  },
  {
    "title": "Why is this Fox News host speculating about AOC’s sex life? | Arwa Mahdawi",
    "url": "https://www.theguardian.com/commentisfree/2025/oct/11/why-is-this-fox-news-host-speculating-about-aocs-sex-life",
    "image": "https://media.guim.co.uk/7773c9ac2cafbf7875462ed43955744e3d6d3dd5/770_0_4564_3651/500.jpg",
    "summary": "Jesse Watters made a contentious claim involving Congresswoman Alexandria Ocasio-Cortez and Stephen Miller, which has drawn criticism. A colleague referred to his comments as 'creepy.' The remarks have sparked controversy and highlighted tensions within political discourse.",
    "published": "2025-10-11T13:00:24Z"
  },
  {
    "title": "Trump is ‘obsessed’ with seeming pro-worker – but his actions suggest otherwise",
    "url": "https://www.theguardian.com/us-news/2025/oct/11/trump-impact-labor-force-workers",
    "image": "https://media.guim.co.uk/7a864cde219edadfa6a57ba9936460fd9462256e/157_0_4075_3261/500.jpg",
    "summary": "The current administration's policies are negatively impacting agriculture and various other sectors. This has led to a bleak economic outlook for affected industries. Concerns are rising about the long-term effects of these policies on overall economic health.",
    "published": "2025-10-11T13:00:23Z"
  }
]