[
  {
    "title": "Australia news live: ‘unedifying week’ for Coalition, says Hume; Trump reportedly calls Albanese ‘a good man’",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/12/anthony-albanese-pacific-islands-forum-woodside-north-west-shelf-decision-sussan-ley-labor-coalition-ntwnfb",
    "image": "https://media.guim.co.uk/e3aaf3bc2ecae1810a745391e7cc326d1fa8d84c/1144_0_5512_4409/500.jpg",
    "summary": "Stay updated with real-time news updates, covering a range of topics and events. Access breaking news as it unfolds and get the most recent developments. Join the conversation and stay informed on current affairs.",
    "published": "2025-09-11T23:26:02Z"
  },
  {
    "title": "A quiet Utah town reckons with Charlie Kirk’s shooting: ‘Nothing like this has happened here’",
    "url": "https://www.theguardian.com/us-news/2025/sep/11/utah-residents-react-charlie-kirk-shooting",
    "image": "https://media.guim.co.uk/48101dfa572565f7cc045a630a238048da9baed7/601_0_5413_4333/500.jpg",
    "summary": "Mourners gathered to pay their respects to a far-right activist and ally of Trump, reflecting on his controversial and polarizing legacy. The event sparked discussions about his impact on political discourse. Many expressed mixed feelings about his contributions to the ideologies he espoused.",
    "published": "2025-09-11T23:20:40Z"
  },
  {
    "title": "Charlie Kirk shooting latest: Trump encourages nonviolent response as search continues for shooting suspect",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/11/charlie-kirk-shot-latest-news-updates-utah-university-donald-trump",
    "image": "https://media.guim.co.uk/9a38893e62f086205c21f83902cafdb2120e4a81/1006_0_6827_5464/500.jpg",
    "summary": "Trump praises Kirk for advocating nonviolence, expressing a desire for similar responses from the public. Meanwhile, the FBI has released images of a shooting suspect and is offering a $100,000 reward for information leading to an arrest. The situation highlights ongoing calls for peaceful responses amid rising violence.",
    "published": "2025-09-11T23:16:38Z"
  },
  {
    "title": "Premier League: 10 things to look out for this weekend",
    "url": "https://www.theguardian.com/football/2025/sep/12/premier-league-10-things-to-look-out-for-this-weekend",
    "image": "https://media.guim.co.uk/86e26b65034e807a0bc339e2a1e224881404d095/0_0_5000_4000/500.jpg",
    "summary": "Ange Postecoglou debuted as manager for Nottingham Forest, while Newcastle showcased a revamped forward line in their latest match. Meanwhile, the Manchester derby was a disappointing encounter for both teams. The weekend featured key developments in team strategies and performances.",
    "published": "2025-09-11T23:01:19Z"
  },
  {
    "title": "Ed Sheeran: Play review – subcontinental sounds and shards of darkness – but still unmistakably him",
    "url": "https://www.theguardian.com/music/2025/sep/12/ed-sheeran-play-review",
    "image": "https://media.guim.co.uk/c74dc44efb6c8321f5904106cee69a1793b3ad5e/0_33_3000_2398/500.jpg",
    "summary": "Ed Sheeran's eighth album returns to a more simplistic sound after two albums of subdued tones, blending Indian and Persian influences. The new work offers a fresh perspective with unexpected elements. Overall, it marks a shift back to his roots while exploring new musical landscapes.",
    "published": "2025-09-11T23:00:19Z"
  }
]