[
  {
    "title": "Oil price rises after Opec+ pauses oil output hikes amid glut fears – business live",
    "url": "https://www.theguardian.com/business/live/2025/nov/03/oil-price-rises-opec-pauses-oil-output-hikes-uk-manufacturing-stock-market-business-live-news",
    "image": "https://media.guim.co.uk/69d17126764db38ba3dcbc65016775bc7b0ca5b0/354_0_3058_2447/500.jpg",
    "summary": "Opec+ has decided to pause increases in oil output beyond December due to concerns over a potential crude oil glut. This decision comes amidst ongoing economic and financial developments. Analysts are closely monitoring the situation as it unfolds.",
    "published": "2025-11-03T07:16:23Z"
  },
  {
    "title": "Optus customer who reported triple-zero outage told to go to store – as it happened",
    "url": "https://www.theguardian.com/australia-news/live/2025/nov/03/australia-politics-live-nationals-net-zero-liberals-labor-bulk-billing-optus-sussan-ley-anthony-albanese-question-time",
    "image": "https://media.guim.co.uk/cb1fe63635ec5c89258f898850824339dec49938/456_0_4560_3648/500.jpg",
    "summary": "The blog has officially ceased its operations and will no longer be updated. Readers are encouraged to explore other available resources or platforms. Thank you for your support throughout the blog's run.",
    "published": "2025-11-03T07:04:46Z"
  },
  {
    "title": "Winter in Sokcho review – atmospheric slow-burner about family and intimacy in South Korean border city",
    "url": "https://www.theguardian.com/film/2025/nov/03/winter-in-sokcho-review-atmospheric-slow-burner-about-family-and-intimacy-in-south-korean-border-city",
    "image": "https://media.guim.co.uk/f45f978f88697575ac5692638a5e296334ee4987/542_0_1125_900/500.jpg",
    "summary": "Koya Kamura's debut film explores themes of shared identities through a subtle, atmospheric drama. The story follows an enigmatic French writer who arrives in a town named after the film. Its narrative delves into the complexities of human connection in a chilly, introspective setting.",
    "published": "2025-11-03T07:00:28Z"
  },
  {
    "title": "Book of Lives by Margaret Atwood review – the great novelist reveals her hidden side",
    "url": "https://www.theguardian.com/books/2025/nov/03/book-of-lives-margaret-atwood-autobiography-review",
    "image": "https://media.guim.co.uk/9eac3de09a26b1215b18ad4c6dd36bb6c9f13f52/0_479_8231_6585/500.jpg",
    "summary": "A new autobiography features the witty and captivating journey of a prominent literary figure. The book combines humor with insightful reflections, showcasing the author's life experiences. It promises to be an engaging read for fans and literature enthusiasts alike.",
    "published": "2025-11-03T07:00:27Z"
  },
  {
    "title": "Rachel Reeves's housing scandal was a small administrative error, but a big political mistake | Oliver Eagleton",
    "url": "https://www.theguardian.com/commentisfree/2025/nov/03/rachel-reeves-housing-scandal-labour",
    "image": "https://media.guim.co.uk/0221da3611b152522787fb3734b57ed6671c0620/499_89_4882_3905/500.jpg",
    "summary": "Oliver Eagleton, managing editor of Phenomenal World, warns that during a period of austerity, the public is frustrated by ministers owning multiple homes. He suggests that the Labour Party's housing policies will take years to yield results, further fueling discontent. The focus is shifting toward accountability and the perceived disparity between politicians and ordinary citizens.",
    "published": "2025-11-03T07:00:27Z"
  }
]