[
  {
    "title": "Experts tips for cleaning and caring for your bath towel to keep them softer, longer",
    "url": "https://www.theguardian.com/thefilter-us/2025/oct/03/how-to-keep-bath-towels-soft",
    "image": "https://media.guim.co.uk/61ec4404b291d550c993825b2c8060489ca2b214/176_0_3780_3024/500.jpg",
    "summary": "Maintaining your bath towels is essential to keep them looking and feeling fresh. Proper washing, drying, and storage techniques can extend their lifespan and maintain softness. Simple care tips, such as avoiding fabric softeners and regular washing, can help preserve their quality.",
    "published": "2025-10-03T14:15:38Z"
  },
  {
    "title": "UK political class ‘poisoned by wealth’, says Zack Polanski as he sets out plan to tax assets of richest 1% – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/oct/03/greens-labour-reform-conservatives-immigration-uk-politics-live-news-updates",
    "image": "https://media.guim.co.uk/230f3f716b1479d4b506a4187fec02c39aa795b2/648_0_4274_3419/500.jpg",
    "summary": "Film director Roman Polanski emphasized the need for a deeper discussion on patriotism, urging it to move beyond mere flag-waving. He advocates for a more thoughtful engagement with the concept of national pride. Polanski's comments reflect a desire for a nuanced exploration of what it means to be patriotic.",
    "published": "2025-10-03T14:15:07Z"
  },
  {
    "title": "Sean ‘Diddy’ Combs to be sentenced after pleading with judge for ‘second chance’ – live updates",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/03/sean-diddy-combs-sentencing-trial-conviction-latest-updates",
    "image": "https://media.guim.co.uk/f481d2573a78ffbd126134345e03b8e177261762/429_0_4088_3270/500.jpg",
    "summary": "A music mogul has been convicted of prostitution charges in July and may face a lengthy prison sentence. Court proceedings are set to begin at 10 AM Eastern Time. The outcome could have significant implications for the mogul's career and reputation.",
    "published": "2025-10-03T14:15:06Z"
  },
  {
    "title": "UK business growth hits five-month low amid budget uncertainty and weak demand – as it happened",
    "url": "https://www.theguardian.com/business/live/2025/oct/03/oil-price-weekly-fall-opec-fuel-services-sector-no-non-farm-business-live-news",
    "image": "https://media.guim.co.uk/2cf3ac9741f743b964dfd19bb7c0abebc5708749/661_0_6417_5132/500.jpg",
    "summary": "Stay updated with continuous reporting on the latest economic and financial developments. Key insights and trends are highlighted to inform readers about market movements and economic indicators. This coverage aims to provide a comprehensive overview of the current financial landscape.",
    "published": "2025-10-03T14:13:53Z"
  },
  {
    "title": "White House halts $2.1bn of Chicago transport funding; Senate to hold vote as shutdown enters third day – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/03/shutdown-congress-trump-senate-latest-updates",
    "image": "https://media.guim.co.uk/4552f1f7817e2cb44bdb4b189dfb79c34355ef31/512_0_5275_4222/500.jpg",
    "summary": "Trump aide Russ Vought warned that a government shutdown would impede efforts to extend and modernize the city's transit lines. He expressed concerns about the lack of optimism for a Senate resolution to avoid the shutdown. The situation poses challenges for urban infrastructure projects critical to public transport.",
    "published": "2025-10-03T14:06:00Z"
  }
]