[
  {
    "title": "England v Australia: Women’s Rugby World Cup – rugby union live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/06/england-v-australia-womens-rugby-world-cup-rugby-union-live",
    "image": "https://media.guim.co.uk/433454de68e360d789a5c9e2e1c81c455c4ee72c/636_168_3295_2635/500.jpg",
    "summary": "Daniel Gallan provides live updates on England's intense Women's Rugby World Cup group match against Australia. Fans can follow minute-by-minute coverage as the action unfolds. Stay tuned for real-time insights and highlights from the game.",
    "published": "2025-09-06T16:35:59Z"
  },
  {
    "title": "England v Andorra: World Cup 2026 qualifying – live",
    "url": "https://www.theguardian.com/football/live/2025/sep/06/england-v-andorra-world-cup-2026-qualifying-live",
    "image": "https://media.guim.co.uk/b429e26b9e4b2a797fcbe17d87ce903ac9e1f906/350_0_3989_3192/500.jpg",
    "summary": "Thomas Tuchel's team aims for a significant victory at Villa Park to boost team morale. The match will be covered by Barry Glendenning. Fans are eager to see their side perform strongly.",
    "published": "2025-09-06T16:35:39Z"
  },
  {
    "title": "Keir Starmer confirms first batch of junior ministers in post-Rayner reshuffle – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/06/no-early-election-angela-rayner-resignation-nigel-farage-reform-uk-politics-live-news-latest",
    "image": "https://media.guim.co.uk/ef89e6d973b2d1173f1dff0d29de38013d336ef3/393_0_3928_3143/500.jpg",
    "summary": "Chief Secretary Darren Jones revealed that Angela Rayner's resignation prompted a quicker-than-expected reshuffle within the Labour Party. He emphasized that there are no divisions within the party despite the changes. The announcement aims to stabilize leadership and maintain party unity.",
    "published": "2025-09-06T16:09:59Z"
  },
  {
    "title": "The Lost Bus review – Paul Greengrass wildfire movie is as stressful as you’d expect",
    "url": "https://www.theguardian.com/film/2025/sep/06/the-lost-bus-review-paul-greengrass-wildfire-movie",
    "image": "https://media.guim.co.uk/6ff05d8562bed805a68c948564e629fd67b76ebe/226_0_844_675/500.jpg",
    "summary": "The director attempts to portray California's most devastating wildfire with impressive technical skill, but is hindered by a melodramatic script. This combination detracts from the overall effectiveness of the retelling. Despite the ambitious subject matter, the execution falls short due to the screenplay's shortcomings.",
    "published": "2025-09-06T15:56:19Z"
  },
  {
    "title": "Families of British couple killed in Lisbon funicular crash ‘heartbroken’",
    "url": "https://www.theguardian.com/world/2025/sep/06/british-couple-killed-in-lisbon-funicular-crash-named",
    "image": "https://media.guim.co.uk/be3f08cd867bc23201634dabe4e63821d10e9be5/0_0_2329_1862/500.jpg",
    "summary": "Relatives honor Kayleigh Smith, 36, and William Nelson, 44, following their tragic deaths in the derailment of the Elevador da Glória. Family members gathered to pay their respects and commemorate the lives of the victims. The incident has prompted an investigation into the safety of the historic funicular in Lisbon.",
    "published": "2025-09-06T15:46:09Z"
  }
]