[
  {
    "title": "Families of dead hostages urge US to ‘leave no stone unturned’ to have them returned",
    "url": "https://www.theguardian.com/world/2025/oct/14/israel-reportedly-tells-hamas-return-hostage-bodies-end-tuesday",
    "image": "https://media.guim.co.uk/39dfb0c0f6155852e27dc5624d8ccaeb454c2896/570_562_1904_1524/500.jpg",
    "summary": "A ceasefire agreement between Israel and Hamas included the return of 28 hostages, yet only four have been released thus far. This delay highlights ongoing tensions in the region despite the ceasefire. Efforts to negotiate further hostages' release are ongoing.",
    "published": "2025-10-14T17:15:24Z"
  },
  {
    "title": "Hamas agrees to return four deceased hostages tonight as Israel says it will halve aid deliveries to Gaza over release of bodies – live",
    "url": "https://www.theguardian.com/world/live/2025/oct/14/gaza-ceasefire-israel-hamas-palestine-hostages-detainees-truce-live-news-updates",
    "image": "https://media.guim.co.uk/4485c433f0abc3593206f7f2ed92f476d7ca8b07/278_0_2580_2065/500.jpg",
    "summary": "Hamas has informed mediators of its intention to transfer the bodies of four deceased hostages. The transfer is scheduled for 10 PM local time. This development underscores ongoing tensions and negotiations in the region.",
    "published": "2025-10-14T17:14:44Z"
  },
  {
    "title": "ChatGPT ‘upgrade’ giving more harmful answers than previously, tests find",
    "url": "https://www.theguardian.com/technology/2025/oct/14/chatgpt-upgrade-giving-more-harmful-answers-than-previously-tests-find",
    "image": "https://media.guim.co.uk/57a55dbf29e394625b140c167d1167d04b423427/472_0_4723_3779/500.jpg",
    "summary": "Campaigners express significant concern over the adequacy of responses provided to prompts regarding suicide, self-harm, and eating disorders. They highlight the risks associated with insufficient support and resources for individuals seeking help. The call for improved awareness and intervention strategies is urgent to safeguard vulnerable populations.",
    "published": "2025-10-14T17:06:24Z"
  },
  {
    "title": "Latvia v England: World Cup 2026 qualifier – live",
    "url": "https://www.theguardian.com/football/live/2025/oct/14/latvia-v-england-world-cup-2026-qualifier-live",
    "image": "https://media.guim.co.uk/a79f742cee5b4dd667d1cc97f33f44b77ea3c21f/1052_0_4846_3876/500.jpg",
    "summary": "Scott Murray provides a live report as England aims for a victory that would secure their qualification for the World Cup. Fans can follow minute-by-minute updates on the match. The focus is on achieving the crucial win needed for the team's advancement.",
    "published": "2025-10-14T17:00:01Z"
  },
  {
    "title": "House speaker defends White House using research funding to pay military during government shutdown – live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/14/donald-trump-government-shutdown-national-guard-javier-milei-charlie-kirk-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/71f9f04ad27b7d129dea2a5442081efa2fdd331e/616_0_4167_3335/500.jpg",
    "summary": "Mike Johnson supports the Trump administration's ability to reallocate funds that Congress has appropriated to the Department of Defense. He emphasizes that this action is within their rights. Johnson's comments highlight ongoing discussions about budget management and funding priorities in government.",
    "published": "2025-10-14T16:47:40Z"
  }
]