[
  {
    "title": "India v New Zealand: Women’s Cricket World Cup – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/23/india-v-new-zealand-womens-cricket-world-cup-live",
    "image": "https://media.guim.co.uk/208c46341f5409bd4da4c346d527d6711fc0126a/235_0_2032_1626/500.jpg",
    "summary": "India, facing three consecutive defeats, still has a chance to secure the last semi-final spot with a win in their upcoming match. The hosts are determined to turn their fortunes around. Stay tuned for live updates from the writers.",
    "published": "2025-10-23T14:19:37Z"
  },
  {
    "title": "US government shutdown enters day 23 as Senate set to vote on bill to keep essential workers and troops paid – live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/23/trump-san-francisco-federal-agents-white-house-ice-immigration-latest-news-updates",
    "image": "https://media.guim.co.uk/0d4d60688479d70d6e3cf20f9648a70266f47cca/578_0_6880_5504/500.jpg",
    "summary": "A bill aimed at securing pay for federal workers and military personnel may struggle to achieve the necessary 60 votes for passage. Democrats are expected to hold out on the legislation, complicating its potential approval. The situation reflects ongoing tensions in Congress regarding budgetary issues.",
    "published": "2025-10-23T14:19:26Z"
  },
  {
    "title": "A rift that took 500 years to repair: King Charles prays with the pope",
    "url": "https://www.theguardian.com/world/2025/oct/23/king-charles-prays-with-pope-historic-division",
    "image": "https://media.guim.co.uk/07f01053fcb8b4c64f72e2ee62fefe5dece96641/9_0_5906_4725/500.jpg",
    "summary": "A joint prayer held in the Sistine Chapel marks a significant moment of reconciliation between the Catholic Church and the Church of England, signaling an effort to bridge centuries of division. This symbolic act highlights the ongoing dialogue and desire for unity between the two denominations. The event reflects a commitment to collective faith and collaboration moving forward.",
    "published": "2025-10-23T14:12:27Z"
  },
  {
    "title": "Oil price jumps and FTSE 100 hits new high after Trump puts sanctions on Russian firms",
    "url": "https://www.theguardian.com/business/2025/oct/23/oil-price-jumps-after-trump-imposes-sanctions-on-two-russian-producers-rosneft-lukoil",
    "image": "https://media.guim.co.uk/0818295466a9b00382cf92a24435a4a854997cd0/664_144_4366_3495/500.jpg",
    "summary": "Assets belonging to Russian oil companies Rosneft and Lukoil in the U.S. have been frozen amid ongoing geopolitical tensions. Meanwhile, shares in major oil companies Shell and BP have seen a 3% increase. The market response reflects investor sentiment amid changing energy dynamics.",
    "published": "2025-10-23T14:11:07Z"
  },
  {
    "title": "Zelenskyy to speak at EU summit as European leaders discuss use of frozen Russian assets for Ukraine loan – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/oct/23/russia-sanctions-ukraine-loan-assets-zelenskyy-putin-european-council-latest-news-updates",
    "image": "https://media.guim.co.uk/4df6b99056eafd1db8865c31db390b8ae38fcfa4/373_0_3994_3195/500.jpg",
    "summary": "King Charles and Pope Francis participated in a joint worship service at the Sistine Chapel during the King's visit to the Vatican with Queen Camilla. The event highlights the ongoing relationship between the British monarchy and the Catholic Church. It marked a significant moment in King Charles's reign, emphasizing themes of faith and unity.",
    "published": "2025-10-23T14:10:59Z"
  }
]