[
  {
    "title": "AstraZeneca to upgrade US listing in ‘knock-back for London’",
    "url": "https://www.theguardian.com/business/2025/sep/29/astrazeneca-plans-new-york-stock-exchange-listing-but-isnt-quitting-london",
    "image": "https://media.guim.co.uk/7d65f6db020383477ad5c00f415db8777a305d58/0_0_4026_3220/500.jpg",
    "summary": "The UK's largest drugmaker plans to align its US shares with its London-based stock. Despite this change, the company will maintain its headquarters in Cambridge. This move aims to simplify its corporate structure while reinforcing its UK presence.",
    "published": "2025-09-29T13:26:40Z"
  },
  {
    "title": "Donald Trump and Benjamin Netanyahu to discuss Gaza peace plan at the White House – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/29/donald-trump-benjamin-netanyahu-gaza-white-house-us-politics-live",
    "image": "https://media.guim.co.uk/dcac1da0ca83af83dab779b453431861fe887c0b/296_0_3770_3016/500.jpg",
    "summary": "The US president plans to urge the Israeli prime minister to adopt a new framework aimed at resolving the ongoing war in Gaza. This initiative also seeks to secure the release of remaining hostages held by Hamas. The discussions are part of efforts to stabilize the region and promote peace.",
    "published": "2025-09-29T13:20:49Z"
  },
  {
    "title": "Bank of England’s Ramsden says inflation will fall to target as jobs market weakens; gold hits new record high – business live",
    "url": "https://www.theguardian.com/business/live/2025/sep/29/moral-hazard-fears-jlr-jaguar-land-rover-government-loan-gsk-ceo-astrazeneca-listing-dollar-shutdown-business-live-news",
    "image": "https://media.guim.co.uk/bc39d850fa88b0455bc21d1f74749621ee3f6385/0_0_4824_3861/500.jpg",
    "summary": "The Bank of England's deputy governor stated that the core disinflation process will persist as wage growth decelerates. This trend is expected to contribute to easing inflationary pressures. Overall, the outlook suggests continued moderation in price increases.",
    "published": "2025-09-29T13:20:38Z"
  },
  {
    "title": "Andy Burnham says Labour leadership is too ‘factional’ – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/29/rachel-reeves-labour-party-conference-youth-guarantee-unemployment-uk-politics-live-latest-news",
    "image": "https://media.guim.co.uk/fffb026f6bb604ce40d8b2ff99e2ad9ea0e305d7/947_0_6072_4860/500.jpg",
    "summary": "The Mayor of Greater Manchester stated that he does not remember any instances of party members having the whip withdrawn due to policy disagreements during the Tony Blair and Gordon Brown administrations. This comment highlights a perceived difference in how disciplinary measures were handled in the past compared to current practices. The remark comes amid ongoing discussions about political discipline within the party.",
    "published": "2025-09-29T13:15:38Z"
  },
  {
    "title": "Hybrid attacks such as drones ‘part of our new reality’, Danish justice minister warns – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/sep/29/moldova-voters-pro-eu-government-russia-drones-europe-live",
    "image": "https://media.guim.co.uk/953898f4ae3b7d965da1916ca6a56766ca8c19f3/293_0_4208_3367/500.jpg",
    "summary": "Peter Hummelgaard likened the recent rise in hybrid attacks across Europe to the September 11 terrorist attacks, emphasizing their profound impact and the need for collective security measures. He underscored the importance of vigilance and a coordinated response to address the evolving threat landscape. Hummelgaard's comments highlight concerns about the blending of conventional and cyber threats in modern warfare.",
    "published": "2025-09-29T13:05:43Z"
  }
]