[
  {
    "title": "Chelsea v Paris FC: Women’s Champions League – live",
    "url": "https://www.theguardian.com/football/live/2025/oct/15/chelsea-v-paris-fc-womens-champions-league-live",
    "image": "https://media.guim.co.uk/11c565ca9e85f414a85b2351171263770d29b93d/452_207_3591_2873/500.jpg",
    "summary": "Sonia Bompastor's team is aiming for their inaugural European victory this season. Taha Hashim provides a live, minute-by-minute report on the match updates. Keep an eye on the progress as the game unfolds.",
    "published": "2025-10-15T19:15:38Z"
  },
  {
    "title": "Gaza ceasefire live: Trump reportedly says Israel could resume fighting if Hamas fails to uphold agreement",
    "url": "https://www.theguardian.com/world/live/2025/oct/15/gaza-ceasefire-israel-hamas-palestine-aid-hostages-detainees-prisoners-live-news-updates",
    "image": "https://media.guim.co.uk/1fa1942e1069e28a7952e7ca5c08d14a65eef438/593_0_1993_1595/500.jpg",
    "summary": "US President stated in a CNN interview that Israel could resume attacks in Gaza at any moment. Meanwhile, Hamas has reported challenges in locating the remaining bodies of hostages. The situation remains tense as discussions continue.",
    "published": "2025-10-15T19:15:11Z"
  },
  {
    "title": "Federal judge temporarily blocks mass layoffs as Trump official estimates 10,000 could be affected – live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/15/donald-trump-federal-government-shutdown-redistricting-voting-rights-act-kash-patel-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/1236457b37a4d0de48d9e8308a7fd9ef4b884464/282_0_4116_3293/500.jpg",
    "summary": "Judge Susan Illston criticized the administration for exploiting a lapse in government functions. In response, Russell Vought emphasized his office's intent to aggressively dismantle bureaucratic inefficiencies. The remarks highlight ongoing tensions between judicial oversight and executive actions.",
    "published": "2025-10-15T19:14:31Z"
  },
  {
    "title": "Challenges remain for aid distribution in Gaza City despite ceasefire with Israel",
    "url": "https://www.theguardian.com/world/2025/oct/15/challenges-remain-for-aid-distribution-in-gaza-city-despite-ceasefire-with-israel",
    "image": "https://media.guim.co.uk/f6eb1921e58b8ee583ad871a1a8b843bc4715225/126_0_3780_3024/500.jpg",
    "summary": "Israeli forces' destruction and ongoing control have rendered access roads to the most severely affected hunger areas nearly impassable. This hampers humanitarian efforts to provide aid to those in need. As a result, the situation for vulnerable populations continues to deteriorate.",
    "published": "2025-10-15T19:04:02Z"
  },
  {
    "title": "Adani denies claims it sold ‘below-market coal’ leading to Queensland missing out on hundreds of millions in royalties",
    "url": "https://www.theguardian.com/australia-news/2025/oct/16/adani-denies-claims-it-sold-below-market-coal-leading-to-queensland-missing-out-on-hundreds-of-millions-in-royalties",
    "image": "https://media.guim.co.uk/fa5bb8e2893491223a122d503cd82a9b2faf3fed/0_0_2500_2000/500.jpg",
    "summary": "Adani has dismissed the Australia Institute's claims regarding customer payments, which stated that customers paid an average of $102 per tonne in 2022-23. The company labeled the findings as inaccurate. Adani continues to defend its pricing and business practices in the face of the report's assertions.",
    "published": "2025-10-15T19:00:45Z"
  }
]