[
  {
    "title": "Australia politics live: ‘no doubt’ Iranian diplomat expulsion was independent from Israel, former Israeli ambassador says",
    "url": "https://www.theguardian.com/australia-news/live/2025/aug/28/australian-politics-live-usman-khawaja-gambling-ads-anthony-albanese-sussan-ley-labor-coalition-question-time-ntwnfb",
    "summary": "Please provide the news article or details you'd like summarized!",
    "published": "2025-08-27T23:27:56Z"
  },
  {
    "title": "Porepunkah police shooting live updates: bad weather in Victoria to hamper manhunt as police confirm no sightings of suspect since Tuesday – latest news",
    "url": "https://www.theguardian.com/australia-news/live/2025/aug/28/porepunkah-shooting-live-updates-victoria-police-manhunt-latest-news-ntwnfb",
    "image": "https://media.guim.co.uk/6383c8d2da6bc977fbaf89dd1880089bdbea5058/390_0_4640_3712/500.jpg",
    "summary": "I'm unable to summarize the news as you haven't provided the specific content. Please share the details or main points you'd like summarized, and I'll be happy to help!",
    "published": "2025-08-27T23:26:12Z"
  },
  {
    "title": "Top CDC officials quit, with one condemning ‘ongoing weaponization of public health’ – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/aug/27/cdc-resignation-susan-monarez-trump-administration-us-politics-updates-rfk-jr",
    "image": "https://media.guim.co.uk/75aff6bbb868d9755206ef64b34f1efb6ec29b52/403_0_4583_3667/500.jpg",
    "summary": "The CDC is experiencing significant leadership changes, as multiple top-level officials resign following the dismissal of CDC chief Susan Monarez, who was removed from her position less than a month after taking office. This upheaval raises concerns about stability within the agency. The resignations indicate ongoing turmoil and possible challenges in the CDC's operations and public health efforts.",
    "published": "2025-08-27T23:17:44Z"
  },
  {
    "title": "Women’s Super League 2025-26 previews No 4: Chelsea",
    "url": "https://www.theguardian.com/sport/2025/aug/28/womens-super-league-2025-26-previews-no-4-chelsea",
    "image": "https://media.guim.co.uk/2987aae7222760957f04b5a9b191fc37d5802be8/1173_344_4653_3722/500.jpg",
    "summary": "Sonia Bompastor's team, fresh off a treble win last season, acknowledges the need for improvement. The squad is further strengthened by the addition of Ellie Carpenter. This combination aims to enhance their performance in the upcoming season.",
    "published": "2025-08-27T23:01:15Z"
  },
  {
    "title": "Property tax threat is slowing down housing market, say UK agents",
    "url": "https://www.theguardian.com/business/2025/aug/28/property-tax-threat-slow-down-housing-market-uk-agents",
    "image": "https://media.guim.co.uk/2f24cb1635ef61cf278200c05f56a75c58f92470/371_0_5000_4000/500.jpg",
    "summary": "Concerns are rising among buyers as discussions emerge about a potential new levy on expensive homes, as well as the possibility of removing the Capital Gains Tax (CGT) exemption. This uncertainty is leading to increased caution in the housing market. The chancellor's proposals could significantly impact high-value property investments.",
    "published": "2025-08-27T23:01:15Z"
  }
]