[
  {
    "title": "Crystal Palace v Brighton, Brentford v Newcastle and more: Premier League clockwatch – live",
    "url": "https://www.theguardian.com/football/live/2025/nov/09/crystal-palace-v-brighton-brentford-v-newcastle-and-more-premier-league-clockwatch-live",
    "image": "https://media.guim.co.uk/7b0f70ee9e6979d1abe0a75adab6d9cfeb285049/1259_531_1344_1075/500.jpg",
    "summary": "Rival teams will clash at Selhurst Park as part of the latest football updates. Leeds will face Nottingham Forest, while Aston Villa is set to host Bournemouth. Stay tuned for all the action from these exciting matches.",
    "published": "2025-11-09T15:15:24Z"
  },
  {
    "title": "NFL week 10 live: Indianapolis Colts v Atlanta Falcons in Berlin – live",
    "url": "https://www.theguardian.com/sport/live/2025/nov/09/nfl-week-10-live-vikings-ravens-jets-browns-dolphins-bills-live",
    "image": "https://media.guim.co.uk/601f61e053bb5903a08da26a9d4c3320ad6810d4/105_0_3294_2636/500.jpg",
    "summary": "Seven NFL games are set to start at 6 PM UK time, featuring a match between Atlanta and Indianapolis in Berlin. Graham Searles will provide comprehensive coverage and details. Fans can look forward to an exciting evening of football action.",
    "published": "2025-11-09T15:15:21Z"
  },
  {
    "title": "Rob Steen obituary",
    "url": "https://www.theguardian.com/sport/2025/nov/09/rob-steen-obituary",
    "image": "https://media.guim.co.uk/7638e5d4280851298b8196b39d4135eec6e232d6/127_127_2055_1643/500.jpg",
    "summary": "A notable sports writer has passed away, renowned for his exceptional biographies and the cult classic football book, \"The Mavericks.\" His contributions to sports literature have left a lasting impact on fans and readers. The writer's legacy continues through his influential works.",
    "published": "2025-11-09T15:08:09Z"
  },
  {
    "title": "ATP Finals tennis: Carlos Alcaraz defeated Alex de Minaur – as it happened",
    "url": "https://www.theguardian.com/sport/live/2025/nov/09/atp-finals-tennis-carlos-alcaraz-alex-de-minaur-live",
    "image": "https://media.guim.co.uk/a04927a0c3f7714bd7dfc5ff71f185005fa827cb/254_93_4332_3467/500.jpg",
    "summary": "Alex de Minaur struggled to secure the first set, leading 5-3 in the tie-break but ultimately losing to Carlos Alcaraz, who rallied to win 7-5. Alcaraz then showcased an impressive performance in the second set. The match highlighted Alcaraz's determination and skill.",
    "published": "2025-11-09T15:05:19Z"
  },
  {
    "title": "Bad Bridgets podcast about crime among Irish women in US inspires film",
    "url": "https://www.theguardian.com/tv-and-radio/2025/nov/09/bad-bridgets-podcast-about-irish-womens-lives-of-us-inspires-film",
    "image": "https://media.guim.co.uk/78f9f42fc54bfb5803cf3b333f189002973110a5/222_0_1715_1372/500.jpg",
    "summary": "Margot Robbie's production company is set to develop a film inspired by the real-life experiences of Northern Ireland academics centered on themes of poverty and imprisonment. The project aims to highlight the struggles and resilience of individuals affected by socio-economic challenges. Robbie expressed enthusiasm for bringing these poignant stories to the screen.",
    "published": "2025-11-09T15:00:35Z"
  }
]