[
  {
    "title": "European markets largely shrug off Trump tariffs on pharmaceuticals, trucks and kitchen cabinets – business live",
    "url": "https://www.theguardian.com/business/live/2025/sep/26/trump-investors-tariffs-pharmaceuticals-trucks-kitchen-cabinets-markets-uk-borrowing-costs-business-live-news",
    "image": "https://media.guim.co.uk/b6e9c41d11c16f906c88625cc595cbbbed746bf2/263_0_3333_2667/500.jpg",
    "summary": "This report provides continuous updates on recent developments in the economy and financial markets. It highlights key trends, market movements, and significant events impacting the global financial landscape. Stay informed with real-time insights and expert analysis.",
    "published": "2025-09-26T09:18:43Z"
  },
  {
    "title": "Keir Starmer says digital ID cards are an ‘enormous opportunity’ and will make it tougher to work illegally - UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/26/keir-starmer-digital-id-cards-immigration-borders-reform-uk-politics-live",
    "image": "https://media.guim.co.uk/4b97cc6b081483fb8c46eaac32defe55d8031476/0_0_4164_3333/500.jpg",
    "summary": "The Prime Minister announced that a new digital ID system, which will be stored on people's phones, will soon be mandatory for proving the right to work. This initiative aims to streamline the verification process for employment. The rollout of the digital ID is part of broader efforts to modernize identification methods.",
    "published": "2025-09-26T09:17:10Z"
  },
  {
    "title": "Breaking the school poo stigma: what parents have to say",
    "url": "https://www.theguardian.com/permission-to-poo/2025/sep/26/breaking-the-school-poo-stigma-what-parents-have-to-say",
    "image": "https://media.guim.co.uk/c98cafb0b33ab4724c19e0e6a68042e99ebcba1b/0_0_2345_1876/500.jpg",
    "summary": "Andrex aims to help children overcome their embarrassment about using the toilet at school. Rhiannon Evans explores the reasons behind this growing issue and potential solutions. The initiative seeks to foster a more open and understanding environment for young students.",
    "published": "2025-09-26T09:16:33Z"
  },
  {
    "title": "Benjamin Netanyahu set for defiant UN speech as Trump warns on annexation of West Bank - Middle East crisis live",
    "url": "https://www.theguardian.com/world/live/2025/sep/26/gaza-israel-benjamin-netanyahu-un-united-nations-unga-west-bank-donald-trump-middle-east-crisis-live",
    "image": "https://media.guim.co.uk/1fc57891ee0a2f8bc46d0b0ee6d7172966c3ac3c/691_0_4466_3572/500.jpg",
    "summary": "Israeli Prime Minister is set to deliver a strong statement at the UN General Assembly, opposing the establishment of a Palestinian state. His address is anticipated to emphasize Israel's stance on the conflict. The speech comes amid ongoing tensions in the region.",
    "published": "2025-09-26T09:10:44Z"
  },
  {
    "title": "£500m Thames Water desalination plant has provided just seven days’ water over 15 years",
    "url": "https://www.theguardian.com/business/2025/sep/26/500m-thames-water-desalination-plant-has-provided-just-seven-days-water-over-15-years",
    "image": "https://media.guim.co.uk/4c5d6b76ad5eb3ad7451ba013ff73e5cc14f4732/0_0_2389_1912/500.jpg",
    "summary": "The plant in Beckton has faced numerous issues since its construction, resulting in it operating only five times. These ongoing problems have hindered its functionality and reliability. The situation raises concerns about the plant's overall viability and performance.",
    "published": "2025-09-26T09:08:06Z"
  }
]