[
  {
    "title": "Arsenal v Manchester City: Premier League – live",
    "url": "https://www.theguardian.com/football/live/2025/sep/21/arsenal-v-manchester-city-premier-league-live-score-updates",
    "image": "https://media.guim.co.uk/bdfd21b750999ab6d6f92d4dc311d72781f95591/606_121_3550_2841/500.jpg",
    "summary": "Two title contenders face off in a highly anticipated match in north London. Rob Smyth provides a minute-by-minute report to keep fans updated. Stay tuned for the latest developments as the game unfolds.",
    "published": "2025-09-21T16:38:07Z"
  },
  {
    "title": "Ireland v England: third men’s T20 cricket international – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/21/cricket-ireland-v-england-third-mens-t20-cricket-international-live",
    "image": "https://media.guim.co.uk/9ce400e24c262400002eb292ccb8aa3964fa47ae/307_0_2151_1720/500.jpg",
    "summary": "In the third match of the series in Malahide, James Wallace provided live over-by-over coverage. The updates highlighted key moments and performances throughout the game. Fans were engaged as the match progressed, with excitement building over the unfolding action.",
    "published": "2025-09-21T16:37:56Z"
  },
  {
    "title": "Premier League top scorers 2025-26: who is leading race for golden boot?",
    "url": "https://www.theguardian.com/football/2025/sep/15/premier-league-top-scorers-2025-26-who-is-leading-race-for-golden-boot",
    "image": "https://media.guim.co.uk/77be6da0a20792a89f51335849cb3f8169dfbba1/671_0_2264_1811/500.jpg",
    "summary": "The latest update highlights the top goal scorers in the English Premier League for the current season. Key players are making significant impacts as they vie for the leading position in the charts. Fans are eager to see how the competition unfolds as the season progresses.",
    "published": "2025-09-21T16:35:25Z"
  },
  {
    "title": "Charlie Kirk memorial latest updates: Trump and Vance to join tens of thousands of people at service for rightwing activist",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/21/charlie-kirk-funeral-memorial-time-updates-arizona",
    "image": "https://media.guim.co.uk/8f40b7af36fcf3d55bbb2ab16bd8d02e91a6811e/0_0_4355_3487/500.jpg",
    "summary": "A funeral is scheduled to begin at 11 AM local time, with notable speakers including Erika Kirk, the President, and the Vice-President of the United States. The event is anticipated to draw significant public attention. Further details on the venue and attendees are yet to be released.",
    "published": "2025-09-21T16:29:43Z"
  },
  {
    "title": "Manchester United 0-0 Arsenal: Women’s Super League – as it happened",
    "url": "https://www.theguardian.com/football/live/2025/sep/21/manchester-united-v-arsenal-womens-super-league-live",
    "image": "https://media.guim.co.uk/2573af132adde752bf13b18d329b15347df6d2b3/482_0_4216_3374/500.jpg",
    "summary": "Arsenal played to a goalless draw against Manchester United at Leigh Sports Village. The match featured a strong defensive display from United, which limited Arsenal's scoring opportunities. Despite efforts from both teams, neither could find the back of the net.",
    "published": "2025-09-21T16:24:38Z"
  }
]