[
  {
    "title": "Australia news live: alleged Porepunkah shooter’s partner has been arrested and released, police say",
    "url": "https://www.theguardian.com/australia-news/live/2025/aug/29/australia-news-live-porepunkah-shooting-dezi-freeman-manhunt-police-latest-updates-ntwnfb",
    "image": "https://media.guim.co.uk/d670a4b4050501f126cf709653a1e8dccf32db05/209_0_3720_2976/500.jpg",
    "summary": "Please provide the news article or details you'd like summarized, and I'll be happy to help!",
    "published": "2025-08-29T04:39:25Z"
  },
  {
    "title": "Country diary: Scanning for treasure on a chalky hill | Oliver Southall",
    "url": "https://www.theguardian.com/environment/2025/aug/29/country-diary-scanning-for-treasure-on-a-chalky-hill",
    "image": "https://media.guim.co.uk/f5d5175a92c42c9798305c7671e48ff7a3fe7b4d/161_0_1577_1262/500.jpg",
    "summary": "In South Downs, West Sussex, the autumn lady’s tresses orchid is expected to bloom, marking the final orchid of the season. This rare plant typically appears in late summer to early autumn. Observers are eagerly anticipating its arrival in the natural landscape.",
    "published": "2025-08-29T04:30:05Z"
  },
  {
    "title": "Porepunkah manhunt day four: what we know so far about the Victoria police shooting and suspect Dezi Freeman",
    "url": "https://www.theguardian.com/news/2025/aug/29/what-we-know-so-far-porepunkah-police-shooting-victoria-manhunt-suspect-dezi-freeman-ntwnfb",
    "image": "https://media.guim.co.uk/9dcc22a0637b9319a9472b83f3c72a30b9f4cf22/1_0_2653_2122/500.jpg",
    "summary": "Police are searching for Dezi Freeman, the prime suspect in the alleged killing of two officers in Porepunkah, a town in regional Victoria, Australia. The incident has prompted an extensive manhunt about 300 kilometers northeast of Melbourne. Authorities urge the public to report any sightings of Freeman.",
    "published": "2025-08-29T04:10:42Z"
  },
  {
    "title": "KPOPPED review – making this star-packed singing contest must have been absolutely wild",
    "url": "https://www.theguardian.com/tv-and-radio/2025/aug/29/kpopped-review-apple-tv-star-packed-singing-contest",
    "image": "https://media.guim.co.uk/14d2f79b6aa4bde8d9ebb581e63bdc1232366046/687_0_2698_2160/500.jpg",
    "summary": "Kylie, the Spice Girls, and Vanilla Ice partake in challenges reminiscent of K-pop stars, including eating snails. Despite the complex logistics involved, the show lacks energy and excitement. Overall, the production fails to captivate its audience.",
    "published": "2025-08-29T04:00:08Z"
  },
  {
    "title": "My favourite childhood outfit: ‘The coat I inherited from Grandpa became my teenage refuge’",
    "url": "https://www.theguardian.com/fashion/2025/aug/29/my-favourite-childhood-outfit-the-coat-i-inherited-from-grandpa-became-my-teenage-refuge",
    "image": "https://media.guim.co.uk/062063d21d410b4b812b2d8c364f6f8a4ab2f0b0/0_0_3000_2400/500.jpg",
    "summary": "After the author's grandfather's death, they cherished his heavy, silk-lined overcoat, using it for comfort and nostalgia. The coat accompanied them in various settings, including parks and friends' homes. Eventually, the coat mysteriously vanished, leaving the author with a sense of loss.",
    "published": "2025-08-29T04:00:07Z"
  }
]