[
  {
    "title": "Labour faces legal scrutiny after allowing chickens to be carried by legs",
    "url": "https://www.theguardian.com/world/2025/sep/25/labour-faces-legal-scrutiny-allowing-chickens-carried-legs",
    "image": "https://media.guim.co.uk/bbd638b02edba46b970532c5edbd87cfa84a71a7/698_0_4569_3657/500.jpg",
    "summary": "Secondary legislation allowing a previously forbidden practice came into effect in July across England, Wales, and Scotland. This change was made possible despite prior EU law prohibiting the practice. The new regulation aims to align with local needs and considerations.",
    "published": "2025-09-25T12:39:19Z"
  },
  {
    "title": "Sarkozy says he will ‘sleep in prison, but with head held high’ following guilty verdict in Libya trial – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/sep/25/aalborg-airport-denmark-drones-oslo-sarkozy-meloni-news-updates-europe-live",
    "image": "https://media.guim.co.uk/8800dfa2cf77f4a9639f6910afebd0b14545f524/315_0_4706_3767/500.jpg",
    "summary": "Former French President Nicolas Sarkozy was convicted of criminal conspiracy for receiving large sums from the late Libyan dictator Muammar Gaddafi. He faces custody time regardless of any appeals. The ruling underscores ongoing legal challenges surrounding Sarkozy's political career.",
    "published": "2025-09-25T12:39:06Z"
  },
  {
    "title": "Demand for UK government debt falls; Jaguar Land Rover and Co-op count cost of cyber-attacks – business live",
    "url": "https://www.theguardian.com/business/live/2025/sep/25/co-op-cyber-attack-cost-it-80m-profits-loss-government-support-jlr-suppliers-business-live-news",
    "image": "https://media.guim.co.uk/9ae4d2c19beddde67b6281fad4ad2b3d1328c6d0/1244_0_6473_5181/500.jpg",
    "summary": "Co-op announces that a recent hack may result in a £120 million profit loss this year. Meanwhile, there are calls for the government to assist Jaguar Land Rover's suppliers during an ongoing shutdown. The situation highlights the challenges faced by both companies in the current economic climate.",
    "published": "2025-09-25T12:38:25Z"
  },
  {
    "title": "Former FBI director James Comey expected to be indicted on criminal charges, reports say – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/25/donald-trump-james-comey-fbi-ice-texas-latest-us-politics-news-updates-live",
    "image": "https://media.guim.co.uk/06d86fd2cedd69e78aec01568d1e34b60983c567/1435_0_4484_3588/500.jpg",
    "summary": "James Comey, former FBI director, has been a target of Donald Trump's criticism since he was dismissed from his position early in Trump's presidency. Their contentious relationship has been marked by ongoing public disputes and investigations. Comey's firing has been a significant point of contention in discussions about Trump's handling of the FBI and the Russia investigation.",
    "published": "2025-09-25T12:37:53Z"
  },
  {
    "title": "Nottinghamshire close on title against Warwickshire: county cricket final round – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/25/nottinghamshire-close-on-title-against-warwickshire-county-cricket-final-round-live",
    "image": "https://media.guim.co.uk/33647d31b655e49b766f871eb12fe218ac4a2b74/167_0_2250_1800/500.jpg",
    "summary": "Tanya Aldred provides updates from various grounds during the final round of County Championship matches this season. Fans can expect highlights and key moments as the tournament comes to a close. Stay tuned for the latest developments in this exciting cricketing event.",
    "published": "2025-09-25T12:37:04Z"
  }
]