[
  {
    "title": "Zelenskyy says Russia launched 500 drones and 40 missiles in ‘vile attack’ on Ukraine – Ukraine war live",
    "url": "https://www.theguardian.com/world/live/2025/sep/28/ukraine-russia-war-volodymyr-zelenskyy-vladimir-putin-nato-europe-latest-live-news-updates",
    "image": "https://media.guim.co.uk/e68cf9bc3dcc5937c2a7120ff544d888f723da7b/712_330_1503_1202/500.jpg",
    "summary": "A twelve-year-old girl was among the casualties in Kyiv following recent Russian strikes, prompting outrage from Ukrainian President Volodymyr Zelensky. He condemned the attacks as \"brutal\" and emphasized their impact on civilians. The incident has intensified international criticism of Russia's military actions in Ukraine.",
    "published": "2025-09-28T10:04:31Z"
  },
  {
    "title": "Newcastle v Arsenal buildup, Barcelona in action, WSL and more – matchday live",
    "url": "https://www.theguardian.com/football/live/2025/sep/28/newcastle-v-arsenal-buildup-barcelona-in-action-wsl-and-more-matchday-live",
    "image": "https://media.guim.co.uk/b6d3fa4a2eaa9fc15a3722ae8f8004fbdd325e57/0_0_5000_4000/500.jpg",
    "summary": "Today's football discussion covers a significant match at St James' Park, a busy day in the Women's Super League (WSL), and Barcelona's efforts to maintain their position in La Liga.",
    "published": "2025-09-28T10:00:24Z"
  },
  {
    "title": "This is how we do it: ‘Over 30 years, our spark has dimmed in difficult times, but we’ve always got it back’",
    "url": "https://www.theguardian.com/lifeandstyle/2025/sep/28/this-is-how-we-do-it-over-30-years-our-spark-has-dimmed-in-difficult-times-but-weve-always-got-it-back",
    "image": "https://media.guim.co.uk/b34c2f68fb00d18b243e86f52cc97056a4187a0c/0_0_2000_1600/500.jpg",
    "summary": "Gavin and Lisa, parents of three children, have noticed a decline in the frequency of their intimate moments. However, they report that the quality of their connection during these times has significantly improved. Their experiences highlight a shift towards more meaningful interactions in their relationship as they navigate parenthood.",
    "published": "2025-09-28T10:00:09Z"
  },
  {
    "title": "The week in Trump absurdities: from Turkey’s ‘rigged elections’ to ‘your countries are going to hell’",
    "url": "https://www.theguardian.com/us-news/2025/sep/28/trump-tylenol-autism-turkey-united-nations-pam-bondi",
    "image": "https://media.guim.co.uk/959572cc0a5733e00986d73f0289fb51aed5088c/168_43_3637_2910/500.jpg",
    "summary": "In a span of five days, the president has made controversial claims linking Tylenol to autism, accused sabotage during a UN event, and declared his political opponents \"guilty as hell.\" These statements highlight a pattern of provocative rhetoric amid ongoing political challenges. The comments have sparked significant debate and concern regarding their implications.",
    "published": "2025-09-28T10:00:09Z"
  },
  {
    "title": "Bullion bonanza: why is gold hitting record highs?",
    "url": "https://www.theguardian.com/business/2025/sep/28/bullion-bonanza-why-is-gold-hitting-record-highs",
    "image": "https://media.guim.co.uk/31dfc86b66f1ed7c60d8e58ce7d3bc3e158fce8f/235_0_2918_2334/500.jpg",
    "summary": "Interest rates, inflation, and geopolitical tensions are contributing to the metal's strongest annual performance since 1979. These factors have heightened demand and driven prices upward. The combo of economic and political instability has renewed investor interest in precious metals.",
    "published": "2025-09-28T10:00:09Z"
  }
]