[
  {
    "title": "Australia news live: Michael McCormack says green energy projects ‘won’t reduce the global temperature by anything’",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/16/australia-news-live-sydney-airport-social-media-ban-anthony-albanese-chris-bowen-climate-crisis-carbon-emissions-png-treaty-ntwnfb",
    "image": "https://media.guim.co.uk/9c459e95f3e1ef58f328a0d8bfc9962449b38edc/1732_1555_4936_3949/500.jpg",
    "summary": "Could you please provide the news article or the content you'd like summarized?",
    "published": "2025-09-16T07:30:30Z"
  },
  {
    "title": "State pension on course for 4.7% rise under triple lock; Jaguar Land Rover production shutdown extended until next week – business live",
    "url": "https://www.theguardian.com/business/live/2025/sep/16/uk-wage-growth-slows-jobs-market-cools-business-live-news-updates",
    "image": "https://media.guim.co.uk/574b4285f5b7bdd0171d4edd87c7307ebcfc5623/332_0_2336_1868/500.jpg",
    "summary": "Pensioners are expected to celebrate a substantial increase in the state pension beginning in April next year. Analysts indicate that this rise will significantly outpace inflation. The adjustment aims to provide financial relief to retirees amid rising living costs.",
    "published": "2025-09-16T07:28:19Z"
  },
  {
    "title": "Israel has committed genocide in Gaza, concludes UN commission of inquiry - latest updates",
    "url": "https://www.theguardian.com/world/live/2025/sep/16/israel-gaza-war-israels-defence-minister-says-gaza-is-burning-amid-escalation-in-bombardment-latest-updates",
    "image": "https://media.guim.co.uk/6fbc494fdd5dbc1a38b67b9e1ff358b9726e815b/773_0_4127_3301/500.jpg",
    "summary": "Israel's defense minister stated that \"Gaza is burning\" as military actions intensify, highlighting the significant escalation in bombardment in the region. This remark underscores the growing tensions and humanitarian crisis in Gaza amid ongoing conflict. The situation raises concerns about the impact on civilians and future peace efforts.",
    "published": "2025-09-16T07:25:06Z"
  },
  {
    "title": "Jaguar Land Rover extends production shutdown after cyber-attack",
    "url": "https://www.theguardian.com/business/2025/sep/16/jaguar-land-rover-production-shutdown-cyber-attack",
    "image": "https://media.guim.co.uk/eb243666b8df29949cea2a4a81bb5b7b7b2fcfdd/463_0_5508_4408/500.jpg",
    "summary": "A carmaker has announced a halt on production until at least September 24. This decision comes as the company conducts ongoing investigations. The temporary freeze aims to address unspecified issues impacting operations.",
    "published": "2025-09-16T07:23:32Z"
  },
  {
    "title": "UK labour market cools as pay growth slows and job losses rise",
    "url": "https://www.theguardian.com/business/2025/sep/16/uk-labour-market-pay-growth-job-losses-rachel-reeves",
    "image": "https://media.guim.co.uk/a9bffe8bef91b21d1d86163af6931647c8071436/7_0_4800_3840/500.jpg",
    "summary": "ONS figures highlight the urgent need for the government to take action to stimulate Britain's economy ahead of the upcoming budget. Economic performance data suggests challenges that may require a strategic response. The pressure is mounting for effective measures to support recovery and growth.",
    "published": "2025-09-16T07:15:46Z"
  }
]