[
  {
    "title": "US supreme court’s liberal justices express skepticism over Trump’s justification of tariffs – live updates",
    "url": "https://www.theguardian.com/us-news/live/2025/nov/05/zohran-mamdani-new-york-nyc-donald-trump-mayor-election-california-new-jersey-virginia-latest-news-results",
    "image": "https://media.guim.co.uk/d8cdd9f715ccbdf9e48a5cb64833be6173e940c2/589_0_5885_4708/500.jpg",
    "summary": "The Supreme Court has begun hearing oral arguments regarding the legality of Donald Trump’s tariffs. The case addresses whether these tariffs were imposed lawfully under existing trade laws. The outcome could have significant implications for U.S. trade policy.",
    "published": "2025-11-05T16:27:06Z"
  },
  {
    "title": "Lancashire’s Reform-run council plans to close care homes and day centres to sell off land",
    "url": "https://www.theguardian.com/politics/2025/nov/05/lancashires-reform-run-council-plans-to-close-care-homes-to-save-4m-a-year",
    "image": "https://media.guim.co.uk/8895ab4a71d5e1250d2be83f920791a9ff8f58e7/517_0_6880_5504/500.jpg",
    "summary": "Concerns have been raised regarding a potential conflict of interest involving a council member responsible for social care, who also owns a private care company. Critics are questioning the integrity of decision-making processes. The situation may lead to reviews of governance standards within the council.",
    "published": "2025-11-05T16:25:01Z"
  },
  {
    "title": "WTA Finals tennis: Iga Swiatek v Amanda Anisimova; Elena Rybakina beats Ekaterina Alexandrova – live",
    "url": "https://www.theguardian.com/sport/live/2025/nov/05/wta-finals-tennis-elena-rybakina-v-ekaterina-alexandrova-iga-swiatek-v-amanda-anisimova-live",
    "image": "https://media.guim.co.uk/b81ecf7ee3865d4e2d31bbbebe88030fb83109d9/521_237_3767_3014/500.jpg",
    "summary": "Taha Hashim will be hosting coverage of the latest group-stage matches in the season-ending tournament. Fans can expect insightful analysis and updates on the matches. Don't miss this opportunity to stay informed about the tournament's progress.",
    "published": "2025-11-05T16:24:49Z"
  },
  {
    "title": "Second accidental release of prisoner ‘utterly unacceptable’, No 10 says, as Lammy blames system left by Tories – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/nov/05/david-lammy-pmqs-rachel-reeves-tax-system-news-updates-uk-politics-live",
    "image": "https://media.guim.co.uk/fdddec341bf1868c4f613e50d0d23524f159030b/197_0_969_775/500.jpg",
    "summary": "During Prime Minister's Questions, David Lammy, representing Keir Starmer, refrained from addressing inquiries regarding the mistaken release of a prisoner. His avoidance of the topic raised questions about the Labour Party's stance on the issue. This incident highlights ongoing concerns surrounding the justice system's handling of such cases.",
    "published": "2025-11-05T16:21:26Z"
  },
  {
    "title": "Amazon sues AI startup over browser’s automated shopping and buying feature",
    "url": "https://www.theguardian.com/technology/2025/nov/05/amazon-perplexity-ai-lawsuit",
    "image": "https://media.guim.co.uk/bb96775be27606decc7e8e9f1ad4e40b3e30fcd2/0_0_2610_2088/500.jpg",
    "summary": "Amazon has accused Perplexity of secretly accessing customer accounts and misrepresenting AI-driven actions as human browsing. The allegations suggest unethical practices in how Perplexity utilizes data. This conflict highlights ongoing tensions in the tech industry regarding data privacy and AI ethics.",
    "published": "2025-11-05T16:17:44Z"
  }
]