[
  {
    "title": "Australia news live: Jay Weatherill named next high commissioner to UK; former radio host to lead ACT Liberals after leader and deputy step down",
    "url": "https://www.theguardian.com/australia-news/live/2025/nov/10/australia-news-live-john-laws-radio-social-media-age-ban-reserve-bank-pauline-hanson-sussan-ley-anthony-albanese-net-zerontwnfb",
    "image": "https://media.guim.co.uk/5cca75c774be7648da96510310e4e7923fce5062/268_0_4297_3437/500.jpg",
    "summary": "I'm sorry, but I need more context or content to summarize the news you're referring to. Please provide the text or main points you'd like summarized.",
    "published": "2025-11-10T05:14:07Z"
  },
  {
    "title": "In Sweden, online hate and anti-immigrant extremism are driving women out of public life | Martin Gelin",
    "url": "https://www.theguardian.com/commentisfree/2025/nov/10/sweden-online-hate-anti-immigrant-extremism-women",
    "image": "https://media.guim.co.uk/0c9863d04c1b52fbfbcb9dd93555aa0de41dadac/779_372_4486_3589/500.jpg",
    "summary": "A prominent liberal politician has resigned over concerns for her physical safety, highlighting growing risks for political figures. Journalist Martin Gelin describes this development as a serious blow to democracy in a country known for its openness. The situation raises alarms about the state of political discourse and safety in the region.",
    "published": "2025-11-10T05:00:55Z"
  },
  {
    "title": "Syrian president to hold talks with Trump at White House ",
    "url": "https://www.theguardian.com/world/2025/nov/10/syrian-president-talks-trump-white-house",
    "image": "https://media.guim.co.uk/9c0b7031ba7e6fb03da3bec0fa2ef7ac08eb80c8/1526_205_3652_2922/500.jpg",
    "summary": "Ahmed al-Sharaa is anticipated to advocate for the complete removal of remaining sanctions that have been in place throughout the 13-year civil war. His efforts aim to alleviate economic pressures on the affected regions. The move is part of broader efforts to promote stability and recovery post-conflict.",
    "published": "2025-11-10T05:00:54Z"
  },
  {
    "title": "Crisis charity to become a landlord in attempt to rectify ‘catastrophic’ housing in UK",
    "url": "https://www.theguardian.com/society/2025/nov/10/crisis-charity-to-become-a-landlord-in-attempt-to-rectify-catastrophic-housing-in-uk",
    "image": "https://media.guim.co.uk/3abad46e3de640d254fe5518a4c0eafc7e3bda2e/364_0_4049_3239/500.jpg",
    "summary": "A homelessness charity is set to acquire properties due to diminishing access to social housing. This strategic move aims to ensure stable housing solutions for those in need. The charity's decision reflects the increasing challenges within the social housing sector.",
    "published": "2025-11-10T05:00:54Z"
  },
  {
    "title": "Investors’ ‘dumb transhumanist ideas’ setting back neurotech progress, say experts",
    "url": "https://www.theguardian.com/science/2025/nov/10/investors-transhumanist-ideas-neurotech-progress-elon-musk",
    "image": "https://media.guim.co.uk/f38ae9bca6ccff3b52d4c3d2df8d1433bc62b94f/2_0_6785_5428/500.jpg",
    "summary": "Scientists claim that the obsession of investors like Elon Musk with brain-computer uploading is diverting attention and resources from essential research aimed at curing diseases. This focus on futuristic technologies could stall advancements in medical science. Experts warn that prioritizing these speculative ideas may ultimately be detrimental to public health initiatives.",
    "published": "2025-11-10T05:00:54Z"
  }
]