[
  {
    "title": "Premier League’s festive fixture lineup confirmed: football news – live",
    "url": "https://www.theguardian.com/football/live/2025/oct/31/weekend-team-news-and-previews-football-live",
    "image": "https://media.guim.co.uk/562b9e68c46a600c16cdde16fbf0834327846440/408_250_6568_5254/500.jpg",
    "summary": "Join our writers for updates and insights as the weekend football matches approach. Stay informed on the latest news, match previews, and player performances. Don't miss out on key developments leading into the games!",
    "published": "2025-10-31T16:24:53Z"
  },
  {
    "title": "Stupidity and royal self-entitlement sank Andrew, and it may not be over yet",
    "url": "https://www.theguardian.com/uk-news/2025/oct/31/andrew-royal-behaviour-analysis",
    "image": "https://media.guim.co.uk/376b6a1be9429d0135596c37f430fac633a5be7a/397_0_2499_1999/500.jpg",
    "summary": "Andrew's indulgent upbringing by his mother and neglect from his siblings may threaten the future of the monarchy. His behavior raises concerns about the impact of royal family dynamics on public perception. Such issues could ultimately undermine the institution itself.",
    "published": "2025-10-31T16:18:55Z"
  },
  {
    "title": "Michael McVeigh obituary",
    "url": "https://www.theguardian.com/theguardian/2025/oct/31/michael-mcveigh-obituary",
    "image": "https://media.guim.co.uk/867a5959ea8f0102c777b70fec120481bed14559/209_0_1730_1384/500.jpg",
    "summary": "I'm sorry, but the text you provided doesn't contain enough information for me to summarize. Could you please provide more details or context?",
    "published": "2025-10-31T16:14:43Z"
  },
  {
    "title": "Premier League team news: predicted lineups for the weekend action",
    "url": "https://www.theguardian.com/football/2025/oct/31/premier-league-team-news-predicted-lineups-for-the-weekend-action",
    "image": "https://media.guim.co.uk/db9a661bb0563f4a4339871b3ccb10eb4f1f827b/356_0_3574_2859/500.jpg",
    "summary": "Tottenham will face Chelsea in a highly anticipated match on Saturday. Meanwhile, Manchester City will take on the in-form Bournemouth on Sunday. Both matches are set to be key encounters in the Premier League.",
    "published": "2025-10-31T16:11:30Z"
  },
  {
    "title": "Judges could rule on Snap food aid as top Trump official rejects call to use emergency funding to keep benefits going – live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/31/donald-trump-filibuster-shutdown-snap-food-refugees-drug-boats-latest-news-updates",
    "image": "https://media.guim.co.uk/07b229d1eac114f30d6758b19b617cbe5a13903d/421_0_6569_5254/500.jpg",
    "summary": "Over 40 million Americans may lose their food stamp benefits starting Saturday, as the agriculture secretary stated that finding alternative funding is legally unfeasible. This potential cutoff could significantly impact low-income households relying on these benefits for essential nutrition. The announcement raises concerns about food insecurity across the nation.",
    "published": "2025-10-31T16:10:40Z"
  }
]