[
  {
    "title": "Europe ‘in most difficult and dangerous situation since second world war,’ Danish PM warns – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/oct/01/mette-frederiksen-denmark-europe-russia-vladimir-putin-volodymyr-zelenskyy-ukraine-hybrid-war-security-europe-live-news",
    "image": "https://media.guim.co.uk/e2203d0e9eb1fee0167cfb663bf6eb9a6c5b5af7/348_0_4680_3744/500.jpg",
    "summary": "Danish Prime Minister Mette Frederiksen has expressed her support for the European Commission's plan to provide reparation loans to Ukraine. The loans would be backed by assets frozen from Russia. This initiative aims to help Ukraine recover from the impacts of the ongoing conflict.",
    "published": "2025-10-01T16:24:07Z"
  },
  {
    "title": "Foreigners underrepresented among prisoners in England and Wales, report finds",
    "url": "https://www.theguardian.com/uk-news/2025/oct/01/foreigners-underrepresented-among-prisoners-in-england-and-wales-report",
    "image": "https://media.guim.co.uk/b5c67bfd587303737e76ba051f630f913ca149da/476_0_4848_3878/500.jpg",
    "summary": "A recent analysis has revealed insights into conviction rates related to nationality amidst ongoing tensions between anti-immigration activists and counter-protestors in Whitehall. The study’s findings are likely to fuel the heated debate on immigration policies. The confrontations highlight the polarizing views on immigration in the UK.",
    "published": "2025-10-01T16:24:04Z"
  },
  {
    "title": "Women’s Cricket World Cup: Australia v New Zealand – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/01/womens-cricket-world-cup-live-australia-v-new-zealand",
    "image": "https://media.guim.co.uk/f09646df7b62f59fb7c410977b3e389941e49d84/198_110_3829_3063/500.jpg",
    "summary": "Australia begins their title defense in the 50-over cricket tournament at Holkar Stadium in Indore. James Wallace provides live updates on the match. Fans can follow the action as the game unfolds.",
    "published": "2025-10-01T16:23:37Z"
  },
  {
    "title": "US government shutdown live: Senate votes down Democratic continuing resolution as speaker says House will return next week",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/01/us-government-shutdown-update-2025-shutting-funding-trump-democrats-republicans-live-updates-latest-news",
    "image": "https://media.guim.co.uk/1cdaebff7784a2a7255d78dd53eaa0e4593e0934/634_0_5000_4000/500.jpg",
    "summary": "The Senate voted 47-53 to reject the Democrats' counterproposal for government funding, with all Republicans opposing it. House Speaker Mike Johnson announced that the House will reconvene to address the situation. Tensions between party lines continue as discussions on government funding remain unresolved.",
    "published": "2025-10-01T16:22:29Z"
  },
  {
    "title": "UK’s FTSE 100 share index closes at record high as AstraZeneca becomes London’s biggest stock again – business live",
    "url": "https://www.theguardian.com/business/live/2025/oct/01/uk-house-prices-return-to-growth-us-dollar-shutdown-manufacturing-growth-business-live-news",
    "image": "https://media.guim.co.uk/74ba1d6637e24977b469b130f707df3cecca3f94/196_0_2989_2391/500.jpg",
    "summary": "The FTSE 100 has reached a record high, reflecting a robust performance as global stocks experienced their best September since 2013. This surge indicates strong investor confidence and positive market trends. The milestone marks a significant recovery and optimism in the stock market.",
    "published": "2025-10-01T16:19:06Z"
  }
]