[
  {
    "title": "Unyielding Aces rally late to edge Mercury in WNBA finals opener",
    "url": "https://www.theguardian.com/sport/2025/oct/03/wnba-finals-2025-aces-mercury-game-1-report",
    "image": "https://media.guim.co.uk/e8168464aa017e52b9f6a9005865cdd4ca216ed5/711_0_3103_2483/500.jpg",
    "summary": "Las Vegas pulled off a surprising comeback to defeat Phoenix 89-86 in Game 1 of the WNBA Finals. The win showcased the team's resilience as they rallied late in the game. Meanwhile, Commissioner Cathy Engelbert faced scrutiny regarding issues off the court.",
    "published": "2025-10-04T03:04:54Z"
  },
  {
    "title": "Two bodies found in Victorian high country by hikers",
    "url": "https://www.theguardian.com/australia-news/2025/oct/04/two-bodies-found-in-victorian-high-country-by-hikers",
    "image": "https://media.guim.co.uk/8f74427f996aefde56bd4ecb44878dad183bc56f/111_0_3725_2980/500.jpg",
    "summary": "Tasmanian police have confirmed the death of a woman who drowned in the Franklin River. In a separate incident, 11 hikers were rescued after being stranded. Authorities are investigating the circumstances surrounding both events.",
    "published": "2025-10-04T02:08:15Z"
  },
  {
    "title": "Trump says Hamas response to peace plan means ‘peace in the Middle East’ is ‘very close’ – as it happened",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/03/shutdown-congress-trump-senate-latest-updates",
    "image": "https://media.guim.co.uk/9b4205aea3f4fabc735b6ffe16d553a37b6532ec/580_0_5802_4644/500.jpg",
    "summary": "The US president has expressed approval of Hamas's response to his Gaza plan, even though the group indicated that additional negotiations on specific details are necessary. This marks a significant step in the ongoing discussions. However, the blog covering this news is now closed.",
    "published": "2025-10-04T02:05:28Z"
  },
  {
    "title": "Donald Trump orders Israel to ‘immediately’ stop bombing Gaza as Hamas agrees to free hostages",
    "url": "https://www.theguardian.com/world/2025/oct/03/hamas-agrees-to-release-all-israeli-hostages",
    "image": "https://media.guim.co.uk/21a5a6d3ece081378a0436e0594a541e6cb40bf0/720_0_7200_5760/500.jpg",
    "summary": "A Palestinian militant group has agreed to some aspects of a US president's proposed plan but demands further discussions on several key terms. They are open to negotiations to address their concerns. The ongoing dialogue highlights the complexities of reaching a comprehensive agreement.",
    "published": "2025-10-04T02:02:49Z"
  },
  {
    "title": "Dfat officials supporting five Australians in Israeli prison after they were detained on pro-Palestinian flotilla",
    "url": "https://www.theguardian.com/australia-news/2025/oct/03/australians-gaza-flotilla-detained-government-pushing-israel-for-information",
    "image": "https://media.guim.co.uk/13979036b07825efe92a98cd77b6cf3345cbf424/168_0_1695_1356/500.jpg",
    "summary": "The Global Movement to Gaza group has expressed concerns over the detention conditions of Australians in Gaza. They highlight the potential mistreatment and inadequate living situations faced by detainees. This news reflects the broader humanitarian issues in the region amid ongoing conflicts.",
    "published": "2025-10-04T01:30:23Z"
  }
]