[
  {
    "title": "WSL clockwatch: Liverpool v Man Utd, Man City v London City Lionesses and more – live",
    "url": "https://www.theguardian.com/football/live/2025/sep/28/newcastle-v-arsenal-buildup-barcelona-in-action-wsl-and-more-matchday-live",
    "image": "https://media.guim.co.uk/95c74eb8bcccdeddfb7e18886748df5dea0bd14a/85_0_2200_1760/500.jpg",
    "summary": "The northwest derby is set to take place in St Helens, featuring a crucial matchup for London City, who are striving to prove themselves after promotion. The game will showcase both teams' aspirations and competitive spirit. Dominic Booth will be providing coverage of the events.",
    "published": "2025-09-28T11:14:01Z"
  },
  {
    "title": "Starmer calls Reform’s policy on immigration ‘racist’ and says Farage’s party would ‘tear country apart’ – Labour conference live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/28/labour-conference-keir-starmer-latest-uk-politics-news-live-updates",
    "image": "https://media.guim.co.uk/278884c7175aa9e0168f0cf2237632369f74848c/237_0_3750_3000/500.jpg",
    "summary": "The Prime Minister labels the Reform party's policy as immoral, emphasizing that voters attracted to it are not driven by racism but rather by frustration. He acknowledges the concerns of these individuals, suggesting a need for understanding their motivations. The statement highlights a complex political landscape where discontent is shaping voter behavior.",
    "published": "2025-09-28T11:14:00Z"
  },
  {
    "title": "Zelenskyy condemns ‘vile’ and deadly Russian strikes on Ukraine; drones spotted over Danish military sites – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/sep/28/ukraine-russia-war-volodymyr-zelenskyy-vladimir-putin-nato-europe-latest-live-news-updates",
    "image": "https://media.guim.co.uk/e68cf9bc3dcc5937c2a7120ff544d888f723da7b/712_330_1503_1202/500.jpg",
    "summary": "A twelve-year-old girl was among the victims killed in Kyiv amid ongoing violence. Meanwhile, unidentified drones were observed over Danish military bases on Saturday night, raising concerns about security. The incidents highlight escalating tensions in the region.",
    "published": "2025-09-28T11:11:22Z"
  },
  {
    "title": "Why Trump is backing Argentina’s Thatcherite economics | Heather Stewart",
    "url": "https://www.theguardian.com/business/2025/sep/28/why-trump-is-backing-argentinas-thatcherite-economics",
    "image": "https://media.guim.co.uk/9fa640f19ab074796d5f81d7ff0a38852521db51/412_0_4118_3294/500.jpg",
    "summary": "Javier Milei's aggressive measures to combat inflation have gained approval from Washington and the IMF. However, many ordinary Argentinians are not convinced by his approach. The divide highlights the challenges of his economic strategies amidst public skepticism.",
    "published": "2025-09-28T11:06:37Z"
  },
  {
    "title": "UK government urged to restore Electoral Commission’s independence to protect democracy",
    "url": "https://www.theguardian.com/politics/2025/sep/28/uk-government-urged-to-restore-electoral-commissions-independence-to-protect-democracy",
    "image": "https://media.guim.co.uk/433e8aa862270192f9815bfeaf9f806556e00c97/86_0_2796_2239/500.jpg",
    "summary": "A new report warns that the oversight of a government watchdog could be at risk of abuse by a future authoritarian regime. It raises concerns about the potential for diminished accountability and the undermining of democratic processes. The findings highlight the need for robust safeguards to protect the integrity of oversight institutions.",
    "published": "2025-09-28T11:00:18Z"
  }
]