[
  {
    "title": "New York Times sues Pentagon over new reporting restrictions – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/dec/04/us-politics-live-donald-trump-latest-news-updates-democrats-republicans",
    "image": "https://media.guim.co.uk/c78833bfa22a05726fc75d59cf27d11518e7fda6/171_0_1706_1365/500.jpg",
    "summary": "The New York Times has accused the Pentagon of violating the constitutional rights of its journalists. The accusation stems from the military's actions that reportedly obstructed the press's ability to cover certain stories. The situation raises concerns about press freedom and transparency in military operations.",
    "published": "2025-12-04T12:46:24Z"
  },
  {
    "title": "First Thing: ‘Alligator Alcatraz’ detainees face human rights violations, report alleges",
    "url": "https://www.theguardian.com/us-news/2025/dec/04/first-thing-alligator-alcatraz-detainees-human-rights-violations-amnesty-report-alleges",
    "image": "https://media.guim.co.uk/7373f6fbe4fedb41baf063d0fe329711d4ada7f4/560_0_5573_4461/500.jpg",
    "summary": "Amnesty International reports that detainees at a Florida facility were subjected to inhumane treatment, being shackled and confined in a metal cage outdoors. The organization highlights serious human rights violations occurring within the facility. In a separate investigation, it was revealed that the dollar-store industry frequently overcharges consumers despite its low-cost branding.",
    "published": "2025-12-04T12:44:31Z"
  },
  {
    "title": "Labour says it is ‘deplorable’ for Reform to dismiss Farage schoolboy racism claims as lies – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/dec/04/reform-uk-nigel-farage-richard-tice-keir-starmer-kemi-badenoch-uk-politics-live-news-updates",
    "image": "https://media.guim.co.uk/1b8953d976c5eb593676de4baa8fb874fa0b6fea/1085_0_5425_4342/500.jpg",
    "summary": "Reform UK deputy leader Richard Tice defended Nigel Farage against recent allegations, labeling them as \"nonsense.\" He suggested that the claims are being made by individuals with a \"political axe to grind.\" Tice's remarks indicate strong support for Farage amid the controversy.",
    "published": "2025-12-04T12:44:02Z"
  },
  {
    "title": "Macron reportedly warned European leaders ‘there is a chance that the US will betray Ukraine’ – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/dec/04/german-chancellor-ukraine-russia-future-of-europe-live-latest-news",
    "image": "https://media.guim.co.uk/48ad80755894536faec827f14801e387d2f1dff6/1440_0_7200_5760/500.jpg",
    "summary": "German magazine Der Spiegel has reported on a leaked note from a recent call among European leaders, indicating a warning about an unspecified issue. The contents of the call suggest growing concerns within Europe. The details of the warning remain undisclosed, but it highlights potential challenges facing the EU.",
    "published": "2025-12-04T12:43:29Z"
  },
  {
    "title": "How Queen’s University Belfast became a global hub for decoding Earth’s past – and protecting its future",
    "url": "https://www.theguardian.com/research-to-reality/2025/dec/04/how-queens-university-belfast-is-decoding-earths-past",
    "image": "https://media.guim.co.uk/1a7029c47933504f71fcac542b15acfab46c5a90/899_0_6395_5120/500.jpg",
    "summary": "Queen's University emphasizes interdisciplinary collaboration as a key strategy for fostering innovation. Researchers are actively engaging in projects that range from reconstructing ancient climates to addressing contemporary ecological challenges. Their work highlights the importance of shared curiosity in influencing current policy decisions.",
    "published": "2025-12-04T12:38:08Z"
  }
]