[
  {
    "title": "Australia politics live: Minns government’s ‘dramatic, harsh and dangerous’ workers compensation changes condemned in searing report",
    "url": "https://www.theguardian.com/australia-news/live/2025/nov/03/australia-politics-live-nationals-net-zero-liberals-labor-bulk-billing-optus-sussan-ley-anthony-albanese-question-time",
    "image": "https://media.guim.co.uk/c46833e5991515940347dbaabb57e74d21ea5a8d/379_290_2678_2142/500.jpg",
    "summary": "I'm sorry, but I'll need more context or content related to the news you want summarized. Please provide additional information or details!",
    "published": "2025-11-03T06:31:07Z"
  },
  {
    "title": "TV tonight: Rachel Sennott’s new zillennial comedy",
    "url": "https://www.theguardian.com/tv-and-radio/2025/nov/03/tv-tonight-rachel-sennotts-new-zillennial-comedy",
    "image": "https://media.guim.co.uk/6c3289a2a28e37ce9352f6a8030b59dc5655bb5c/152_0_1600_1280/500.jpg",
    "summary": "The creator of \"The Bottoms\" explores themes of ambition, friendships, and love set in Los Angeles. Additionally, \"Blue Lights\" delivers a remarkable season finale. Check out these shows tonight for an engaging viewing experience.",
    "published": "2025-11-03T06:20:24Z"
  },
  {
    "title": "Massive crocodile taken to Steve Irwin’s Australia Zoo despite traditional owners’ anger over removal",
    "url": "https://www.theguardian.com/australia-news/2025/nov/03/crocodile-steve-irwin-australia-zoo-traditional-owners-anger-old-faithful",
    "image": "https://media.guim.co.uk/f200e33a95969d2d65d4a2a581f9d0592d9a6d4a/350_0_2700_2160/500.jpg",
    "summary": "Old Faithful, a giant freshwater crocodile measuring over 4 meters, has been relocated to a facility on the Sunshine Coast. The crocodile was removed from a waterhole in far north Queensland due to safety concerns. The rehoming aims to ensure both the crocodile's well-being and public safety.",
    "published": "2025-11-03T06:17:29Z"
  },
  {
    "title": "‘History won’t forgive us’ if UK falls behind in quantum computing race, says Tony Blair",
    "url": "https://www.theguardian.com/technology/2025/nov/03/history-wont-forgive-us-if-uk-falls-behind-in-quantum-computing-race-says-tony-blair",
    "image": "https://media.guim.co.uk/b0bae56b8f193d05cf5da36e64f831b60d01e8bf/982_0_6880_5504/500.jpg",
    "summary": "Former Prime Minister William Hague has warned that the UK is falling short in high-risk capital and infrastructure necessary to leverage advancements in powerful technology. He emphasized that without these resources, the country may miss out on significant economic benefits. Hague's concerns highlight the need for strategic investments to support innovation and growth in the tech sector.",
    "published": "2025-11-03T06:00:27Z"
  },
  {
    "title": "Tax rises and drop in investment predicted to limit UK growth ",
    "url": "https://www.theguardian.com/business/2025/nov/03/tax-rises-drop-investment-limit-uk-growth-ey-item-club",
    "image": "https://media.guim.co.uk/aa713a5e752cd030b6e402d9899208ea49efe536/507_0_5088_4070/500.jpg",
    "summary": "The EY Item Club has revised its economic forecast downward for the upcoming year. This adjustment suggests that the Office for Budget Responsibility is likely to make similar revisions. The changes reflect concerns about economic performance and growth expectations.",
    "published": "2025-11-03T06:00:27Z"
  }
]