[
  {
    "title": "Australia news live: Cash accuses PM of ‘double standards’ over trip to UK Labour conference; police investigate fatal plane crash",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/28/australia-news-live-albanese-king-charles-afl-brisbane-coalition-liberals-western-australia-gst-queensland-nsw-victoria-labor-ntwnfb",
    "image": "https://media.guim.co.uk/e1468a7b3c77896d39cb2dd8838ad02b473e621d/598_0_5955_4767/500.jpg",
    "summary": "For real-time updates on today's news, tune in to live coverage. Stay informed about the latest developments across various topics. Keep an eye on breaking stories as they unfold.",
    "published": "2025-09-28T04:20:23Z"
  },
  {
    "title": "What would you do if a supermarket accidentally gave you £300 of groceries you hadn’t paid for? | Polly Hudson ",
    "url": "https://www.theguardian.com/commentisfree/2025/sep/28/what-would-you-do-if-a-supermarket-accidentally-gave-you-300-of-groceries-you-hadnt-paid-for",
    "image": "https://media.guim.co.uk/87100a19324d6c0e3a005dc83cf331c79f810798/403_0_5569_4456/500.jpg",
    "summary": "The law encourages individuals to return lost items. However, many might feel tempted to keep them instead. This raises ethical questions about the moral responsibilities associated with lost property.",
    "published": "2025-09-28T04:01:01Z"
  },
  {
    "title": "‘Huge energy challenges’: how can India make the leap to become a green, clean country?",
    "url": "https://www.theguardian.com/environment/2025/sep/28/huge-energy-challenges-how-can-india-make-leap-green-clean-country",
    "image": "https://media.guim.co.uk/12b009e0d7477eec181ed1b96a7f28e02df8b144/625_0_3750_3000/500.png",
    "summary": "Increasingly frequent deadly heatwaves in India are heightening the demand for life-saving cooling solutions. This surge in demand is putting additional pressure on the country's power generation capacity. The situation highlights the urgent need for enhanced energy resources to address climate-related challenges.",
    "published": "2025-09-28T04:00:01Z"
  },
  {
    "title": "Ukraine war briefing: Ukraine discussing ‘mega’ arms deal with US, Zelenskyy says ",
    "url": "https://www.theguardian.com/world/2025/sep/28/ukraine-war-briefing-ukraine-discussing-mega-arms-deal-with-us-zelenskyy-says",
    "image": "https://media.guim.co.uk/3e59abb7420b4d60a4d4aec9148c6da390218863/390_0_5908_4728/500.jpg",
    "summary": "Ukrainian President Zelenskyy announced efforts to negotiate a drone sales agreement with the United States. Meanwhile, Russian Foreign Minister Sergei Lavrov warned the UN that any aggression toward Russia would be met with a strong response. Tensions remain high as both countries navigate their military capabilities and international relations.",
    "published": "2025-09-28T02:26:28Z"
  },
  {
    "title": "Albanese rules out holding Australian republic referendum while he is prime minister",
    "url": "https://www.theguardian.com/australia-news/2025/sep/28/albanese-rules-out-holding-australian-republic-referendum-while-he-is-prime-minister",
    "image": "https://media.guim.co.uk/f556a644632eecffeda475ed4ca361b67f434eae/898_173_1762_1409/500.jpg",
    "summary": "The Prime Minister, who once supported transitioning to a republic, has shown a shift in stance and is now less focused on advocating for constitutional changes. This change in approach indicates a reconsideration of the importance of the republic discussion. The current emphasis appears to be shifting away from significant constitutional reforms.",
    "published": "2025-09-28T02:14:53Z"
  }
]