[
  {
    "title": "NFL week 12: Chiefs v Colts, Packers v Vikings and Bears v Steelers – live",
    "url": "https://www.theguardian.com/sport/live/2025/nov/23/nfl-week-12-chiefs-v-colts-packers-v-vikings-and-bears-v-steelers-live",
    "image": "https://media.guim.co.uk/4d4abbe2c916d4f3ef737b14d067fb75b7919cd1/878_0_4401_3521/500.jpg",
    "summary": "Graham Searles provides real-time updates on the UK kick-offs scheduled for 6pm. Fans can follow minute-by-minute coverage of the matches. Stay tuned for all the key moments and results as they unfold.",
    "published": "2025-11-23T19:15:39Z"
  },
  {
    "title": "Strictly Come Dancing: Blackpool results – live",
    "url": "https://www.theguardian.com/tv-and-radio/live/2025/nov/22/strictly-come-dancing-blackpool-special-live",
    "image": "https://media.guim.co.uk/d55b9629dc9adc20a5759aac6483440a3e40f6bb/395_0_3953_3162/500.jpg",
    "summary": "Due to La Voix's injury withdrawal, the annual Tower Ballroom event will not feature a dance-off or elimination this week. Scores and votes will be carried over to the following week, creating anticipation for which contestants will excel and which may struggle. The community awaits to see who will shine by the seaside and who could falter.",
    "published": "2025-11-23T19:14:13Z"
  },
  {
    "title": "Arsenal 4-1 Tottenham: player ratings from the north London derby",
    "url": "https://www.theguardian.com/football/2025/nov/23/arsenal-4-1-tottenham-player-ratings-from-the-north-london-derby",
    "image": "https://media.guim.co.uk/1083a7c2ae59c2f5ef5d8f69c772f62b82bc0180/35_0_5792_4634/500.jpg",
    "summary": "Eze had a memorable debut in the derby, marking a significant milestone in his career. Meanwhile, Bentancur and several other Spurs players experienced a disappointing match. The clash highlighted contrasting fortunes for the two teams involved.",
    "published": "2025-11-23T19:02:20Z"
  },
  {
    "title": "Arsenal v Tottenham: Premier League – as it happened ",
    "url": "https://www.theguardian.com/football/live/2025/nov/23/arsenal-v-tottenham-premier-league-live",
    "image": "https://media.guim.co.uk/a468ee0344fefd06e4d2baa7b122ffaa2a13eb14/1238_238_2962_2369/500.jpg",
    "summary": "Eberechi Eze scored a hat-trick to lead Arsenal to a decisive victory over Tottenham. The win allowed Arsenal to maintain their position at the top of the table, increasing their lead to six points. Tottenham struggled throughout the match, showcasing a disappointing performance.",
    "published": "2025-11-23T18:48:16Z"
  },
  {
    "title": "Brilliant Eze hits hat-trick as Arsenal thump Spurs to extend lead in title race",
    "url": "https://www.theguardian.com/football/2025/nov/23/arsenal-tottenham-premier-league-match-report",
    "image": "https://media.guim.co.uk/529390661c8c0b47d954f1956789c1b9dbb8dff7/200_0_2941_2352/500.jpg",
    "summary": "Eberechi Eze scored a hat-trick as Arsenal defeated Tottenham Hotspur 4-1 in a thrilling north London derby. The victory extends Arsenal's lead at the top of the Premier League to six points. This dominant performance further solidifies Arsenal's title aspirations this season.",
    "published": "2025-11-23T18:46:58Z"
  }
]