[
  {
    "title": "Trump ally Charlie Kirk has died after being shot at university event, with suspect still at large – latest updates",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/10/donald-trump-jeffrey-epstein-tariffs-immigration-crime-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/2673fb19ee0d09b38b7c9c4de993bd283a9eb6e7/313_215_3046_2437/500.jpg",
    "summary": "A rightwing activist was shot at around noon local time, prompting an investigation. University officials have stated that there is currently no suspect in custody, as the individual previously arrested has been cleared. Authorities continue to search for leads in the case.",
    "published": "2025-09-10T22:29:26Z"
  },
  {
    "title": "Charlie Kirk: influential rightwing activist and trusted ally of Trump",
    "url": "https://www.theguardian.com/us-news/2025/sep/10/who-is-charlie-kirk-profile",
    "image": "https://media.guim.co.uk/dfa838850b730de7152474621d32978a075bdc47/300_0_3000_2400/500.jpg",
    "summary": "Turning Point USA co-founder and activist leveraged a significant social media platform to promote right-wing ideologies. Through his work and influence, he played a pivotal role in shaping conservative discourse. His efforts reflect the growing impact of social media on political activism.",
    "published": "2025-09-10T22:28:55Z"
  },
  {
    "title": "Australia news live: Sydney wakes to storm cleanup; MPs condemn Charlie Kirk shooting",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/11/australia-news-live-sydney-storm-weather-anthony-albanese-solomon-islands-pacific-sussan-ley-jacinta-nampijinpa-price-ntwnfb",
    "image": "https://media.guim.co.uk/4cb2f72b88e176c31dad7c5751319109bf8583a8/690_0_5893_4715/500.jpg",
    "summary": "Sure! Please provide the news article or key details you want summarized.",
    "published": "2025-09-10T22:26:17Z"
  },
  {
    "title": "England v South Africa: first men’s T20 international – as it happened",
    "url": "https://www.theguardian.com/sport/live/2025/sep/10/england-v-south-africa-first-mens-t20-international-live",
    "image": "https://media.guim.co.uk/6e864a3093ae553bbdf9b640cd4ed57b2261752a/224_0_2500_2000/500.jpg",
    "summary": "South Africa triumphed by 14 runs using the Duckworth-Lewis-Stern (DLS) method during a rainy match at Sophia Gardens. The weather conditions significantly impacted the game, contributing to the tense atmosphere. The victory adds to South Africa's momentum in the tournament.",
    "published": "2025-09-10T22:19:38Z"
  },
  {
    "title": "US lawmakers unite to condemn Charlie Kirk shooting: ‘Reject political violence’",
    "url": "https://www.theguardian.com/us-news/2025/sep/10/charlie-kirk-shooting-reaction",
    "image": "https://media.guim.co.uk/cddc8dd3dc2dc420ef154842c3a7d21b1c26c808/240_0_3931_3145/500.jpg",
    "summary": "Both Republicans and Democrats have expressed strong condemnation following an attack on a right-wing activist at Utah Valley University. The incident has sparked widespread concern over the growing political violence and intolerance on campuses. Leaders from both parties are calling for unity in addressing such attacks and protecting free speech.",
    "published": "2025-09-10T22:14:09Z"
  }
]