[
  {
    "title": "Gaza ceasefire live: Hamas says it has returned all hostage bodies it can reach for now",
    "url": "https://www.theguardian.com/world/live/2025/oct/16/gaza-ceasefire-israel-hamas-palestine-rafah-hostages-live-news-updates",
    "image": "https://media.guim.co.uk/858fe899e1bcea685c54f64b3eef04136435f2e7/164_0_5558_4449/500.jpg",
    "summary": "A militant group reported that it is unable to recover additional remains from the ruins in Gaza due to a lack of specialized equipment. They emphasized the need for proper tools to facilitate the retrieval process. This statement comes amidst ongoing humanitarian concerns in the region.",
    "published": "2025-10-16T09:20:04Z"
  },
  {
    "title": "Ricky Hatton is thought to have killed himself, inquest told",
    "url": "https://www.theguardian.com/sport/2025/oct/16/ricky-hatton-is-thought-to-have-killed-himself-inquest-told",
    "image": "https://media.guim.co.uk/33252c81d04a0b1c71c718a8c6973d7117c651d4/329_0_2920_2336/500.jpg",
    "summary": "The opening of an inquest in Stockport revealed the provisional cause of death for a former boxing world champion. Details surrounding the circumstances of their passing were discussed during the proceedings. Further investigations are ongoing to establish a conclusive cause.",
    "published": "2025-10-16T09:18:48Z"
  },
  {
    "title": "Government to respond to Commons urgent question on China spy case witness statements – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/oct/16/china-spy-case-cps-keir-starmer-uk-politics-latest-news-updates",
    "image": "https://media.guim.co.uk/bc36c48f8d3f897800edc802cdf890079dd80aff/958_432_1897_1519/500.jpg",
    "summary": "A minister is set to respond to a request regarding three witness statements related to an alleged breach of the Official Secrets Act involving China. The details of the statements will be addressed in the forthcoming reply. This development highlights ongoing concerns about national security and foreign influence.",
    "published": "2025-10-16T09:16:29Z"
  },
  {
    "title": "Women’s Cricket World Cup: Australia v Bangladesh – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/16/womens-cricket-world-cup-australia-v-bangladesh-live",
    "image": "https://media.guim.co.uk/835a7854ad4cb6cfc7b620b4dd45f1087d261eee/0_0_3500_2802/500.jpg",
    "summary": "Australia has secured their spot in the finals after a decisive performance in the 50-over match held in Visakhapatnam. The over-by-over report provides detailed updates on the game's progress. Fans can follow the match commentary by joining Megan Maurice for live insights.",
    "published": "2025-10-16T09:15:54Z"
  },
  {
    "title": "‘Gruesome videos’: social media pushes distressing news to children, experts say",
    "url": "https://www.theguardian.com/society/2025/oct/16/gruesome-videos-social-media-distressing-news-children-survey",
    "image": "https://media.guim.co.uk/72781d6c485a65b7073e63843db561a727836155/569_0_5002_4000/500.jpg",
    "summary": "A survey by Internet Matters reveals that children are feeling worried and upset due to exposure to violent content, including shootings, stabbings, and war. The findings highlight the emotional impact of such media on younger audiences. This underscores the need for parental guidance and responsible media consumption.",
    "published": "2025-10-16T09:11:18Z"
  }
]