[
  {
    "title": "‘Loophole’ in sanctions allowing Russian oil to be imported to Australia through port part-owned by Macquarie Bank",
    "url": "https://www.theguardian.com/australia-news/2025/nov/09/loophole-russian-sanctions-oil-imported-to-australia",
    "image": "https://media.guim.co.uk/a87874c5699975d2a834f16cdd526f1c1c765205/131_0_2027_1622/500.jpg",
    "summary": "Australia ceased direct fuel purchases from Russia following the invasion of Ukraine. However, it has imported over 3 million tonnes of Russian oil products in 2023. This situation raises concerns about compliance with sanctions while highlighting the complexity of global energy markets.",
    "published": "2025-11-08T23:00:15Z"
  },
  {
    "title": "Is it better to be occasionally brilliant or consistently good? Ask the Wallabies | Daniel Gallan",
    "url": "https://www.theguardian.com/sport/2025/nov/09/is-it-better-to-be-occasionally-brilliant-or-consistently-good-ask-the-wallabies",
    "image": "https://media.guim.co.uk/9b16abc5b6965d57227d8ffdf62b59ae28398f9b/145_0_6880_5504/500.jpg",
    "summary": "Australia's cricket team displays moments of brilliance but suffers from critical collapses that undermine hopes for a revival. Consistent performance remains elusive as they seek to establish a reliable rhythm. Continued challenges may hinder their progress moving forward.",
    "published": "2025-11-08T22:57:27Z"
  },
  {
    "title": "Man charged with attempted murder after woman stabbed in neck in Birmingham",
    "url": "https://www.theguardian.com/uk-news/2025/nov/08/woman-stabbed-in-neck-in-unprovoked-attack-in-birmingham-city-centre",
    "image": "https://media.guim.co.uk/d4a303bfec21c397b7bb413a20f7d4a51e089e5d/269_495_2923_2339/500.jpg",
    "summary": "Djeison Rafael, 21, has been charged with two counts of assault and possession of a blade following an incident in the city center. The charges relate to events that took place recently. Further details on the incident and its circumstances have not been disclosed.",
    "published": "2025-11-08T22:21:55Z"
  },
  {
    "title": "Chelsea 3-0 Wolves: Premier League – as it happened",
    "url": "https://www.theguardian.com/football/live/2025/nov/08/chelsea-v-wolves-premier-league-live",
    "image": "https://media.guim.co.uk/abf6e6dc427ffafab452d669ee21663365418b59/568_174_4264_3413/500.jpg",
    "summary": "The hosts received boos at half-time but rallied to secure a convincing victory over their struggling visitors. Goals from Malo Gusto, Joao Pedro, and Pedro Neto in the second half sealed the win. The performance notably improved after a disappointing first half.",
    "published": "2025-11-08T22:18:14Z"
  },
  {
    "title": "Malo Gusto’s first professional goal sets up Chelsea cruise past winless Wolves",
    "url": "https://www.theguardian.com/football/2025/nov/08/chelsea-wolves-premier-league-match-report",
    "image": "https://media.guim.co.uk/926579f5921eb0304f788f0f358157ba444229da/614_549_3342_2673/500.jpg",
    "summary": "Chelsea secured a commanding 3-0 victory against Wolves in the Premier League. João Pedro and Pedro Neto, both scoring against their former club, contributed to the win. The result solidifies Chelsea's strong performance at home.",
    "published": "2025-11-08T22:07:04Z"
  }
]