[
  {
    "title": "Japan v Australia: rugby union international Test – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/25/japan-v-australia-live-rugby-union-international-test-scores-results-kick-off-time-national-stadium-tokyo",
    "image": "https://media.guim.co.uk/14fec09a7c5d55f45d56ba1eb3daca71f83545cc/97_23_3600_2881/500.jpg",
    "summary": "The Wallabies are set to compete against their former coach, Eddie Jones, in an eagerly anticipated match. Jonathan Howcroft will provide a live minute-by-minute report with updates on the game. Fans can follow along for real-time insights and commentary.",
    "published": "2025-10-25T07:17:13Z"
  },
  {
    "title": "Premier League buildup, Lionesses v Brazil and more – matchday live",
    "url": "https://www.theguardian.com/football/live/2025/oct/25/premier-league-buildup-lionesses-v-brazil-and-more-matchday-live",
    "image": "https://media.guim.co.uk/c715d88372ab5de0417dad99d5f36634c0fc1103/0_0_5000_4000/500.jpg",
    "summary": "Dominic Booth will host a segment featuring news, previews, and discussions in anticipation of an exciting day of events. Tune in for insights and updates on the latest happenings. Don't miss out on the action!",
    "published": "2025-10-25T07:17:12Z"
  },
  {
    "title": "Australia v India: third men’s one-day international – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/25/australia-v-india-cricket-odi-live-scores-aus-vs-ind-scorecard-third-mens-one-day-international",
    "image": "https://media.guim.co.uk/df37b4cfbc793e437de81c65d725037de7f78cca/0_0_3693_2955/500.jpg",
    "summary": "James Wallace will provide live updates in an over-by-over report format for the event. Fans can follow along for real-time commentary and insights. Stay tuned for detailed analysis and highlights throughout the coverage.",
    "published": "2025-10-25T07:16:11Z"
  },
  {
    "title": "Full Bloom: Hearts ride to the top off investment and analytics",
    "url": "https://www.theguardian.com/football/2025/oct/25/full-bloom-hearts-ride-to-the-top-off-investment-and-analytics",
    "image": "https://media.guim.co.uk/eacef493a62f6af3513584fab427fe144483e15e/244_0_2250_1800/500.jpg",
    "summary": "Edinburgh is set to host Celtic on Sunday, holding a five-point lead in the standings. Their advantage is strengthened by insights from the Brighton owner's access to top-notch data analytics. This strategic edge could play a crucial role in the match.",
    "published": "2025-10-25T07:00:28Z"
  },
  {
    "title": "‘He’s one of the few politicians who likes crypto’: my day with the UK tech bros hosting Nigel Farage",
    "url": "https://www.theguardian.com/technology/2025/oct/25/nigel-farage-reform-cryptocurrency-conference",
    "image": "https://media.guim.co.uk/c2133c117c8c5bb8e2ed8e205de7cf7fb2e0c644/909_0_4547_3637/500.jpg",
    "summary": "Reform UK leader is engaging with the cryptocurrency community to potentially secure campaign funding. This strategy aims to tap into the growing interest and investment in digital currencies. The move reflects a broader interest in innovative funding sources for political campaigns.",
    "published": "2025-10-25T07:00:28Z"
  }
]