[
  {
    "title": "Belgium holds emergency security council meeting to address drone sightings – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/nov/06/europe-latest-live-news-updates-belgium-drones",
    "image": "https://media.guim.co.uk/b26f7f5c26cc80f85fc2e10d0a82b076d81f4ca6/329_0_6880_5504/500.jpg",
    "summary": "Security services suspect that a state actor, likely Russia, is responsible for recent drone flights observed at military bases and airports. This activity raises concerns about potential espionage or military intelligence-gathering efforts. Authorities are closely monitoring the situation to assess the threat level.",
    "published": "2025-11-06T10:21:30Z"
  },
  {
    "title": "Australia v India: fourth men’s Twenty20 international – live",
    "url": "https://www.theguardian.com/sport/live/2025/nov/06/australia-v-india-mens-cricket-twenty20-international-live-updates",
    "image": "https://media.guim.co.uk/dbda36cac7679868aea6abcefcc887e97bf7bfa5/191_0_1980_1584/500.jpg",
    "summary": "The T20 series is tied at 1-1 as the teams prepare for their penultimate match. Martin Pegan will provide updates throughout the game. Fans can expect an exciting clash as both sides aim to take the lead in the series.",
    "published": "2025-11-06T10:20:02Z"
  },
  {
    "title": "Lammy set to face media as Tories accuse him of ‘dereliction of duty’ over prisoners released by mistake – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/nov/06/prisoner-release-david-lammy-latest-live-politics-news-updates",
    "image": "https://media.guim.co.uk/7f9e52918d46ab46d42949bfeb294901bdf25169/299_0_3403_2722/500.jpg",
    "summary": "Prison governors in England have been called to an urgent meeting with ministers amid growing scrutiny of the deputy Prime Minister. The meeting aims to address concerns and challenges within the prison system. This situation highlights ongoing issues in the management of prisons and their impact on public policy.",
    "published": "2025-11-06T10:11:40Z"
  },
  {
    "title": "Is Kim Kardashian’s legal drama All’s Fair really the worst TV show of all time?",
    "url": "https://www.theguardian.com/tv-and-radio/2025/nov/06/kim-kardashian-alls-fair-show",
    "image": "https://media.guim.co.uk/d54bc998af7025a443a2eb64098dc41d01a11ee9/228_0_4296_3439/500.jpg",
    "summary": "Ryan Murphy's latest series, featuring a prominent cast, has garnered overwhelmingly negative reviews, with several outlets assigning it zero-star ratings. Critics have labeled the show as disappointing and lacking substance. This reaction marks one of the most astonishing critical receptions in recent memory.",
    "published": "2025-11-06T10:02:05Z"
  },
  {
    "title": "‘New reality’: Hurricane Melissa strength multiplied by climate crisis, study says",
    "url": "https://www.theguardian.com/world/2025/nov/06/hurricane-melissa-storm-strength-climate-crisis",
    "image": "https://media.guim.co.uk/01987d4efc90799a8ac2c91fc56164928aa10c8b/500_0_6587_5271/500.jpg",
    "summary": "Research indicates that the intensity of winds associated with Melissa has increased fivefold due to climate change. This trend highlights the escalating impact of the climate crisis on weather patterns. The findings emphasize the need for urgent action to address climate-related issues.",
    "published": "2025-11-06T10:00:07Z"
  }
]