[
  {
    "title": "Trump urges Microsoft to fire lawyer who ran investigation into attempt to overturn 2020 US election – live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/26/james-comey-fbi-indictment-donald-trump-executive-orders-tariffs-us-politics-live",
    "image": "https://media.guim.co.uk/ea30745b7e0352485176734657642900fd15ae4f/186_0_2153_1724/500.jpg",
    "summary": "President expresses frustration towards a former deputy attorney general now at a tech company, following controversy surrounding the targeting of ex-FBI chief James Comey. This incident has sparked significant public outcry. Tensions between the administration and its former officials continue to escalate.",
    "published": "2025-09-27T01:21:42Z"
  },
  {
    "title": "AFL grand final 2025: Geelong Cats v Brisbane Lions – live build-up",
    "url": "https://www.theguardian.com/sport/live/2025/sep/27/afl-grand-final-2025-live-updates-geelong-vs-lions-blog-scores-results-start-time-cats-v-lions-mcg",
    "image": "https://media.guim.co.uk/f2b2451ed9abb4d17babe485e1623122273123ab/603_0_5000_4000/500.jpg",
    "summary": "The news previews an upcoming match between the Cats and the Lions, highlighting its significance as the Cats aim for a third championship under coach Chris Scott's leadership. Meanwhile, the Lions seek to defend their title and achieve back-to-back victories. Writers will provide live updates and commentary leading up to the game.",
    "published": "2025-09-27T01:21:30Z"
  },
  {
    "title": "Trump says he expects charges for other adversaries after Comey indictment",
    "url": "https://www.theguardian.com/us-news/2025/sep/26/trump-comey-charges-indictment",
    "image": "https://media.guim.co.uk/492b4ec199db9230dac7567e6dcdb17ce44119c8/609_325_2635_2109/500.jpg",
    "summary": "President comments on the potential for further actions amid the justice department's condemnation for allegedly pursuing a retribution campaign. His statement suggests the possibility of additional measures or consequences. The remarks highlight ongoing tensions between government branches regarding accountability and justice.",
    "published": "2025-09-27T01:13:06Z"
  },
  {
    "title": "Detainees shot in deadly attack on Ice facility in Dallas identified – reports",
    "url": "https://www.theguardian.com/us-news/2025/sep/26/immigrant-detainees-shot-dallas-identified",
    "image": "https://media.guim.co.uk/e738283ee6cd622727bbc40f4fd546c7d07eda91/491_0_4380_3504/500.jpg",
    "summary": "A shooting incident at an immigration detention center in Texas resulted in one death and two injuries. The alleged shooter is believed to have acted alone. Authorities are investigating the motive behind the attack.",
    "published": "2025-09-27T01:02:58Z"
  },
  {
    "title": "Eddy Current Suppression Ring’s electrifying return proves they never really went away",
    "url": "https://www.theguardian.com/music/2025/sep/27/eddy-current-suppression-rings-electrifying-return-proves-they-never-really-went-away",
    "image": "https://media.guim.co.uk/6b19b5df09aa92df35031f7aa08237669fbef4cb/587_0_4538_3630/500.jpg",
    "summary": "Fifteen years since their last headline performance in Melbourne, the cult favorite band played to a full crowd at Federation Square on Friday. Their show showcased their enduring appeal and musical legacy. Fans were treated to a memorable night filled with nostalgia and energy.",
    "published": "2025-09-27T00:28:07Z"
  }
]