[
  {
    "title": "Slavia Prague v Arsenal: Champions League – live",
    "url": "https://www.theguardian.com/football/live/2025/nov/04/slavia-prague-v-arsenal-champions-league-live",
    "image": "https://media.guim.co.uk/966393bf7effce0aaa8ec1eb88a4a359e4bb1b78/200_120_2063_1650/500.jpg",
    "summary": "The report follows the Arsenal team's attempt to continue their winning streak while holding a clean sheet. Niall McVeigh provides minute-by-minute updates on the match. Fans are keen to see if the Gunners can extend their remarkable defensive performance.",
    "published": "2025-11-04T17:14:58Z"
  },
  {
    "title": "US elections 2025 live: Donald Trump weighs in as Americans go to the polls in New York City, New Jersey, Virginia and California",
    "url": "https://www.theguardian.com/us-news/live/2025/nov/04/us-elections-2025-live-new-york-city-new-jersey-virginia-california-latest-news-updates-live",
    "image": "https://media.guim.co.uk/88a9be04ff4e347897e06aabd63cfa5e1dbf3434/293_0_2500_2000/500.jpg",
    "summary": "US President Joe Biden criticized Jewish voters supporting Democratic mayoral candidate Zohran Mamdani, calling them \"a stupid person.\" His comments sparked controversy and backlash. The remark highlights ongoing tensions within political and community dynamics regarding the candidate's stance on Israel and Jewish issues.",
    "published": "2025-11-04T17:13:24Z"
  },
  {
    "title": "WTA Finals tennis: Sabalenka v Pegula; Gauff beats ailing Paolini in straight sets – live",
    "url": "https://www.theguardian.com/sport/live/2025/nov/04/wta-finals-tennis-coco-gauff-v-jasmine-paolini-aryna-sabalenka-v-jessica-pegula-live",
    "image": "https://media.guim.co.uk/eb668894ef01947d0d362d3fc92d0a59a1f1fd23/143_0_2131_1705/500.jpg",
    "summary": "Join Yara El-Shaboury for coverage of the latest group-stage matches in the season-ending tournament. Tune in for insights and highlights as teams compete for advancement. Stay updated on the thrilling action and key performances.",
    "published": "2025-11-04T17:09:24Z"
  },
  {
    "title": " Lucy Ward tells court Joey Barton social media posts scared her",
    "url": "https://www.theguardian.com/uk-news/2025/nov/04/lucy-ward-tells-court-joey-barton-social-media-posts-scared-her",
    "image": "https://media.guim.co.uk/d5ff307965d41c0a44e3a691148ec1fad5d62fd9/131_0_1289_1031/500.jpg",
    "summary": "A former footballer is facing trial for allegedly posting offensive content on social media directed at broadcasters. The case centers around comments made by the athlete that are considered derogatory and harmful. Legal proceedings are underway to determine the implications of these online statements.",
    "published": "2025-11-04T17:05:14Z"
  },
  {
    "title": " EU could admit new members by 2030, says its foreign policy chief",
    "url": "https://www.theguardian.com/world/2025/nov/04/case-for-eu-enlargement-very-clear-cut-says-its-foreign-policy-chief",
    "image": "https://media.guim.co.uk/210b245d6496224aa81b0324293c17e8bb3cdfbb/0_0_4557_3647/500.jpg",
    "summary": "Kaja Kallas announced that additional countries, such as Montenegro, Albania, and Ukraine, may soon join the 27-member European Union. This statement highlights the EU's potential expansion in the future. The inclusion of these nations would signify further integration in Europe.",
    "published": "2025-11-04T17:04:20Z"
  }
]