[
  {
    "title": "‘Ukraine’s future is our future’, says Starmer, as he vows coalition will take Russian oil and gas off market to choke funding – Europe live ",
    "url": "https://www.theguardian.com/world/live/2025/oct/24/volodmyr-zelenskyy-ukraine-russia-vladimir-putin-sanctions-keir-starmer-coalition-of-the-willing-military-support-europe-live-news",
    "image": "https://media.guim.co.uk/fd72d626190c09fe7cc74791635b789c0e9ce584/167_0_1666_1333/500.jpg",
    "summary": "Ukrainian President Volodymyr Zelenskyy, UK Labour leader Keir Starmer, and allies from the 'coalition of willing' held a press conference to discuss ongoing military support for Ukraine. They emphasized the importance of unity among nations in facing aggression and bolstering Ukraine's defense. The leaders reiterated their commitment to providing assistance to secure peace and stability in the region.",
    "published": "2025-10-24T16:24:35Z"
  },
  {
    "title": "Bruno Fernandes still committed to Manchester United before landmark 300th game: football – live",
    "url": "https://www.theguardian.com/football/live/2025/oct/24/premier-league-news-europa-league-reaction-and-more-weekend-football-countdown-live",
    "image": "https://media.guim.co.uk/d7151cc0e7d67294e67ba542581ad031b92928a2/743_0_6105_4884/500.jpg",
    "summary": "A team of writers is set to cover a bustling weekend of sports action across various leagues. They will provide ongoing updates and insights as events unfold. Stay tuned for comprehensive coverage throughout the weekend.",
    "published": "2025-10-24T16:22:38Z"
  },
  {
    "title": "Premier League team news: predicted lineups for the weekend action",
    "url": "https://www.theguardian.com/sport/2025/oct/24/premier-league-team-news-predicted-lineups-for-the-weekend-action",
    "image": "https://media.guim.co.uk/3e7842f306b54ac4de54cafc84616d0db93fc76b/200_0_1658_1326/500.jpg",
    "summary": "Champions Liverpool are set to face Brentford in an exciting matchup on Saturday night. Meanwhile, league leaders Arsenal will take on Crystal Palace on Sunday. Both matches are key fixtures in the current football schedule.",
    "published": "2025-10-24T16:20:38Z"
  },
  {
    "title": "US and Canada spar over anti-Trump tariff advertising campaign that derailed trade talks – live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/24/donald-trump-trade-negotiations-canada-mark-carney-terminated-tariff-letitia-james-new-york-us-politics-live-news",
    "image": "https://media.guim.co.uk/47d1344ad043ca49c696490a8a5dde76db550753/830_0_6388_5111/500.jpg",
    "summary": "A White House adviser described negotiations with Canada as \"difficult.\" Meanwhile, an Ontario lawmaker defended a Canadian advertisement showcasing Ronald Reagan criticizing tariffs. This indicates ongoing tensions surrounding trade discussions between the two countries.",
    "published": "2025-10-24T16:19:56Z"
  },
  {
    "title": "Still life that never moved: mystery of missing Picasso painting solved",
    "url": "https://www.theguardian.com/artanddesign/2025/oct/24/mystery-of-missing-picasso-still-life-painting-solved-spain",
    "image": "https://media.guim.co.uk/53ad9540740f1073c5a603218df6da2f17767432/0_679_2400_1920/500.jpg",
    "summary": "An artwork intended for display in Granada from Madrid was reported missing during transport. Investigations suggest that the piece never actually made it onto the transport van. Authorities are looking into the circumstances surrounding its disappearance.",
    "published": "2025-10-24T16:14:21Z"
  }
]