[
  {
    "title": "Strictly Come Dancing: week three results – live",
    "url": "https://www.theguardian.com/tv-and-radio/live/2025/oct/11/strictly-come-dancing-week-three-live",
    "image": "https://media.guim.co.uk/9c81fe7a1bcb926f848a5f93e8bcaa9d407ee22f/254_0_3485_2788/500.jpg",
    "summary": "During Movie Week, Lewis Cope achieved the first perfect score of the year with his impressive paso doble inspired by Zorro. Meanwhile, Ross King found himself at the bottom of the leaderboard. The competition raises questions about which contestants might face elimination in the upcoming dance-off.",
    "published": "2025-10-12T18:23:55Z"
  },
  {
    "title": "Gaza ceasefire live: Trump to meet with Israeli hostages after their release by Hamas on Monday, says Vance",
    "url": "https://www.theguardian.com/world/live/2025/oct/12/gaza-ceasefire-live-aid-relief-hamas-release-israel-hostages",
    "image": "https://media.guim.co.uk/b826099457fa74a398182d2a2a34105b1b0e6877/500_0_5000_4000/500.jpg",
    "summary": "US Vice President JD Vance announced that a release of hostages could occur \"any moment.\" He emphasized optimism about progress in achieving sustainable peace in the Middle East. Vance's comments reflect a significant moment in ongoing diplomatic efforts in the region.",
    "published": "2025-10-12T18:21:43Z"
  },
  {
    "title": "Liverpool remain pointless in WSL after Fujino strike gives Manchester City late win",
    "url": "https://www.theguardian.com/football/2025/oct/12/liverpool-manchester-city-womens-super-league-match-report",
    "image": "https://media.guim.co.uk/282b28c7241fc2670015ea9787df47fd5e99aeb9/320_0_3202_2561/500.jpg",
    "summary": "Manchester City secured a 2-1 victory against Liverpool after initially falling behind. The win marked a significant setback for Liverpool, as they experienced their fifth consecutive loss in league matches. Gareth Taylor's side demonstrated resilience in overcoming the early deficit to claim the win.",
    "published": "2025-10-12T18:20:04Z"
  },
  {
    "title": "Steelers v Browns, Ravens v Rams and more: NFL week six – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/12/steelers-v-browns-ravens-v-rams-and-more-nfl-week-six-live",
    "image": "https://media.guim.co.uk/96a3033a659defe4a5896c5979e2efa9e45cecbf/815_0_5381_4305/500.jpg",
    "summary": "Graham Searles will provide live updates during week six of the NFL. Fans can expect timely information on games, scores, and player performances. Stay tuned for insights and highlights throughout the week.",
    "published": "2025-10-12T18:17:08Z"
  },
  {
    "title": "Scotland 2-1 Belarus: World Cup 2026 qualifying – as it happened",
    "url": "https://www.theguardian.com/football/live/2025/oct/12/scotland-v-belarus-world-cup-2026-qualifying-live",
    "image": "https://media.guim.co.uk/5639d210855a02419a53bced0700e309239b76cb/545_0_5000_4000/500.jpg",
    "summary": "Scotland secured a victory despite underperforming, with Che Adams and Scott McTominay scoring important goals. The team's lackluster performance was overshadowed by their ability to clinch the win. The match showcased their resilience and determination to succeed.",
    "published": "2025-10-12T18:11:26Z"
  }
]