[
  {
    "title": "Australia politics live: super fund sends ‘hands off’ message to government; Marles says army joining search for Dezi Freeman",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/03/australia-politics-live-labor-coalition-greens-anthony-albanese-sussan-ley-question-time-nauru-immigration-asylum-ntwnfb",
    "image": "https://media.guim.co.uk/4fb146847a87c4aee28bb36b89f28f0c25f23abe/620_0_5863_4693/500.jpg",
    "summary": "Sorry, but I need more context or details about the news you'd like summarized. Could you provide more information?",
    "published": "2025-09-02T22:25:37Z"
  },
  {
    "title": "RFK Jr critic Paul Offit removed from FDA vaccine advisory committee",
    "url": "https://www.theguardian.com/us-news/2025/sep/02/paul-offit-rfk-jr-fda-vaccines",
    "image": "https://media.guim.co.uk/b448e581ebe3b9c7cb376fb892d38d95fb3f75f6/389_0_4984_3989/500.jpg",
    "summary": "Vaccine scientist Paul Offit, known for his long tenure in the field, has been dismissed from his position without explanation, despite having previously been offered an extension. Offit expressed surprise at the decision, given his contributions to vaccine development. The circumstances surrounding his dismissal remain unclear.",
    "published": "2025-09-02T22:21:25Z"
  },
  {
    "title": "Trump makes false claims about US tariffs revenue and says White House trash video is ‘AI-generated’ – live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/02/congress-returns-government-shutdown-funding-trump-announcement-us-politics-live-latest-updates",
    "image": "https://media.guim.co.uk/37dd38e8ca0e0fcabf8e02a039a62a031d60968c/694_509_4364_3491/500.jpg",
    "summary": "Following the announcement regarding Space Command, the president held a press briefing, notably his first in a week. During the session, he provided responses that were deemed misleading by some. The inconsistent information raised concerns about transparency in communication with the press.",
    "published": "2025-09-02T22:16:34Z"
  },
  {
    "title": "US conducts ‘kinetic strike’ against drug boat from Venezuela, killing 11, Trump says",
    "url": "https://www.theguardian.com/us-news/2025/sep/02/trump-venezuela-boat-lethal-strike",
    "image": "https://media.guim.co.uk/1c2acbd6bd19bbe47426ae062e31e4b6cab1240a/4_74_3837_3071/500.jpg",
    "summary": "Former President Trump claimed that the U.S. conducted an operation in international waters, suggesting it was a decisive action amidst rising tensions between the U.S. and Caracas. His statement reflects ongoing geopolitical strain involving Venezuela. The remarks come as the Biden administration navigates complex relationships in the region.",
    "published": "2025-09-02T22:16:18Z"
  },
  {
    "title": "Trump announces Space Command HQ will switch to Alabama from Colorado",
    "url": "https://www.theguardian.com/us-news/2025/sep/02/trump-space-command-hq-alabama-colorado",
    "image": "https://media.guim.co.uk/4c375f733607b6bf7f1f7f36ea49cea9dbf3ed23/296_0_2950_2361/500.jpg",
    "summary": "The President announced that national security operations in space will now be based in a state where he secured a strong electoral victory, marking a reversal of a previous decision made by President Biden. This shift aims to enhance the strategic positioning of space operations. The move highlights the ongoing political implications of military and security policies.",
    "published": "2025-09-02T21:56:47Z"
  }
]