[
  {
    "title": "France recognises state of Palestine, Macron tells UN; Abbas says Hamas to ‘surrender their weapons’ – Middle East crisis live",
    "url": "https://www.theguardian.com/world/live/2025/sep/22/palestinian-state-gaza-israel-middle-east-hamas-benjamin-netanyahu-latest-live-updates",
    "image": "https://media.guim.co.uk/944e804bb81f5a77f0d68dd7363ee27724e20944/29_0_4598_3681/500.jpg",
    "summary": "France, Morocco, Belgium, Malta, and Luxembourg have made announcements regarding the situation in Gaza. Palestinian President Mahmoud Abbas stated that Hamas should \"have no role\" in governing the territory. This reflects ongoing discussions about leadership and governance in Gaza amid the conflict.",
    "published": "2025-09-22T23:27:03Z"
  },
  {
    "title": "Australia news live: AMA says ‘no studies’ back Trump claim about paracetamol as TGA confirms it is safe for use in pregnancy",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/23/australia-news-live-albanese-new-york-palestine-united-nations-donald-trump-mark-butler-paracetamol-pregnancy-ntwnfb",
    "image": "https://media.guim.co.uk/b09ed64d2e866d48885bb7465c5820885307a3c2/684_0_5461_4369/500.jpg",
    "summary": "I'm sorry, but I need more context or specific details about the news you would like summarized. Please provide the content or main points of the news article!",
    "published": "2025-09-22T23:19:49Z"
  },
  {
    "title": "Donald Trump signs order designating antifa as a domestic terror organization – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/22/donald-trump-charlie-kirk-autism-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/5575e702c456e7484aca274f2f22e2453f0c92d6/86_0_5478_4385/500.jpg",
    "summary": "President cites the killing of rightwing activist Charlie Kirk as evidence of a broader pattern of political violence associated with leftwing movements. He alleges this trend justifies his administration's decision to take action. The statement highlights ongoing tensions between political ideologies.",
    "published": "2025-09-22T23:17:49Z"
  },
  {
    "title": "What to know about Trump’s new $100,000 H-1B visa fee",
    "url": "https://www.theguardian.com/us-news/2025/sep/22/trump-h1b-visa-fee-explainer",
    "image": "https://media.guim.co.uk/36ee8f1953ca12d1c926b5b1c3cfef3ffa39b251/326_0_2500_2000/500.jpg",
    "summary": "The White House has issued a proclamation introducing new visa fees, leading to inquiries and uncertainty among the public. Many are seeking clarification on how these changes will affect visa applications and processing. The administration aims to provide guidance to address concerns and ensure transparency.",
    "published": "2025-09-22T23:14:34Z"
  },
  {
    "title": "Trump rails against Tylenol but autism claims not supported by science",
    "url": "https://www.theguardian.com/us-news/2025/sep/22/trump-tylenol-autism-women",
    "image": "https://media.guim.co.uk/476f5e154650bf044a7d301a19ed5e1c6d55dc2b/833_0_4167_3333/500.jpg",
    "summary": "The president's recent announcement is part of a broader campaign promoting the idea of \"natural\" living, which often disadvantages women. This initiative has sparked concerns about its implications for gender equality and women's rights. Critics argue that the movement undermines women's autonomy and reinforces traditional gender roles.",
    "published": "2025-09-22T23:07:53Z"
  }
]