[
  {
    "title": "Australia politics live: Anika Wells calls Coalition claims Labor sat on report about 2023 Optus outage ‘complete fabrication’",
    "url": "https://www.theguardian.com/australia-news/live/2025/oct/07/australia-politics-live-october-7-anniversary-hamas-israel-anthony-albanese-sussan-ley-question-time-andrew-hastie-labor-coalition-ntwnfb",
    "image": "https://media.guim.co.uk/230b3c6bd4aaa207c1c6ef8f166e17e4fee18b98/492_0_6176_4941/500.jpg",
    "summary": "Could you please provide the news article or details you'd like summarized?",
    "published": "2025-10-07T05:14:24Z"
  },
  {
    "title": "Pro-Palestine activists ask court to make genocide ruling during battle over Sydney Opera House protest",
    "url": "https://www.theguardian.com/world/2025/oct/07/pro-palestine-activists-planned-sydney-opera-house-protest-ask-court-genocide-ruling-ntwnfb",
    "image": "https://media.guim.co.uk/4e0f9eb9dfac14b3f8dc2b1c6d23187a247c93cc/416_0_6666_5334/500.jpg",
    "summary": "The Palestine Action Group emphasizes that the ongoing violence in Gaza necessitates a serious and urgent tone for the Sydney march planned for Sunday. They are advocating for heightened awareness and action in response to the situation. The group highlights the importance of addressing the humanitarian crisis in their demonstrations.",
    "published": "2025-10-07T05:12:09Z"
  },
  {
    "title": "Has Kemi Badenoch sounded the death knell for one nation Conservatism?",
    "url": "https://www.theguardian.com/politics/2025/oct/07/has-kemi-badenoch-sounded-the-death-knell-for-one-nation-conservatism",
    "image": "https://media.guim.co.uk/2ec8aaa888c6521b7c2b82c54ed57a80a987706a/1327_0_6990_5592/500.jpg",
    "summary": "The Tory leader's move towards more right-wing politics has caused concern among the party's centrist members. They are questioning the viability and future of their moderating tradition within the party. This shift may impact the internal dynamics and overall direction of the Tories.",
    "published": "2025-10-07T05:00:33Z"
  },
  {
    "title": "Two years after 7 October and the kidnap of my parents, hate is in fashion. For all our sakes, we need compassion | Sharone Lifschitz",
    "url": "https://www.theguardian.com/commentisfree/2025/oct/07/7-october-kidnap-parents-israel",
    "image": "https://media.guim.co.uk/4f9bc202af6932a59d780517c17f9f29fc6f34ec/421_0_3461_2769/500.jpg",
    "summary": "Sharone Lifschitz reflects on her mother's release from captivity, highlighting her choice to greet her captors with \"shalom,\" despite the violence they caused. This moment of grace amidst tragedy serves as a powerful lesson in forgiveness and humanity. Lifschitz calls for a deeper understanding of such acts in the face of conflict.",
    "published": "2025-10-07T05:00:33Z"
  },
  {
    "title": "José Pizarro’s recipe for parsnip, apple and chickpea albóndigas in saffron-tomato broth",
    "url": "https://www.theguardian.com/food/2025/oct/07/parsnip-apple-chickpea-albondigas-recipe-saffron-tomato-broth-jose-pizarro",
    "image": "https://media.guim.co.uk/a415cb932be115a1075ecdc5b4cce8804e43655d/438_977_3838_3067/500.jpg",
    "summary": "Delicious meatballs are served in a flavorful saffron and tomato broth. The dish is described as hearty, earthy, and slightly sweet. It's a comforting and satisfying meal option.",
    "published": "2025-10-07T05:00:33Z"
  }
]