[
  {
    "title": "Lawyer for Federal Reserve governor targeted by Trump says firing does ‘irreparable harm’ – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/aug/29/cdc-robert-f-kennedy-jr-donald-trump-federal-reserve-lisa-cook-latest-us-politics-news-live-updates",
    "image": "https://media.guim.co.uk/ae564ae0486ae4200007325d1b872da0bdd15a29/119_0_2999_2400/500.jpg",
    "summary": "Lisa Cook's attorney is advocating for her to continue in her position while awaiting a court decision. The request aims to maintain stability during the legal proceedings. A ruling regarding her status is pending.",
    "published": "2025-08-29T15:29:42Z"
  },
  {
    "title": "Trump will have been ‘played’ if Putin avoids Zelenskyy meeting, warns Macron – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/aug/29/ukraine-russia-war-zelenskyy-putin-latest-europe-news-updates-live",
    "image": "https://media.guim.co.uk/019722cb4af6668b4a6b93dc739fb20405d12b1b/1865_1010_1987_1590/500.jpg",
    "summary": "French President Emmanuel Macron plans to speak with U.S. President Joe Biden as pressure builds for Russian President Vladimir Putin to agree to bilateral talks by a Monday deadline. The discussions come amid escalating tensions between Russia and Ukraine. Diplomatic efforts are being intensified to address the situation.",
    "published": "2025-08-29T15:28:51Z"
  },
  {
    "title": "US Open tennis 2025: Emma Raducanu and Carlos Alcaraz in action on day six – live",
    "url": "https://www.theguardian.com/sport/live/2025/aug/29/us-open-tennis-2025-emma-raducanu-carlos-alcaraz-shelton-paolini-day-six-live",
    "image": "https://media.guim.co.uk/752cb77ac7b689fb5e31862a820ae8c4ba494088/484_0_4868_3895/500.jpg",
    "summary": "Katy Murrells is providing live updates from the third round of an event taking place in New York. Stay tuned for real-time information and highlights from the action. Follow along for the latest developments as they unfold.",
    "published": "2025-08-29T15:28:38Z"
  },
  {
    "title": "Addison Rae review – pop’s newest A-lister has the stagecraft of a veteran",
    "url": "https://www.theguardian.com/music/2025/aug/29/addison-rae-review-manchester-academy",
    "image": "https://media.guim.co.uk/96a0ff0131dc77d0bce883884df36f99232d9fbd/298_0_4164_3333/500.jpg",
    "summary": "Rae, a viral TikTok dancer, has made a transition to performing live, showcasing her confidence and vocal talent. Despite limited live appearances, she captivates audiences with her voice and club-ready beats. Her performances highlight her evolution from social media star to an emerging music artist.",
    "published": "2025-08-29T15:27:38Z"
  },
  {
    "title": "Solskjær, Mourinho and a warning for Amorim after Manchester United ",
    "url": "https://www.theguardian.com/football/2025/aug/29/solskjaer-mourinho-amorim-warning-manchester-united",
    "image": "https://media.guim.co.uk/67735bf2d7a20087ba169b62933e1adfe31909f9/0_0_5000_4000/500.jpg",
    "summary": "In today's Football Daily, two ex-Manchester United managers receive a dismissal in Turkey. Additionally, Thomas Tuchel issues an apology to Jude Bellingham. Highlights from the football world showcase ongoing coaching challenges and player relations.",
    "published": "2025-08-29T15:26:21Z"
  }
]