[
  {
    "title": "Leeds United v Liverpool: Premier League – live ",
    "url": "https://www.theguardian.com/football/live/2025/dec/06/leeds-v-liverpool-premier-league-live",
    "image": "https://media.guim.co.uk/f21c7957785ddde6b15c8f5a741374f8b3ece80f/329_0_3133_2506/500.jpg",
    "summary": "The misfiring champions head to Elland Road for a crucial match. Scott Murray will provide minute-by-minute updates on the game. Fans are eager to see how the team performs in this challenging encounter.",
    "published": "2025-12-06T19:15:25Z"
  },
  {
    "title": "Strictly Come Dancing: week 11 – live",
    "url": "https://www.theguardian.com/tv-and-radio/live/2025/dec/06/strictly-come-dancing-week-11-live",
    "image": "https://media.guim.co.uk/529facc214c0595b24fb7dfa6226462fe6ded3ff/736_0_3678_2944/500.jpg",
    "summary": "This week features Musicals Week, showcasing songs from The Greatest Showman and West Side Story, along with a new Dance Relay. The competition heats up as quarter-final performances await audience reactions. Viewers are eager to see who will struggle and who will shine.",
    "published": "2025-12-06T19:12:23Z"
  },
  {
    "title": "MLS Cup final: Inter Miami v Vancouver Whitecaps – live buildup",
    "url": "https://www.theguardian.com/football/live/2025/dec/06/mls-cup-final-inter-miami-v-vancouver-whitecaps-live-build-up",
    "image": "https://media.guim.co.uk/114a920b5cf9125fe4bac3cf4569c9431cb2cc6f/330_0_2479_1984/500.jpg",
    "summary": "Inter Miami is facing the Vancouver Whitecaps in the MLS Cup final. Beau Dure provides a minute-by-minute report of the match. Fans can follow the action closely as the teams compete for the championship.",
    "published": "2025-12-06T19:11:56Z"
  },
  {
    "title": "A Melbourne bakery found TikTok fame, before trolls began harassing its young staff. How the owners responded went viral",
    "url": "https://www.theguardian.com/australia-news/2025/dec/06/melbourne-bakery-montmorency-tiktok-harassment-viral-video",
    "image": "https://media.guim.co.uk/5485b23005dbe1bffba43364ffc18f1fb0f4ef08/82_0_2953_2362/500.jpg",
    "summary": "Montmorency Bakehouse has taken a stand against online harassment by addressing inappropriate comments directed at their content. They urged viewers to cease making \"thirsty comments.\" The bakery aims to create a positive online environment for their audience.",
    "published": "2025-12-06T19:00:05Z"
  },
  {
    "title": "Overhaul of Victoria’s anti-corruption watchdog recommended to broaden definition of corrupt conduct",
    "url": "https://www.theguardian.com/australia-news/2025/dec/07/victoria-ibac-anti-corruption-watchdog-overhaul-recommends-broaden-definition-corrupt-conduct",
    "image": "https://media.guim.co.uk/8c4aeff3332a304e1565223211d9b03420447041/609_0_6088_4870/500.jpg",
    "summary": "The state’s integrity and oversight committee has recommended that the Independent Broad-based Anti-corruption Commission (Ibac) enhance its oversight of Victoria Police. This recommendation aims to improve accountability and transparency within the police force. Strengthening Ibac's role is seen as crucial for upholding public trust and integrity in law enforcement.",
    "published": "2025-12-06T19:00:05Z"
  }
]