[
  {
    "title": "Abu Dhabi Grand Prix: F1 title decider – live",
    "url": "https://www.theguardian.com/sport/live/2025/dec/07/abu-dhabi-grand-prix-formula-one-f1-title-decider-norris-verstappen-piastri-live",
    "image": "https://media.guim.co.uk/95b79f31832b96c51aabafce25b4b8178f52f6b8/300_0_4836_3870/500.jpg",
    "summary": "Lando Norris, Max Verstappen, and Oscar Piastri are set to compete for the title at the Yas Marina Circuit. Live updates will be provided by Niall McVeigh. The championship showdown promises intense action.",
    "published": "2025-12-07T11:13:54Z"
  },
  {
    "title": "Premier League buildup, FA Cup second round updates, and more – live",
    "url": "https://www.theguardian.com/football/live/2025/dec/07/premier-league-buildup-fa-cup-second-round-updates-and-more-live",
    "image": "https://media.guim.co.uk/9b6a91e516d60b8e80c79f7e65ac248e188ca955/0_0_5000_4000/500.jpg",
    "summary": "The upcoming FA Cup matches feature Brighton vs. West Ham and Fulham vs. Crystal Palace. Coverage will also include updates on Scottish and European football. Join our writers for live insights and analysis leading up to the games.",
    "published": "2025-12-07T11:13:28Z"
  },
  {
    "title": "Forcing banks to support credit unions would help keep loan sharks at bay",
    "url": "https://www.theguardian.com/politics/2025/dec/07/banks-support-credit-unions-loan-sharks",
    "image": "https://media.guim.co.uk/217169c4e9404a9f2698525e978650da69c7f8d4/612_0_6137_4912/500.jpg",
    "summary": "Mainstream banks have avoided a windfall tax, prompting calls for them to reinvest their profits. Advocates argue that supporting local lenders could enhance community development and financial stability. Investing in local institutions may help foster competition and better serve underserved populations.",
    "published": "2025-12-07T11:12:41Z"
  },
  {
    "title": "Your Party’s Sultana suggests electoral alliances could help stop Farage – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/dec/07/keir-starmer-labour-reform-conservatives-your-party-uk-politics-latest-news-updates",
    "image": "https://media.guim.co.uk/c6656c67ce1ee54ca5ab9addc77b675bda35e631/250_0_2500_2000/500.jpg",
    "summary": "Sultana criticizes the Labour Party for withdrawing from political engagement, stating they have \"left the scene.\" She expresses a positive rapport with Polanski from the Greens, indicating potential collaboration. This highlights a shift in political dynamics and alliances.",
    "published": "2025-12-07T11:11:30Z"
  },
  {
    "title": "Australia v England: Ashes second Test, day four – as it happened",
    "url": "https://www.theguardian.com/sport/live/2025/dec/07/australia-vs-england-live-ashes-second-2nd-test-day-four-aus-v-eng-cricket-scores-updates-gabba-brisbane",
    "image": "https://media.guim.co.uk/aa66d39ea275f95e4b18df217a197ecd7438bbed/322_332_3903_3123/500.jpg",
    "summary": "Australia secured a dominant 8-wicket victory against England at Brisbane's Gabba, taking a 2-0 lead in the Ashes series. The team's strong performance emphasized their dominance on home soil. England will look to regroup as they face challenges in the upcoming matches.",
    "published": "2025-12-07T11:06:27Z"
  }
]