[
  {
    "title": "Kazakhstan v Wales: World Cup 2026 qualifier – live",
    "url": "https://www.theguardian.com/football/live/2025/sep/04/kazakhstan-v-wales-world-cup-2026-qualifier-live",
    "image": "https://media.guim.co.uk/27173c7d927d1e881b185b354c5f2f672bf46a12/319_0_5228_4183/500.jpg",
    "summary": "Wales faces a challenge as they travel to Astana to maintain their strong performance under coach Craig Bellamy. Barry Glendenning provides a minute-by-minute report on the match. Fans are eager to see if Wales can build on their recent success.",
    "published": "2025-09-04T15:34:09Z"
  },
  {
    "title": "RFK Jr defends chaos at federal health agencies as Democratic senators attack his ‘disaster’ tenure – live updates",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/04/donald-trump-tariffs-immigration-technology-epstein-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/0d34ae23b6cc0655f7cad1023e9794f21e7fe324/697_0_3834_3069/500.jpg",
    "summary": "Trump's health secretary is under pressure as he addresses concerns over layoffs and budget cuts within the department. Critics are scrutinizing his agenda to \"make America healthy again.\" The situation raises questions about the effectiveness of his plans amid financial challenges.",
    "published": "2025-09-04T15:32:57Z"
  },
  {
    "title": "England v South Africa: second men’s one-day international – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/04/england-v-south-africa-second-mens-one-day-international-live",
    "image": "https://media.guim.co.uk/b23a9cb7d29f8f44dc8dd5874696d46f29316482/569_0_4058_3247/500.jpg",
    "summary": "England is looking to recover from a heavy defeat in the first ODI as they face South Africa at Lord's. The match coverage includes an over-by-over report, allowing fans to follow the action closely. Writers will provide insights and updates throughout the game.",
    "published": "2025-09-04T15:32:25Z"
  },
  {
    "title": "Djed Spence and the long, long, long list of England’s post-Cole left-backs",
    "url": "https://www.theguardian.com/football/2025/sep/04/djed-spence-england-left-backs-football-daily-newsletter",
    "image": "https://media.guim.co.uk/19c69f0c639d83c4401b1ec72b81316055f9c1ae/130_0_4268_3415/500.jpg",
    "summary": "In today's Football Daily, Djed Spence receives a chance to showcase his talent on the England team. Additionally, Grimsby fans demonstrate strong solidarity with their club. Exciting developments are unfolding in the football world!",
    "published": "2025-09-04T15:31:29Z"
  },
  {
    "title": "Rob Lane obituary",
    "url": "https://www.theguardian.com/politics/2025/sep/04/rob-lane-obituary",
    "image": "https://media.guim.co.uk/a520aede686d58a5e5968cec9f15eb42a9c9d002/22_0_4926_3941/500.jpg",
    "summary": "The director of highways and transport at GLC aimed to reduce car dependency and enhance public transport services. Their initiatives focused on promoting sustainable mobility options. The director's efforts reflect a broader commitment to improving urban transport infrastructure.",
    "published": "2025-09-04T15:30:07Z"
  }
]