[
  {
    "title": "Trump says he ‘absolutely’ would live in Mamdani’s New York during unexpectedly cordial first meeting – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/nov/21/donald-trump-democrats-republicans-zohran-mamdani-us-politics-latest-news-updates",
    "image": "https://media.guim.co.uk/688c0d6cac8063aaed10172b8cd4bd39dfac0cbd/1030_0_6880_5504/500.jpg",
    "summary": "The president and the mayor-elect demonstrated a united front, deflecting questions aimed at highlighting their differences. Despite persistent inquiries, both leaders chose to focus on collaboration rather than conflict. Their reluctance to engage in division underscores a commitment to working together.",
    "published": "2025-11-21T23:16:14Z"
  },
  {
    "title": "Zelenskyy says Ukraine has impossible choice as Trump pushes plan to end war",
    "url": "https://www.theguardian.com/world/2025/nov/21/zelenskyy-says-ukraine-faces-most-difficult-moment-as-trump-pushes-plan-to-end-war",
    "image": "https://media.guim.co.uk/9db26e6a635fd6e0e40e8e15559eeb918b3ec7a8/285_0_1350_1080/500.jpg",
    "summary": "President Biden has urged Ukraine to consider a peace plan that may require conceding some territory to Russia. This approach aims to facilitate negotiations and end the ongoing conflict. The proposal has sparked debate over the implications for Ukrainian sovereignty and territorial integrity.",
    "published": "2025-11-21T23:14:47Z"
  },
  {
    "title": "Cop30 live: summit president says ‘everybody will lose’ as fears rise that conference will end without a deal",
    "url": "https://www.theguardian.com/world/live/2025/nov/21/cop30-live-fossil-fuel-phaseout-final-text-brazil-belem-latest-news-updates",
    "image": "https://media.guim.co.uk/b9df2e7064fb3fba79bfc87a214d9a2dad11d9e6/359_0_5000_4000/500.jpg",
    "summary": "André Corrêa do Lago urged the importance of preserving the Paris Agreement as negotiations reached a critical juncture. Despite efforts, participating countries were far from reaching a consensus on the final day of discussions. The plea highlights the urgency of collective action to address climate change challenges.",
    "published": "2025-11-21T23:13:49Z"
  },
  {
    "title": "Kellie Sloane faces a treacherous road ahead as NSW Liberal leader – and has a heavy burden on her shoulders | Anne Davies",
    "url": "https://www.theguardian.com/australia-news/commentisfree/2025/nov/22/kellie-sloane-faces-a-treacherous-road-ahead-as-nsw-liberal-leader-and-has-a-heavy-burden-on-her-shoulders",
    "image": "https://media.guim.co.uk/527cfbb20b85d906fa5f5d938961d38fa9c61e69/902_200_5776_4622/500.jpg",
    "summary": "The Liberal party faces significant challenges if it fails to connect with aspirational cities like Sydney. This raises concerns about the party's future viability and relevance in urban areas. A lack of appeal in such key regions could signal broader electoral difficulties ahead.",
    "published": "2025-11-21T23:00:22Z"
  },
  {
    "title": "What to turn to when the heat hits: the fan",
    "url": "https://www.theguardian.com/australia-news/2025/nov/22/fan-first-home-cooling-australia",
    "image": "https://media.guim.co.uk/0746952ae1d5241404e9159f0dba402ca93041a2/1_0_5998_4800/500.jpg",
    "summary": "As summer approaches, using fans for cooling can help maintain a comfortable temperature while lowering energy costs. Implementing fan-first strategies allows for efficient cooling. Stay informed on tips to maximize fan effectiveness.",
    "published": "2025-11-21T23:00:22Z"
  }
]