[
  {
    "title": "Tories and Reform offer only ‘easy answers and snake oil’ on UK-EU relationship, minister warns – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/aug/27/conservatives-consider-deal-afghanistan-migrants-uk-politics-latest-updates-news",
    "image": "https://media.guim.co.uk/47b36a7511c83493f2c6693221763aeda1c34683/1923_356_3689_2951/500.jpg",
    "summary": "Nick Thomas-Symonds criticized Nigel Farage for fostering division within communities and inciting anger. He emphasized the negative impact of Farage's actions on social cohesion. The comments highlight ongoing tensions in British politics.",
    "published": "2025-08-27T11:26:38Z"
  },
  {
    "title": "Trump’s 50% tariffs on India come into force as president puts pressure on country over buying Russian oil – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/aug/27/donald-trump-tariffs-india-us-politics-latest-updates-news",
    "image": "https://media.guim.co.uk/dbf56b9eac9b3c76aef3dc2fd49774f3edb80066/623_0_7200_5760/500.jpg",
    "summary": "An official from India's commerce ministry announced plans to encourage exporters to diversify their markets. This strategy aims to include regions like China and the Middle East. The initiative is part of efforts to enhance India's trade and economic resilience.",
    "published": "2025-08-27T11:25:58Z"
  },
  {
    "title": "Home Office planning to halve time asylum seekers given to find accommodation",
    "url": "https://www.theguardian.com/uk-news/2025/aug/27/charities-warn-rise-rough-sleeping-refugees-winter-uk",
    "image": "https://media.guim.co.uk/16ce2bf3b5dd18c28504a10a2b5632a481669024/705_0_4099_3280/500.jpg",
    "summary": "Charities are raising concerns over a government plan that would provide asylum seekers only 28 days to secure new housing after their case decisions. They warn this tight timeframe could lead to increased homelessness and vulnerability among this population. Advocates are calling for more support to help asylum seekers transition to stable living conditions.",
    "published": "2025-08-27T11:24:25Z"
  },
  {
    "title": "Israeli military carries out raid in West Bank city of Nablus – Middle East crisis live",
    "url": "https://www.theguardian.com/world/live/2025/aug/27/donald-trump-meeting-white-house-gaza-israel-middle-east-crisis-latest-updates-news",
    "image": "https://media.guim.co.uk/ce39f24c39b81909aa863d5c6c12c0aa4d61e30c/670_0_4910_3928/500.jpg",
    "summary": "Israeli military confirms the entry of soldiers and armored vehicles into a city in the northern occupied West Bank. Residents report that troops are conducting house searches in the area. The situation reflects ongoing tensions in the region.",
    "published": "2025-08-27T11:20:00Z"
  },
  {
    "title": "Tems is uplifting women to smash sexism in music. Can the industry change its tune?",
    "url": "https://www.theguardian.com/news/2025/aug/26/tems-women-sexism-african-music",
    "image": "https://media.guim.co.uk/f691c115001e9b49d909dbc526e96b6fe994fb02/356_1262_3015_2411/500.jpg",
    "summary": "A Grammy-winning singer has introduced an innovative platform aimed at empowering emerging African talent. This initiative seeks to support and nurture future artists across the continent. The platform is designed to provide resources and opportunities for young creatives.",
    "published": "2025-08-27T11:16:11Z"
  }
]