[
  {
    "title": "Tottenham v Brentford, Manchester City v Sunderland, and more: football – live",
    "url": "https://www.theguardian.com/football/live/2025/dec/06/tottenham-v-brentford-manchester-city-v-sunderland-and-more-football-live",
    "image": "https://media.guim.co.uk/00628f3f46fc7e6a8a6836d5adcfde5331e59fbd/97_0_3393_2714/500.jpg",
    "summary": "John Brewin will provide live updates on goals and significant match events from the 3pm Premier League kick-offs and other leagues. Stay tuned for real-time coverage of the most important moments in today's football action. Don't miss out on the excitement of the games!",
    "published": "2025-12-06T15:18:33Z"
  },
  {
    "title": "F1 Abu Dhabi Grand Prix: Verstappen takes pole in qualifying for the season finale – live",
    "url": "https://www.theguardian.com/sport/live/2025/dec/06/f1-abu-dhabi-grand-prix-qualifying-updates-for-the-season-finale-live",
    "image": "https://media.guim.co.uk/91674327d8fef7d98abc301921f7694f5795fbda/473_143_4676_3741/500.jpg",
    "summary": "Philip Cornwall will provide live updates during the qualifying sessions as the competition for the world drivers' title intensifies in its final round. The event features a thrilling three-way battle among top contenders. Fans can expect real-time insights and analysis of the qualifying outcomes.",
    "published": "2025-12-06T15:17:40Z"
  },
  {
    "title": "Noah Caluori shows his speed to help Saracens thrash depleted Clermont",
    "url": "https://www.theguardian.com/sport/2025/dec/06/saracens-clermont-auvergne-champions-cup-rugby-union-match-report",
    "image": "https://media.guim.co.uk/7a11ac101c8b5ab52ce84ee86186de3d1fbd3f5b/356_0_3401_2721/500.jpg",
    "summary": "Saracens had a dominant victory in their Champions Cup opener, defeating Clermont Auvergne 47-10. The team showcased a strong performance, highlighting their offensive strength. This win sets a positive tone for Saracens' campaign in the tournament.",
    "published": "2025-12-06T15:16:34Z"
  },
  {
    "title": "Aston Villa 2-1 Arsenal: Premier League – as it happened",
    "url": "https://www.theguardian.com/football/live/2025/dec/06/aston-villa-v-arsenal-premier-league-live",
    "image": "https://media.guim.co.uk/975fe4ea3a09442470801f5911b996da67e890a6/1103_0_3881_3104/500.jpg",
    "summary": "Emi Buendia showcased composure in a chaotic penalty box to secure a thrilling victory. His decisive kick at the last moment clinched the game for his team. The match was filled with excitement and dramatic moments throughout.",
    "published": "2025-12-06T15:10:13Z"
  },
  {
    "title": "Reform UK gains its first peer after Conservative party defection",
    "url": "https://www.theguardian.com/politics/2025/dec/06/reform-uk-gains-its-first-peer-after-conservative-party-defection-malcolm-offord",
    "image": "https://media.guim.co.uk/36adb6af4e943c642851b48e0244d359b9df5720/233_0_2831_2264/500.jpg",
    "summary": "Malcolm Offord was introduced as the newest member of Reform UK by party leader Nigel Farage during an event in Falkirk on Saturday. His recruitment adds to the party's lineup as it seeks to strengthen its influence. Farage's endorsement highlights Offord's significance to the party's future objectives.",
    "published": "2025-12-06T15:06:58Z"
  }
]