[
  {
    "title": "Guéhi to leave Palace, heat on Postecoglou as Premier League returns – matchday live",
    "url": "https://www.theguardian.com/football/live/2025/oct/18/premier-league-returns-postecoglou-arsenal-matchday-live",
    "image": "https://media.guim.co.uk/00f47bbe7e0c306035d7e512fdeb003379a53460/0_0_5000_4000/500.jpg",
    "summary": "Emillia Hawkins will host coverage of the Premier League as it resumes following the international break. Fans can expect updates and insights on the returning matches. The excitement builds as teams prepare to compete again on the field.",
    "published": "2025-10-18T08:22:18Z"
  },
  {
    "title": "New Zealand v England: first men’s T20 cricket international – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/18/new-zealand-v-england-first-mens-t20-cricket-international-live",
    "image": "https://media.guim.co.uk/b90dbb32ea26b93ddf93fe90b5c86b9ac25873e4/300_0_3000_2400/500.jpg",
    "summary": "England has launched its white-ball tour of New Zealand with updates being provided from Christchurch by James Wallace. The report covers the action on the field as the teams compete. Fans can stay tuned for live commentary and insights throughout the match.",
    "published": "2025-10-18T08:16:01Z"
  },
  {
    "title": "Revealed: UK Foreign Office staff pushed for Israel trip despite suspension of trade talks ",
    "url": "https://www.theguardian.com/politics/2025/oct/18/revealed-uk-foreign-office-staff-pushed-for-israel-trip-despite-suspension-of-trade-talks",
    "image": "https://media.guim.co.uk/e0300f33315509cd3f4bdd6938b432a087f7ff14/64_0_1920_1536/500.jpg",
    "summary": "A group of peers held meetings with Israeli officials and business leaders during a visit that lacked the backing of government ministers. The initiative appears to be independent and may spark discussions on UK-Israel relations. This development highlights ongoing diplomatic and economic interests despite the absence of official ministerial support.",
    "published": "2025-10-18T08:06:30Z"
  },
  {
    "title": "US podcaster who helped convict ‘Queen of the Con’ disappointed at short sentence",
    "url": "https://www.theguardian.com/us-news/2025/oct/18/us-podcaster-queen-of-the-con-sentence",
    "image": "https://media.guim.co.uk/6d9edd8c49eac80b098ef414ee088e853087728c/29_0_1201_960/500.jpg",
    "summary": "Johnathan Walton, a victim of Marianne 'Mair' Smyth, played a crucial role in assisting UK authorities in locating her. His support was instrumental in the investigative process. Smyth was ultimately apprehended due to Walton's efforts.",
    "published": "2025-10-18T08:00:40Z"
  },
  {
    "title": "‘It’s like a nuclear bomb has hit’: shocked Palestinians return home to desolation",
    "url": "https://www.theguardian.com/world/2025/oct/18/its-like-a-nuclear-bomb-has-hit-shocked-palestinians-return-home-to-desolation",
    "image": "https://media.guim.co.uk/b57648856e436edd602cfe7b339e8f6fe973a458/670_0_5000_4000/500.jpg",
    "summary": "Families are returning to Gaza City and nearby areas, discovering their neighborhoods have been devastated. Many are left with no choice but to camp amidst the ruins of their homes. The destruction has left them struggling to secure basic shelter and safety.",
    "published": "2025-10-18T08:00:39Z"
  }
]