[
  {
    "title": "UK house price growth slows as buyers ‘sit on sidelines’ before budget",
    "url": "https://www.theguardian.com/business/2025/oct/31/uk-house-price-growth-slows-budget",
    "image": "https://media.guim.co.uk/e1a37ed8eb18922f3c61ea4d52f63a6a4b38e165/20_685_3637_2912/500.jpg",
    "summary": "In October, the average price of a home in the UK increased by 0.3% to £272,226, according to Nationwide. This rise occurs alongside discussions regarding potential changes to property taxes. The housing market remains a key area of focus amid these developments.",
    "published": "2025-10-31T08:22:45Z"
  },
  {
    "title": "UK housing market ‘resilient’ in October; Asian stocks mixed after bumper tech earnings – business live ",
    "url": "https://www.theguardian.com/business/live/2025/oct/31/uk-house-prices-rise-asian-stocks-mixed-tech-earnings-business-live-news",
    "image": "https://media.guim.co.uk/60944f899cc10b02cb5609c621a120d10fe98739/666_0_5798_4639/500.jpg",
    "summary": "The latest economic and financial news highlights ongoing developments in global markets, including fluctuations in stock prices and shifts in interest rates. Analysts are closely monitoring inflation trends and central bank policies, which are impacting investor sentiment. Key economic indicators are being released, influencing forecasts and market strategies.",
    "published": "2025-10-31T08:21:53Z"
  },
  {
    "title": "Australia v India: second men’s Twenty20 international – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/31/australia-v-india-t20-live-second-twenty20-international-cricket-aus-vs-ind-latest",
    "image": "https://media.guim.co.uk/508fe812cc0ac83db4cf7cdfdb2987632fafd583/0_643_2000_1600/500.jpg",
    "summary": "Australia has chosen to bowl first against their arch-rivals in a sold-out match at the MCG for the second game of the T20 series. Martin Pegan will provide live updates. The excitement builds as the two teams face off in this highly anticipated clash.",
    "published": "2025-10-31T08:18:01Z"
  },
  {
    "title": "What – if anything – did Asian countries get out of Donald Trump’s whirlwind tour?",
    "url": "https://www.theguardian.com/business/2025/oct/31/donald-trump-tour-asian-countries-trade-deals-tariffs-explainer",
    "image": "https://media.guim.co.uk/39a810ac4794a2c1e0d3dc4ed194b578c704f99a/1117_0_7200_5760/500.jpg",
    "summary": "This week's trade deals face uncertainty as negotiations failed to secure U.S. commitments to reduce tariffs. Without reciprocity, the agreements may lose significant impact. The situation could hinder progress in international trade relations.",
    "published": "2025-10-31T08:15:15Z"
  },
  {
    "title": "Australian man dies while attempting to climb Himalayan mountain",
    "url": "https://www.theguardian.com/australia-news/2025/oct/31/australian-man-dies-while-attempting-to-climb-himalayan-mountain-himlung-himal-nepal",
    "image": "https://media.guim.co.uk/c2b89eb619c386668f138808ca5ead16530a4d47/0_0_4264_3413/500.jpg",
    "summary": "Chin Tark Chan tragically passed away while climbing Himlung Himal in Nepal. He was reported ill on Monday before his death on Wednesday. The incident highlights the risks associated with high-altitude mountaineering.",
    "published": "2025-10-31T08:13:20Z"
  }
]