[
  {
    "title": "World Cup qualifiers, WSL updates and football news – matchday live",
    "url": "https://www.theguardian.com/football/live/2025/oct/12/world-cup-qualifiers-wsl-updates-and-football-news-matchday-live",
    "image": "https://media.guim.co.uk/64ce8b500facbcfae5885d211674993017fec172/0_0_5000_4000/500.jpg",
    "summary": "Emillia Hawkins will host a pre-event buildup and discussion. She will provide insights and analysis ahead of the day’s activities. Tune in for expert commentary and anticipation of what’s to come.",
    "published": "2025-10-12T08:18:32Z"
  },
  {
    "title": "Gaza ceasefire live: aid relief scaled up as Hamas confirms it will begin releasing Israeli hostages on Monday morning",
    "url": "https://www.theguardian.com/world/live/2025/oct/12/gaza-ceasefire-live-aid-relief-hamas-release-israel-hostages",
    "image": "https://media.guim.co.uk/c50b7d0dc21406eaca08677991f847ed8903da37/571_0_3750_3000/500.jpg",
    "summary": "Israel's military has announced the completion of the first phase of its withdrawal operations. This move comes in preparation for a peace summit scheduled for Monday in Egypt. The developments signal a potential shift in the ongoing regional tensions.",
    "published": "2025-10-12T08:17:32Z"
  },
  {
    "title": "Thousands attend pro-Palestine rallies across Australia as organisers vow to keep protesting after Gaza ceasefire",
    "url": "https://www.theguardian.com/world/2025/oct/12/thousand-attend-pro-palestine-rallies-across-australia-as-organisers-vow-to-keep-protesting-after-gaza-ceasefire",
    "image": "https://media.guim.co.uk/6909c5015935b58cf409d7262bb2b1bbb892458a/228_0_2461_1970/500.jpg",
    "summary": "Sydney organizers affirmed their commitment to continuing protests for a free Palestine amid ongoing conflicts. Participants voiced hope that a potential US-brokered deal could lead to an end to the violence and suffering. The protests highlight a strong sentiment for justice and peace in the region.",
    "published": "2025-10-12T07:17:32Z"
  },
  {
    "title": "Parliamentary staff of colour earn £2,000 less than white colleagues, study suggests",
    "url": "https://www.theguardian.com/inequality/2025/oct/12/parliamentary-staff-of-colour-earn-2000-less-than-white-colleagues-study-suggests",
    "image": "https://media.guim.co.uk/71ef600428451279f76b08ac2123adcaf3932862/304_244_5811_4649/500.jpg",
    "summary": "A report from the GMB union reveals significant pay disparities among employees, highlighting wage gaps for women, disabled individuals, and LGBTQ+ staff, including trans and non-binary workers. The findings underscore ongoing issues of inequality in the workplace. The report calls for urgent attention to address these disparities.",
    "published": "2025-10-12T07:00:47Z"
  },
  {
    "title": "It can get worse: Blackpool’s latest defeat recalls Mick McCarthy meme",
    "url": "https://www.theguardian.com/football/2025/oct/12/stockport-1-0-blackpool-relegation-fears-after-steve-bruce-sacking",
    "image": "https://media.guim.co.uk/7ea3077e805d7b24ea12f60dd8f98e05912f207c/287_88_2522_2018/500.jpg",
    "summary": "Blackpool started the season with optimism under manager Steve Bruce but are now without a manager. Following their recent loss to Stockport, they find themselves in the relegation zone, sitting second from bottom in League One. The team's hopes for a turnaround look bleak as they navigate this difficult period.",
    "published": "2025-10-12T07:00:47Z"
  }
]