[
  {
    "title": "‘Beyond ironic’: Reform-led council says flags must come down so Christmas lights can go up",
    "url": "https://www.theguardian.com/uk-news/2025/nov/03/beyond-ironic-reform-led-council-says-flags-must-come-down-so-christmas-lights-can-go-up",
    "image": "https://media.guim.co.uk/ec60909c838cb285ddea1a3f5af0c8580cf2bb3d/720_0_7200_5760/500.jpg",
    "summary": "Kent County Council has ordered the removal of union flags and St George's flags from street lights due to safety concerns. The council cited potential hazards related to the flags' installation. The decision aims to ensure public safety in the area.",
    "published": "2025-11-03T19:12:19Z"
  },
  {
    "title": "Head teachers’ union considers strikes after judge drops case against Ofsted",
    "url": "https://www.theguardian.com/uk-news/2025/nov/03/head-teachers-union-considers-strikes-judge-dismisses-ofsted-case",
    "image": "https://media.guim.co.uk/17052718b449f24288dd7cdbaa8dd313d377cc62/824_0_5422_4338/500.jpg",
    "summary": "A union has requested permission to seek a judicial review of a new inspection framework implemented by a regulatory watchdog. The union argues that the framework may adversely affect its members. The outcome of the request could impact how inspections are conducted in their field.",
    "published": "2025-11-03T19:08:56Z"
  },
  {
    "title": "Scunthorpe United footballer injured in Cambridgeshire train stabbing",
    "url": "https://www.theguardian.com/uk-news/2025/nov/03/scunthorpe-united-footballer-jonathan-gjoshe-injured-in-cambridgeshire-train-stabbing-huntingdon",
    "image": "https://media.guim.co.uk/52d96987121245a64579f7c08a89699a946f4d22/350_58_908_726/500.jpg",
    "summary": "Jonathan Gjoshe suffered non-life-threatening injuries in an incident on Saturday. He is currently hospitalized, according to the club's statement. Further updates on his condition have yet to be provided.",
    "published": "2025-11-03T19:04:00Z"
  },
  {
    "title": "Frank calls for better support from Spurs crowd after Van de Ven and Spence apologise",
    "url": "https://www.theguardian.com/football/2025/nov/03/thomas-frank-tottenham-micky-van-de-ven-djed-spence-copenhagen-champions-league-chelsea",
    "image": "https://media.guim.co.uk/f76afcae709d22f0937c9553b982b6ee42d4d44a/272_32_2138_1710/500.jpg",
    "summary": "Thomas Frank has urged Tottenham Hotspur Stadium fans to provide better support for the team. This follows an incident where players Micky van de Ven and Djed Spence expressed regret over their reactions to crowd criticism. Frank emphasizes the importance of a united atmosphere for the team's success.",
    "published": "2025-11-03T18:58:00Z"
  },
  {
    "title": "Sunderland v Everton: Premier League – live",
    "url": "https://www.theguardian.com/football/live/2025/nov/03/sunderland-v-everton-premier-league-live",
    "image": "https://media.guim.co.uk/5e0034214965d3d5d7e72eee21d7970b8d809dda/81_0_5000_4000/500.jpg",
    "summary": "David Moyes returns to Wearside for a highly anticipated match, and Rob Smyth is providing minute-by-minute updates. Fans eagerly await the outcome as Moyes faces his former club. Stay tuned for live commentary and insights throughout the game.",
    "published": "2025-11-03T18:54:46Z"
  }
]