[
  {
    "title": "England v Sri Lanka: Women’s Cricket World Cup – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/11/england-v-sri-lanka-womens-cricket-world-cup-live",
    "image": "https://media.guim.co.uk/107d52eeda7fe74c6c00ddcf38fb61c51eb5bb30/66_0_3122_2497/500.jpg",
    "summary": "Nat Sciver-Brunt's team is set to compete against Sri Lanka in a cricket match. An over-by-over report will provide continuous updates on the game's progress. Stay tuned for insights and key moments from the match.",
    "published": "2025-10-11T11:12:07Z"
  },
  {
    "title": "Trump says ‘for the most part, there is consensus’ on next stages of Gaza ceasefire plan – live",
    "url": "https://www.theguardian.com/world/live/2025/oct/11/israel-gaza-ceasefire-hamas-hostages-netanyahu-trump-middle-east-latest-news-updates",
    "image": "https://media.guim.co.uk/427d10da50f878783a74c19da746f351f08fe8e7/834_0_4416_3535/500.jpg",
    "summary": "The US President stated that Hamas is currently in the process of gathering hostages. Meanwhile, displaced Palestinians are beginning to return to northern Gaza. This situation highlights the ongoing conflict and humanitarian challenges in the region.",
    "published": "2025-10-11T11:05:49Z"
  },
  {
    "title": "Ross Wilson ends Newcastle sporting director saga in switch from Forest",
    "url": "https://www.theguardian.com/football/2025/oct/10/ross-wilson-nears-newcastle-switch-from-nottingham-forest-sporting-director",
    "image": "https://media.guim.co.uk/7ac2d48b848cca596075e5f5730dc57de982db49/288_153_4298_3439/500.jpg",
    "summary": "Eddie Howe has united with Ross Wilson at Newcastle after finalizing a compensation agreement with Nottingham Forest. This collaboration marks an important step for Newcastle as they strengthen their management team. The deal underscores Howe's commitment to enhancing the club's performance and strategy.",
    "published": "2025-10-11T11:00:47Z"
  },
  {
    "title": "Pity poor Trump, whose Nobel hopes were dashed by common sense | Dave Schiling",
    "url": "https://www.theguardian.com/commentisfree/2025/oct/11/donald-trump-nobel-peace-prize",
    "image": "https://media.guim.co.uk/f999e049029ba5dd056fd97fc39f57a0fdb02b7b/871_0_5264_4212/500.jpg",
    "summary": "MAGA supporters are frustrated that the president was not awarded the peace prize. Their disappointment highlights the president's persistent focus on his own image and achievements. The situation underscores how closely political identity is tied to individual recognition.",
    "published": "2025-10-11T11:00:24Z"
  },
  {
    "title": "Boycotting Israel has gone mainstream: ‘We’ve never seen such traction before’",
    "url": "https://www.theguardian.com/world/2025/oct/11/israel-global-boycott",
    "image": "https://media.guim.co.uk/c84af8b09e6226d5fac0bfb85e18c281f991c2d5/816_0_5602_4480/500.jpg",
    "summary": "The call for a boycott, once marginalized, is now gaining traction among prominent leaders in the arts, sports, and political arenas. This shift marks a significant change in its acceptance and support. Advocates believe this movement reflects growing awareness and solidarity on various issues.",
    "published": "2025-10-11T11:00:23Z"
  }
]