[
  {
    "title": "Port Vale v Arsenal, Huddersfield v Manchester City, and more: Carabao Cup – live",
    "url": "https://www.theguardian.com/football/live/2025/sep/24/port-vale-v-arsenal-huddersfield-v-manchester-city-and-more-carabao-cup-live",
    "image": "https://media.guim.co.uk/50b431438a08ff9bafffb24475c8720195a54947/70_0_2290_1833/500.jpg",
    "summary": "Scott Murray will provide updates on the League Cup third round matches taking place on Wednesday. Stay tuned for highlights and key moments from the games. Don't miss the latest developments in this exciting tournament.",
    "published": "2025-09-24T20:33:09Z"
  },
  {
    "title": "Real Betis v Nottingham Forest, Red Star Belgrade v Celtic: Europa League – live",
    "url": "https://www.theguardian.com/football/live/2025/sep/24/lincoln-chelsea-liverpool-southampton-clockwatch-carabao-cup-live",
    "image": "https://media.guim.co.uk/f2eaf73a70995dd222c08b05b6c2bae5a44e7f40/466_172_3146_2517/500.jpg",
    "summary": "Rob Smyth will provide updates and news on the opening round of Europa League matches. Fans can expect insights and highlights from the initial games. Stay tuned for the latest developments in the tournament.",
    "published": "2025-09-24T20:32:59Z"
  },
  {
    "title": "Murdoch’s TikTok? Trump offers allies another lever of media control",
    "url": "https://www.theguardian.com/us-news/2025/sep/24/tiktok-trump-murdoch-ellison",
    "image": "https://media.guim.co.uk/6856a36502477eb3e7721678dfa00deb9ac4fcec/0_0_3000_2400/500.jpg",
    "summary": "TikTok is set to form a new board following a deal with China, which will include prominent figures like the Murdochs and Ellisons. This restructuring comes amid ongoing scrutiny over data privacy and security concerns. The changes aim to address regulatory issues while maintaining the platform's operations in the U.S.",
    "published": "2025-09-24T20:30:23Z"
  },
  {
    "title": "Officials reportedly identify Dallas Ice facility shooter; DHS corrects death toll down to one person killed – live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/24/donald-trump-jimmy-kimmel-freedom-of-speech-immigration-government-shutdown-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/2a31ae3af7399a58e942cf59ad12d39e233d5ff4/575_0_4583_3667/500.jpg",
    "summary": "Joshua Jahn allegedly killed one detainee and severely injured two others before taking his own life. The incident has sparked political controversy, with JD Vance attributing the rise in political violence to Democrats. This tragic event highlights growing concerns about safety and violence in detention facilities.",
    "published": "2025-09-24T20:29:05Z"
  },
  {
    "title": "Australia news live: Penny Wong tackles Trump climate claims; EU leader ‘inspired’ by Australian social media ban for kids ",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/25/australia-news-live-penny-wong-anthony-albanese-climate-crisis-united-nations-donald-trump-turkey-cop-politics-ntwnfb",
    "image": "https://media.guim.co.uk/275ab3ec81b662b0bcc438dafc4916e315785281/261_0_6880_5504/500.jpg",
    "summary": "I'm sorry, but I need more context or details about the specific news you're referring to in order to provide a summary. Please provide the text or main points of the news article you'd like summarized.",
    "published": "2025-09-24T20:28:57Z"
  }
]