[
  {
    "title": "Newcastle United v Barcelona: Champions League – live",
    "url": "https://www.theguardian.com/football/live/2025/sep/18/newcastle-united-v-barcelona-champions-league-live",
    "image": "https://media.guim.co.uk/a995cdc2327dcc24ef3f7f214c8d60eaeec2bd3f/255_51_2264_1812/500.jpg",
    "summary": "Eddie Howe's team faces a tough challenge as they kick off their campaign against Barcelona. Barry Glendenning will provide a minute-by-minute report of the match. Stay tuned for real-time updates on this exciting encounter.",
    "published": "2025-09-18T20:32:20Z"
  },
  {
    "title": "‘Censor-in-chief’: Trump-backed FCC chair at heart of Jimmy Kimmel storm",
    "url": "https://www.theguardian.com/tv-and-radio/2025/sep/18/brendan-carr-fcc-jimmy-kimmel",
    "image": "https://media.guim.co.uk/368ec51c6bd9cae71c736af37e3a0b03cac6a61d/661_0_6606_5285/500.jpg",
    "summary": "Brendan Carr advocates for free speech, yet has targeted certain broadcasters he claims are failing to serve the 'public interest.' His actions raised questions about the balance between promoting free expression and ensuring responsible media practices. This has sparked debate over the role of regulators in overseeing content and protecting democratic values.",
    "published": "2025-09-18T20:32:18Z"
  },
  {
    "title": "Manchester City v Napoli: Champions League – live",
    "url": "https://www.theguardian.com/football/live/2025/sep/18/manchester-city-v-napoli-champions-league-live",
    "image": "https://media.guim.co.uk/63cad710a022b38f82f1fd9204708304f258eb3f/363_319_1555_1244/500.jpg",
    "summary": "Italian champions arrive at the Etihad for a highly anticipated match. Simon Burnton provides live updates throughout the event. Fans can expect an exciting showdown as the teams compete.",
    "published": "2025-09-18T20:31:58Z"
  },
  {
    "title": "Jimmy Kimmel suspension: Trump suggests networks who cover him ‘negatively’ could lose licenses – live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/18/jimmy-kimmel-charlie-kirk-comments-show-cancelled-suspended-monologue-trump-us-politics-live",
    "image": "https://media.guim.co.uk/c5e96b967de7e5aa001310c0fc9ab1ba6d6aedce/0_284_6474_5180/500.jpg",
    "summary": "President Trump claimed that 97% of news networks are biased against him, making this assertion without evidence during a conversation with reporters on Air Force One. Meanwhile, Senate Minority Leader Chuck Schumer criticized Trump, accusing him of attempting to undermine free speech. The exchange highlights ongoing tensions between the Trump administration and the media.",
    "published": "2025-09-18T20:31:31Z"
  },
  {
    "title": "Swiped review – breezy drama gives dating apps the origins treatment",
    "url": "https://www.theguardian.com/film/2025/sep/18/swiped-review-tinder-bumble-movie",
    "image": "https://media.guim.co.uk/be9f703dc8a0eb7a28906b4b1ed1067832a39946/849_0_2400_1920/500.jpg",
    "summary": "Lily James stars as a former Tinder employee who transforms into the founder of Bumble in a new film. The story highlights her journey to success, blending insightful moments with some cliches. The narrative captures the essence of ambition and empowerment in the tech industry.",
    "published": "2025-09-18T20:31:28Z"
  }
]