[
  {
    "title": "Australia news live: Chalmers flags terms for ‘contentious’ GST review as inflation data shows ‘we’ve got work to do’",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/24/australia-news-live-anthony-albanese-new-york-united-nations-donald-trump-climate-crisis-palestine-israel-gaza-ntwnfb",
    "image": "https://media.guim.co.uk/ce27c1330e80002af4b4cedb7b13e3f5f3b2aa56/704_0_6620_5299/500.jpg",
    "summary": "I'm unable to access live news updates or specific articles at the moment. Please provide the text you'd like summarized, and I'll be happy to help!",
    "published": "2025-09-24T04:33:15Z"
  },
  {
    "title": "Country diary: The allotment is flying at full mast",
    "url": "https://www.theguardian.com/environment/2025/sep/24/country-diary-the-allotment-is-flying-at-full-mast",
    "image": "https://media.guim.co.uk/8123afaf859cb62c8400bcc4b3b2c562e2fea343/0_810_3024_2419/500.jpg",
    "summary": "In Hove, East Sussex, social gatherings involve sharing juice, jam, and plums at the pub. The event highlights seasonal offerings and community spirit. However, there's lingering curiosity regarding the phenomenon of 'mast' years, when specific trees produce abundant seeds.",
    "published": "2025-09-24T04:30:14Z"
  },
  {
    "title": "Jimmy Kimmel says Trump ‘tried his best’ to cancel him, as his show returns to air after suspension",
    "url": "https://www.theguardian.com/tv-and-radio/2025/sep/24/jimmy-kimmel-says-trump-tried-his-best-to-cancel-him-as-his-show-returns-to-air-after-suspension",
    "image": "https://media.guim.co.uk/34434b4557a0891aaf070475eeaf86d269fb1005/266_0_2500_2000/500.jpg",
    "summary": "The host's monologue highlighted that the suspension of his late-night show has sparked a national conversation about free speech. He emphasized the importance of open dialogue in society. The incident has prompted widespread discussions on the boundaries of expression in media.",
    "published": "2025-09-24T04:02:05Z"
  },
  {
    "title": "Slow Horses season five review – not even Gary Oldman can salvage this TV mess",
    "url": "https://www.theguardian.com/tv-and-radio/2025/sep/24/slow-horses-season-five-review-not-even-gary-oldman-can-salvage-this-tv-mess",
    "image": "https://media.guim.co.uk/fe52c130a6ac1f03eb9fd4a4c05350a093969eba/988_0_4939_3952/500.jpg",
    "summary": "The latest installment featuring the Slough House gang reveals their most troubling outing to date, characterized by unsettling shifts in the characters' personalities. Unconventional \"action\" scenes unfold in surprising settings, including penguin enclosures. Overall, the story takes a bizarre turn that leaves readers concerned.",
    "published": "2025-09-24T04:00:16Z"
  },
  {
    "title": "‘Children thrive down here’: the secret play centre hidden under Ukraine’s most dangerous city",
    "url": "https://www.theguardian.com/world/2025/sep/24/ukraine-kherson-childhood-drones-education-danger-isolation-underground",
    "image": "https://media.guim.co.uk/410bd481d44c5085dae4837c8c911433c677e26c/1081_0_5383_4309/500.jpg",
    "summary": "Children in Kherson have been out of school for nearly four years due to conflict, forcing many to live in isolation or underground to avoid drone attacks. The prolonged absence from education has significantly impacted their development and well-being. Efforts to reintegrate these children into a safe learning environment remain crucial.",
    "published": "2025-09-24T04:00:15Z"
  }
]