[
  {
    "title": "Australia news live: Scamps says climate debate may be ‘death knell’ for Liberals; fortune teller charged over alleged fraud",
    "url": "https://www.theguardian.com/australia-news/live/2025/nov/13/australia-news-live-liberals-energy-policy-dan-tehan-sussan-ley-net-zero-emissions-climate-change-labor-anthony-albanese-aurora-australis-ntwnfb",
    "image": "https://media.guim.co.uk/a6c9147b6ab5181b7453158e60725de654c8165e/3689_1036_1876_1501/500.jpg",
    "summary": "I'm sorry, but I cannot summarize the news without specific details about the topic or article you're referring to. Please provide more information or the content you'd like summarized.",
    "published": "2025-11-12T23:18:39Z"
  },
  {
    "title": "Petition to trigger US House vote on release of Epstein files reaches required total – live",
    "url": "https://www.theguardian.com/us-news/live/2025/nov/12/donald-trump-us-government-shutdown-house-democrats-republicans-latest-news-updates",
    "image": "https://media.guim.co.uk/6c428ba844c01c76bb3f1a0a4a958c0aeccce747/500_100_1015_813/500.jpg",
    "summary": "Adelita Grijalva, the newest member of Congress from Arizona, has signed a petition aimed at compelling a House vote on legislation to release files related to Jeffrey Epstein. The effort seeks to increase transparency regarding Epstein's activities and connections. This move marks Grijalva's proactive engagement in a significant issue within Congress.",
    "published": "2025-11-12T22:57:23Z"
  },
  {
    "title": "Bill to restrict late-term abortion defeated in South Australia after emotional debate",
    "url": "https://www.theguardian.com/world/2025/nov/13/south-australia-abortion-bill-restrict-late-term-defeated-voted-down",
    "image": "https://media.guim.co.uk/e3501cb7dae6c97b204dace10b1aee7663266028/340_419_2127_1700/500.jpg",
    "summary": "A proposed amendment aimed to limit abortion access, permitting the procedure only when the mother's life is at stake, in cases of multiple pregnancies, or in instances of significant fetal abnormalities. The amendment sought to restrict previous broader abortion rights. Its implications could significantly impact reproductive health laws and women's rights.",
    "published": "2025-11-12T22:57:21Z"
  },
  {
    "title": "Pressure grows on Starmer to sack chief of staff over briefing row",
    "url": "https://www.theguardian.com/politics/2025/nov/12/presssure-grows-on-starmer-to-sack-chief-of-staff-over-briefing-row",
    "image": "https://media.guim.co.uk/c8f9ce40cf89e0a97d0b1c472ab51abe2f15dd4e/501_166_1332_1065/500.jpg",
    "summary": "There are increasing demands for Morgan McSweeney to resign following a controversial briefing operation aimed at discrediting Wes Streeting. Critics argue that the tactics used in the operation were unethical and damaging. The situation has sparked a significant backlash within political circles.",
    "published": "2025-11-12T22:37:40Z"
  },
  {
    "title": "Anthropic announces $50bn plan for datacenter construction in US",
    "url": "https://www.theguardian.com/technology/2025/nov/12/anthropic-50bn-datacenter-construction",
    "image": "https://media.guim.co.uk/d246807f6abc7c901d8e14945376ea266dae83f2/305_0_3333_2667/500.jpg",
    "summary": "The AI startup responsible for the Claude chatbot is partnering with London-based Fluidstack to develop extensive new computing facilities. This collaboration aims to enhance their infrastructure to support advanced AI capabilities. The initiative reflects the growing demand for robust computing power in the AI sector.",
    "published": "2025-11-12T22:29:49Z"
  }
]