[
  {
    "title": "Zelenskyy condemns Russia’s ‘wicked’ overnight attack on Ukraine – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/nov/14/ukraine-kyiv-russia-zelenskyy-putin-europe-latest-news-updates",
    "image": "https://media.guim.co.uk/994bd8900523bf88ec6f6ecd4c2f1388170ea0df/285_0_2817_2254/500.jpg",
    "summary": "Kyiv faced a brutal attack involving drones and missiles, resulting in the deaths of at least four individuals and leaving dozens more injured. The assault underscores ongoing tensions in the region. Emergency services are actively responding to the aftermath of the strikes.",
    "published": "2025-11-14T11:16:21Z"
  },
  {
    "title": "World Cup qualifying latest, Irish hopes boosted and Ronaldo fumes: football news – live",
    "url": "https://www.theguardian.com/football/live/2025/nov/14/world-cup-qualifying-latest-republic-of-ireland-hopes-boosted-ronaldo-red-card-football-news-live",
    "image": "https://media.guim.co.uk/d064d13b90403b9435ed9e93e5b3f623675a8ff4/145_0_1764_1412/500.jpg",
    "summary": "Stay tuned as our writers provide in-depth coverage leading up to the World Cup qualifiers. Expect real-time updates and analysis of the matches and their outcomes. Don't miss the action and reactions from players and fans alike!",
    "published": "2025-11-14T11:10:57Z"
  },
  {
    "title": "Lô Borges obituary",
    "url": "https://www.theguardian.com/music/2025/nov/14/lo-borges-obituary",
    "image": "https://media.guim.co.uk/48af45b47dd72968a4cb74ad2afc082483350a62/619_199_1765_1412/500.jpg",
    "summary": "A renowned singer-songwriter in Brazil, celebrated for his role in founding the Clube da Esquina collective, has passed away. He gained recognition for releasing two landmark albums during the 1970s that significantly influenced Brazilian music. His contributions have left a lasting impact on the cultural landscape of the nation.",
    "published": "2025-11-14T11:09:53Z"
  },
  {
    "title": "Streeting ‘not in favour of breaking manifesto pledges’ as Treasury considers lowering income tax thresholds – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/nov/14/rachel-reeves-income-tax-budget-keir-starmer-labour-uk-politics-latest-news",
    "image": "https://media.guim.co.uk/a58c3f4ff79920d42f31cfe4ea6ff3447292547e/1355_589_2969_2376/500.jpg",
    "summary": "Rachel Reeves has reportedly abandoned plans to break the manifesto promise regarding income tax, according to a source cited by the Guardian. This decision reflects a commitment to uphold previous pledges. The move may influence public perception and party integrity ahead of future elections.",
    "published": "2025-11-14T11:02:40Z"
  },
  {
    "title": "Jeffrey Epstein advised Steve Bannon during 2018 pro-Trump media campaign",
    "url": "https://www.theguardian.com/us-news/2025/nov/14/jeffrey-epstein-steve-bannon",
    "image": "https://media.guim.co.uk/aff124ec5c65f26ce3ded3b6da601ebb11c941c5/0_0_5000_4000/500.jpg",
    "summary": "Text messages released by the U.S. House indicate that a convicted sex offender was advising a MAGA influencer on political messaging strategies. This revelation raises questions about the influence of controversial figures in political communication. The situation has sparked discussions over ethics and accountability within political circles.",
    "published": "2025-11-14T11:00:54Z"
  }
]