[
  {
    "title": "Government shutdown could cost $14bn, congressional forecaster predicts - US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/29/donald-trump-south-korea-china-latest-news-updates-live",
    "image": "https://media.guim.co.uk/f2aa79ba7a8be91c15f6083de7ea1c2dc7706eeb/422_0_5171_4139/500.jpg",
    "summary": "The nonpartisan Congressional Budget Office reports that the reauthorization of funding could result in a loss of up to $14 billion in GDP. This loss suggests that some economic impacts may be irreversible. The findings highlight the potential long-term consequences of funding decisions.",
    "published": "2025-10-29T19:13:45Z"
  },
  {
    "title": "Hurricane Melissa live updates: ‘dangerous storm surge’ expected in Bahamas after dozens reported dead in Haiti",
    "url": "https://www.theguardian.com/world/live/2025/oct/29/hurricane-melissa-live-updates-strengthens-cuba-extensive-damage-parts-of-jamaica",
    "image": "https://media.guim.co.uk/556fba4f8b291c7c54388fc5d148ebad70038534/403_0_3613_2891/500.jpg",
    "summary": "A hurricane warning remains in effect for areas including Bermuda. Meanwhile, the mayor of a southern coastal town in Haiti is urging the government to provide assistance amid the storm's threat. The situation highlights the vulnerability of these regions to severe weather impacts.",
    "published": "2025-10-29T19:12:14Z"
  },
  {
    "title": "French parliament votes to add consent to rape law after Gisèle Pelicot case",
    "url": "https://www.theguardian.com/world/2025/oct/29/french-parliament-votes-to-add-consent-to-law-after-gisele-pelicot-case",
    "image": "https://media.guim.co.uk/7b0479f4c369c77059c71c215a4c499e30a9ad80/801_0_5468_4375/500.jpg",
    "summary": "France is set to revise its criminal law, aligning it more closely with the legal frameworks of numerous other European nations. This historic reform aims to modernize and enhance the efficiency of the justice system. The proposed changes reflect a shift towards harmonizing legal standards across Europe.",
    "published": "2025-10-29T19:02:48Z"
  },
  {
    "title": "Telegraph sale in turmoil after lead bidder linked to China’s politburo",
    "url": "https://www.theguardian.com/media/2025/oct/29/telegraph-sale-turmoil-china-bidder-redbird-chair-spy-ring",
    "image": "https://media.guim.co.uk/b388b42900f2e2650867f61fd8fddf15fa842302/372_283_3215_2573/500.jpg",
    "summary": "A media group's publication has released a photo showing the chair of RedBird Capital alongside the alleged leader of a spy ring. The report raises concerns about potential connections between high-profile business figures and espionage activities. This revelation could have significant implications for both the media group and RedBird Capital.",
    "published": "2025-10-29T19:01:57Z"
  },
  {
    "title": "Liverpool v Crystal Palace: Carabao Cup – live",
    "url": "https://www.theguardian.com/football/live/2025/oct/29/liverpool-v-crystal-palace-carabao-cup-live",
    "image": "https://media.guim.co.uk/640fe8d0f5dc75e411ffca389ae63e0ad70a9968/1176_0_3146_2517/500.jpg",
    "summary": "In a minute-by-minute report, the focus is on whether the 10-time League Cup winners can regain their form in a match against Oliver Glasner's team. Scott Murray provides live updates on the game. Fans are eager to see how the teams perform in this important clash.",
    "published": "2025-10-29T19:01:54Z"
  }
]