[
  {
    "title": "AFL grand final 2025 live updates: Geelong Cats v Brisbane Lions",
    "url": "https://www.theguardian.com/sport/live/2025/sep/27/afl-grand-final-2025-live-updates-geelong-vs-lions-blog-scores-results-start-time-cats-v-lions-mcg",
    "image": "https://media.guim.co.uk/8078fa403df940448a66ce67de545d553277fed6/132_0_2872_2298/500.jpg",
    "summary": "The article provides a goal-by-goal report on the contest between the Cats and the Lions, with a focus on whether the Cats can achieve a third championship under coach Chris Scott after 15 years. It also highlights the Lions' aim to secure back-to-back titles. Writers are offering live updates on the game.",
    "published": "2025-09-27T05:15:52Z"
  },
  {
    "title": "TV tonight: Lost meets Agatha Christie in a fantastically fun survival thriller",
    "url": "https://www.theguardian.com/tv-and-radio/2025/sep/27/tv-tonight-lost-meets-agatha-christie-in-a-fantastically-fun-survival-thriller",
    "image": "https://media.guim.co.uk/19130f6f8fbe7f38bf160a0b9587a5a0697f51ff/0_0_3570_2856/500.jpg",
    "summary": "In Anthony Horowitz's \"Nine Bodies in a Mexican Morgue,\" a plane crash mystery unfolds. Meanwhile, viewers can tune in to see couples perform their first dances on \"Strictly.\" Tonight's programming promises intriguing storytelling and entertainment.",
    "published": "2025-09-27T05:15:33Z"
  },
  {
    "title": "Bledisloe Cup live updates: New Zealand All Blacks v Australia Wallabies – Rugby Championship",
    "url": "https://www.theguardian.com/sport/live/2025/sep/27/bledisloe-cup-live-updates-new-zealand-all-blacks-vs-wallabies-australia-rugby-championship-scores-results-kick-off-time-eden-park-auckland",
    "image": "https://media.guim.co.uk/9e4e2e40da6d88d15e1a43202483e978ec03ea18/0_0_3182_2547/500.jpg",
    "summary": "The Wallabies aim to break their longstanding losing streak at Eden Park and make significant progress in the Rugby Championship. Jonathan Howcroft provides a detailed, minute-by-minute update on their performance. Fans are eager to see if Australia's team can overcome this challenge.",
    "published": "2025-09-27T05:14:53Z"
  },
  {
    "title": "‘Don’t trust Trump’: how UK health experts are fighting back against a war on medicine",
    "url": "https://www.theguardian.com/news/ng-interactive/2025/sep/27/dont-trust-trump-how-uk-health-experts-fighting-back-war-medicine",
    "image": "https://media.guim.co.uk/15f1a9a4aebab334337c4a2c7547133dfe5aee52/0_0_5000_4000/500.jpg",
    "summary": "Ministers and medical organizations swiftly intervened following a statement from the US president suggesting an unproven connection between paracetamol and autism. They aimed to clarify scientific misunderstandings and reassure the public about the medication's safety. The response underscores the importance of accurate health communication to prevent misinformation.",
    "published": "2025-09-27T05:00:38Z"
  },
  {
    "title": "‘A hacker’s dream’: Britons on Keir Starmer’s plan for digital ID cards",
    "url": "https://www.theguardian.com/politics/2025/sep/27/britons-on-keir-starmer-plan-digital-id-cards",
    "image": "https://media.guim.co.uk/27a6e400dcf25f948da601709181838de103fd55/0_241_3120_2495/500.jpg",
    "summary": "Opinions on the new system are divided, with some expressing worries about civil liberties and cybersecurity risks. Others, however, see it as a beneficial tool for improving service efficiency. The debate highlights the balance between innovation and safeguarding rights.",
    "published": "2025-09-27T05:00:38Z"
  }
]