[
  {
    "title": "News live: Labor’s first deficit not as bad as feared; search continues for missing boy in South Australia",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/29/australia-news-live-optus-suffers-fresh-triple-zero-glitch-labors-first-deficit-not-as-bad-as-feared",
    "image": "https://media.guim.co.uk/bc66c7e52ff94bf4ed82d76468aec4a4c14c07c4/1010_302_4944_3956/500.jpg",
    "summary": "Could you please provide the specific news article or information you'd like me to summarize?",
    "published": "2025-09-29T01:23:00Z"
  },
  {
    "title": "At least two dead and eight injured after shooting at Mormon church in Michigan",
    "url": "https://www.theguardian.com/us-news/2025/sep/28/mass-shootings-north-carolina-texas-new-orleans",
    "image": "https://media.guim.co.uk/900f933af20eedf9a430f10167e0d76671cadc47/1278_0_6500_5203/500.jpg",
    "summary": "A church was set on fire amid a violent weekend that included multiple shootings across the U.S., notably in North Carolina, Texas, and on Bourbon Street in New Orleans. The incidents reflect rising concerns about public safety and gun violence. Authorities are investigating the connections between these events as they seek to address the escalating violence.",
    "published": "2025-09-29T01:10:53Z"
  },
  {
    "title": "Threatened kārearea falcon wins New Zealand’s 2025 bird of the year",
    "url": "https://www.theguardian.com/world/2025/sep/29/new-zealand-bird-of-the-year-2025-karearea-falcon-nz-winner",
    "image": "https://media.guim.co.uk/fe5f3a2ed038c3fe56c328fdac5f9abb7eb4162a/266_0_3522_2818/500.jpg",
    "summary": "The fastest bird in the country has won the top prize in this year's annual poll. The event was notable for being free of any scandals. This year's results highlight the bird's dominance.",
    "published": "2025-09-29T00:47:46Z"
  },
  {
    "title": "‘My kids are too scared to go outside’: Kurdish migrants face hostility as Japan wrestles with demographic crisis",
    "url": "https://www.theguardian.com/world/2025/sep/29/kurdish-migrants-japan-kurds-immigration",
    "image": "https://media.guim.co.uk/53fa770a0a13056401d2d2e05884e3906966611b/377_0_4841_3875/500.jpg",
    "summary": "Antagonism towards migrant communities is rising in Japan, mirroring trends observed in the UK, Europe, and the US. This growing sentiment reflects broader global challenges related to immigration and integration. Analysts warn that this shift could impact Japan's societal cohesion and foreign relations.",
    "published": "2025-09-29T00:43:37Z"
  },
  {
    "title": "Trump news at a glance: more than 100,000 federal workers to quit on Tuesday in largest ever mass resignation",
    "url": "https://www.theguardian.com/us-news/2025/sep/29/president-trump-administration-news-updates-today",
    "image": "https://media.guim.co.uk/f53f4cfd3d71e60830948f3236e1e39e99a201e3/653_0_6532_5227/500.jpg",
    "summary": "In the Trump administration, recent departures occurred within the deferred resignation program as Congress approaches a deadline to prevent a government shutdown. This development highlights ongoing tensions and challenges within US politics. Key political stories on September 28 reflect the looming crisis and its implications for governance.",
    "published": "2025-09-29T00:30:18Z"
  }
]