[
  {
    "title": "Australian politics live: PM says far-right extremists who believe they are above the law a ‘real concern’; Marles meets Hegseth in DC",
    "url": "https://www.theguardian.com/australia-news/live/2025/aug/27/australian-politics-live-anthony-albanese-iran-terrorism-far-right-sovereign-citizen-richard-marles-aukus-sussan-ley-labor-coalition-question-time-parliament-ntwnfb",
    "image": "https://media.guim.co.uk/9426d1c9ade7d257e87cfe365e240fbb972720c9/687_0_5804_4644/500.jpg",
    "summary": "I apologize, but I would need more specific information or text regarding the news you want summarized. Please provide details or the content to summarize.",
    "published": "2025-08-26T20:34:10Z"
  },
  {
    "title": "Kairat v Celtic, Leeds v Sheffield Wednesday: Champions League and Carabao Cup clockwatch – live",
    "url": "https://www.theguardian.com/football/live/2025/aug/26/kairat-v-celtic-leeds-v-sheffield-wednesday-champions-league-and-carabao-cup-clockwatch-live",
    "image": "https://media.guim.co.uk/1a4444ef50e9ee662efb485316d9614981ef0541/542_0_3640_2912/500.jpg",
    "summary": "Simon Burnton delivers the latest scores and updates from football matches across Europe and England. Fans can stay informed about key events and game highlights. This coverage keeps everyone connected to the ongoing excitement in the football world.",
    "published": "2025-08-26T20:34:07Z"
  },
  {
    "title": "US Open tennis day three: Sinner and Swiatek through, Boulter and Kartal exit – live",
    "url": "https://www.theguardian.com/sport/live/2025/aug/26/us-open-tennis-day-three-jannik-sinner-and-iga-swiatek-in-action-live",
    "image": "https://media.guim.co.uk/f794a1e9a50f1ea073d7e7c272b6f9b31c7e6335/463_0_3914_3133/500.jpg",
    "summary": "The article discusses the opening matches of the two favorite teams, providing live updates and insights from the writers. Fans can expect analysis on how these teams perform as the games unfold. Stay tuned for coverage on their progress and key moments from the matches.",
    "published": "2025-08-26T20:28:29Z"
  },
  {
    "title": "Trump urges Democrats to ‘call him’ to send troops to their cities in apparent attempt to legitimize threats of federal takeovers – live",
    "url": "https://www.theguardian.com/us-news/live/2025/aug/26/trump-federal-reserve-lisa-cook-news-updates-us-politics-live",
    "image": "https://media.guim.co.uk/03bf0ccbbfbff11068846f1a1db409ff3e138f13/880_0_7200_5760/500.jpg",
    "summary": "The president, amidst ongoing criticism over his threats to deploy the National Guard and take control of police forces, asserts that Democratic leaders should advocate for such takeovers. He frames the discussion around public safety and governmental authority. This stance highlights tensions between federal and local responses to crime.",
    "published": "2025-08-26T20:06:30Z"
  },
  {
    "title": "Corrections and clarifications",
    "url": "https://www.theguardian.com/news/2025/aug/26/corrections-and-clarifications",
    "summary": "Recent studies on sunscreen have highlighted concerns regarding the effectiveness of certain ingredients in protecting against UV radiation. Some findings suggest that chemical sunscreens may impact marine life and coral reefs. Experts recommend exploring mineral-based alternatives for better health and environmental safety.",
    "published": "2025-08-26T20:00:14Z"
  }
]