[
  {
    "title": "US Open tennis 2025: Auger-Aliassime v De Minaur, Anisimova v Swiatek on day 11 – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/03/us-open-tennis-2025-auger-aliassime-v-de-minaur-anisimova-v-swiatek-on-day-11-live",
    "image": "https://media.guim.co.uk/8b393a8a7db5bd6368edf59ba7b1e6b3414fd617/500_0_3233_2587/500.jpg",
    "summary": "Daniel Harris is providing ongoing updates on the singles quarter-finals at Flushing Meadows. Fans can follow along for live coverage and insights. Stay tuned for the latest developments in the matches.",
    "published": "2025-09-03T16:42:48Z"
  },
  {
    "title": "Trump says ‘you’ll see things happen’ if US is unhappy with Putin’s decisions – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/sep/03/volodymyr-zelenskyy-denmark-support-ukraine-karol-nawrocki-meet-donald-trump-europe-latest-updates-news",
    "image": "https://media.guim.co.uk/6dda344675221d2736430f538d245e3cf1e0ecf5/234_0_3545_2836/500.jpg",
    "summary": "During a meeting with Polish President Karol Nawrocki, Donald Trump addressed rising tensions after Russian President Putin threatened to use military force if diplomatic efforts fail. Trump's comments came amid ongoing concerns about Russia's aggressive posture in Eastern Europe. The meeting highlights the importance of international alliances in addressing security challenges posed by Russia.",
    "published": "2025-09-03T16:42:14Z"
  },
  {
    "title": "Top Obama-era Latin American expert warns of ‘disastrous’ US intervention in Venezuela",
    "url": "https://www.theguardian.com/world/2025/sep/03/us-military-venezuela-strike-guerrilla-war",
    "image": "https://media.guim.co.uk/4665e3169400d6beac0d92a65967133d1496f625/521_0_2635_2110/500.jpg",
    "summary": "The U.S. military's increased presence and an attack on a suspected drug trafficking boat in South America have raised concerns about a potential long-term guerrilla conflict in the region. This escalation reflects heightened tensions related to drug trafficking and security issues. Analysts warn that such actions may lead to further instability and conflict in the area.",
    "published": "2025-09-03T16:39:43Z"
  },
  {
    "title": "Farage a ‘Putin-loving, free speech impostor’ says Democrat before Reform head’s US speech – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/03/farage-starmer-badenoch-pmqs-news-updates-uk-politics-live",
    "image": "https://media.guim.co.uk/6015fae3e517fdff1435548d88f3150d00bc8b00/255_0_3332_2665/500.jpg",
    "summary": "Jamie Raskin referred to Nigel Farage as \"a Trump sycophant\" prior to Farage's appearance before the House Judiciary Committee in Washington. The statement highlights Raskin's criticism of Farage's political alignment with Donald Trump. Farage's address marks his involvement in U.S. political discussions.",
    "published": "2025-09-03T16:33:33Z"
  },
  {
    "title": "Parents and children who struggle at school need to be supported, not shamed | Letters",
    "url": "https://www.theguardian.com/lifeandstyle/2025/sep/03/parents-and-children-who-struggle-at-school-need-to-be-supported-not-shamed",
    "image": "https://media.guim.co.uk/d52a84b7a4924f9fc3ddaaaa177a6984d17c456b/449_0_4750_3800/500.jpg",
    "summary": "In recent letters, Katherine Green argues that the focus shouldn't be on \"doing more,\" while Kimberly Hind recounts her challenges caring for her deafblind son. Additionally, letters from Marjorie Wallace and Prof John Gallacher contribute to the ongoing discussion.",
    "published": "2025-09-03T16:30:19Z"
  }
]