[
  {
    "title": "Australia v England: Ashes second Test, day two – live",
    "url": "https://www.theguardian.com/sport/live/2025/dec/05/australia-vs-england-live-ashes-second-2nd-test-day-two-aus-v-eng-cricket-scores-updates-gabba-brisbane",
    "image": "https://media.guim.co.uk/db59be0bdb3eddd46bbcb643ba2b7460827733d2/405_112_4053_3242/500.jpg",
    "summary": "Tourists were bowled out for 334 runs on the second day at the Gabba. Joe Root played a key role with an unbeaten century. Follow the writers for more updates on the ongoing match.",
    "published": "2025-12-05T08:28:09Z"
  },
  {
    "title": "Sydney records highest temperature in nearly two years amid heatwave as Tasmanian bushfires threaten homes",
    "url": "https://www.theguardian.com/australia-news/2025/dec/05/parts-of-australia-hit-by-severe-heatwave-as-temperature-surges-past-40c-in-nsw-and-tasmanian-bushfires-threaten-properties",
    "image": "https://media.guim.co.uk/0466e77142561e3869f4d06f31a277bfcdfb91c8/0_0_1920_1536/500.jpg",
    "summary": "Heatwave warnings have been issued for regions in New South Wales, the Northern Territory, Queensland, and Western Australia. Residents are advised to take precautions due to extreme temperatures. Authorities are closely monitoring the situation to ensure public safety.",
    "published": "2025-12-05T08:25:38Z"
  },
  {
    "title": "UK house prices stagnated in November; Ocado to get $350m after robotic warehouse cancellations – business live",
    "url": "https://www.theguardian.com/business/live/2025/dec/05/uk-house-prices-affordability-stock-markets-us-inflation-ftse-pound-business-live-news-updates",
    "image": "https://media.guim.co.uk/8a070a72fe3657ee3cd70b98768abc5e984f451c/248_0_3743_2995/500.jpg",
    "summary": "Halifax reports a significant improvement in housing affordability, marking its strongest level since late 2015. This change follows a period of slowed price growth in the real estate market. The increased affordability could potentially attract more buyers looking to enter the market.",
    "published": "2025-12-05T08:22:19Z"
  },
  {
    "title": "Netflix becomes frontrunner in Warner Bros Discovery streaming and studio sale",
    "url": "https://www.theguardian.com/business/2025/dec/05/netflix-frontrunner-warner-bros-discovery-streaming-and-studio-sale",
    "image": "https://media.guim.co.uk/70ca44e85eec0462ce219cbd1a75ff59e6bc3e46/0_184_3838_3067/500.jpg",
    "summary": "A streaming service is in exclusive negotiations for a significant deal that could reshape the film and television industry. This move aims to enhance its content offerings and competitiveness. The potential agreement is highly anticipated and may have far-reaching implications for viewers and creators alike.",
    "published": "2025-12-05T08:20:48Z"
  },
  {
    "title": "Putin-Modi summit in India amid US trade pressure – latest updates",
    "url": "https://www.theguardian.com/world/live/2025/dec/05/vladimir-putin-narendra-modi-russia-india-us-ukraine-trade-latest-news-updates",
    "image": "https://media.guim.co.uk/24e3e7d7183b129830791c3006f3584bd08272ae/2829_1003_3280_2624/500.jpg",
    "summary": "Two leaders are set to engage in defense and trade discussions on Friday amid the ongoing Ukraine conflict. The U.S. has imposed tariffs on India due to its continued imports of Russian oil. These talks come at a crucial time as global geopolitical tensions rise.",
    "published": "2025-12-05T08:20:41Z"
  }
]