[
  {
    "title": "Charlie Kirk murder suspect told he faces death penalty if convicted in first appearance – live updates",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/16/donald-trump-new-york-times-defamation-charlie-kirk-vance-miller-news-updates-us-politics-live",
    "image": "https://media.guim.co.uk/f191746068588b95ee79d7f4a12e989b5a818f17/591_0_6148_4919/500.jpg",
    "summary": "Tyler Robinson appeared virtually in court facing seven charges, including aggravated murder. His next court date is scheduled for September 29. Further legal proceedings will follow based on the upcoming hearing.",
    "published": "2025-09-16T22:14:35Z"
  },
  {
    "title": "Australia news live: Liberal shadow minister calls net zero target a ‘distraction’ and denies row is destabilising Ley",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/17/australia-news-live-liberal-sussan-ley-net-zero-target-climate-crisis-anthony-albanese-donald-trump-trade-tariffs-politics-ntwnfb",
    "image": "https://media.guim.co.uk/8f6ca252d61478f74004cbb08343dbfc773ec11d/363_160_2457_1966/500.jpg",
    "summary": "I'm sorry, but I need more context or specific details about the news article you're referring to in order to provide a summary. Please provide the main points or a brief overview.",
    "published": "2025-09-16T22:12:20Z"
  },
  {
    "title": "Utah prosecutors’ evidence indicates suspected motives of Charlie Kirk’s alleged shooter",
    "url": "https://www.theguardian.com/us-news/2025/sep/16/charlie-kirk-suspect-texts-evidence",
    "image": "https://media.guim.co.uk/cf1f85c8585a81d5b2fea5929ede57bc3b907fed/320_0_3196_2557/500.jpg",
    "summary": "Tyler Robinson expresses frustration to his partner in text messages about the persistent hatred exhibited by a far-right activist. He emphasizes the need to distance themselves from such negativity. The conversation reflects growing concerns over the impact of extremist views on their lives.",
    "published": "2025-09-16T22:11:29Z"
  },
  {
    "title": "Texts, plans and a confession: prosecutor lays out startling details in Charlie Kirk shooting",
    "url": "https://www.theguardian.com/us-news/2025/sep/16/charlie-kirk-shooting-prosecutor-utah",
    "image": "https://media.guim.co.uk/4d8025c31090f99220684c160276f4350c452ace/371_0_5553_4443/500.jpg",
    "summary": "Jeffrey Gray referred to Kirk's death as an \"American tragedy.\" Gray revealed that the murder suspect had pleaded with a friend to remain silent about the incident. The statement highlights the gravity of the situation and potential implications regarding the investigation.",
    "published": "2025-09-16T22:05:42Z"
  },
  {
    "title": "Daily weight loss pill can help cut body weight by a fifth, trial shows",
    "url": "https://www.theguardian.com/society/2025/sep/16/daily-weight-loss-pill-orforglipron-cut-body-weight-by-a-fifth",
    "image": "https://media.guim.co.uk/a3714fb8e364f6b3cf8d1ba50c6c980d18f86bad/427_0_4253_3404/500.jpg",
    "summary": "Eli Lilly reports that one in five participants using orforglipron daily for 72 weeks achieved a weight loss of 20% or more. This new drug shows promise in obesity treatment. The findings highlight orforglipron's potential effectiveness for those seeking significant weight reduction.",
    "published": "2025-09-16T22:01:17Z"
  }
]