[
  {
    "title": "First closure of US government since 2018 begins after funding bill fails – as it happened",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/30/us-government-shutdown-funding-trump-vance-portland-hegseth-latest-updates",
    "image": "https://media.guim.co.uk/f1df06e9e9b4a4893f80093c8cb695c9adec448f/249_0_3713_2970/500.jpg",
    "summary": "The Senate rejected competing bills amid accusations of partisan politics from both Republicans and Democrats. This highlights the ongoing divisions within Congress, preventing progress on key legislation. The failure to pass the bills reflects the broader challenges of bipartisan cooperation.",
    "published": "2025-10-01T06:29:50Z"
  },
  {
    "title": "New Zealand v Australia: men’s first T20 international cricket – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/01/mens-t20-international-cricket-live-new-zealand-v-australia",
    "image": "https://media.guim.co.uk/79e2147c7d684ee8c970af76d8b433d93b6bb5c7/1124_81_4539_3631/500.jpg",
    "summary": "Australia is set to face New Zealand in a three-match Twenty20 series at Bay Oval in Tauranga. Angus Fontaine will provide live updates on the matches. Fans can look forward to exciting cricket action between the two teams.",
    "published": "2025-10-01T06:29:35Z"
  },
  {
    "title": "UK house prices return to growth; US dollar hits one-week low as government shutdown begins – business live",
    "url": "https://www.theguardian.com/business/live/2025/oct/01/uk-house-prices-return-to-growth-us-dollar-shutdown-manufacturing-growth-business-live-news",
    "image": "https://media.guim.co.uk/b539ff8e5597f3088eacdb32cb8581f8ae62cdb3/61_0_2574_2060/500.jpg",
    "summary": "The latest economic and financial news highlights key developments impacting global markets, including fluctuations in stock indices, changes in commodity prices, and updates on central bank policies. Analysts are closely monitoring inflation trends and employment rates as indicators of economic stability. Market reactions reflect investor sentiment amid geopolitical tensions and ongoing recovery from the pandemic.",
    "published": "2025-10-01T06:29:20Z"
  },
  {
    "title": "Australia news live: Kamala Harris to speak at Australian women’s leadership summit next year",
    "url": "https://www.theguardian.com/australia-news/live/2025/oct/01/australia-news-live-nicole-kidman-divorce-keith-urban-sussan-ley-coalition-andrew-hastie-anthony-albanese-housing-ntwnfb",
    "image": "https://media.guim.co.uk/733add278c3ad81a7447670a5c4a03f0de493fff/585_0_6388_5111/500.jpg",
    "summary": "I'm sorry, but I need more context or information about the specific news you would like summarized. Please provide the details or content of the news article.",
    "published": "2025-10-01T06:26:41Z"
  },
  {
    "title": "Death of an Ordinary Man by Sarah Perry review – a brilliant meditation on mortality",
    "url": "https://www.theguardian.com/books/2025/oct/01/death-of-an-ordinary-man-by-sarah-perry-review-a-brilliant-meditation-on-mortality",
    "image": "https://media.guim.co.uk/11ae25b61f0c62482eeaa15f82c9487a110598f5/1152_309_6850_5480/500.jpg",
    "summary": "The author of \"The Essex Serpent\" shares a poignant reflection on her father-in-law's battle with illness, highlighting the emotional complexities of caregiving and loss. Her account captures universal themes of grief and connection, resonating with many who have faced similar situations. This intimate narrative offers comfort and understanding to readers navigating their own experiences with illness and death.",
    "published": "2025-10-01T06:01:03Z"
  }
]