[
  {
    "title": "Israel carrying out crime against humanity in Gaza, Palestinian president Mahmoud Abbas tells UN – Middle East crisis live",
    "url": "https://www.theguardian.com/world/live/2025/sep/25/palestinian-authority-mahmoud-abbas-unga-israel-gaza-us-yemen-middle-east-crisis-live-news-updates",
    "image": "https://media.guim.co.uk/c989c22ba0bb5114dc4b19e97ff80a6d3c5223a7/263_0_3333_2667/500.jpg",
    "summary": "In a recent speech, Palestinian Authority President Mahmoud Abbas stated that Hamas should not participate in governance in Palestine and needs to disarm. He emphasized the importance of unity and a peaceful resolution to the ongoing conflict. Abbas's remarks highlight ongoing tensions between the Palestinian factions regarding leadership and responsibility.",
    "published": "2025-09-25T15:20:10Z"
  },
  {
    "title": "Netanyahu flies circuitous route to UN summit ‘to avoid arrest’ in Europe",
    "url": "https://www.theguardian.com/world/2025/sep/25/netanyahu-flies-circuitous-route-to-un-summit-amid-reporarrest-fears",
    "image": "https://media.guim.co.uk/a3bff496ecdee8636843b2dfc45c1d494c116d50/9_0_1065_852/500.jpg",
    "summary": "The Wing of Zion, a vessel, has been reported sailing along the Mediterranean Sea, with tracking data highlighting its movements. This activity occurs in the context of an International Criminal Court (ICC) arrest warrant. The situation raises concerns regarding the vessel's purpose and legality.",
    "published": "2025-09-25T15:17:44Z"
  },
  {
    "title": "Nottinghamshire close on title against Warwickshire: county cricket final round – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/25/nottinghamshire-close-on-title-against-warwickshire-county-cricket-final-round-live",
    "image": "https://media.guim.co.uk/5466c8b88709b0d9bd7c1c0ba55e932878f4e1b4/506_0_2410_1929/500.jpg",
    "summary": "Tanya Aldred will provide updates on the final round of County Championship matches this season. Fans can expect comprehensive coverage from various cricket grounds. Stay tuned for the latest highlights and scores.",
    "published": "2025-09-25T15:17:39Z"
  },
  {
    "title": "Burnham claims he is ‘completely committed’ to his mayoral job as poll says Labour would overtake Reform UK under his leadership - UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/25/andy-burnham-steve-reed-keir-starmer-labour-news-updates-uk-politics-live",
    "image": "https://media.guim.co.uk/3d33381f6da48c2fca3926a72dc63bcfa12e069b/629_0_4303_3442/500.jpg",
    "summary": "Burnham expresses his enthusiasm for his role, stating he loves \"everything about this job.\" He pledges to support the Labour party in any way possible. His commitment reflects his dedication to the party and its goals.",
    "published": "2025-09-25T15:14:28Z"
  },
  {
    "title": "Starmer’s head of communications Steph Driver quits in latest No 10 exit",
    "url": "https://www.theguardian.com/politics/2025/sep/25/starmers-head-of-communications-steph-driver-quits-in-latest-no-10-exit",
    "image": "https://media.guim.co.uk/f52c634cf44be2a425af9e232c4495c3d8070096/197_0_1845_1476/500.jpg",
    "summary": "A key figure has left their position, just over a week after the director of political strategy resigned. This departure raises concerns about stability within the organization. The implications of these losses are still unfolding.",
    "published": "2025-09-25T15:10:09Z"
  }
]