[
  {
    "title": "Leeds v West Ham: Premier League – live updates",
    "url": "https://www.theguardian.com/football/live/2025/oct/24/leeds-v-west-ham-premier-league-live-updates",
    "image": "https://media.guim.co.uk/f62a28fe698e9b2704e93c52e0663a4437320dbd/236_0_4009_3208/500.jpg",
    "summary": "Two struggling teams are set to clash at Elland Road, aiming for much-needed victories. John Brewin provides a minute-by-minute report on the match. Fans will be eager to see which side emerges victorious.",
    "published": "2025-10-24T19:15:46Z"
  },
  {
    "title": "I tried everything to get better sleep. These five items actually helped ",
    "url": "https://www.theguardian.com/thefilter-us/2025/oct/24/sleep-gadgets-aids-tech",
    "image": "https://media.guim.co.uk/8a08358ff6ca978dd359408a876a1399a7a483c1/1_0_2999_2400/500.jpg",
    "summary": "In an effort to achieve better sleep, I tested various popular apps, earplugs, and a pillow speaker. This experimentation aimed to uncover effective solutions for improving rest. The results may provide insights into enhancing sleep quality.",
    "published": "2025-10-24T19:15:13Z"
  },
  {
    "title": "Save the entire 1987 QPR squad to the cloud: my mental Rolodex is too full of past players | Max Rushden",
    "url": "https://www.theguardian.com/football/2025/oct/24/save-the-entire-1987-qpr-squad-to-the-cloud-my-mental-rolodex-is-too-full-of-past-players",
    "image": "https://media.guim.co.uk/450dd732ad6c7f85daffae78b8b21cf5b9c1a1af/0_0_5000_3999/500.jpg",
    "summary": "Eli Kroupi and Loum Tchaouna scored impressive goals, capturing attention and overshadowing Ian Juryeff. Their standout performances are making a significant impact. The excitement surrounding their talents is growing.",
    "published": "2025-10-24T19:14:35Z"
  },
  {
    "title": "East Wing of White House reduced to rubble as part of Trump’s ballroom construction",
    "url": "https://www.theguardian.com/us-news/2025/oct/24/white-house-demolition-east-wing-trump-ballroom",
    "image": "https://media.guim.co.uk/528c2d2d111515f19ce1d61c523e7150f87fa56f/235_0_1120_897/500.jpg",
    "summary": "The eastern section of a building, despite a presidential promise to protect it, has been completely destroyed. This development raises concerns about the government's commitment to preservation efforts. The incident highlights the ongoing challenges in safeguarding historical structures.",
    "published": "2025-10-24T19:13:13Z"
  },
  {
    "title": "Ontario premier pauses ad criticizing Trump tariffs as US-Canada trade talks remain in limbo – live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/24/donald-trump-trade-negotiations-canada-mark-carney-terminated-tariff-letitia-james-new-york-us-politics-live-news",
    "image": "https://media.guim.co.uk/b8c07a77aa2c17ba4dc567413d2b3cc4055ff747/667_0_3333_2667/500.jpg",
    "summary": "The Ontario government created an advertisement featuring a 1987 speech by Ronald Reagan opposing tariffs. This comes as Canadian Prime Minister expresses a desire to advance trade negotiations. The ad aims to influence public opinion on international trade issues.",
    "published": "2025-10-24T19:12:53Z"
  }
]