[
  {
    "title": "Surrey v Nottinghamshire, Sussex v Yorkshire, and more: county cricket, day one – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/15/surrey-v-nottinghamshire-sussex-v-yorkshire-and-more-county-cricket-day-one-live",
    "image": "https://media.guim.co.uk/027cb4b2165737228df1f412442457907b2fa7e3/0_0_4518_3616/500.jpg",
    "summary": "Tanya Aldred will provide updates on the ongoing County Championship fixtures from the Oval. Stay tuned for the latest developments and insights. Don't miss her coverage of this exciting round of matches!",
    "published": "2025-09-15T17:29:03Z"
  },
  {
    "title": "Trump aide vows to ‘dismantle and destroy’ what he claims is a ‘domestic terror movement’ after Charlie Kirk killing – live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/15/donald-trump-politics-washington-dc-national-emergency-ice-charlie-kirk-live-news-updates",
    "image": "https://media.guim.co.uk/9ad89d5d441f5983456995a7dfc4fd8b38c2e6fd/720_0_7200_5760/500.jpg",
    "summary": "Stephen Miller appeared on JD Vance's podcast, discussing the death of a rightwing activist. He expressed intentions of retribution against those responsible. The conversation highlights the escalating tensions and activism within rightwing circles.",
    "published": "2025-09-15T17:28:51Z"
  },
  {
    "title": "Danny Kruger takes Reform back to full strength – so who’ll be next to quit? | John Crace",
    "url": "https://www.theguardian.com/politics/2025/sep/15/danny-kruger-takes-reform-back-to-full-strength-so-wholl-be-next-to-quit",
    "image": "https://media.guim.co.uk/e1225c2a52da7824f5efcd0ce26090e745a63d21/1591_1732_2776_2220/500.jpg",
    "summary": "Nigel's gang is implementing a 'one in, one out' policy after losing two MPs since the election. The focus now shifts to which member will be the next to leave. Tensions are rising as speculation surrounds future departures.",
    "published": "2025-09-15T17:26:53Z"
  },
  {
    "title": "Election deniers now hold posts on local US election boards, raising concerns for midterms",
    "url": "https://www.theguardian.com/us-news/2025/sep/15/election-deniers-midterms-board-offices",
    "image": "https://media.guim.co.uk/ebf58a51e7af0fef89c103d9f0d8e95a1a42a1d6/417_0_4165_3333/500.jpg",
    "summary": "Election integrity activists are increasingly securing positions of influence, prompting concerns about possible partisan interference in the electoral process. Their growing presence in power could lead to biased oversight and challenges to fair voting practices. Critics warn that this trend may undermine public trust in election outcomes.",
    "published": "2025-09-15T17:25:26Z"
  },
  {
    "title": "US and China reach deal to transfer TikTok ownership, trade official says",
    "url": "https://www.theguardian.com/technology/2025/sep/15/trump-china-tiktok-sale-ban",
    "image": "https://media.guim.co.uk/f521f5b5ad50549d991f496b9dbbe74915c60395/229_0_3333_2667/500.jpg",
    "summary": "A framework agreement has been reached to address the long-standing dispute regarding TikTok's ownership in response to security concerns raised by Washington. This development marks a significant step forward in negotiations over the app's future. Ongoing discussions will determine the specifics of the agreement and its implications.",
    "published": "2025-09-15T17:23:05Z"
  }
]