[
  {
    "title": "‘I lost a friend of almost 40 years’: Nancy Meyers pays tribute to Diane Keaton",
    "url": "https://www.theguardian.com/film/2025/oct/14/nancy-meyers-director-tribute-diane-keaton",
    "image": "https://media.guim.co.uk/ee4fc75a4353ca1625316e676868ffcd21133124/166_0_2301_1841/500.jpg",
    "summary": "A notable film-maker, who directed Diane Keaton in \"Something's Gotta Give\" and wrote \"Baby Boom\" and \"Father of the Bride,\" expressed deep sorrow over the loss of a significant figure in the industry, stating, \"we have lost a giant.\" The remark highlights the impact and legacy of the individual who has passed away. This loss is felt profoundly within the film community.",
    "published": "2025-10-13T23:12:02Z"
  },
  {
    "title": "Australia news live: record year for EV sales with Tesla and BYD dominating; hiker still missing in Tasmania",
    "url": "https://www.theguardian.com/australia-news/live/2025/oct/14/australia-news-live-jim-chalmers-superannuation-concession-tax-cybercrime-anthony-albanese-sussan-ley-coalition-penny-wong-israel-gaza-ntwnfb",
    "image": "https://media.guim.co.uk/8d519bd029f5e2e5ef801d15a1cae22f7e20fcf4/500_0_5000_4000/500.jpg",
    "summary": "I'm sorry, but I can't summarize content without further information. Could you please provide the news you would like summarized?",
    "published": "2025-10-13T23:10:38Z"
  },
  {
    "title": "UK retail sales growth cools amid fears over budget tax rises",
    "url": "https://www.theguardian.com/business/2025/oct/14/uk-retail-sales-growth-budget-tax-rises-barclays",
    "image": "https://media.guim.co.uk/d1deb77da0186897fd4fb7e133c4c9241ab14824/645_0_3354_2685/500.jpg",
    "summary": "Inflation is impacting sales, according to an industry body, highlighting economic challenges. Barclays reported a decline in credit card spending in September, indicating consumer caution. This trend raises concerns about overall economic activity amid rising prices.",
    "published": "2025-10-13T23:02:03Z"
  },
  {
    "title": "Dementia risk for people who quit smoking in middle age ‘same as someone who never smoked’",
    "url": "https://www.theguardian.com/society/2025/oct/14/dementia-risk-for-people-who-quit-smoking-in-middle-age-same-as-someone-who-never-smoked",
    "image": "https://media.guim.co.uk/0b6ac1e4751b5e9d4949368ff5f753b24ae71f0a/453_0_4310_3449/500.jpg",
    "summary": "Recent research indicates that quitting smoking can significantly improve cognitive health by reducing the rate of decline in verbal fluency by 50% and slowing memory loss by 20%. These findings underscore the potential cognitive benefits of cessation efforts. Overall, the study emphasizes the importance of quitting smoking for better mental functioning.",
    "published": "2025-10-13T23:01:05Z"
  },
  {
    "title": "Blair’s former policy chief Matthew Taylor to lead Fair Work Agency",
    "url": "https://www.theguardian.com/business/2025/oct/14/matthew-taylor-fair-work-agency-watchdog-workers-rights",
    "image": "https://media.guim.co.uk/7e3eda6e5deefda9feab9bea4f3e2f6ab24b6bdb/480_0_4800_3840/500.jpg",
    "summary": "The author of a significant report on the gig economy has expressed optimism that a newly established watchdog can effectively improve workers' rights. This initiative aims to address ongoing concerns about the treatment and protections of gig workers. The watchdog's formation is seen as a crucial step towards enhancing labor standards in this sector.",
    "published": "2025-10-13T23:01:04Z"
  }
]