[
  {
    "title": "US government shutdown: Speaker rejects blame over military pay and says Senate Democrats must ‘turn lights back on’– live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/10/letitia-james-donald-trump-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/77b1dcbc0eea00f87bbb1006c164082903e1789a/936_0_4631_3708/500.jpg",
    "summary": "Mike Johnson argues that a separate bill to fund the military during a government shutdown is unnecessary, labeling it as \"redundant.\" Meanwhile, Republicans continue to direct blame towards Democrats for the impending shutdown. This standoff highlights ongoing partisan tensions over government funding.",
    "published": "2025-10-10T15:17:20Z"
  },
  {
    "title": "Britons travelling to EU to undergo new biometric checks at border from Sunday",
    "url": "https://www.theguardian.com/world/2025/oct/10/britons-travelling-eu-undergo-new-biometric-checks-border",
    "image": "https://media.guim.co.uk/3eb57cab0e8775241f14f35b6fd0389f85da9b29/1362_0_6830_5464/500.jpg",
    "summary": "Non-EU nationals entering the Schengen area will now be required to provide their photo and fingerprints as part of a new entry-exit system. This measure aims to enhance border security and facilitate tracking of travelers. The system is designed to streamline processes and improve overall immigration management.",
    "published": "2025-10-10T15:13:27Z"
  },
  {
    "title": "Venezuelan politician María Corina Machado wins Nobel peace prize",
    "url": "https://www.theguardian.com/world/2025/oct/10/venezuelan-politician-maria-corina-machado-wins-nobel-peace-prize",
    "image": "https://media.guim.co.uk/ba7f9656b4f477fad57a303c1cee53441417724e/312_0_3333_2667/500.jpg",
    "summary": "An opponent of the Maduro regime has been awarded for their efforts in promoting democracy in Venezuela. The recognition highlights their resilience and commitment to opposing authoritarianism amidst challenging circumstances. The accolade underscores the ongoing struggle for democratic values in the region.",
    "published": "2025-10-10T14:59:33Z"
  },
  {
    "title": "It’s Sam Altman: the man who stole the rights from copyright. If he’s the future, can we go backwards? | Marina Hyde",
    "url": "https://www.theguardian.com/commentisfree/2025/oct/10/sam-altman-copyright-ai-sora-2-video-generator",
    "image": "https://media.guim.co.uk/fbbbeb830b529abb7d05e856d724a65d9dfcc211/189_0_4560_3648/500.jpg",
    "summary": "Marina Hyde criticizes the AI video generator Sora 2, developed by Sam, for allegedly appropriating the work of others. While it marks a significant advancement for Sam, the overall impact is viewed as negative for the broader community. The Guardian columnist suggests that this development raises concerns about originality and ethical use in AI technologies.",
    "published": "2025-10-10T14:55:43Z"
  },
  {
    "title": "Seven people killed after twin earthquakes off coast of Philippines",
    "url": "https://www.theguardian.com/world/2025/oct/10/tsunami-warning-philippines-indonesia-earthquake-mindanao",
    "image": "https://media.guim.co.uk/00e8c5188801c2c2fad322b71927789ecbbd2862/216_0_2150_1721/500.jpg",
    "summary": "Two significant earthquakes, measuring 7.4 and 6.8 in magnitude, prompted tsunami alerts for coastal areas. Residents in these regions have been advised to evacuate for their safety. Authorities are closely monitoring the situation to assess any potential tsunami impact.",
    "published": "2025-10-10T14:53:35Z"
  }
]