[
  {
    "title": "Mikel Arteta ‘extremely surprised’ by criticism of Arsenal tactics against City",
    "url": "https://www.theguardian.com/football/2025/sep/23/arsenal-blow-as-noni-madueke-is-ruled-out-for-two-months-with-knee-injury",
    "image": "https://media.guim.co.uk/ad3aa3b7ee42899a4ea44992cfa3b5492dac929d/353_0_2907_2325/500.jpg",
    "summary": "Mikel Arteta expressed surprise at the negative response following Arsenal's 1-1 draw with Manchester City. He highlighted the team's 'dominance' in possession during the match. Arteta emphasized that he expected a more positive reaction given their performance.",
    "published": "2025-09-23T17:26:03Z"
  },
  {
    "title": "European return can inspire Nottingham Forest to success, says Postecoglou",
    "url": "https://www.theguardian.com/football/2025/sep/23/nottingham-forest-ange-postecoglou-europa-league-real-betis",
    "image": "https://media.guim.co.uk/f1a38e0c347ff037b3e2ad070ffc897734d7dba2/367_60_3266_2612/500.jpg",
    "summary": "Before the Europa League match against Real Betis, Nottingham Forest's head coach encouraged the team by stating that dreaming can lead to achieving their highest ambitions. His words aim to inspire players to strive for success on the European stage. The match is seen as an opportunity to showcase their potential.",
    "published": "2025-09-23T17:20:38Z"
  },
  {
    "title": "Lincoln v Chelsea, Liverpool v Southampton, and more: Carabao Cup – live",
    "url": "https://www.theguardian.com/football/live/2025/sep/23/lincoln-v-chelsea-liverpool-v-southampton-and-more-carabao-cup-live",
    "image": "https://media.guim.co.uk/a1c444a76b61cbad2a09a233ff7599f7a6432698/453_0_2794_2235/500.jpg",
    "summary": "Rob Smyth will provide updates on the latest action as Premier League teams compete in the third round of the League Cup. This round marks the entry of more top-tier teams into the tournament. Stay tuned for live updates and insights.",
    "published": "2025-09-23T17:20:01Z"
  },
  {
    "title": "‘Your countries are going to hell’: Trump attacks European leaders and United Nations in fiery general assembly speech – live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/23/donald-trump-unga-autism-tylenol-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/8492a88781224927efab8d602f08446ae3cca6f4/1031_0_3066_2454/500.jpg",
    "summary": "US President Trump criticized the United Nations for its inadequate efforts in facilitating peace deals. He also criticized European nations for their stance on migration and called out US allies for supporting Palestinian statehood. His remarks highlighted his dissatisfaction with both international bodies and allies on several key issues.",
    "published": "2025-09-23T17:13:03Z"
  },
  {
    "title": "Noel Clarke ordered to pay initial £3m in legal costs to the Guardian after losing libel case",
    "url": "https://www.theguardian.com/culture/2025/sep/23/noel-clarke-ordered-to-pay-initial-3m-in-legal-costs-to-the-guardian-after-losing-libel-case",
    "image": "https://media.guim.co.uk/0ee3ceaf1bba342f7e698961b36d821eea6c0732/316_0_2000_1600/500.jpg",
    "summary": "Mrs. Justice Steyn criticized the former Doctor Who actor for his role in escalating the scale and costs of the ongoing litigation. She emphasized that he must take responsibility for these developments. The ruling highlights the consequences of his actions on the legal proceedings.",
    "published": "2025-09-23T17:11:24Z"
  }
]