[
  {
    "title": "‘Leave now,’ Netanyahu tells Gaza City residents as he says Israeli forces readying for ground ‘manoeuvre’ – Middle East crisis live",
    "url": "https://www.theguardian.com/world/live/2025/sep/08/middle-east-crisis-live-jerusalem-shooting-israel-threatens-gaza-city-powerful-hurricane-latest-news",
    "image": "https://media.guim.co.uk/694e2904ced8a9df937a5ffbd3a7cebecfe7e279/594_0_5099_4079/500.jpg",
    "summary": "Israeli Prime Minister addressed residents of a heavily affected city, emphasizing that they had received prior warnings about impending dangers. His statement comes amidst ongoing conflict and heightened tensions in the region. The warning highlights the government's stance on the situation and the need for citizens to heed safety measures.",
    "published": "2025-09-08T17:32:23Z"
  },
  {
    "title": "New home secretary Shabana Mahmood says she will not run for deputy leader after Labour accused of ‘stitch-up’ over contest – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/08/labour-deputy-leadership-election-contest-keir-starmer-angela-rayner-uk-politics-live",
    "image": "https://media.guim.co.uk/b52ec3a17d28ede6f33f0e69669c9e5a98245ef3/448_0_1951_1560/500.jpg",
    "summary": "An MP has called for police to concentrate on actual members of a specific group rather than individuals who merely express support for it. The MP argues that distinguishing between active members and supporters is crucial for effective policing. This highlights ongoing debates about law enforcement and freedom of expression.",
    "published": "2025-09-08T17:26:55Z"
  },
  {
    "title": "Europe live: French PM loses confidence vote and will tender resignation amid political crisis",
    "url": "https://www.theguardian.com/world/live/2025/sep/08/europe-live-macron-france-prime-minister-francois-bayrou-confidence-vote-latest-news",
    "image": "https://media.guim.co.uk/27d25520fffb3884efcb6e72485f947141dc0929/132_0_5380_4304/500.jpg",
    "summary": "Over 350 French lawmakers opposed François Bayrou, highlighting significant political dissent within the legislative body. The vote reflects ongoing tensions and disagreements regarding Bayrou's role or policies. The outcome may impact future legislative initiatives and governmental relations in France.",
    "published": "2025-09-08T17:25:20Z"
  },
  {
    "title": "US supreme court backs Trump on aggressive immigration raids – live updates",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/08/donald-trump-immigration-hyundai-tariffs-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/176e8758304c8d935223d4f6e1714433ce3bec83/683_0_6827_5464/500.jpg",
    "summary": "A court has granted federal agents permission to conduct deportation raids in Southern California, specifically targeting individuals based on their race or language. This decision has raised concerns about racial profiling and discrimination. Advocates fear the impacts on communities, emphasizing potential violations of civil rights.",
    "published": "2025-09-08T17:23:07Z"
  },
  {
    "title": "EU and US officials meet as Trump says he is ready to impose further sanctions on Russia",
    "url": "https://www.theguardian.com/world/2025/sep/08/eu-and-us-officials-meet-as-trump-says-he-is-ready-to-impose-further-sanctions-on-russia",
    "image": "https://media.guim.co.uk/5b729d29b819c0a3028a8525c083f1daf254ce22/678_0_4060_3248/500.jpg",
    "summary": "Europe and the US are contemplating additional measures to weaken Russia following a significant air assault on Ukraine, which was reported as the largest to date. This renewed aggression has spurred discussions among Western allies on potential responses. The situation underscores ongoing tensions and the need for a coordinated strategy to support Ukraine.",
    "published": "2025-09-08T17:21:17Z"
  }
]