[
  {
    "title": "Trump arrives at Chequers for talks with Starmer on final day of state visit – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/18/donald-trump-state-visit-uk-keir-starmer-labour-politics-latest-news",
    "image": "https://media.guim.co.uk/6a000c90eb1b1f6815b7289da877d5730e554344/562_0_4751_3801/500.jpg",
    "summary": "The US president is set to meet with UK opposition leader Keir Starmer before attending a business event. Following these engagements, he will participate in a joint news conference with the Prime Minister. The discussions likely focus on strengthening US-UK relations.",
    "published": "2025-09-18T10:37:37Z"
  },
  {
    "title": "World Athletics Championships 2025: 400m finals, 200m semis and more – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/18/world-athletics-championships-2025-400m-finals-200m-semis-and-more-live",
    "image": "https://media.guim.co.uk/5bc50f4869362529f6ec0118fe8bd4e4a65097ab/61_0_5616_4493/500.jpg",
    "summary": "Daniel Harris provides updates from night six in Tokyo, highlighting the competitive events in the men’s and women’s 400m races. Medals in these events are eagerly anticipated. Stay tuned for key results and developments.",
    "published": "2025-09-18T10:36:51Z"
  },
  {
    "title": "Trump celebrates Jimmy Kimmel suspension as some networks replace show with Charlie Kirk tribute – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/18/jimmy-kimmel-charlie-kirk-comments-show-cancelled-suspended-monologue-trump-us-politics-live",
    "image": "https://media.guim.co.uk/2d731b09c5ef58a420c26fcedc65713f29b77eb9/578_0_1106_886/500.jpg",
    "summary": "Jamie Lee Curtis and Ben Stiller have joined the protest against the indefinite removal of \"Jimmy Kimmel Live!\" The Senate Democratic leader believes the suspension should be challenged in court. The controversy highlights concerns about censorship in late-night television.",
    "published": "2025-09-18T10:34:36Z"
  },
  {
    "title": "Jimmy Kimmel Live! suspended over Charlie Kirk comments after US government pressure",
    "url": "https://www.theguardian.com/tv-and-radio/2025/sep/18/jimmy-kimmel-live-suspended-indefinitely-after-hosts-charlie-kirk-comments",
    "image": "https://media.guim.co.uk/c59ce8dcee3435114a7df77702a881a3851ace5e/447_0_1197_958/500.jpg",
    "summary": "The removal of a late-night show has been criticized as a tactic used by the Trump administration to suppress critical voices in media, academia, and business. Critics argue that this move is part of a broader pattern of censorship. The decision raises concerns about freedom of expression and the diversity of perspectives in public discourse.",
    "published": "2025-09-18T10:32:59Z"
  },
  {
    "title": "Bank of England expected to leave UK interest rates on hold and slow bond-selling QT programme – business live",
    "url": "https://www.theguardian.com/business/live/2025/sep/18/bank-of-england-uk-interest-rates-bond-selling-qt-programme-andrew-bailey-business-live",
    "image": "https://media.guim.co.uk/1569d81fc094ab2948d99c38fcb53b3898d72b72/610_0_4591_3674/500.jpg",
    "summary": "Rolling coverage provides ongoing updates on the latest developments in the economy and financial markets. It focuses on key events, trends, and insights that impact economic performance and investor sentiment. The coverage aims to keep readers informed of significant changes and emerging issues in the financial landscape.",
    "published": "2025-09-18T10:30:21Z"
  }
]