[
  {
    "title": "Australia news live: Minns considered scrapping Metro station over $2bn cost blowout; Victorian Liberals struggle to find election candidates",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/30/australia-news-live-albanese-supermarket-united-arab-emirates-uae-coalition-sussan-ley-andrew-hastie-reserve-bank-rba-chalmers-interest-rates-decision-ntwnfb",
    "image": "https://media.guim.co.uk/1e5a83d22485fdfaec2a60829efac80532a7a5f5/158_399_6382_5105/500.jpg",
    "summary": "I'm sorry, but I need more context or specific details about the news you'd like me to summarize. Please provide the information or topic you want summarized!",
    "published": "2025-09-30T02:56:57Z"
  },
  {
    "title": "Judge in strip search class action awards woman $93,000 after she was illegally searched by NSW police",
    "url": "https://www.theguardian.com/australia-news/2025/sep/30/strip-search-class-action-raya-meredith-searches-nsw-police-update-music-festival",
    "image": "https://media.guim.co.uk/380c21b4dfca5def9b091578bfc75db1b03e3d9a/19_0_2341_1873/500.jpg",
    "summary": "Police have acknowledged that they unlawfully strip-searched Raya Meredith at the Splendour in the Grass festival in 2018. They also removed all witnesses before the court hearing related to the incident. This admission raises serious concerns about police conduct and accountability.",
    "published": "2025-09-30T02:54:15Z"
  },
  {
    "title": "Dolphins beat sloppy Jets but Tyreek Hill sustains feared season-ending injury",
    "url": "https://www.theguardian.com/sport/2025/sep/29/nfl-monday-night-football-jets-dolphins-bengals-broncos",
    "image": "https://media.guim.co.uk/e80a3e02db9acea8ce2aceb356f6e2e3be7a470a/861_130_1563_1250/500.jpg",
    "summary": "Miami's Darren Waller marked his return to the NFL after almost two years with two touchdown catches. Despite his impressive performance, the Dolphins secured their first win of the season overshadowed by injuries. The game highlighted both a standout moment for Waller and concerns for the team's health moving forward.",
    "published": "2025-09-30T02:53:50Z"
  },
  {
    "title": "‘There is hope’: Australia welcomes Trump’s 20-point peace plan for Gaza",
    "url": "https://www.theguardian.com/world/2025/sep/30/australia-welcomes-trump-20-point-peace-plan-gaza-there-is-hope",
    "image": "https://media.guim.co.uk/51fcaf1ce8a25554c99ad33a45fdc9ca92c12498/375_0_3751_3001/500.jpg",
    "summary": "Australian Defense Minister Richard Marles expressed support for a plan announced by US President Biden and Israeli Prime Minister Benjamin Netanyahu, stating it \"keeps the door open\" for a two-state solution. The initiative aims to address ongoing tensions in the region. Marles emphasized the importance of diplomatic efforts for lasting peace.",
    "published": "2025-09-30T02:39:11Z"
  },
  {
    "title": "Optus boss ‘has a lot of work to do’, Anika Wells says after meeting telco and Singtel in wake of triple-zero outages",
    "url": "https://www.theguardian.com/business/2025/sep/30/optus-triple-zero-outages-anika-wells-meeting-singtel-lot-of-work-to-do",
    "image": "https://media.guim.co.uk/921c3592b6caef8b983294374ef352e528417993/561_0_6827_5464/500.jpg",
    "summary": "The Minister has urged the parent company of the emergency call service to appoint an external reviewer. This move aims to restore public confidence in the effectiveness and reliability of emergency calls. The initiative follows concerns about the performance of the service in Australia.",
    "published": "2025-09-30T02:10:43Z"
  }
]