[
  {
    "title": "Australia news live: Ley says she is not worried about a Hastie leadership tilt; several arrested after pursuit in Melbourne’s CBD",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/29/australia-news-live-optus-suffers-fresh-triple-zero-glitch-labors-first-deficit-not-as-bad-as-feared",
    "image": "https://media.guim.co.uk/6beeccb9a38d9f60531f4db8fb1389a863900215/628_0_5685_4548/500.jpg",
    "summary": "I'm sorry, but I need more context or specific content to summarize. Could you please provide the details or the news you'd like me to summarize?",
    "published": "2025-09-29T05:13:06Z"
  },
  {
    "title": "Sky News Australia program axed after airing anti-Islam guest wearing shirt covered in bacon",
    "url": "https://www.theguardian.com/media/2025/sep/29/sky-news-australia-program-axed-after-airing-anti-islam-guest-wearing-shirt-covered-in-bacon",
    "image": "https://media.guim.co.uk/887bff83c4cbb1fde25c3ee75cd03415140fee7e/110_27_829_663/500.jpg",
    "summary": "The night show \"Freya Fires Up\" has been canceled, but the presenter will continue to co-host another program. The decision comes as part of a broader programming change. Details on the new show have not been disclosed yet.",
    "published": "2025-09-29T05:01:58Z"
  },
  {
    "title": "‘I essentially taught myself GCSEs’: the enduring impact of missing school during Covid",
    "url": "https://www.theguardian.com/uk-news/2025/sep/29/covid-inquiry-impact-of-missing-school",
    "image": "https://media.guim.co.uk/52197375013358cc8fd2ee1a23ac22c3a721db99/532_234_3043_2434/500.jpg",
    "summary": "Lana Collie-James, at age 14, dedicated two years to staying home to care for her clinically vulnerable mother. Her commitment highlights the challenges faced by young caregivers during health crises. This experience has shaped her perspective on family responsibility and resilience.",
    "published": "2025-09-29T05:00:34Z"
  },
  {
    "title": "Starwatch: Sunlight and dust combine to create the soft glow of zodiacal light ",
    "url": "https://www.theguardian.com/science/2025/sep/29/starwatch-sunlight-dust-soft-glow-zodiacal-light",
    "image": "https://media.guim.co.uk/0c8a1c4deb0bbb8273961fd893e690b130dab79a/242_0_4436_3549/500.jpg",
    "summary": "Seek out the darkest location possible an hour before dawn twilight to witness a subtle celestial phenomenon. This event offers a unique opportunity for stargazers and astronomy enthusiasts. Optimal viewing conditions will enhance the experience of observing this remarkable twilight effect.",
    "published": "2025-09-29T05:00:34Z"
  },
  {
    "title": "More than 1m UK workers to gain more rights under employment bill, says thinktank",
    "url": "https://www.theguardian.com/uk-news/2025/sep/29/more-than-1m-uk-workers-to-gain-more-rights-under-employment-bill-says-thinktank",
    "image": "https://media.guim.co.uk/d24d85c3969b87cacef600c204999d8893a78fab/138_0_3078_2462/500.jpg",
    "summary": "The Work Foundation highlights that essential aspects of a new bill aim to enhance job security, despite significant opposition from businesses lobbying against the legislation. The proposed measures are seen as vital for protecting workers' rights in the face of economic challenges. The ongoing debate reflects divergent views on balancing worker security and business interests.",
    "published": "2025-09-29T05:00:33Z"
  }
]