[
  {
    "title": "Leeds v Aston Villa: Premier League – live",
    "url": "https://www.theguardian.com/football/live/2025/nov/23/leeds-v-aston-villa-premier-league-live",
    "image": "https://media.guim.co.uk/89682646177eea59813f683bf502f33e3ede25fd/284_132_3297_2637/500.jpg",
    "summary": "Leeds United aims to improve their position in the league standings, while Aston Villa seeks to break into the top five. Billy Munday provides updates on both teams' performances. The outcome remains uncertain as the competition heats up.",
    "published": "2025-11-23T14:17:13Z"
  },
  {
    "title": "Epstein survivor condemns Trump for calling file release fight a ‘hoax’",
    "url": "https://www.theguardian.com/us-news/2025/nov/23/epstein-survivor-condemns-trump",
    "image": "https://media.guim.co.uk/40bc2ecf1db08619060fb54ebafd1ff3bb395416/1556_1337_4203_3362/500.jpg",
    "summary": "Danielle Bensky, a survivor of Jeffrey Epstein's abuse, criticized the president for making comments she found \"incredibly disrespectful.\" She expressed her disappointment in his remarks relating to the abuse she endured. Bensky's statement highlights a broader concern regarding how victims are treated in public discourse.",
    "published": "2025-11-23T14:16:34Z"
  },
  {
    "title": "Sheffield United sink Wednesday thanks to Tyrese Campbell’s derby double",
    "url": "https://www.theguardian.com/football/2025/nov/23/sheffield-wednesday-sheffield-united-championship-match-report",
    "image": "https://media.guim.co.uk/fa674f18dd2e0fa098fd7b7a8deecf7431fe6957/789_0_3901_3123/500.jpg",
    "summary": "Tyrese Campbell scored early in both halves, and a late goal from Tom Cannon secured a 3-0 victory for United in the Sheffield derby against Wednesday. The win highlighted United's dominance throughout the match. The result adds to the competitive history of the local rivalry.",
    "published": "2025-11-23T14:11:07Z"
  },
  {
    "title": "Polish PM says it would be ‘good to know’ who wrote plan to end war in Ukraine, amid concerns over Moscow involvement – live",
    "url": "https://www.theguardian.com/world/live/2025/nov/23/ukrainian-us-emergency-talks-plan-war-russia-live",
    "image": "https://media.guim.co.uk/c82b9742a207341ec5c4ce1982ad3037ee8f2495/511_0_6651_5321/500.jpg",
    "summary": "Ukrainian President Zelenskyy emphasized the need for decisive actions against ongoing Russian aggression during emergency talks with US officials. He described the Russian attacks as \"wicked\" and called for strengthened support. The discussions highlight the urgent collaboration between Ukraine and the US amid the escalating conflict.",
    "published": "2025-11-23T14:10:49Z"
  },
  {
    "title": "Which old Christmas traditions should be revived?",
    "url": "https://www.theguardian.com/lifeandstyle/2025/nov/23/which-old-christmas-traditions-should-be-revived",
    "image": "https://media.guim.co.uk/cd72554a691af640916b80cdf797929796863ab0/220_0_2503_2003/500.jpg",
    "summary": "A popular series invites readers to engage by answering each other's questions on diverse topics, from whimsical curiosities to deep scientific and philosophical inquiries. The format encourages community interaction and intellectual exploration. It continues to captivate audiences with its breadth of subjects and collaborative spirit.",
    "published": "2025-11-23T14:05:09Z"
  }
]