[
  {
    "title": "Israeli hostages released: all living captives freed as Trump receives standing ovation at Knesset – latest updates",
    "url": "https://www.theguardian.com/world/live/2025/oct/13/gaza-ceasefire-live-updates-israel-hostages-release-hamas-trump-middle-east",
    "image": "https://media.guim.co.uk/f7353bd190bb499ebb84df9b1e09e5b4a9ebdbcd/1318_0_6591_5273/500.jpg",
    "summary": "Donald Trump addressed the Israeli parliament, discussing pivotal issues during his visit. Simultaneously, the first images of recently released hostages were made public, highlighting the ongoing crisis. Trump's speech centered on U.S.-Israel relations and regional security concerns.",
    "published": "2025-10-13T11:14:07Z"
  },
  {
    "title": "Family says failure to assess man’s mental health led to his death on Bibby Stockholm ",
    "url": "https://www.theguardian.com/uk-news/2025/oct/13/leonard-farruku-family-mental-health-bibby-stockholm",
    "image": "https://media.guim.co.uk/f264aea0e2d4b90211420c447233ca4aeefcf671/112_0_522_418/500.jpg",
    "summary": "Leonard Farruku's sisters claim he was in poor health and should not have been transferred to a barge. They believe the move contributed to his decision to take his own life. The family is now seeking accountability for his treatment.",
    "published": "2025-10-13T11:13:46Z"
  },
  {
    "title": "Mitsuko Uchida review – enthralling and exhilarating late Beethoven ",
    "url": "https://www.theguardian.com/music/2025/oct/13/mitsuko-uchida-review-late-beethoven-programme-wigmore-hall",
    "image": "https://media.guim.co.uk/333c82d6d3b2dd872673c51cf6dfc14bea7c5b59/1000_591_1722_1377/500.jpg",
    "summary": "The pianist delivered a captivating performance of Beethoven's sonatas Opp 109, 110, and 111, showcasing rich and delicate details. Each piece contributed to an overarching musical narrative that transcended individual compositions. The combined effect was a powerful and cohesive experience for the audience.",
    "published": "2025-10-13T11:09:05Z"
  },
  {
    "title": "Richard Tice confirms Reform abandoning firm commitment to most of the £90bn tax cuts in its 2024 manifesto – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/oct/13/china-spy-trial-keir-starmer-egypt-margaret-thatcher-anniversary-uk-politics-live-news-updates",
    "image": "https://media.guim.co.uk/621b8996ca1041677f372d59e8a1755a20e6c81f/1835_0_6039_4831/500.jpg",
    "summary": "Reform UK's deputy leader has stated that the party's plans for tax cuts have shifted from a solid commitment to merely an aspiration. This change reflects a reassessment of their fiscal policies. The declaration highlights potential challenges in fully implementing tax reductions in the near future.",
    "published": "2025-10-13T11:06:08Z"
  },
  {
    "title": "Brydon Carse reveals Stokes and Wood are close to 100% and raring to go for Ashes",
    "url": "https://www.theguardian.com/sport/2025/oct/13/brydon-carse-ben-stokes-mark-wood-raring-to-go-ashes-england-australia-cricket",
    "image": "https://media.guim.co.uk/65867a470a948b31fe83aff4f990d8204ce109cd/402_0_4016_3213/500.jpg",
    "summary": "England pace bowler Brydon Carse announced that captain Ben Stokes and fellow fast bowler Mark Wood are nearly fully fit ahead of the upcoming Ashes series. Their improved fitness is a positive sign for the team's prospects. The Ashes series is set to begin soon, heightening anticipation for their performance.",
    "published": "2025-10-13T11:00:49Z"
  }
]