[
  {
    "title": "UK long-term borrowing costs reach 27-year high in pre-budget blow for Labour – business live",
    "url": "https://www.theguardian.com/business/live/2025/sep/02/uk-long-term-borrowing-costs-27-year-high-gold-silver-inflation-business-live-news-updates",
    "image": "https://media.guim.co.uk/e33d07dd27d69afd62d493dfc3b45e781ee7d390/582_0_5839_4672/500.jpg",
    "summary": "The latest economic and financial news features ongoing updates regarding market trends, inflation rates, and monetary policy changes. Analysts are closely monitoring shifts in global economies as central banks adjust interest rates in response to inflation. Investors remain cautious amid geopolitical tensions and evolving economic indicators.",
    "published": "2025-09-02T09:35:28Z"
  },
  {
    "title": "Cooper rejects claims Reeves has been sidelined on economic policy by No 10 mini-reshuffle – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/02/cooper-reeves-starmer-green-party-leader-badenoch-devolution-latest-updates",
    "image": "https://media.guim.co.uk/ff6b042e9a3be70d8a4755ae982db10e5129390f/777_1462_3478_2782/500.jpg",
    "summary": "Home Secretary's remarks suggest that recent organizational changes by Keir Starmer are intended to counter claims of exclusion. Reports indicate that Starmer's reorganization may be aimed at sidelining the Chancellor as the autumn budget approaches. The situation highlights potential political maneuvering within the Labour Party ahead of key financial decisions.",
    "published": "2025-09-02T09:26:04Z"
  },
  {
    "title": "‘Clearly the worst film ever made by anyone ever’: the story behind John Boorman’s horrific Exorcist sequel",
    "url": "https://www.theguardian.com/film/2025/sep/02/devil-john-boorman-exorcist-sequel-the-heretic-documentary",
    "image": "https://media.guim.co.uk/a41fb5cf83c69530394fcf3eeb016895f48c4f69/1406_414_3884_3108/500.jpg",
    "summary": "Following the failure of the film \"The Heretic,\" director was so disheartened in 1977 that he contemplated drastic measures. A new documentary debuting at the Venice Film Festival aims to redeem his reputation and re-evaluate his work. The film suggests that his artistic contributions deserve a second look, despite past criticisms.",
    "published": "2025-09-02T09:26:02Z"
  },
  {
    "title": "Europe live: US treasury secretary indicates growing frustration with Putin over Ukraine",
    "url": "https://www.theguardian.com/world/live/2025/sep/02/russia-ukraine-war-putin-china-visit-europe-live-news-updates",
    "image": "https://media.guim.co.uk/c82033470d85964c8ff8d473b381a51651b3030e/41_0_1200_960/500.jpg",
    "summary": "Scott Bessent condemns the recent surge in attacks, describing them as \"despicable,\" while asserting that \"all options are on the table\" in response. This statement comes amid a notable reception for the Russian leader during his visit to China. Tensions are high as the geopolitical landscape continues to shift.",
    "published": "2025-09-02T09:21:29Z"
  },
  {
    "title": "Belgium to recognise Palestinian state at UN and sanction Israel – Middle East crisis live",
    "url": "https://www.theguardian.com/world/live/2025/sep/02/middle-east-crisis-israel-gaza-palestine-un-belgium-live-news-updates",
    "image": "https://media.guim.co.uk/6e91d70261e19e5f28df210b67e6d327ed450be9/192_0_1666_1333/500.jpg",
    "summary": "The foreign minister clarified that the recent actions are not directed at the Israeli people but focused on prompting their government to adhere to international and humanitarian law. This statement underscores a diplomatic effort to hold the Israeli government accountable. The remarks aim to distinguish between the state's policies and its citizens.",
    "published": "2025-09-02T09:20:36Z"
  }
]