[
  {
    "title": "Australia news live: independent MPs Allegra Spender and Sophie Scamps quit parliamentary sports club after David Pocock banned over gambling criticisms",
    "url": "https://www.theguardian.com/australia-news/live/2025/oct/10/australia-politics-live-senate-estimates-anthony-albanese-sussan-ley-andrew-hastie-migration-aukus-trump-gaza-ntwnfb",
    "image": "https://media.guim.co.uk/b51b0aa752b372cce840d3476461d2e3bb00139c/237_189_2936_2349/500.jpg",
    "summary": "I'm sorry, but Ineed the specific news content you want summarized in order to help you. Please provide the details or key points of the news.",
    "published": "2025-10-10T05:17:46Z"
  },
  {
    "title": "Two dead as severe weather brings down trees and powerlines in Tasmania ",
    "url": "https://www.theguardian.com/australia-news/2025/oct/10/severe-weather-tasmania-wind-fallen-trees-powerlines",
    "image": "https://media.guim.co.uk/c74f6c9b10850a0601b69a00c68d41865510c38d/0_526_2511_2008/500.jpg",
    "summary": "Severe weather warnings are in effect for Victoria, southern New South Wales, and parts of South Australia. Authorities are urging residents to prepare for potential adverse conditions. Safety measures and updates are being communicated in these affected areas.",
    "published": "2025-10-10T05:01:07Z"
  },
  {
    "title": "Forgive Us All review – a dead-boring zombie film? That’s unforgivable",
    "url": "https://www.theguardian.com/film/2025/oct/10/forgive-us-all-review-dead-boring-zombie-film",
    "image": "https://media.guim.co.uk/fd96d3be8e1d0163d0a4b41233f4c6d3c24911c2/0_380_7829_6260/500.jpg",
    "summary": "The film features stunning cinematography and beautiful New Zealand landscapes but ultimately falls flat, failing to engage viewers. Questions arise regarding Richard Roxburgh’s unclear accent. Overall, the movie struggles to leave a lasting impression.",
    "published": "2025-10-10T05:00:47Z"
  },
  {
    "title": "The Filter is one! 50 things we loved this year, from a sleep mask to the perfect pan",
    "url": "https://www.theguardian.com/thefilter/2025/oct/10/the-filter-turns-one-favourite-products-tried-tested",
    "image": "https://media.guim.co.uk/b6aaaf9853e649a488ed100566e4df40f12fb96a/0_0_5000_4000/500.jpg",
    "summary": "Over the past year, readers and writers have conducted thousands of tests to identify the best kitchen gadgets. Highlighted among them is a revolutionary potato masher, which stands out as a favorite. The article showcases a selection of top-rated products that have garnered significant attention and praise.",
    "published": "2025-10-10T05:00:47Z"
  },
  {
    "title": "Ty Bouncers and food toys tipped to be must-have Christmas presents",
    "url": "https://www.theguardian.com/lifeandstyle/2025/oct/10/ty-bouncers-and-food-toys-tipped-to-be-must-have-christmas-presents-hamleys",
    "image": "https://media.guim.co.uk/aadc6730a9aef6ba17167a3decce11b3ad670adc/0_841_5256_4205/500.jpg",
    "summary": "Hamleys reports a resurgence in soft-toy collecting among both children and adults. The iconic toy store notes increased demand for plush toys, reflecting nostalgia and emotional connections. This trend highlights the timeless appeal of soft toys in today’s market.",
    "published": "2025-10-10T05:00:46Z"
  }
]