[
  {
    "title": "Australia v England: Ashes first Test, day two – live",
    "url": "https://www.theguardian.com/sport/live/2025/nov/22/australia-vs-england-live-ashes-first-1st-test-day-two-aus-v-eng-cricket-scores-updates-perth",
    "image": "https://media.guim.co.uk/fc1d18aca45baa1a6a978b9720026840e34210f4/387_0_3213_2570/500.jpg",
    "summary": "In the series opener in Perth, the tourists have established a 40-run lead going into their second innings. The match is ongoing, with live updates provided by our writers. Stay tuned for more developments.",
    "published": "2025-11-22T07:17:31Z"
  },
  {
    "title": "Which country is the fourth most successful in Olympic swimming? The Saturday quiz",
    "url": "https://www.theguardian.com/lifeandstyle/2025/nov/22/which-country-is-the-fourth-most-successful-in-olympic-swimming-the-saturday-quiz",
    "image": "https://media.guim.co.uk/d336e15d3d0fbc36eb05a7a59f56aea1fd2b0871/805_0_4680_3744/500.jpg",
    "summary": "Test your knowledge with this Saturday quiz featuring intriguing topics, including pop stars performing in space and unique non-primates that have fingerprints. Challenge yourself with questions designed to engage your curiosity. Perfect for a fun and informative weekend activity!",
    "published": "2025-11-22T07:00:36Z"
  },
  {
    "title": "Who created the legend of Dracula and how do bees make honey? The kids’ quiz",
    "url": "https://www.theguardian.com/lifeandstyle/2025/nov/22/who-created-the-legend-of-dracula-and-how-do-bees-make-honey-the-kids-quiz",
    "image": "https://media.guim.co.uk/6456d606e0c8043e3c66ce5e9328f453f565a41f/0_0_1680_1344/500.jpg",
    "summary": "A new quiz features five multiple-choice questions created by children to challenge your knowledge. Participants can test their understanding and enjoy engaging with youthful creativity. Additionally, there's an opportunity to contribute your own junior brainteasers for future quizzes.",
    "published": "2025-11-22T07:00:35Z"
  },
  {
    "title": "Two UK clinical trials to assess impact of puberty blockers in young people",
    "url": "https://www.theguardian.com/science/2025/nov/22/two-uk-clinical-trials-to-assess-impact-of-puberty-blockers-in-young-people",
    "image": "https://media.guim.co.uk/e7b65f21db9d3e23baede93ffb1e0fec003810be/717_0_3539_2832/500.jpg",
    "summary": "Following the Cass review's findings of \"insufficient evidence\" regarding the effects of treatments for children with gender dysphoria, multi-year studies have been announced to further investigate this issue. The reviews highlight the need for more comprehensive research on the long-term impacts of gender-affirming care. Stakeholders emphasize the importance of understanding the complexities and nuances surrounding gender dysphoria in children.",
    "published": "2025-11-22T07:00:35Z"
  },
  {
    "title": "‘So unchanged it is almost otherworldly’: the oasis town of Skoura, Morocco",
    "url": "https://www.theguardian.com/travel/2025/nov/22/oasis-town-skoura-morocco",
    "image": "https://media.guim.co.uk/f3f1b6b9bc259b90ddb39cf20e90a6be2fa418c0/512_758_2696_2156/500.jpg",
    "summary": "An explorer and author finds solace in a desert outpost, which is nourished by water from the Atlas Mountains. This tranquil location serves as an ideal retreat for relaxation and reflection. The unique environment combines natural beauty with a sense of peace, offering a perfect escape.",
    "published": "2025-11-22T07:00:34Z"
  }
]