[
  {
    "title": "Arsenal v Brentford, Leeds v Chelsea, and more: Premier League – live",
    "url": "https://www.theguardian.com/football/live/2025/dec/03/arsenal-v-brentford-leeds-v-chelsea-and-more-premier-league-live",
    "image": "https://media.guim.co.uk/183e5bc23caae2342619119f3eb298c792b2388d/392_0_4950_3960/500.jpg",
    "summary": "Daniel Harris will provide live updates on Wednesday's matches in the English Premier League. Fans can follow along for real-time football action and insights. Stay tuned for all the latest developments from the matches.",
    "published": "2025-12-03T19:16:40Z"
  },
  {
    "title": "Democrats decry ‘harrowing’ photos of Epstein’s private island home and demand end to Trump’s ‘cover-up’ – live",
    "url": "https://www.theguardian.com/us-news/live/2025/dec/03/donald-trump-somali-immigrants-ice-minnesota-pete-hegseth-caribbean-boats-venezuela-us-politics-live-latest-news-updates",
    "image": "https://media.guim.co.uk/a29ca0ab3cd9d7e80c4d83b22a3358f06e8c4be0/1497_0_10400_8320/500.jpg",
    "summary": "A newly released media disclosure reveals details of Jeffrey Epstein’s home, featuring various rooms and significant items. Among them are a telephone and a chalkboard prominently displaying the words \"intellectual,\" \"deception,\" and \"power.\" These findings add to the intrigue surrounding Epstein’s activities and mindset.",
    "published": "2025-12-03T19:11:42Z"
  },
  {
    "title": "Celtic confirm Wilfried Nancy’s arrival from Columbus Crew as head coach",
    "url": "https://www.theguardian.com/football/2025/dec/03/celtic-confirm-wilfried-nancy-appointed-head-coach-columbus-crew",
    "image": "https://media.guim.co.uk/bb6d338f075d9c0bd3e52a140343eee262c13526/473_86_4088_3270/500.jpg",
    "summary": "Celtic has appointed Wilfried Nancy as the new head coach, succeeding Brendan Rodgers. Nancy takes over following Martin O'Neill's interim management. The club aims to move forward under his leadership.",
    "published": "2025-12-03T19:11:42Z"
  },
  {
    "title": "Liverpool v Sunderland: Premier League – live",
    "url": "https://www.theguardian.com/football/live/2025/dec/03/liverpool-v-sunderland-premier-league-live",
    "image": "https://media.guim.co.uk/65e34a0ca0553c97f1a7ac2259c8eae04c39708e/842_136_3672_2937/500.jpg",
    "summary": "The champions are set to face a challenging match against Sunderland, who have emerged as surprise contenders this season. The game will be closely followed by Rob Smyth in a minute-by-minute report. Expect an intense showdown as both teams vie for victory.",
    "published": "2025-12-03T19:08:41Z"
  },
  {
    "title": "‘From taboo to tool’: 30% of GPs in UK use AI tools in patient consultations, study finds",
    "url": "https://www.theguardian.com/society/2025/dec/03/gp-doctors-health-uk-artificial-intelligence-study",
    "image": "https://media.guim.co.uk/0c71a8355dfada84e574301527b62a3049ad7385/183_0_5151_4122/500.jpg",
    "summary": "A recent study reveals an increase in general practitioners (GPs) utilizing tools like ChatGPT to create patient appointment summaries and aid in diagnoses. This trend highlights the growing integration of AI technology in healthcare practices. The use of such tools aims to enhance efficiency and improve patient care outcomes.",
    "published": "2025-12-03T19:07:45Z"
  }
]