[
  {
    "title": "Novo Nordisk shares climb after positive results for anti-obesity pill",
    "url": "https://www.theguardian.com/business/2025/sep/18/novo-nordisk-shares-shoot-up-amid-promising-results-for-anti-obesity-pill",
    "image": "https://media.guim.co.uk/78683f98e8c711e83dcee5d5ef4b0ab37cb212e7/515_0_5826_4659/500.jpg",
    "summary": "Danish drugmaker Novo Nordisk saw its market value increase by approximately £9 billion following positive trial results for the tablet version of its weight-loss drug Wegovy. The trial demonstrated significant weight loss among participants, boosting investor confidence in the medication's potential. This development highlights the growing interest in innovative obesity treatments.",
    "published": "2025-09-18T15:33:25Z"
  },
  {
    "title": "Trump claims Jimmy Kimmel suspension not a free speech issue as Democrats call for FCC chair to quit over ‘abuse of power’ – live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/18/jimmy-kimmel-charlie-kirk-comments-show-cancelled-suspended-monologue-trump-us-politics-live",
    "image": "https://media.guim.co.uk/2d731b09c5ef58a420c26fcedc65713f29b77eb9/578_0_1106_886/500.jpg",
    "summary": "US President Biden criticized a comedian for being \"fired for lack of talent.\" Meanwhile, Democratic House leaders called for the resignation of Trump's media official, Brendan Carr. Tensions are rising as political leaders respond to recent media controversies.",
    "published": "2025-09-18T15:31:44Z"
  },
  {
    "title": "‘Censoring you in real time’: suspension of Jimmy Kimmel show sparks shock and fears for free speech",
    "url": "https://www.theguardian.com/tv-and-radio/2025/sep/18/jimmy-kimmel-suspension-sparks-shock-fears-for-free-speech-censoring-realtime",
    "image": "https://media.guim.co.uk/f2f3e94e2bb2be79cf1ec1882b9095a3faf07955/250_0_2500_2000/500.jpg",
    "summary": "ABC's decision regarding comments made by Jimmy Kimmel occurred shortly after the chair of the U.S. media regulator, appointed by Trump, threatened the licenses of the broadcaster's affiliate stations. This timing raises concerns about potential political pressures on media outlets. The situation highlights ongoing tensions between regulatory bodies and broadcasting networks.",
    "published": "2025-09-18T15:31:18Z"
  },
  {
    "title": "Trump suggests Starmer use military to cu– UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/18/donald-trump-state-visit-uk-keir-starmer-labour-politics-latest-news",
    "image": "https://media.guim.co.uk/3b481b3e5184381ee343d9f990e06eea26f9b1b9/463_0_5000_4000/500.jpg",
    "summary": "US and UK leaders faced questions regarding their stances on Gaza and the issue of free speech. Meanwhile, former President Trump asserted that he was unfamiliar with Peter Mandelson, who served as a former US ambassador. The discussions highlight ongoing geopolitical tensions and the complexities of diplomatic relations.",
    "published": "2025-09-18T15:28:26Z"
  },
  {
    "title": "Nottinghamshire stun Surrey, Somerset v Hampshire, and more: county cricket, day four – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/18/surrey-v-nottinghamshire-somerset-v-hampshire-and-more-county-cricket-day-four-live",
    "image": "https://media.guim.co.uk/6e00c513cd479e01fb23433c5043c61e772fff4f/335_0_2978_2382/500.jpg",
    "summary": "Tanya Aldred provides live updates on the concluding day of the latest County Championship matches. Fans can expect comprehensive coverage of the final outcomes and performances. Stay tuned for key moments and highlights from the matches.",
    "published": "2025-09-18T15:20:57Z"
  }
]