[
  {
    "title": "Adelaide v Hawthorn: AFL 2025 first semi-final – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/12/adelaide-crows-vs-hawthorn-hawks-live-updates-2025-afl-semi-final-latest",
    "image": "https://media.guim.co.uk/b7cb49fb1a5c57dc332ecffc3f6515e5d0ebcca0/0_0_5871_4699/500.jpg",
    "summary": "The Crows face the Hawks at Adelaide Oval in a crucial match for a spot in the preliminary final against Geelong. Martin Pegan provides live updates on the game. Tension builds as both teams strive for victory.",
    "published": "2025-09-12T11:21:19Z"
  },
  {
    "title": "Wissa, Ramsey and Delap face injury layoffs, plus Slot on Isak and Guéhi – live",
    "url": "https://www.theguardian.com/football/live/2025/sep/12/premier-league-buildup-press-conferences-team-news-live",
    "image": "https://media.guim.co.uk/2c4f1fdff4815cf807e9216ea0955f8552fbde08/1112_298_3825_3059/500.jpg",
    "summary": "Barry Glendenning provides updates as the Premier League resumes after the international break. Fans can expect insights and highlights from the upcoming matches. Stay tuned for the latest developments in the league.",
    "published": "2025-09-12T11:19:49Z"
  },
  {
    "title": "TfL invites RMT for further talks as London tube services resume after strike",
    "url": "https://www.theguardian.com/uk-news/2025/sep/12/tfl-invites-rmt-union-to-resume-talks-after-week-of-london-tube-strikes",
    "image": "https://media.guim.co.uk/ce655606a989027a310d0fb51e264a14bedc548d/1110_0_6484_5190/500.jpg",
    "summary": "Services were restored on all underground lines after disruptions during the morning rush hour on Friday. However, some delays continued to affect the resumed operations. Commuters are advised to plan accordingly.",
    "published": "2025-09-12T11:14:18Z"
  },
  {
    "title": "Charlie Kirk shooting latest: killer still at large as video of suspect released",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/12/charlie-kirk-shooter-suspect-latest-news-updates-donald-trump-utah",
    "image": "https://media.guim.co.uk/ca8554f3ef7bb4b9452f7942dced10abb093acdf/58_0_6000_4800/500.jpg",
    "summary": "Utah’s governor emphasized the critical role of public assistance in ongoing investigations, stating that collaboration is essential for effective law enforcement. He revealed that the FBI has received over 7,000 leads and tips related to the case. The appeal highlights the need for community involvement in uncovering crucial information.",
    "published": "2025-09-12T11:12:12Z"
  },
  {
    "title": "Labour MPs despondent after Rayner and Mandelson departures, says cabinet minister – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/12/uk-politics-latest-news-peter-mandelson-labour-keir-starmer-angela-rayner",
    "image": "https://media.guim.co.uk/95e8e572ca2e33ef0b5a5d45051acab3d36b78c1/0_0_4447_3558/500.jpg",
    "summary": "Scotland Secretary Douglas Alexander expressed that MPs are experiencing a profound sense of loss following Rayner's departure. He highlighted the emotional impact her absence has had on the parliamentary community. The sentiment reflects a broader recognition of her contributions.",
    "published": "2025-09-12T11:10:08Z"
  }
]