[
  {
    "title": "New Zealand v England: first men’s T20 cricket international – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/18/new-zealand-v-england-first-mens-t20-cricket-international-live",
    "image": "https://media.guim.co.uk/22d06e746d5288ba7a80ab8c8e7297563a6b483c/0_0_4164_3333/500.jpg",
    "summary": "England has commenced their white-ball tour of New Zealand, with James Wallace providing over-by-over updates from Christchurch. The match marks the beginning of England's limited-overs series against New Zealand. Fans can follow the live commentary for detailed insights on the game.",
    "published": "2025-10-18T06:26:47Z"
  },
  {
    "title": "‘London could 100% compete with Cannes’: Aids charity UK gala debut to honour Tracey Emin",
    "url": "https://www.theguardian.com/culture/2025/oct/18/london-could-100-compete-with-cannes-aids-charity-uk-gala-debut-to-honour-tracey-emin",
    "image": "https://media.guim.co.uk/4f99b2163333f1684d31f0b74172b3092576134f/1000_286_4643_3714/500.jpg",
    "summary": "AmfAR, founded by Elizabeth Taylor, is renowned for its extravagant fundraising events that support HIV and AIDS research. The organization has successfully raised significant amounts of money to combat the diseases. Its efforts continue to contribute to advancements in treatment and awareness.",
    "published": "2025-10-18T06:11:26Z"
  },
  {
    "title": "Energy clubs offer chance to reduce electricity bills by up to 30%",
    "url": "https://www.theguardian.com/money/2025/oct/18/green-energy-clubs-savings-electricity-bills-energy-local-better-deal",
    "image": "https://media.guim.co.uk/4f432609de10e14df0dc391db3955f37292e1a85/802_449_3466_2774/500.jpg",
    "summary": "Energy Local, a non-profit organization, has developed a platform that enables customers to collaborate with green energy projects to secure improved deals on energy prices. This initiative aims to promote sustainable energy practices while enhancing affordability for consumers. By leveraging collective purchasing power, Energy Local fosters community engagement in renewable energy efforts.",
    "published": "2025-10-18T06:00:40Z"
  },
  {
    "title": "My cultural awakening: ‘The Specials helped me to stop fixating on death’",
    "url": "https://www.theguardian.com/culture/2025/oct/18/my-cultural-awakening-the-specials-helped-me-to-stop-fixating-on-death",
    "image": "https://media.guim.co.uk/a42b16189988631d1073982e5a312cc91f55c962/32_0_4600_3680/500.jpg",
    "summary": "After experiencing the loss of several loved ones, the author became fixated on fitness and struggled with panic attacks. A ska cover song ultimately led them to realize that life doesn't always have to be serious. This revelation helped shift their perspective and approach to life.",
    "published": "2025-10-18T06:00:40Z"
  },
  {
    "title": "Back on the piste – at 83: Hilary Bradt and her ‘gang of oldies’ go skiing in Austria ",
    "url": "https://www.theguardian.com/travel/2025/oct/18/skiing-holiday-austria-hilary-bradt-83",
    "image": "https://media.guim.co.uk/fadbe640c1581aa668331b56ac1e7776d263c6f9/628_0_4800_3840/500.jpg",
    "summary": "After 40 years away from skiing, a travel writer returns to the slopes at a resort in the Tirol. The experience reignites their passion for the sport. The trip highlights the enduring joys of skiing in picturesque surroundings.",
    "published": "2025-10-18T06:00:39Z"
  }
]