[
  {
    "title": "US Open tennis 2025: Anisimova v Swiatek, Auger-Aliassime beats De Minaur on day 11 – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/03/us-open-tennis-2025-auger-aliassime-v-de-minaur-anisimova-v-swiatek-on-day-11-live",
    "image": "https://media.guim.co.uk/cc3e92d52f73cdb87f4b5576d31b5cbb46b1df9c/476_0_2694_2155/500.jpg",
    "summary": "Daniel Harris provides live updates on the ongoing singles quarter-finals at Flushing Meadows. The report offers insights into the matches as they progress. Fans can follow along for the latest developments in the tournament.",
    "published": "2025-09-03T20:31:45Z"
  },
  {
    "title": "US military to continue targeting vessels belonging to alleged Venezuelan drug cartels, Rubio warns – live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/03/donald-trump-immigration-tariffs-epstein-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/38b2bd9ff5031d4889cb7df20a8468cc081e5fe3/0_0_4681_3744/500.jpg",
    "summary": "Senator Marco Rubio has criticized past drug interdiction efforts in Latin America, claiming they have been ineffective. He argues that true deterrence will come from aggressive military action against drug traffickers. Rubio emphasizes the need for a more destructive approach to combat the drug problem.",
    "published": "2025-09-03T20:31:04Z"
  },
  {
    "title": "Australia politics live: Bob Carr defends China visit but ‘wouldn’t have picked this guest list’; RBA chief dampens hope for more interest rate cuts",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/04/australia-politics-live-bob-carr-daniel-andrews-beijing-putin-question-time-labor-coalition-anthony-albanese-sussan-ley-ntwnfb",
    "image": "https://media.guim.co.uk/30d865c6d6df95cf17bd07e1885d6252e76f5d63/1570_236_6224_4980/500.jpg",
    "summary": "Please provide the news content you'd like summarized, and I'll be happy to help!",
    "published": "2025-09-03T20:30:16Z"
  },
  {
    "title": "Downton Abbey: The Grand Finale review – this silly, enjoyable nonsense should go on for ever",
    "url": "https://www.theguardian.com/film/2025/sep/03/downton-abbey-the-grand-finale-review-this-silly-enjoyable-nonsense-should-go-on-for-ever",
    "image": "https://media.guim.co.uk/48bd38847219e47b443f69b13801cae93deaf010/629_120_3600_2880/500.jpg",
    "summary": "The news of Lady Mary's divorce is delivered with a notable seriousness that captivates viewers. The presentation keeps audiences engaged and invested in the unfolding story. This outing is so compelling that it shouldn't be the last, suggesting potential for further developments.",
    "published": "2025-09-03T20:00:32Z"
  },
  {
    "title": "Sweeteners can harm cognitive health equivalent to 1.6 years of ageing, study finds",
    "url": "https://www.theguardian.com/food/2025/sep/03/sweeteners-can-harm-cognitive-health-equivalent-to-16-years-of-ageing-study-finds",
    "image": "https://media.guim.co.uk/c5d54122bf4d9009d2b152deedc5fe2da67d341e/0_0_5200_4160/500.jpg",
    "summary": "Researchers have found that low- and no-calorie sweeteners may negatively impact cognitive functions, particularly thinking and memory, in middle-aged individuals. The study suggests a potential link between these sweeteners and cognitive decline. Further research is needed to understand the implications of these findings on dietary choices.",
    "published": "2025-09-03T20:00:32Z"
  }
]