[
  {
    "title": "Surrey v Nottinghamshire, Somerset v Hampshire, and more: county cricket, day four – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/18/surrey-v-nottinghamshire-somerset-v-hampshire-and-more-county-cricket-day-four-live",
    "image": "https://media.guim.co.uk/b5d3d35b0c7f75578e6d8b30e3c1d273a27e89b9/550_0_4180_3344/500.jpg",
    "summary": "Tanya Aldred provides updates on the concluding day of the latest County Championship matches. Fans can expect insights into team performances and key moments from the games. Stay tuned for the final results and implications for the tournament standings.",
    "published": "2025-09-18T09:30:46Z"
  },
  {
    "title": "World Athletics Championships 2025: 400m finals, 200m semis and more – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/18/world-athletics-championships-2025-400m-finals-200m-semis-and-more-live",
    "image": "https://media.guim.co.uk/ea38aa3883521a22fc3653d50bc257aaca13dada/572_0_6578_5263/500.jpg",
    "summary": "Daniel Harris provides updates from Tokyo on night six of the competition, featuring key events in both the men's and women's 400m races. Medals are on the line, drawing significant attention. Stay tuned for live coverage of the exhilarating races.",
    "published": "2025-09-18T09:30:38Z"
  },
  {
    "title": "‘A slap in the face’: our expert panel on Australia’s 2035 emissions target",
    "url": "https://www.theguardian.com/commentisfree/2025/sep/18/expert-panel-australias-2035-emissions-target",
    "image": "https://media.guim.co.uk/2c5c8822f795ddb3d9682e766fa503ad227d2ba6/464_0_4640_3712/500.jpg",
    "summary": "Six experts evaluate Labor's proposals across key sectors including agriculture, resources, and energy. They highlight both the strengths of the plans and areas needing improvement. The discussion emphasizes the importance of comprehensive strategies to address sector-specific challenges.",
    "published": "2025-09-18T09:28:21Z"
  },
  {
    "title": "How vulnerable are Australia’s cities to extreme heat? Explore our maps",
    "url": "https://www.theguardian.com/environment/2025/sep/18/climate-crisis-how-vulnerable-australian-cities-sydney-melbourne-extreme-heat-explore-our-maps",
    "image": "https://media.guim.co.uk/73168a6e24b0189e49c945a6a552e701c6f85386/514_0_3863_3090/500.jpg",
    "summary": "Residents of western Sydney and outer suburbs of Melbourne face heightened risks from extreme heat, according to recent data. These regions are experiencing significant temperature increases that pose health and safety concerns. Authorities are urged to take action to mitigate the effects of the rising temperatures on local communities.",
    "published": "2025-09-18T09:27:14Z"
  },
  {
    "title": "New French PM under pressure as strikes disrupt schools and transport across country – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/sep/18/france-strikes-lecornu-merz-sanchez-von-der-leyen-europe-live-latest-updates",
    "image": "https://media.guim.co.uk/e80f8a4868339543f6e03b1ac3a20ab69280988e/443_0_5530_4424/500.jpg",
    "summary": "Up to 800,000 people are anticipated to participate in a march protesting budget cuts, reductions in public services, and wage issues. This demonstration comes just one week after the appointment of Sébastien Lecornu. The event highlights growing discontent among citizens regarding government fiscal policies.",
    "published": "2025-09-18T09:26:43Z"
  }
]