[
  {
    "title": "Australia news live: all children’s sand imports to be tested for asbestos ‘in light of recent findings’; $60bn wiped from ASX",
    "url": "https://www.theguardian.com/australia-news/live/2025/nov/18/australia-news-live-victorian-liberal-leader-spill-libspill-coalition-nsw-brad-battin-mark-speakman-sussan-ley-killing-season-ntwnfb",
    "image": "https://media.guim.co.uk/c07d07da68a7bb97a0448771e4eac3532cf628a9/1127_0_5612_4492/500.jpg",
    "summary": "I'm sorry, but I need more information about the specific news article you would like to summarize. Could you please provide the details or content of the news?",
    "published": "2025-11-18T07:17:46Z"
  },
  {
    "title": "Sydney resident died after triple-zero call didn’t work on Samsung phone, TPG says",
    "url": "https://www.theguardian.com/australia-news/2025/nov/18/customer-died-after-triple-zero-call-didnt-work-on-samsung-phone-tpg-says",
    "image": "https://media.guim.co.uk/29e855205498fda82f39d297a08033989f6373ca/400_0_3332_2666/500.jpg",
    "summary": "Early investigations indicate that a device was operating software that is incompatible with emergency call services on the TPG network. This issue may have impacted the ability to make emergency calls. Further assessments are ongoing to determine the full extent of the problem.",
    "published": "2025-11-18T07:06:09Z"
  },
  {
    "title": "MoD identifies possible UK sites for making explosives and ammunition",
    "url": "https://www.theguardian.com/uk-news/2025/nov/18/mod-identifies-possible-uk-sites-for-making-explosives-and-ammunition",
    "image": "https://media.guim.co.uk/441c3e25fa206c894758b75ba272888fa4bb29cc/435_0_4840_3872/500.jpg",
    "summary": "The UK government is exploring the potential conversion of unused refineries and chemical plants into facilities for a multibillion-pound defense investment. This initiative aims to enhance national security and improve production capabilities. The plan reflects a strategic approach to repurpose existing infrastructure for defense needs.",
    "published": "2025-11-18T07:00:28Z"
  },
  {
    "title": "Wetlands and wildlife in the Netherlands: slowing down and connecting with nature in Friesland",
    "url": "https://www.theguardian.com/travel/2025/nov/18/wetlands-wildlife-slow-travel-friesland-netherlands",
    "image": "https://media.guim.co.uk/f5b207bab3d483f7eb590b7c357737b2d71e6d97/17_0_5355_4284/500.jpg",
    "summary": "De Alde Feanen national park offers a tranquil winter getaway with cozy cabins and scenic bike rides. The serene environment provides an ideal setting for relaxation. It's a perfect destination to disconnect and recharge during the colder months.",
    "published": "2025-11-18T07:00:28Z"
  },
  {
    "title": "The Wax Child by Olga Ravn review – a visceral tale of witchcraft",
    "url": "https://www.theguardian.com/books/2025/nov/18/the-wax-child-by-olga-ravn-review-a-visceral-tale-of-witchcraft",
    "image": "https://media.guim.co.uk/ffbaf33248a4cbe7c6c5ded3e1eb5cacf7e4dd13/0_250_4679_3743/500.jpg",
    "summary": "The author of *The Employees* returns with a vivid exploration of 17th-century Denmark, highlighting themes of everyday sorcery and the strength of female solidarity. This new work offers an intensely poetic depiction of women's experiences during this historical period. The narrative intertwines magic and camaraderie, providing a rich tapestry of life in that era.",
    "published": "2025-11-18T07:00:27Z"
  }
]