[
  {
    "title": "IMF chief Georgieva says global economy is “better then feared”, and urges countries to prepare for AI – business live",
    "url": "https://www.theguardian.com/business/live/2025/oct/16/uk-gdp-economy-growth-august-reeves-budget-imf-business-live-news",
    "image": "https://media.guim.co.uk/b51b1de728d08b30bcf7499fce93657248e2c73d/688_0_6880_5504/500.jpg",
    "summary": "The Chancellor spoke to journalists in Washington, expressing a desire for greater budget flexibility. She emphasized the importance of achieving the right balance in tax policy. Her comments reflect ongoing discussions about fiscal strategy.",
    "published": "2025-10-16T12:42:04Z"
  },
  {
    "title": "Top Senate Republican says he can ‘guarantee’ a vote on key healthcare provision amid shutdown standoff – live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/16/trump-latest-shutdown-vote-jd-vance-republicans-democrats",
    "image": "https://media.guim.co.uk/14b9f122f0d86ee69c264de3f18004600cf1dc11/667_0_6830_5464/500.jpg",
    "summary": "Senate Majority Leader announced that a vote on Obamacare subsidies will take place, responding to demands from Democrats. However, he cautioned that he cannot guarantee the measure's passage. This indicates ongoing uncertainty about support for the subsidies within the Senate.",
    "published": "2025-10-16T12:41:10Z"
  },
  {
    "title": "Women’s Cricket World Cup: Australia v Bangladesh – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/16/womens-cricket-world-cup-australia-v-bangladesh-live",
    "image": "https://media.guim.co.uk/722564bb2069558c8a009261fd1f3ca47a345bbd/706_0_4389_3512/500.jpg",
    "summary": "Australia has secured their place in the finals during the 50-over match in Visakhapatnam. The over-by-over report provides updates on the game as it unfolds. Follow Megan Maurice for live insights.",
    "published": "2025-10-16T12:40:54Z"
  },
  {
    "title": "Former Bush adviser charged with amassing top secret files",
    "url": "https://www.theguardian.com/us-news/2025/oct/16/indian-born-former-george-w-bush-adviser-ashley-tellis-accused-of-amassing-top-secret-files",
    "image": "https://media.guim.co.uk/4308570ed0be265de416dcfd0d2ce3050c697a7a/299_0_2993_2394/500.jpg",
    "summary": "Ashley Tellis has been arrested for allegedly gathering sensitive aircraft documents and meeting with Chinese officials to deliver envelopes containing this information. The case raises concerns about potential espionage and the unauthorized transfer of classified materials. Authorities are investigating the extent of his activities and their implications for national security.",
    "published": "2025-10-16T12:38:07Z"
  },
  {
    "title": "Rachel Reeves says those with broadest shoulders should pay fair share of tax",
    "url": "https://www.theguardian.com/politics/2025/oct/16/rachel-reeves-says-those-broadest-shoulders-should-pay-fair-share-tax",
    "image": "https://media.guim.co.uk/838272fda6fc2e5b5604a5f4474638b03da75c71/449_0_6527_5221/500.jpg",
    "summary": "The Chancellor emphasizes the importance of finding the right balance in policies to attract wealthy individuals to the UK. She aims to ensure that measures do not deter affluent residents. Her approach focuses on promoting the UK as a desirable destination for wealthy individuals.",
    "published": "2025-10-16T12:36:39Z"
  }
]