[
  {
    "title": "Gaza ceasefire plan live: Trump claims Israeli hostages should be released on Monday or Tuesday",
    "url": "https://www.theguardian.com/world/live/2025/oct/09/gaza-ceasefire-live-trump-says-hostages-probably-released-monday-idf-says-gaza-city-still-extremely-dangerous",
    "image": "https://media.guim.co.uk/8f8678e0799c4df390fe5cdc06ada48ead822b5e/205_0_2406_1925/500.jpg",
    "summary": "Trump announced what he referred to as the ‘end of the war’ and suggested that Gaza will undergo significant changes. However, the Israeli security cabinet has not publicly approved this deal. The situation remains uncertain as negotiations continue.",
    "published": "2025-10-09T17:16:39Z"
  },
  {
    "title": "England v Wales: international football friendly – live",
    "url": "https://www.theguardian.com/football/live/2025/oct/09/england-v-wales-international-football-friendly-live-score-updates",
    "image": "https://media.guim.co.uk/79f84f5b685d11bdfd2fe190950abd212544e11f/422_0_4674_3739/500.jpg",
    "summary": "Scott Murray provides a live minute-by-minute report from the friendly match at Wembley. Fans can follow along for real-time updates and insights. The event promises an engaging experience for spectators and sports enthusiasts alike.",
    "published": "2025-10-09T17:15:30Z"
  },
  {
    "title": "‘Everyone is still afraid’: ceasefire deal brings relief to Gaza but fears remain over future",
    "url": "https://www.theguardian.com/world/2025/oct/09/gaza-ceasefire-deal-relief-fear-future",
    "image": "https://media.guim.co.uk/f2e10710b4d847455fd70d2be7bfbc89f5b2339d/508_28_2327_1862/500.jpg",
    "summary": "Two previous ceasefires in Gaza ended quickly, leading to skepticism among residents about the durability of the latest agreement. Many remain uncertain whether this ceasefire will bring lasting peace. The situation continues to foster doubt and concern in the region.",
    "published": "2025-10-09T17:11:38Z"
  },
  {
    "title": "Trump says ‘we’re only going to cut Democrat programs’ as Senate again fails to advance stopgap funding bill – live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/09/national-guard-ice-federal-property-chicago-illinois-us-politics-live",
    "image": "https://media.guim.co.uk/a6c5956247d057ce1291913317adeba39eb1037e/1_0_2998_2399/500.jpg",
    "summary": "Donald Trump stated that federal cuts during the government shutdown will primarily affect his opponents' priorities. Meanwhile, a Democratic proposal to end the shutdown has failed for the ninth time. The ongoing impasse continues to create uncertainty in government operations.",
    "published": "2025-10-09T17:10:13Z"
  },
  {
    "title": "Prince William to attend Cop30 UN climate summit in Brazil",
    "url": "https://www.theguardian.com/environment/2025/oct/09/prince-william-to-attend-cop30-un-climate-summit-in-brazil",
    "image": "https://media.guim.co.uk/5288b177ae2b576d7afda83217a7cf134ec19861/290_0_4167_3334/500.jpg",
    "summary": "The Prince of Wales's decision is praised for drawing attention to the event and promoting a sense of urgency in discussions. His involvement aims to enhance awareness and engagement. This move is seen as a positive step towards fostering meaningful dialogue.",
    "published": "2025-10-09T17:09:25Z"
  }
]