[
  {
    "title": "Sarkozy will ‘sleep in jail but with head held high’ after Libya conviction",
    "url": "https://www.theguardian.com/world/2025/sep/25/nicolas-sarkozy-found-guilty-of-criminal-conspiracy-in-libya-trial",
    "image": "https://media.guim.co.uk/32c0169973b082cac67ae6690dbf89682a340b12/892_40_4125_3302/500.jpg",
    "summary": "Former French President Nicolas Sarkozy has been sentenced to five years in prison for his involvement in a criminal conspiracy related to a deal with Muammar Gaddafi's regime. The court found him guilty of accepting illegal campaign financing from the late Libyan leader. Sarkozy plans to appeal the verdict.",
    "published": "2025-09-25T17:13:20Z"
  },
  {
    "title": "Warhol, Haring, Basquiat: exhibition remembers pivotal 80s New York artists",
    "url": "https://www.theguardian.com/artanddesign/2025/sep/25/warhol-haring-basquiat-exhibition-new-york-artists",
    "image": "https://media.guim.co.uk/b59376dda245f700bfb1c7ba992fc0329695c2e0/62_0_1687_1350/500.jpg",
    "summary": "A new exhibition showcases a dynamic era of art in the city, highlighting themes such as the rise of celebrity culture, the impact of hyper-capitalism, and the devastation caused by AIDS. The exhibit captures the intersection of art and societal changes over time. Visitors are invited to explore this complex tapestry of influences shaping contemporary artistic expression.",
    "published": "2025-09-25T17:08:42Z"
  },
  {
    "title": "Trump says he was ‘still friends’ with Erdoğan while in US ‘exile’ and demands Turkey stop buying Russian oil – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/25/donald-trump-james-comey-fbi-ice-texas-latest-us-politics-news-updates-live",
    "image": "https://media.guim.co.uk/f83c833ce0272b0c0ac36e4737fae25fc01fdf60/455_0_6020_4819/500.jpg",
    "summary": "During a White House meeting with the Turkish president, the U.S. President reflected on the aftermath of the 2020 election, citing the challenges faced over the past four years. The meeting underscores the ongoing diplomatic relations between the U.S. and Turkey. The conversation likely touched on various global issues and cooperation between the two nations.",
    "published": "2025-09-25T17:08:06Z"
  },
  {
    "title": "Dallas Ice shooting suspect engaged in ‘high degree of planning’, FBI says",
    "url": "https://www.theguardian.com/us-news/2025/sep/25/dallas-texas-ice-shooting-suspect",
    "image": "https://media.guim.co.uk/b369f4038d75f9540247c89fec9458902c16e19d/718_0_6582_5264/500.jpg",
    "summary": "Kash Patel reported that the suspected gunman downloaded sensitive documents related to homeland security facilities in Dallas. Additionally, the individual conducted searches related to ballistics. This information raises concerns about potential motives and threats to public safety.",
    "published": "2025-09-25T17:04:29Z"
  },
  {
    "title": "ID cards ‘will make Britons’ everyday lives easier and build trust’, claims Blair thinktank - UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/25/andy-burnham-steve-reed-keir-starmer-labour-news-updates-uk-politics-live",
    "image": "https://media.guim.co.uk/c53b08140f6d0024e3945a9fe299a17f1af576c2/2039_0_3252_2601/500.jpg",
    "summary": "Alexander Iosad from a think tank claims that the implementation of new identification cards will address illegal migration issues. These cards are also expected to facilitate access to essential government services for individuals. The initiative aims to streamline processes and enhance support for affected populations.",
    "published": "2025-09-25T17:02:50Z"
  }
]