[
  {
    "title": "Trump signs bill to compel release of more Epstein documents",
    "url": "https://www.theguardian.com/us-news/2025/nov/19/trump-sign-bill-epstein-files",
    "image": "https://media.guim.co.uk/298d8b201c01f38da764b2f1efda94c9675623b7/798_0_6024_4818/500.jpg",
    "summary": "President Trump criticized Democrats in a post on Truth Social following their prompt passage of a bill through Congress. He expressed discontent with their legislative actions and called for Republican unity. The remarks highlight ongoing partisan tensions as lawmakers navigate pivotal legislation.",
    "published": "2025-11-20T01:35:26Z"
  },
  {
    "title": "Australia news live: Malinauskas complains of ‘frankly obscene’ process that ended in Cop31 going to Turkey instead of Adelaide",
    "url": "https://www.theguardian.com/australia-news/live/2025/nov/20/australia-news-live-volcano-java-labor-nature-laws-coalition-sussan-ley-anthony-albanese-nsw-leadership-spill-liberal-chaos-ntwnfb",
    "image": "https://media.guim.co.uk/db4970e4ded39bc2304d7a35041d4fafe0de19b1/1279_0_6393_5115/500.jpg",
    "summary": "Please provide the news content you would like me to summarize, and I'd be happy to help!",
    "published": "2025-11-20T01:35:17Z"
  },
  {
    "title": "‘Shock’ loophole in NSW law meant to protect children against incarceration could mean more will be locked up",
    "url": "https://www.theguardian.com/society/2025/nov/20/shock-loophole-in-nsw-law-meant-to-protect-children-against-incarceration-could-mean-more-will-be-locked-up",
    "image": "https://media.guim.co.uk/e4ee444cb5485d3d5b0abdb46444424625e04323/781_0_6424_5143/500.jpg",
    "summary": "The Minns government has introduced a bill that allows the presumption of doli incapax, which protects children from criminal responsibility, to be overturned. This change would apply if a child is determined to have understood that their conduct was \"seriously wrong.\" The bill aims to address concerns about child offenders and accountability.",
    "published": "2025-11-20T01:00:49Z"
  },
  {
    "title": "House Democrat faces federal charges for allegedly stealing $5m in disaster funds – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/nov/19/us-congress-epstein-files-donald-trump-saudi-arabia-redistricting-latest-news-updates",
    "image": "https://media.guim.co.uk/ae5686a1924755f8c1738ef8745aff185a357585/288_0_1404_1124/500.jpg",
    "summary": "Florida Representative Sheila Cherfilus-McCormick faces allegations of misusing funds to support her 2021 campaign. The accusations suggest that she may have diverted financial resources for personal political gain. The investigation is ongoing, raising concerns about campaign finance practices.",
    "published": "2025-11-20T00:58:00Z"
  },
  {
    "title": "Victoria to force agents to publish property reserve prices in crackdown on underquoting",
    "url": "https://www.theguardian.com/business/2025/nov/20/victoria-agents-to-publish-property-reserve-prices-crackdown-on-underquoting",
    "image": "https://media.guim.co.uk/4cdfcf95a3f04c07193f1f8db6ea6e05fa48baa3/887_679_3734_2988/500.jpg",
    "summary": "Victoria has implemented new \"nation-first\" laws requiring real estate agents to disclose the owner's reserve price within seven days of a sale. Failure to comply will result in penalties for the agents. This legislation aims to enhance transparency in real estate transactions.",
    "published": "2025-11-20T00:35:17Z"
  }
]