[
  {
    "title": "Damaris Le Grand obituary",
    "url": "https://www.theguardian.com/society/2025/sep/09/damaris-le-grand-obituary",
    "image": "https://media.guim.co.uk/bdd52e91eb5115e002c3080949db0a3becf99634/0_173_896_717/500.jpg",
    "summary": "A prominent social worker and policy officer has passed away, known for instigating the Avon mental health measure. Their contributions significantly impacted mental health policy and support services. They are remembered for their dedication to enhancing the well-being of the community.",
    "published": "2025-09-09T16:43:10Z"
  },
  {
    "title": "Corridor care ‘new normal’ in England for one in five NHS inpatients",
    "url": "https://www.theguardian.com/society/2025/sep/09/one-in-five-inpatients-hospital-corridors-england-cqc-survey",
    "image": "https://media.guim.co.uk/ca916a62dcce46ea488eabfdfe2d23f18212b3a2/1250_0_6250_5000/500.jpg",
    "summary": "A recent CQC survey from November 2024 reveals that prolonged waiting times in healthcare settings have become a normalized experience for patients. Experts express concern over this trend, highlighting its potential impact on patient care and well-being. The findings prompt calls for urgent reforms to address the issue.",
    "published": "2025-09-09T16:42:44Z"
  },
  {
    "title": "Putin views, queen stories and a boss’s birthday bash: Boris Johnson’s £5m worth of paid speeches",
    "url": "https://www.theguardian.com/uk-news/2025/sep/09/boris-johnson-paid-speeches-putin-queen-birthday-bash",
    "image": "https://media.guim.co.uk/933c8bd4cad0052a53776ec4f0c2ddbcc4957d28/1_0_3748_3000/500.jpg",
    "summary": "Leaked documents indicate that the former Prime Minister completed 34 paid speaking engagements in under two years. The files also provide insights into his financial disclosures related to these appearances. This revelation raises questions about transparency and potential conflicts of interest.",
    "published": "2025-09-09T16:42:09Z"
  },
  {
    "title": "Nice deal if it happens – but Anglo Teck is also an invitation to other bidders",
    "url": "https://www.theguardian.com/business/nils-pratley-on-finance/2025/sep/09/nice-deal-if-it-happens-but-anglo-teck-is-also-an-invitation-to-other-bidders",
    "image": "https://media.guim.co.uk/a263d2cb20e6f5f34063554f401e0f6f7199142a/340_0_5022_4016/500.jpg",
    "summary": "The proposed $53 billion merger appears rational based on its strategic goals. However, it faces several challenges and is not guaranteed to go through. Ongoing negotiations and approvals will play crucial roles in determining its outcome.",
    "published": "2025-09-09T16:41:37Z"
  },
  {
    "title": "Doha strikes on Hamas leaders were in response to Jerusalem shooting, says Netanyahu – Middle East crisis live",
    "url": "https://www.theguardian.com/world/live/2025/sep/09/israel-gaza-city-evacuation-order-idf-military-offensive-live-updates-middle-east-crisis-latest-news",
    "image": "https://media.guim.co.uk/194b78f6b7777ba65dde174e77716e009ae0bbba/117_0_1849_1479/500.jpg",
    "summary": "Israeli Prime Minister has stated that the targeting of ceasefire negotiators from a militant group is \"entirely justified.\" He emphasized the necessity of such actions in the context of ongoing conflicts. The comment highlights the Israeli government's stance on national security and the complexities of achieving lasting peace.",
    "published": "2025-09-09T16:40:20Z"
  }
]