[
  {
    "title": "Strictly Come Dancing: week two results – live",
    "url": "https://www.theguardian.com/tv-and-radio/live/2025/oct/04/strictly-come-dancing-week-two-live",
    "image": "https://media.guim.co.uk/3a925c7ab0c93d0f7d458d2239e5605a30e357c3/395_0_3953_3162/500.jpg",
    "summary": "Amber Davies led the scoreboard, showcasing her strong performance, while Alex Kingston and Balvinder Sopal showed significant improvement. Ross King and Thomas Skinner found themselves at the lowest positions. The question remains: who will be the first to leave the competition?",
    "published": "2025-10-05T18:24:45Z"
  },
  {
    "title": "Eagles v Broncos, Texans v Ravens, Jets v Cowboys, and more: NFL week five – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/05/nfl-week-five-eagles-broncos-texans-ravens-jets-cowboys-live",
    "image": "https://media.guim.co.uk/d280344b0c84c09c4e7a05f901c4c292e0c0d56b/14_0_3943_3155/500.jpg",
    "summary": "In Sunday’s matchups, the 4-0 Philadelphia team is set to host Denver. Meanwhile, Baltimore and Houston aim to regain their momentum as they face off in their respective games. Updates on these key games highlight the competitive landscape of the season.",
    "published": "2025-10-05T18:24:34Z"
  },
  {
    "title": "China threatened to retaliate against UK over foreign influence rules",
    "url": "https://www.theguardian.com/uk-news/2025/oct/05/china-threatened-to-retaliate-against-uk-over-foreign-influence-rules",
    "image": "https://media.guim.co.uk/1db51637127a779756cd2f5bdca052ba1d11b970/248_0_3004_2403/500.jpg",
    "summary": "Chinese officials have cautioned that any actions directed at their security apparatus could harm diplomatic relations. This warning comes amid heightened tensions between China and other countries. The officials emphasized the importance of mutual respect and understanding in maintaining stable ties.",
    "published": "2025-10-05T18:23:51Z"
  },
  {
    "title": "Gaza ceasefire talks live: Trump warns Hamas faces ‘complete obliteration’ if it refuses to cede power",
    "url": "https://www.theguardian.com/world/live/2025/oct/05/gaza-ceasefire-israel-palestine-hamas-trump-cairo-negotiations-middle-east-crisis-live-news-updates",
    "image": "https://media.guim.co.uk/547b7a5cc18105a953b48919cda03551a19b5e0f/886_0_4554_3642/500.jpg",
    "summary": "Hamas has agreed to certain elements of Trump's proposed plan for Gaza, prompting negotiators to travel to Egypt for further discussions. The agreement suggests potential progress in ongoing efforts to address the conflict. The developments could impact regional dynamics and future peace initiatives.",
    "published": "2025-10-05T18:09:56Z"
  },
  {
    "title": "Postecoglou enters talks intent on keeping job at Nottingham Forest",
    "url": "https://www.theguardian.com/football/2025/oct/05/postecoglou-enters-talks-intent-on-keeping-job-at-nottingham-forest",
    "image": "https://media.guim.co.uk/0a8d8b23e3640491fe4a7b0e48a19c20b39905d5/54_0_1558_1246/500.jpg",
    "summary": "Ange Postecoglou is determined to secure his position as head coach during upcoming discussions with the Nottingham Forest board. He aims to convey his commitment to the team’s success. His intention to retain the job reflects his dedication to the club's future.",
    "published": "2025-10-05T18:05:15Z"
  }
]