[
  {
    "title": "US Open tennis 2025: Raducanu, Djokovic and Pegula in action on day four – live",
    "url": "https://www.theguardian.com/sport/live/2025/aug/27/us-open-tennis-2025-raducanu-djokovic-and-pegula-in-action-on-day-four-live",
    "image": "https://media.guim.co.uk/d4434befac6023281d5add5b21b87e564ddbd77c/904_0_3781_3026/500.jpg",
    "summary": "Daniel Harris is providing live updates from Flushing Meadows, covering a full schedule of events. The coverage highlights a day filled with significant matches and activities. Stay tuned for continuous updates on the action unfolding at the venue.",
    "published": "2025-08-27T15:35:21Z"
  },
  {
    "title": "Federal judge says that Kilmar Ábrego García can’t be deported until early October – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/aug/27/donald-trump-tariffs-india-us-politics-latest-updates-news",
    "image": "https://media.guim.co.uk/bbc352cfd6786d568196c7d3bd98462980f733b3/1468_0_4919_3937/500.jpg",
    "summary": "Judge Paula Xinis of Maryland has scheduled a hearing for October 6 regarding the administration's plans to deport Ábrego. This follows ongoing legal discussions surrounding the deportation case. The outcome of the hearing could significantly impact Ábrego's immigration status.",
    "published": "2025-08-27T15:32:08Z"
  },
  {
    "title": "Israeli military carries out raid in West Bank city of Nablus – Middle East crisis live",
    "url": "https://www.theguardian.com/world/live/2025/aug/27/donald-trump-meeting-white-house-gaza-israel-middle-east-crisis-latest-updates-news",
    "image": "https://media.guim.co.uk/ce39f24c39b81909aa863d5c6c12c0aa4d61e30c/670_0_4910_3928/500.jpg",
    "summary": "Israeli military confirms the entry of soldiers and armored vehicles into a northern city in the occupied West Bank. Residents report that troops are conducting searches of houses in the area. The situation highlights ongoing tensions and military operations in the region.",
    "published": "2025-08-27T15:30:01Z"
  },
  {
    "title": "Denmark summons US charge d’affaires over alleged attempts to interfere with Greenland’s status – as it happened",
    "url": "https://www.theguardian.com/world/live/2025/aug/27/volodymyr-zelenskyy-substantive-talks-eu-us-security-guarantees-ukraine-europe-latest-updates-news",
    "image": "https://media.guim.co.uk/bf28ad6adfac60e4a982aa9dd07dba4d7df6509c/567_0_3333_2666/500.jpg",
    "summary": "Danish Foreign Minister Lars Løkke Rasmussen declared that interference in the internal affairs of Denmark and its territories is unacceptable. His statement emphasizes the country's commitment to sovereignty and independence. Rasmussen's comment may indicate a response to perceived external pressures or influences on the nation's governance.",
    "published": "2025-08-27T15:16:26Z"
  },
  {
    "title": "The Champions League gets a hipster makeover",
    "url": "https://www.theguardian.com/football/2025/aug/27/champions-league-hipster-makeover-football-daily-newsletter",
    "image": "https://media.guim.co.uk/ae3a74c39fb354442d106c96f185064613be2c79/1_0_2997_2398/500.jpg",
    "summary": "Today's Football Daily features a comprehensive travel guide for the Bigger Cup event, offering essential tips and insights for fans. It includes recommendations on transportation, accommodations, and what to expect during the tournament. Stay prepared to make the most out of your Bigger Cup experience!",
    "published": "2025-08-27T15:15:15Z"
  }
]