[
  {
    "title": "Australia politics live: Penny Wong moves censure motion against Pauline Hanson over burqa stunt",
    "url": "https://www.theguardian.com/australia-news/live/2025/nov/25/australia-politics-live-anthony-albanese-sussan-ley-tanya-plibersek-domestic-violence-helpline-pauline-hanson-burqa-net-zero-labor-coalition-greens-question-time-ntwnfb",
    "image": "https://media.guim.co.uk/5d6a8842cdb4e2747169eb9c4a8b7ad4b7b88856/577_0_5770_4616/500.jpg",
    "summary": "I'm sorry, but I need more information or specific content to summarize. Could you please provide details or a specific news article?",
    "published": "2025-11-25T01:35:54Z"
  },
  {
    "title": "Outrage over Democrats’ video telling soldiers to refuse to follow illegal orders defies ‘basic morality’, says Ron Paul – live",
    "url": "https://www.theguardian.com/us-news/live/2025/nov/24/us-politics-trump-venezuela-marjorie-tayor-greene-latest-updates",
    "image": "https://media.guim.co.uk/0a9e7fd3d5972b4d34aae8fa5e88d75e0d41a4b1/1559_0_2808_2246/500.jpg",
    "summary": "A former Republican congressman and presidential candidate has endorsed six Democratic lawmakers, emphasizing the need for reforms in the U.S. war initiation process. He criticized the current procedures as \"illegal.\" This bipartisan appeal highlights concerns over military engagement and governance.",
    "published": "2025-11-25T01:25:27Z"
  },
  {
    "title": "What is the Muslim Brotherhood – explained in 30 seconds ",
    "url": "https://www.theguardian.com/world/2025/nov/25/what-is-muslim-brotherhood-islamist-movement-explained",
    "image": "https://media.guim.co.uk/fa3598db583d2a70e81c587267ff0f8c79d649b3/1_0_2499_2000/500.jpg",
    "summary": "The Muslim Brotherhood, one of the Arab world's oldest and most influential Islamist movements, continues to play a significant role in regional politics. Founded in Egypt in 1928, it has shaped political discourse and policies across various countries. Despite facing repression and challenges, the movement maintains a dedicated following and influences contemporary Islamist thought.",
    "published": "2025-11-25T00:45:43Z"
  },
  {
    "title": "Brisbane storms and hail leave nearly 100,000 without power as trees downed and roofs stripped",
    "url": "https://www.theguardian.com/australia-news/2025/nov/25/brisbane-storms-qld-power-outages-hail-queensland-bom-weather",
    "image": "https://media.guim.co.uk/3b479800b8e7561a8d3313840a74a2e063dccbe2/304_0_1440_1152/500.jpg",
    "summary": "Severe weather in the city caused over 880,000 lightning strikes and hailstones up to 12cm in diameter. High winds were the primary factor leading to widespread power outages. The storm's intensity resulted in significant disruptions across the region.",
    "published": "2025-11-25T00:43:44Z"
  },
  {
    "title": "‘An idealized version of LA’: fabled mid-century Stahl house on sale for first time",
    "url": "https://www.theguardian.com/us-news/2025/nov/24/los-angeles-stahl-house-sale",
    "image": "https://media.guim.co.uk/59d308af8e6a1db75a02c1ddfe4761e08d97be80/26_24_2949_2358/500.jpg",
    "summary": "A historic home in the Hollywood Hills, originally built for $37,500 and renowned for a photo by photographer Julius Shulman, has been listed for $25 million. The property showcases a blend of architectural significance and modern luxury. Its steep price reflects the home's unique heritage and location.",
    "published": "2025-11-25T00:39:58Z"
  }
]