[
  {
    "title": "Shabana Mahmood tells MPs asylum system is ‘out of control and unfair’ amid Labour backlash over proposals – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/nov/17/immigration-asylum-keir-starmer-labour-shabana-mahmood-uk-politics-live-news-updates",
    "image": "https://media.guim.co.uk/471f1f44148f78f4e0d3ed9124645d86d0a6a388/231_0_2423_1938/500.jpg",
    "summary": "A Labour MP has labeled the government's asylum plans as \"dystopian\" during a session in the Commons. The Home Secretary introduced new measures aimed at addressing asylum issues. The critique highlights concerns over the government's approach to handling asylum seekers.",
    "published": "2025-11-17T19:15:52Z"
  },
  {
    "title": "Germany v Slovakia, Northern Ireland v Luxembourg, and more: World Cup 2026 qualifying – live",
    "url": "https://www.theguardian.com/football/live/2025/nov/17/germany-v-slovakia-northern-ireland-v-luxembourg-and-more-world-cup-2026-qualifying-live",
    "image": "https://media.guim.co.uk/a0e4ed3536d13ac0eeebd0973c5d037cde84210a/350_0_3500_2800/500.jpg",
    "summary": "Daniel Harris is providing updates on the ongoing qualifying rounds for next year's tournament. The updates will cover the latest developments and results as competitors vie for a spot. Stay tuned for more information as the tournament approaches.",
    "published": "2025-11-17T19:11:58Z"
  },
  {
    "title": "Trump is ‘panicking’ after failing ‘to kill our Jeffrey Epstein investigation’, says top Democrat, after president’s sudden pivot – live",
    "url": "https://www.theguardian.com/us-news/live/2025/nov/17/donald-trump-jeffrey-epstein-files-republicans-democrats-world-cup-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/717a65a8fcbd9e62edc8e5f880d027b4f7e38f9a/354_0_4077_3262/500.jpg",
    "summary": "Robert Garcia, the ranking member of the House oversight committee, claims that President Biden is aware he may lose support regarding the Epstein matter. He is urging for the release of related files to promote transparency. This statement underscores the tension surrounding the investigation into Epstein's connections and implications.",
    "published": "2025-11-17T19:03:58Z"
  },
  {
    "title": "Tuchel will visit Alexander-Arnold to explain how he can earn England recall",
    "url": "https://www.theguardian.com/football/2025/nov/17/thomas-tuchel-trent-alexander-arnold-earn-england-recall-world-cup-2026",
    "image": "https://media.guim.co.uk/caa9cda221efffa7072523c0c556ebd32a4b8b7c/195_0_3278_2623/500.jpg",
    "summary": "Real Madrid right-back faces increased competition from Jarell Quansah, who recently debuted for England in their 2-0 victory over Albania. Quansah's strong performance may challenge the current player for his position. The emergence of new talent could impact team dynamics moving forward.",
    "published": "2025-11-17T19:00:13Z"
  },
  {
    "title": "Bazball faces its ultimate test as England eye golden Ashes chance",
    "url": "https://www.theguardian.com/sport/2025/nov/17/england-bazball-rollercoaster-ashes-cricket",
    "image": "https://media.guim.co.uk/c920f9010b59ddf9ebee0369c57df6161d5fddbd/0_0_4932_3946/500.jpg",
    "summary": "England has established a strong identity and a sense of optimism in their approach to competition. However, they must prove themselves through their performance to earn the respect of Australia. The challenge lies in translating their confidence into competitive success.",
    "published": "2025-11-17T19:00:12Z"
  }
]