[
  {
    "title": "Russia and Ukraine trade missile attacks after Putin-Trump talks shelved – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/oct/22/russia-ukraine-war-kyiv-attack-latest-news-updates-europe",
    "image": "https://media.guim.co.uk/a7c5520b23006e06e8f0db5c581a58593bbecd97/93_167_792_634/500.jpg",
    "summary": "A Russian missile attack on Kyiv resulted in multiple fatalities following Ukraine's strike on a chemical plant in Bryansk that produces gunpowder, explosives, and fuel. The escalation marks an intensifying conflict between the two nations. This incident reflects the ongoing violence and retaliatory measures in the war.",
    "published": "2025-10-22T08:26:52Z"
  },
  {
    "title": "Gaza ceasefire live: JD Vance has ‘great optimism’ truce will hold as he prepares to meet Netanyahu",
    "url": "https://www.theguardian.com/world/live/2025/oct/22/israel-gaza-ceasefire-jd-vance-netanyahu-hamas-hostages-middle-east-latest-news-updates",
    "image": "https://media.guim.co.uk/1bffe3905643d4be2400e85b72a23d77ea791c0d/481_0_5059_4047/500.jpg",
    "summary": "During his visit to Israel, the U.S. Vice President announced that Washington would not impose a deadline for disarmament under the recently negotiated U.S.-brokered agreement. The decision underscores America's support for Israel amid the ongoing conflict. This statement reflects the complexities of the region's security dynamics.",
    "published": "2025-10-22T08:22:36Z"
  },
  {
    "title": "Signs of peak inflation open door to earlier Bank of England interest rate cuts",
    "url": "https://www.theguardian.com/business/2025/oct/22/peak-inflation-signs-bank-of-england-interest-rate-cuts-analysis",
    "image": "https://media.guim.co.uk/24e43cfdc15bb2bf6a406d0bf8bdbcd711350ae4/27_269_3387_2711/500.jpg",
    "summary": "UK policymakers face increasing pressure to reassess their strategies as inflation remains steady at 3.8% in September. This persistent price growth raises concerns about the effectiveness of current economic measures. Calls for a comprehensive review of policies are growing among economists and the public alike.",
    "published": "2025-10-22T08:21:29Z"
  },
  {
    "title": "Grooming gangs inquiry will never be watered down, home secretary says, after survivors resign from panel – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/oct/22/grooming-gangs-inquiry-mahmood-starmer-caerphilly-pmqs-latest-news-updates",
    "image": "https://media.guim.co.uk/a0293d384e1ac9c1d16a5fb652935966f2266503/661_188_3828_3063/500.jpg",
    "summary": "Keir Starmer is expected to face intense questioning during Prime Minister's Questions (PMQs) regarding allegations that an ongoing inquiry has become chaotic. The scrutiny comes as dissatisfaction with the inquiry’s management grows. Starmer's responses will be closely watched as they could impact his leadership position.",
    "published": "2025-10-22T08:16:43Z"
  },
  {
    "title": "UK inflation stays at 3.8% as food price rises slow for first time since March – business live",
    "url": "https://www.theguardian.com/business/live/2025/oct/22/uk-inflation-stays-at-38-as-food-price-rises-slow-for-first-time-since-march-business-live",
    "image": "https://media.guim.co.uk/fe487c9aa140b572bb41664e2ba45075ec3215ba/644_0_6436_5149/500.jpg",
    "summary": "Recent inflation figures have increased the likelihood of an interest rate cut in December. Additionally, gold prices have risen following their largest sell-off in five years. Investors are reacting to these economic indicators, impacting market dynamics.",
    "published": "2025-10-22T08:09:55Z"
  }
]