[
  {
    "title": "France v South Africa: Women’s Rugby World Cup – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/07/france-v-south-africa-womens-rugby-world-cup-live",
    "image": "https://media.guim.co.uk/e1dee9b686a17221f6f3cec97ad7ed19c78d564c/455_0_4542_3634/500.jpg",
    "summary": "France and South Africa have both advanced to the quarterfinals of the tournament. The competition now focuses on determining which team will secure the top position in Pool D. Follow along with Daniel Gallan for updates.",
    "published": "2025-09-07T17:26:19Z"
  },
  {
    "title": "US Open tennis 2025: Jannik Sinner v Carlos Alcaraz, men’s singles final – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/07/us-open-tennis-2025-jannik-sinner-v-carlos-alcaraz-mens-singles-final-live",
    "image": "https://media.guim.co.uk/26d1e6a182f2a444933ab98195b816468d8ef1ca/1685_1095_4960_3968/500.jpg",
    "summary": "Daniel Harris provides updates from the men's singles final at Flushing Meadows. Fans eagerly follow the match as it unfolds, showcasing top-level tennis. Key moments and player performances are highlighted throughout the event.",
    "published": "2025-09-07T17:26:06Z"
  },
  {
    "title": "The Guardian view on the ‘twin’ Vermeers: how to spot a masterpiece | Editorial",
    "url": "https://www.theguardian.com/commentisfree/2025/sep/07/the-guardian-view-on-the-twin-vermeers-how-to-spot-a-masterpiece",
    "image": "https://media.guim.co.uk/6658ef1243f1363dae09f888b1df52affffc6072/616_0_6533_5229/500.jpg",
    "summary": "The editorial discusses the significance of attribution in art, particularly through the lens of two versions of the Guitar Player. It highlights the challenges posed by the prevalence of fake images in today's world. The piece emphasizes the increasing importance of authenticity in artistic expressions.",
    "published": "2025-09-07T17:25:26Z"
  },
  {
    "title": "England beat South Africa by 342 runs for biggest winning margin in men’s ODI history – as it happened",
    "url": "https://www.theguardian.com/sport/live/2025/sep/07/england-v-south-africa-third-mens-one-day-international-live",
    "image": "https://media.guim.co.uk/2146f4108eb84b8eb96b1af226440ab873b28295/188_0_2553_2042/500.jpg",
    "summary": "England achieved a record ODI victory over South Africa in Southampton, with standout performances from Jofra Archer, Joe Root, and Jacob Bethell. The team's strong showing showcased their dominance in the match. This victory adds to England's impressive performances in limited-overs cricket.",
    "published": "2025-09-07T16:59:38Z"
  },
  {
    "title": "Hull KR in touching distance of leaders’ shield after sinking Hull FC in derby",
    "url": "https://www.theguardian.com/sport/2025/sep/07/hull-kr-hull-fc-super-league-match-report",
    "image": "https://media.guim.co.uk/af814c63d6c3d5c4e164ecd20bf05c8fb34f2616/518_0_3228_2583/500.jpg",
    "summary": "Hull KR edged closer to winning the League Leaders’ Shield with an 18-4 derby victory over Hull FC. The win solidifies their position at the top of the league standings. This victory marks a significant milestone for Hull KR as they aim for the title.",
    "published": "2025-09-07T16:40:31Z"
  }
]