[
  {
    "title": "Women’s Cricket World Cup: Australia v India – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/12/womens-cricket-world-cup-australia-v-india-live-updates-scores-results-teams-squads-start-time-visakhapatnam",
    "image": "https://media.guim.co.uk/b68ad297e519de5d9ac70dfceaf4835461f0fcb1/634_0_4583_3666/500.jpg",
    "summary": "In an ODI match in Visakhapatnam, two heavyweight teams aim to make a statement during the group stage. The over-by-over report features insights and updates from the game. Follow along with analyst Megan Maurice for detailed commentary.",
    "published": "2025-10-12T14:14:21Z"
  },
  {
    "title": "Ceasefire live: all 20 hostages to be released by Hamas early on Monday morning, says Israel, as aid trucks enter Gaza",
    "url": "https://www.theguardian.com/world/live/2025/oct/12/gaza-ceasefire-live-aid-relief-hamas-release-israel-hostages",
    "image": "https://media.guim.co.uk/3705a4625beb65e66edf0eda511b0d3be9181544/0_0_4800_3840/500.jpg",
    "summary": "US Vice President JD Vance announced that the release of hostages could occur \"any moment,\" with Donald Trump expected to greet them. This development comes as a peace summit is set to take place in Egypt. The situation suggests imminent progress in negotiations related to the hostages.",
    "published": "2025-10-12T14:13:37Z"
  },
  {
    "title": "WSL: Arsenal v Brighton, Liverpool v Manchester City and more – matchday live",
    "url": "https://www.theguardian.com/football/live/2025/oct/12/world-cup-qualifiers-wsl-updates-and-football-news-matchday-live",
    "image": "https://media.guim.co.uk/727fab79b7590ab78624e588ba6fc65f15116ea2/419_0_5123_4098/500.jpg",
    "summary": "Stay tuned for live updates from today's Women's Super League matches and the latest breaking news in football. Our writers will provide real-time coverage and insights. Don't miss a moment of the action!",
    "published": "2025-10-12T14:11:12Z"
  },
  {
    "title": "Hull KR aim for more while triumph brings hope for all Super League teams",
    "url": "https://www.theguardian.com/sport/2025/oct/12/hull-kr-aim-for-more-while-triumph-brings-hope-for-all-super-league-teams",
    "image": "https://media.guim.co.uk/c806409b4acd2bf0a2ac50e02ab109146d8f87ff/518_0_4545_3636/500.jpg",
    "summary": "The Super League has showcased unpredictability and a renewed energy, creating excitement for England's upcoming home Tests against Australia. Fans are eager for the matchups as the league's dynamics suggest thrilling competition. This fresh atmosphere promises to enhance the anticipation surrounding the England-Australia series.",
    "published": "2025-10-12T14:02:34Z"
  },
  {
    "title": "Time to change rules and strip honours from child abusers who’ve died, victims and advocates say",
    "url": "https://www.theguardian.com/australia-news/2025/oct/13/time-to-change-rules-and-strip-honours-from-child-abusers-who-have-died-victims-and-advocates-say-ntwnfb",
    "image": "https://media.guim.co.uk/9da5ac5a175f07aa7cfa5c43c2ea7982b2b27a40/400_0_2000_1600/500.jpg",
    "summary": "Survivor John Jolley expresses frustration over the prolonged inaction regarding a significant issue, stating it has been placed in the \"too-hard basket\". He urges the Australian government to posthumously rescind certain awards. Jolley's call highlights the need for resolution and accountability in addressing historical grievances.",
    "published": "2025-10-12T14:00:58Z"
  }
]