[
  {
    "title": "Buildup to Chelsea v Fulham in the Premier League, transfer latest and more – matchday live",
    "url": "https://www.theguardian.com/football/live/2025/aug/30/buildup-to-chelsea-v-fulham-in-the-premier-league-transfer-latest-and-more-matchday-live",
    "image": "https://media.guim.co.uk/36ff84da35fa7135de5e4fa0c389b73ce973f8b6/0_0_5000_4000/500.jpg",
    "summary": "Rob Smyth is providing ongoing updates as the Premier League gears up for a busy afternoon of matches. Fans can stay tuned for the latest developments and insights. Don't miss the action as it unfolds!",
    "published": "2025-08-30T07:14:38Z"
  },
  {
    "title": "A Taylor-made proposal: what Swift and Kelce’s engagement pictures say",
    "url": "https://www.theguardian.com/music/2025/aug/30/taylor-swift-travis-kelce-engagement-pictures-proposal-instagram",
    "image": "https://media.guim.co.uk/8aff2a83634a0f02c1a5eb1419c4130ba63d2b81/163_279_878_703/500.jpg",
    "summary": "Instagram images highlight a blend of relatable fashion and intentional spontaneity, prompting followers to ponder the symbolism and meanings behind roses. The posts create a connection between aesthetic appeal and deeper emotional narratives. Overall, they encourage viewers to reflect on personal interpretations of beauty and connection.",
    "published": "2025-08-30T07:00:55Z"
  },
  {
    "title": "Fireworks at the Women’s Rugby World Cup but the game can still rocket | Andy Bull",
    "url": "https://www.theguardian.com/sport/2025/aug/30/womens-rugby-world-cup-needs-jeopardy-to-stay-in-monday-morning-conversations",
    "image": "https://media.guim.co.uk/c4675812bc0f6df661002fe8480cbabdcbe2a6c5/673_0_3365_2692/500.jpg",
    "summary": "The current one-sided nature of matches highlights the need for structural changes in the competition. Despite this imbalance, there remains a lot to appreciate in the games. Fans continue to find enjoyment amidst the lopsided outcomes.",
    "published": "2025-08-30T07:00:55Z"
  },
  {
    "title": "Szoboszlai’s sublime dummy something more than a cog in Liverpool’s red machine | Barney Ronay",
    "url": "https://www.theguardian.com/football/2025/aug/30/szoboszlais-sublime-dummy-something-more-than-a-cog-in-liverpools-red-machine",
    "image": "https://media.guim.co.uk/7e162cdb9bf945b5edf32584a7b68f260c34d743/28_0_2058_1646/500.jpg",
    "summary": "Rio Ngumoha was celebrated for his victory at Newcastle, highlighting his impressive performance. However, it was the Hungarian player's exceptional contribution during the match that truly captivated the audience. The event showcased remarkable talent and skill from both players.",
    "published": "2025-08-30T07:00:55Z"
  },
  {
    "title": "WSL players to resume taking knee after Jess Carter abuse prompted refusal",
    "url": "https://www.theguardian.com/football/2025/aug/30/wsl-players-to-resume-taking-knee-after-jess-carter-abuse-prompted-refusal",
    "image": "https://media.guim.co.uk/8a483e184dd7f67671e596d6f2d013dc05a10831/1079_47_3066_2453/500.jpg",
    "summary": "Players in the Women’s Super League will restart taking the knee this season, following a pause by England's Lionesses during the recent Euros. The gesture is a statement against racism and aims to promote equality. This decision marks a renewed commitment to social justice within women's football.",
    "published": "2025-08-30T07:00:55Z"
  }
]