[
  {
    "title": "Australia politics live: teals to vote against Labor’s nature laws as Chaney complains ‘the process sucks and the substance is questionable’",
    "url": "https://www.theguardian.com/australia-news/live/2025/nov/05/australia-politics-live-nauru-deportations-labor-greens-coalition-anthony-albanese-sussan-ley-nationals-leadership-net-zero-question-time-ntwnfb",
    "image": "https://media.guim.co.uk/09dc199926a05f4926dedcda59a9f8761d3cc29a/481_0_6675_5340/500.jpg",
    "summary": "Please provide the news article or the details you would like summarized, and I'll be happy to help!",
    "published": "2025-11-05T01:40:12Z"
  },
  {
    "title": "NYC mayor election live: polls to close soon after Mamdani, Cuomo and Sliwa complete tense campaigns",
    "url": "https://www.theguardian.com/us-news/live/2025/nov/04/nyc-mayor-election-zohran-mamdani-andrew-cuomo-results-latest",
    "image": "https://media.guim.co.uk/3bf4b09ad3f7d69d7d63931cd0bcaf9a60ba14f7/0_0_3000_2400/500.jpg",
    "summary": "A Democratic socialist and former New York governor are competing in the race to lead New York City. This contest highlights the ideological divide within the Democratic Party. The outcome could significantly shape the city's policies and direction.",
    "published": "2025-11-05T01:39:44Z"
  },
  {
    "title": "Democrat Abigail Spanberger to become Virginia’s first female governor – live",
    "url": "https://www.theguardian.com/us-news/live/2025/nov/04/us-elections-2025-live-new-york-city-new-jersey-virginia-california-latest-news-updates-live",
    "image": "https://media.guim.co.uk/636310f87732b9c538b85b89ea16cdbce040c0af/430_0_4279_3425/500.jpg",
    "summary": "Democrat Abigail Spanberger has been projected by the Associated Press as the winner of the Virginia governor's race. She defeated Republican candidate Winsome Earle-Sears. This victory marks a significant achievement for Spanberger in the state.",
    "published": "2025-11-05T01:36:59Z"
  },
  {
    "title": "Live NYC mayoral election results: Zohran Mamdani, Andrew Cuomo and Curtis Sliwa await outcome as polls near close",
    "url": "https://www.theguardian.com/us-news/2025/nov/04/nyc-mayoral-election-results-zohran-mamdani-andrew-cuomo-voting-polls",
    "image": "https://media.guim.co.uk/f90be3d4d7fed5edfba1b450e687a571c6aa56f0/2_0_2413_1930/500.jpg",
    "summary": "Election results are unfolding as a Democratic candidate challenges a disgraced former governor running as a Republican. Ongoing updates will provide insights into the contest's progress. Stay tuned for the latest outcomes and developments.",
    "published": "2025-11-05T01:31:39Z"
  },
  {
    "title": "Radiohead review – bards of the apocalypse return for a brutal bacchanal",
    "url": "https://www.theguardian.com/music/2025/nov/05/radiohead-live-review-movistar-arena-madrid-spain-thom-yorke",
    "image": "https://media.guim.co.uk/005a4d75dc71e295583c1b20e22b93a8a3a6d33a/949_0_4743_3795/500.jpg",
    "summary": "Radiohead performed their first gig in seven years, captivating the crowd with infectious rhythms and complex drum patterns. The event showcased the band's ability to evoke pure joy and connect with their fans. The concert was a vibrant celebration of their musical prowess.",
    "published": "2025-11-05T01:19:36Z"
  }
]