[
  {
    "title": "World Cup qualifying buildup to England v Andorra, WSL Q&A  and Football League – matchday live",
    "url": "https://www.theguardian.com/football/live/2025/sep/06/world-cup-qualifying-buildup-to-england-v-andorra-wsl-qa-and-football-league-matchday-live",
    "image": "https://media.guim.co.uk/6bbdd2e6e47c70dd6499708786934a74327eed03/0_0_5000_4000/500.jpg",
    "summary": "Updates on football include preparations for Saturday's World Cup qualifying matches and the latest developments in the Women's Super League (WSL). Teams are finalizing their lineups and strategies. Fans can expect exciting fixtures as national teams and clubs vie for critical points.",
    "published": "2025-09-06T10:29:44Z"
  },
  {
    "title": " No early election despite Rayner resignation and Farage claims, says prime minister’s key adviser – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/06/no-early-election-angela-rayner-resignation-nigel-farage-reform-uk-politics-live-news-latest",
    "image": "https://media.guim.co.uk/ef89e6d973b2d1173f1dff0d29de38013d336ef3/393_0_3928_3143/500.jpg",
    "summary": "Chief Secretary Darren Jones states that the resignation of Rayner prompted an earlier-than-expected reshuffle within the Labour party. He emphasizes that there is no division within the party despite the changes. The reshuffle aims to strengthen the party's position moving forward.",
    "published": "2025-09-06T10:24:20Z"
  },
  {
    "title": "Seoul promises to help hundreds of Korean workers arrested in US in Ice raid",
    "url": "https://www.theguardian.com/us-news/2025/sep/05/immigration-ice-raid-hyundai-georgia",
    "image": "https://media.guim.co.uk/1d0bc2321ee797d8561fafff184fba6655951564/620_420_2802_2241/500.jpg",
    "summary": "A total of 475 individuals were detained at a construction site in Georgia where a factory is being built to produce batteries for Hyundai and Kia vehicles. The detentions occurred during a protest related to the factory's development. The situation highlights ongoing tensions surrounding the project and its impact on the local community.",
    "published": "2025-09-06T10:10:30Z"
  },
  {
    "title": "“It’s a secret garden”: National Theatre turns roof into a riot of colour with dye plants",
    "url": "https://www.theguardian.com/stage/2025/sep/06/national-theatre-roof-dye-plants-riot-of-colour-garden",
    "image": "https://media.guim.co.uk/2c9ef69d3a869ca635b1b0854d55df10373debf3/171_0_1706_1365/500.jpg",
    "summary": "Textile artists are innovating costume design in theatre by focusing on sustainable practices. They aim to replace harsh synthetic dyes with eco-friendly alternatives. This shift promotes environmental responsibility in the fashion and arts industries.",
    "published": "2025-09-06T10:00:49Z"
  },
  {
    "title": "What the ‘is Trump dead?’ rumours reveal about our current moment",
    "url": "https://www.theguardian.com/us-news/2025/sep/06/donald-trump-health-death-conspiracy-theories",
    "image": "https://media.guim.co.uk/276df39f1a3e0d45b6ef437a02fb14e8f01d1af2/0_0_3000_2400/500.jpg",
    "summary": "Recent discussions on social media revealed insights into conspiracy theories, showcasing how misinformation can thrive in the attention-driven digital landscape. This phenomenon highlights the intersection of liberal fantasies and online discourse. The dynamics of speculation illustrate the challenges of discerning fact from fiction in the modern information age.",
    "published": "2025-09-06T10:00:49Z"
  }
]