[
  {
    "title": "Collingwood v Brisbane: AFL 2025 first preliminary final – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/20/afl-2025-first-preliminary-final-collingwood-magpies-v-brisbane-lions-live",
    "image": "https://media.guim.co.uk/b0d3580984c93199ed478b6f2c338867854991e3/0_0_6623_5299/500.jpg",
    "summary": "The Pies and Lions face off at the MCG for a chance to compete in the grand final against the Cats. Stay tuned for live updates from Martin Pegan. The match promises to be an exciting showdown.",
    "published": "2025-09-20T07:25:33Z"
  },
  {
    "title": "Merseyside derby buildup, Manchester United v Chelsea and more – matchday live",
    "url": "https://www.theguardian.com/football/live/2025/sep/20/merseyside-derby-buildup-manchester-united-v-chelsea-and-more-matchday-live",
    "image": "https://media.guim.co.uk/ad753a7e6b1df38fa2c81520250ccc6050c5cf8e/0_0_5000_4000/500.jpg",
    "summary": "Emillia Hawkins will provide coverage, including news and analysis, leading up to significant football matches today. Fans can expect insights and updates as the action unfolds. Tune in for comprehensive pre-game information.",
    "published": "2025-09-20T07:18:04Z"
  },
  {
    "title": "Parents outraged as Meta uses photos of schoolgirls in ads targeting man",
    "url": "https://www.theguardian.com/technology/2025/sep/20/parents-outraged-meta-uses-photos-schoolgirls-ads-man",
    "image": "https://media.guim.co.uk/8bf4de8fe8e47cae0aca75f004ae9e5d30f799ea/0_706_1179_942/500.jpg",
    "summary": "Campaigners allege that Instagram pictures of girls as young as 13 were used to promote the Threads platform, describing this as a form of exploitation. The images were reportedly shared as a misleading tactic to attract users. This has raised concerns regarding the safety and ethical implications of social media marketing practices.",
    "published": "2025-09-20T07:01:07Z"
  },
  {
    "title": "A year on, Manchester City’s legal experts have the Premier League in a corner | Barney Ronay",
    "url": "https://www.theguardian.com/football/2025/sep/20/manchester-city-legal-experts-have-premier-league-in-corner-rules-breaches-charges",
    "image": "https://media.guim.co.uk/c7631227d24c0591835102ada82f6adcddb8d5f8/0_0_5000_4000/500.jpg",
    "summary": "The charges tribunal has yet to provide an update on potential rule violations. There are questions about whether the league intends to undermine its eight-time champions. Concerns linger about the impact of the tribunal's findings on the team's reputation.",
    "published": "2025-09-20T07:00:09Z"
  },
  {
    "title": "Strange days: how the Blitz club changed the 1980s – and fashion",
    "url": "https://www.theguardian.com/fashion/2025/sep/20/how-the-blitz-club-changed-the-1980s-and-fashion",
    "image": "https://media.guim.co.uk/43c61ae8e64c0e3b25302ba6593688b8e61c3f02/0_50_2945_2355/500.jpg",
    "summary": "A new exhibition explores the influence of a legendary London club on music, highlighting its role in launching artists like Spandau Ballet and Boy George. It showcases the club's impact on fashion and style during its heyday. The event celebrates the club's legacy as a vibrant cultural hub.",
    "published": "2025-09-20T07:00:08Z"
  }
]