[
  {
    "title": "US Open tennis 2025: Raducanu crashes out to Rybakina, Alcaraz races through – live",
    "url": "https://www.theguardian.com/sport/live/2025/aug/29/us-open-tennis-2025-emma-raducanu-carlos-alcaraz-shelton-paolini-day-six-live",
    "image": "https://media.guim.co.uk/ea254892b2f41b70058ebba2d23cf3f518016915/4003_461_3765_3014/500.jpg",
    "summary": "Katy Murrells is providing live updates from the third round of an event in New York. Stay tuned for continuous coverage and insights as the round progresses. Follow along for the latest developments.",
    "published": "2025-08-29T17:30:26Z"
  },
  {
    "title": "Epping council leader calls for calm after judges rule on asylum seeker hotel – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/aug/29/latest-live-uk-politics-news-updates-asylum-hotels-labour-conservatives-reform",
    "image": "https://media.guim.co.uk/69db6f531143c0c52f448704b7123eb50758b45e/396_137_3832_3066/500.jpg",
    "summary": "The Home Office and the owner of the Bell Hotel are contesting an injunction from the council that aimed to prevent the accommodation of numerous asylum seekers at the hotel. This legal challenge arises amidst ongoing debates and tensions regarding asylum housing. The case highlights the complexities surrounding asylum seeker accommodations in the region.",
    "published": "2025-08-29T17:28:36Z"
  },
  {
    "title": "Court orders seizure of counterfeit underwear seller’s £90m assets",
    "url": "https://www.theguardian.com/uk-news/2025/aug/29/counterfeit-underwear-seller-90m-assets-seized-arif-patel",
    "image": "https://media.guim.co.uk/5b9b75146f227123715f35acbf83fab606670f96/143_0_900_720/500.jpg",
    "summary": "Ferrari and properties linked to Arif Patel, a tax fraudster evading capture since 2011, are set to be auctioned off. The auction aims to recover assets from Patel's fraudulent activities. This move highlights ongoing efforts to combat tax evasion and reclaim stolen funds.",
    "published": "2025-08-29T17:28:04Z"
  },
  {
    "title": "Lawyer for Federal Reserve governor targeted by Trump says firing does ‘irreparable harm’ – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/aug/29/cdc-robert-f-kennedy-jr-donald-trump-federal-reserve-lisa-cook-latest-us-politics-news-live-updates",
    "image": "https://media.guim.co.uk/ae564ae0486ae4200007325d1b872da0bdd15a29/119_0_2999_2400/500.jpg",
    "summary": "Lisa Cook's attorney is advocating for her to continue in her position while awaiting a court decision. The legal team's argument emphasizes the importance of her presence in the role. A ruling from the court is still pending.",
    "published": "2025-08-29T17:16:29Z"
  },
  {
    "title": "IDF declares famine-hit Gaza City a combat zone, ending ‘tactical pauses’ that allowed limited food delivery – Middle East crisis live",
    "url": "https://www.theguardian.com/world/live/2025/aug/29/gaza-famine-israel-middle-east-lastest-news-updates",
    "image": "https://media.guim.co.uk/b1901bbed84a056f7f41f390f3d7f66a951b5bae/619_0_4715_3772/500.jpg",
    "summary": "In a devastated city where famine has been declared, around one million Palestinians are anticipated to be displaced. The humanitarian crisis highlights the severity of the ongoing conflict and its impact on civilians. Urgent international assistance is needed to address the escalating situation.",
    "published": "2025-08-29T17:10:20Z"
  }
]