[
  {
    "title": "Streeting says there are ‘unintended consequences’ of hate speech laws after arrest of Father Ted writer – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/03/farage-starmer-badenoch-pmqs-news-updates-uk-politics-live",
    "image": "https://media.guim.co.uk/5530a8a7cb56752a692f736210a075b3235835ab/306_0_2809_2248/500.jpg",
    "summary": "The Health Secretary emphasizes the need for balanced legislation to prevent police from focusing solely on social media posts. This statement follows the detention of Graham Linehan for his comments on transgender issues. The government aims to ensure that law enforcement priorities are appropriately aligned.",
    "published": "2025-09-03T10:35:39Z"
  },
  {
    "title": "Trump cannot use Alien Enemies Act to deport Venezuelan gang members, appeals court rules – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/03/donald-trump-immigration-tariffs-epstein-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/643adc09dded47b54abe59a68c25ebfa0379014c/468_0_4585_3668/500.jpg",
    "summary": "A federal appeals court has issued a 2-1 decision regarding a presidential proclamation that invokes a 1798 law. This ruling marks the first time a federal appeals court has addressed such a proclamation. The implications of this decision could impact the interpretation and application of historical laws in modern governance.",
    "published": "2025-09-03T10:31:15Z"
  },
  {
    "title": "At least 24 Palestinians killed by Israeli military across Gaza on Wednesday, say health officials – Middle East crisis live",
    "url": "https://www.theguardian.com/world/live/2025/sep/03/gaza-graveyard-international-humanitarian-law-unrwa-israel-middle-east-crisis-latest-updates-news",
    "image": "https://media.guim.co.uk/9501ef62e035f4fe4233e091a9265ecc8af5446a/247_0_2891_2312/500.jpg",
    "summary": "The head of UNRWA has claimed that Gaza is turning into a \"graveyard of international humanitarian law\" amid ongoing Israeli offensives in Gaza City. This statement highlights the deteriorating humanitarian conditions in the region. Calls for accountability and protection of civilians are intensifying as the situation escalates.",
    "published": "2025-09-03T10:30:46Z"
  },
  {
    "title": "Taylor Swift’s Eras tour helps fuel UK consumer spending on live music to record £6.7bn high",
    "url": "https://www.theguardian.com/music/2025/sep/03/taylor-swifts-eras-tour-helps-fuel-uk-consumer-spending-on-live-music-to-record-67bn-high",
    "image": "https://media.guim.co.uk/854fde930b5f7e522222f5a27c25a7b4f681bfbb/1308_292_3958_3169/500.jpg",
    "summary": "A report indicates that spending on live shows has risen by £2 billion compared to pre-Covid-19 levels. Despite this increase, grassroots venues continue to face closures at an alarming rate. This situation highlights a growing disparity in the live entertainment industry.",
    "published": "2025-09-03T10:30:31Z"
  },
  {
    "title": "Investors urge calm over bond sell-off as UK borrowing costs ease back from 27-year high – business live",
    "url": "https://www.theguardian.com/business/live/2025/sep/03/global-bond-sell-off-japan-government-debt-uk-us-eurozone-pound-falls-business-live-news-updates",
    "image": "https://media.guim.co.uk/33043e635ce2b16bdd760078e1df4511ce16a2d7/500_0_5000_4002/500.jpg",
    "summary": "UK 30-year yields initially increased in early trading on Wednesday, surpassing Tuesday’s figures. However, they subsequently declined again during the session. This fluctuation highlights ongoing volatility in the bond market.",
    "published": "2025-09-03T10:28:13Z"
  }
]