[
  {
    "title": "TV tonight: great plane crash thriller fun with Nine Bodies in a Mexican Morgue ",
    "url": "https://www.theguardian.com/tv-and-radio/2025/oct/18/tv-tonight-great-plane-crash-thriller-fun-with-nine-bodies-in-a-mexican-morgue",
    "image": "https://media.guim.co.uk/a5942c56a71085512d3d941cb33328a57ca8f65c/714_0_3570_2856/500.jpg",
    "summary": "Anthony Horowitz’s latest installment in his gripping series features heightened murder and suspicion. Additionally, the French drama \"The Intruder\" comes to a close, providing a captivating viewing experience. These offerings make for compelling entertainment this evening.",
    "published": "2025-10-18T05:15:36Z"
  },
  {
    "title": "German far right setting agenda as opponents amplify its ideas, study finds",
    "url": "https://www.theguardian.com/world/2025/oct/18/german-far-right-setting-agenda-as-opponents-amplify-its-ideas-study-finds",
    "image": "https://media.guim.co.uk/c8fac6f0b29ceeed2dab5f3a56c2ec8f5e885bea/432_0_4322_3457/500.jpg",
    "summary": "Researchers indicate that the normalization of far-right ideologies could impact the electoral success of these parties throughout Europe. This shift may lead to more acceptance of extreme views among voters. Consequently, traditional political dynamics may be altered as far-right parties gain traction.",
    "published": "2025-10-18T05:00:40Z"
  },
  {
    "title": "‘London could 100% compete with Cannes’: Aids charity UK gala debut to honour Tracey Emin",
    "url": "https://www.theguardian.com/culture/2025/oct/18/london-could-100-compete-with-cannes-aids-charity-uk-gala-debut-to-honour-tracey-emin",
    "image": "https://media.guim.co.uk/f06424fb9982447ee1e464ad1e22a5f54ebc57df/0_136_4973_3978/500.jpg",
    "summary": "AmfAR, founded by Elizabeth Taylor, is renowned for its extravagant events featuring A-list celebrities. The organization focuses on raising significant funds for HIV and AIDS research. Its high-profile galas attract attention and support for vital health initiatives.",
    "published": "2025-10-18T05:00:40Z"
  },
  {
    "title": "Tim Dowling: I’m in Greece with my band and the weather’s awful … but I can’t complain",
    "url": "https://www.theguardian.com/lifeandstyle/2025/oct/18/tim-dowling-im-in-greece-with-my-band-and-the-weathers-awful-but-i-cant-complain",
    "image": "https://media.guim.co.uk/b98461879c0babf5fce3c316241102669a30256e/628_0_3750_3000/500.jpg",
    "summary": "The speaker is feeling anxious about an upcoming gig at a literary festival. They express discomfort in settings where attendees are critical or judgmental. This anticipation highlights their unease in such social environments.",
    "published": "2025-10-18T05:00:39Z"
  },
  {
    "title": "‘I like to create chaos’: David Bentley back in spotlight for charity boxing bout with Jody Morris",
    "url": "https://www.theguardian.com/football/2025/oct/18/i-like-to-create-chaos-david-bentley-back-in-spotlight-for-charity-boxing-bout-with-jody-morris",
    "image": "https://media.guim.co.uk/e8dfa4c734428803b9301a74b7fcb46842f1229f/264_0_1500_1200/500.jpg",
    "summary": "The former England midfielder has built a reputation as a disruptor and is eager to demonstrate his resilience during Saturday's match. He believes this game can serve as a powerful example for his children. His determination to showcase his fighting spirit remains strong.",
    "published": "2025-10-18T05:00:39Z"
  }
]