[
  {
    "title": "The Guardian view on Turner and Constable: radical in different ways | Editorial",
    "url": "https://www.theguardian.com/commentisfree/2025/nov/28/the-guardian-view-on-turner-and-constable-radical-in-different-ways",
    "image": "https://media.guim.co.uk/b91c994ae6c39a4957f4587cb5f72acd8e449910/1167_0_5833_4666/500.jpg",
    "summary": "The 18th-century rivalry between artists transformed British art as they captured the era's changing landscapes. Their work gains renewed significance in light of the current climate emergency. This editorial highlights the connection between historical art and contemporary environmental concerns.",
    "published": "2025-11-28T18:25:14Z"
  },
  {
    "title": "‘The City can’t be taken for granted’: how banks won over Rachel Reeves",
    "url": "https://www.theguardian.com/uk-news/2025/nov/28/city-cant-banks-rachel-reeves-jp-morgan-jp-morgan-goldman-sachs-budget",
    "image": "https://media.guim.co.uk/caabb8752d3dd6ec41807ba38183dbe1d7a31fd0/0_0_6627_5304/500.jpg",
    "summary": "JP Morgan and Goldman Sachs are set to expand their operations in the UK following a recent budget that kept financial sector taxes unchanged. This decision highlights the attractiveness of the UK market for major investment banks. The move aims to capitalize on growth opportunities in the region.",
    "published": "2025-11-28T18:19:22Z"
  },
  {
    "title": "Labour MPs to demand more concessions on workers’ rights after government climbdown",
    "url": "https://www.theguardian.com/politics/2025/nov/28/labour-mps-to-demand-more-concessions-on-workers-rights-after-government-climbdown",
    "image": "https://media.guim.co.uk/4e11d1ed5851c53b064b2440b9902507c5a16547/321_0_3210_2568/500.jpg",
    "summary": "Dissatisfied MPs are advocating for enhanced protections regarding bogus self-employment arrangements. Their push aims to address concerns about workers' rights and job security. This initiative seeks to strengthen labor regulations and ensure fair treatment in the employment sector.",
    "published": "2025-11-28T18:13:40Z"
  },
  {
    "title": "‘Sexy and a little daring, but never too much’: sheer skirts hit the sweet spot",
    "url": "https://www.theguardian.com/fashion/2025/nov/28/sexy-daring-sheer-skirts",
    "image": "https://media.guim.co.uk/6890507ed7b16ee861a95d70c27f1f2996932473/753_512_3374_2699/500.jpg",
    "summary": "\"Naked dressing\" may be too bold for some, but sheer fabrics offer a stylish and more wearable alternative. These fabrics allow for a hint of skin without fully revealing it. Sheer materials can create elegant looks while maintaining comfort and modesty.",
    "published": "2025-11-28T18:12:35Z"
  },
  {
    "title": "Palmer fit to start against Arsenal; Iran to boycott World Cup draw – as it happened",
    "url": "https://www.theguardian.com/football/live/2025/nov/28/premier-league-news-europa-league-reaction-previews-and-more-football-live",
    "image": "https://media.guim.co.uk/0e30b458e27f21ee2f3bd5b38a1f8f356bf5deba/0_810_3878_3103/500.jpg",
    "summary": "Ahead of the highly anticipated London derby this Sunday, the latest football updates highlight key team news and player form. Fans and analysts are expressing excitement and predictions for the match's potential impact on the league standings. Coaches are emphasizing strategies to gain a competitive edge in this crucial rivalry.",
    "published": "2025-11-28T18:01:49Z"
  }
]