[
  {
    "title": "Trump threatens ‘massive’ China tariffs as Beijing restricts rare-earth exports",
    "url": "https://www.theguardian.com/us-news/2025/oct/10/trump-china-tariffs",
    "image": "https://media.guim.co.uk/8e482f0db7c72148b29a33d4261daad28a938ca0/340_0_3407_2725/500.jpg",
    "summary": "Wall Street experienced a decline after the US president hinted at the possibility of another trade war. He also indicated that a meeting with Chinese President Xi Jinping might not occur. This uncertainty contributed to investor concerns, leading to the market's drop.",
    "published": "2025-10-10T16:23:13Z"
  },
  {
    "title": "What the late Jilly Cooper meant to us | Letters",
    "url": "https://www.theguardian.com/books/2025/oct/10/what-the-late-jilly-cooper-meant-to-us",
    "image": "https://media.guim.co.uk/fc4eaa7034d99aabd4c51a2196b597a056409e53/0_673_4176_3340/500.jpg",
    "summary": "Caroline Cole shares the inspiration behind naming her first daughter Harriet in a heartfelt letter. The article also includes contributions from Bob Kentridge and Jean Holmes, adding diverse perspectives to the discussion. These letters offer personal insights and reflections on names and their significance.",
    "published": "2025-10-10T16:22:01Z"
  },
  {
    "title": "Gen Z women in the US: do you identify as liberal?",
    "url": "https://www.theguardian.com/society/2025/oct/10/gen-z-women-political-identity-call-out",
    "image": "https://media.guim.co.uk/46d11f773ee0e466ed278e8c695a33e61d24a5f2/683_0_6827_5464/500.jpg",
    "summary": "A new poll indicates that women aged 28 and younger are more liberal than the national average. The organization is seeking insights and opinions from this demographic regarding the poll's findings. Feedback from these women will help deepen the understanding of their political views.",
    "published": "2025-10-10T16:21:50Z"
  },
  {
    "title": "Enjoying my meat that’s low on miles | Letter",
    "url": "https://www.theguardian.com/food/2025/oct/10/enjoying-my-meat-thats-low-on-miles",
    "image": "https://media.guim.co.uk/28c53eee7e627e4a6a68c5877703c85193714584/225_0_6765_5412/500.jpg",
    "summary": "Dr. Kirstine Oswald highlights that while promoting a reduction in meat consumption and an increase in vegetable intake is beneficial, it's important to acknowledge that vegetables can also contribute to rising CO2 levels. She encourages a balanced view on dietary changes and their environmental impact. The letter calls for more awareness on the overall carbon footprint of various food sources.",
    "published": "2025-10-10T16:21:17Z"
  },
  {
    "title": "Hamas praises Trump but says Tony Blair not welcome in post-war Gaza role – live",
    "url": "https://www.theguardian.com/world/live/2025/oct/10/gaza-ceasefire-plan-israel-donald-trump-hamas-palestine-benjamin-netanyahu-middle-east-latest-news",
    "image": "https://media.guim.co.uk/715b6748a97400308c7ea16c85bbeab3a959e509/403_0_2204_1763/500.jpg",
    "summary": "A senior Hamas official credited US President Biden for facilitating a ceasefire, but expressed skepticism towards former UK Prime Minister Tony Blair due to Palestinians' negative perceptions of him. The official highlighted the complex dynamics of international involvement in the Israeli-Palestinian conflict. Despite the ceasefire, lingering distrust remains among Palestinians towards past leaders.",
    "published": "2025-10-10T16:18:58Z"
  }
]