[
  {
    "title": "RFK Jr ally reportedly chosen to lead CDC as departing officials hit out at vaccine messaging – live",
    "url": "https://www.theguardian.com/us-news/live/2025/aug/28/cdc-susan-monarez-trump-news-updates-us-politics-live",
    "image": "https://media.guim.co.uk/0163b0ac35ffe3e3f62334fc0538fefd79563d98/451_0_4511_3609/500.jpg",
    "summary": "Deputy Health Secretary Jim O'Neill is set to become the interim director of the CDC. This change comes as staff members express support for officials who have recently resigned. The shift aims to bring stability amid ongoing public health challenges.",
    "published": "2025-08-28T22:31:09Z"
  },
  {
    "title": "Australia news live: Littleproud says Katter threat not ‘becoming’, police raid Porepunkah property as manhunt continues",
    "url": "https://www.theguardian.com/australia-news/live/2025/aug/29/australia-news-live-porepunkah-shooting-dezi-freeman-manhunt-police-latest-updates-ntwnfb",
    "image": "https://media.guim.co.uk/34377f63f4c79f17e2abc1b28396117f1d9281bb/190_0_1349_1080/500.jpg",
    "summary": "I'm sorry, but I cannot access or summarize live news directly. However, if you provide me with some details or text about the news you want summarized, I'd be happy to help!",
    "published": "2025-08-28T22:30:42Z"
  },
  {
    "title": "Atomic review – the intro is the most hardcore 37 seconds of TV this year",
    "url": "https://www.theguardian.com/tv-and-radio/2025/aug/28/atomic-review-the-intro-is-the-most-hardcore-37-seconds-of-tv-this-year",
    "image": "https://media.guim.co.uk/61236322a20d78f67ab5da9af55001d42b562b0f/333_0_3333_2668/500.jpg",
    "summary": "Alfie Allen and Samira Wiley star in a gripping uranium-smuggling thriller that keeps viewers on the edge of their seats. The film begins with a high-stakes tension that sets the tone for the intense narrative. If audiences can handle the shocking start, they're in for a wild ride.",
    "published": "2025-08-28T22:00:02Z"
  },
  {
    "title": "Naomi Osaka recovers from Montreal ‘shame’ to set up chance of US Open run",
    "url": "https://www.theguardian.com/sport/2025/aug/28/naomi-osaka-recovers-from-montreal-shame-to-set-up-chance-of-us-open-run",
    "image": "https://media.guim.co.uk/bf09fa95f1fb1e82ebd32458381115ffa5aee87f/604_0_2397_1918/500.jpg",
    "summary": "The former two-time US Open champion from Japan advanced to the third round of the tournament. She is aiming to achieve her best performance at a Grand Slam in four years. Her progress reflects a strong return to form on the big stage.",
    "published": "2025-08-28T21:47:36Z"
  },
  {
    "title": "CDC officials who quit in protest lead call to ‘get politics out of public health’",
    "url": "https://www.theguardian.com/us-news/2025/aug/28/cdc-rally-staffers-protest",
    "image": "https://media.guim.co.uk/3183aa72af01f954587fc3b02e4f0f2282601bce/422_0_2915_2333/500.jpg",
    "summary": "Staff members convened in Atlanta to express support for senior leaders resigning in the wake of CDC chief Susan Monarez's dismissal. The gathering highlighted the staff's appreciation for the leadership during a tumultuous period. The resignations reflect ongoing tensions within the organization following Monarez's exit.",
    "published": "2025-08-28T21:45:12Z"
  }
]