[
  {
    "title": "Gaza ceasefire talks live: Hamas says hostage and prisoner lists exchanged with Israel",
    "url": "https://www.theguardian.com/world/live/2025/oct/08/gaza-ceasefire-talks-israel-hamas-trump-us-qatar-turkey-egypt-live-news-updates",
    "image": "https://media.guim.co.uk/7edff8dee2afbac3984dcf086ad40564c666668a/262_0_3078_2463/500.jpg",
    "summary": "The Qatari Prime Minister, along with US officials Witkoff and Kushner, is participating in negotiations involving Hamas and Israeli representatives related to Trump's Gaza plan. This collaboration aims to address the ongoing conflict and seek a resolution. The involvement of key players highlights the complex dynamics of Middle Eastern politics.",
    "published": "2025-10-08T14:19:39Z"
  },
  {
    "title": "Women’s Cricket World Cup: Australia v Pakistan – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/08/womens-cricket-world-cup-australia-v-pakistan-live-updates-scores-results-teams-squads-start-time-colombo",
    "image": "https://media.guim.co.uk/74b7eeda9030ff93aa949f483ccddfd15a20e1e8/408_0_2704_2164/500.jpg",
    "summary": "The defending champions are aiming to regain momentum in the group stage during an ODI match in Colombo. Megan Maurice provides an over-by-over report on the game. Fans are eager to see how the team performs as they strive for victory.",
    "published": "2025-10-08T14:17:41Z"
  },
  {
    "title": "Five chefs share the kitchen appliances they can’t live without",
    "url": "https://www.theguardian.com/thefilter-us/2025/oct/08/chefs-favorite-kitchen-appliances",
    "image": "https://media.guim.co.uk/b1d755108fb80e79488b83ef76b70beafcdc15a4/1_0_4998_4000/500.jpg",
    "summary": "A panel of culinary experts has endorsed several consumer-grade kitchen tools, including toaster ovens and stand mixers, for their effectiveness and usability. These appliances have garnered significant praise for enhancing cooking experiences. The recommendations highlight their practicality for home chefs.",
    "published": "2025-10-08T14:15:33Z"
  },
  {
    "title": "Bank of England warns of risk of AI market correction; gold hits new $4,000 an ounce record – business live",
    "url": "https://www.theguardian.com/business/live/2025/oct/08/spot-gold-rises-above-4000-first-time-vertu-motors-warns-profit-hit-jlr-disruption-federal-reserve-imf-business-live",
    "image": "https://media.guim.co.uk/2eb12199f001b69a40370e389a77a3e8e44f88e9/126_0_3780_3024/500.jpg",
    "summary": "Central banks warn that rising tech valuations may decline due to potentially underwhelming advancements in AI. Meanwhile, gold prices have seen a significant increase, doubling over the past two years and rallying by 50% this year alone. Investors are closely monitoring these trends in the market.",
    "published": "2025-10-08T14:12:44Z"
  },
  {
    "title": "Ex-FBI director James Comey pleads not guilty on lying to Congress charge",
    "url": "https://www.theguardian.com/us-news/2025/oct/08/james-comey-court-indictment",
    "image": "https://media.guim.co.uk/ede11ddc6cac28dbb001d36ea005432afd3f8c43/1577_631_3147_2518/500.jpg",
    "summary": "The case highlights Donald Trump's attempts to leverage the justice system for political gain and targets perceived adversaries. It signals a broader concern about the politicization of the justice department under his influence. Critics argue this approach undermines the integrity of the legal system.",
    "published": "2025-10-08T14:11:31Z"
  }
]