[
  {
    "title": "Why the needless mystery from Australia over Cummins and Khawaja for second Test? | Geoff Lemon",
    "url": "https://www.theguardian.com/sport/2025/nov/28/needless-mystery-from-australia-over-cummins-and-khawaja-for-second-test",
    "image": "https://media.guim.co.uk/92cc8a4c2199079ddb1527ab79e8f7fddcc5ca85/942_382_5825_4660/500.jpg",
    "summary": "There are conflicting signals regarding Pat Cummins's possible return to bowling in the Ashes, leaving fans uncertain. This situation reflects a dismissive attitude toward the paying public's expectations and concerns. Such ambiguity could impact fan engagement and trust in the team's communication.",
    "published": "2025-11-28T22:02:55Z"
  },
  {
    "title": "Trump says he will cancel all Biden executive orders signed by autopen – live ",
    "url": "https://www.theguardian.com/us-news/live/2025/nov/28/trump-washington-dc-shooting-politics-updates",
    "image": "https://media.guim.co.uk/fcd85e45c85cbde48cae498f511144a64392e654/581_0_5000_4000/500.jpg",
    "summary": "Trump recently took to social media to assert, without evidence, that President Biden did not personally approve certain orders. This claim adds fuel to his ongoing campaign against Biden. The statement reflects Trump's continued criticism of his predecessor's actions.",
    "published": "2025-11-28T21:41:07Z"
  },
  {
    "title": "Jeremy Corbyn and Zara Sultana’s Your Party reveals shortlist for official name",
    "url": "https://www.theguardian.com/politics/2025/nov/28/jeremy-corbyn-and-zara-sultanas-your-party-reveals-shortlist-for-official-name",
    "image": "https://media.guim.co.uk/af873cb61a677d134fb3dc24380047dd5e81fa36/0_0_3615_2892/500.jpg",
    "summary": "A leftwing party is urging its members to choose among four options: Your Party, Our Party, Popular Alliance, and For The Many. This decision reflects ongoing political shifts and the desire for unity among leftist factions. The outcome could significantly influence future collaborations and strategies within the left.",
    "published": "2025-11-28T21:36:24Z"
  },
  {
    "title": "Five Great Reads: the evolving history of the Beatles, Buddhist extremism, and anatomy of a WhatsApp group scandal",
    "url": "https://www.theguardian.com/australia-news/2025/nov/29/five-great-reads-the-evolving-history-of-the-beatles-buddhist-extremism-and-anatomy-of-a-whatsapp-group-scandal",
    "image": "https://media.guim.co.uk/518fead6bdcf3e20cbda792dc492954d52d934a3/551_0_2700_2160/500.jpg",
    "summary": "Guardian Australia's weekend wrap highlights key articles from the past week, curated by Kris Swales. It offers a concise overview of essential reads, capturing notable events and insights. The selection aims to provide readers with a comprehensive digest of important news and analysis.",
    "published": "2025-11-28T21:00:18Z"
  },
  {
    "title": "Corrections and clarifications",
    "url": "https://www.theguardian.com/news/2025/nov/28/corrections-and-clarifications",
    "summary": "\"Ronni Ancona | Prisoner 951 | This is Christmas\" is a news piece discussing the UK comedian's compelling new project that explores themes of redemption and the human experience during the holiday season. Through her unique storytelling and humor, Ancona sheds light on the emotional challenges faced by those behind bars. The piece highlights her efforts to use comedy as a means of connection and healing during a traditionally joyful time.",
    "published": "2025-11-28T21:00:17Z"
  }
]