[
  {
    "title": "The Guardian view on political chaos in France: time for Emmanuel Macron to face reality and compromise with the left | Editorial",
    "url": "https://www.theguardian.com/commentisfree/2025/sep/09/the-guardian-view-on-political-chaos-in-france-time-for-emmanuel-macron-to-face-reality-and-compromise-with-the-left",
    "image": "https://media.guim.co.uk/2c6a934f267926b00afd5957e5c4cdf9b1fbd03b/398_54_2549_2040/500.jpg",
    "summary": "The French president has experienced a revolving door of four prime ministers within three years, highlighting the instability of his second term. This ongoing turmoil has created a political deadlock that benefits Marine Le Pen. The situation suggests challenges ahead for the presidency in regaining authority and direction.",
    "published": "2025-09-09T17:25:47Z"
  },
  {
    "title": "White House to hold press briefing amid furor over Trump’s birthday note to Epstein – live updates",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/09/donald-trump-jeffrey-epstein-birthday-note-letter-latest-live-us-politics-news",
    "image": "https://media.guim.co.uk/b0e5d7e8b7aa33fd498746bbd3662c425557d965/603_29_1913_1531/500.jpg",
    "summary": "Donald Trump and several of his MAGA supporters, including Charlie Kirk and Laura Loomer, have downplayed the significance of a note Trump allegedly sent to Jeffrey Epstein for his 50th birthday. They characterized the note as trivial and not indicative of Trump's character or associations. The comments come amid renewed scrutiny of Trump's past connections to Epstein.",
    "published": "2025-09-09T17:25:14Z"
  },
  {
    "title": "Doha strikes on Hamas leaders were in response to Jerusalem shooting, says Netanyahu – Middle East crisis live",
    "url": "https://www.theguardian.com/world/live/2025/sep/09/israel-gaza-city-evacuation-order-idf-military-offensive-live-updates-middle-east-crisis-latest-news",
    "image": "https://media.guim.co.uk/194b78f6b7777ba65dde174e77716e009ae0bbba/117_0_1849_1479/500.jpg",
    "summary": "Israeli Prime Minister stated that the targeting of ceasefire negotiators from Hamas is \"entirely justified.\" In response, Hamas reported that the son of one of its senior leaders was among those killed. The situation reflects ongoing tensions and violence in the region.",
    "published": "2025-09-09T17:23:33Z"
  },
  {
    "title": "Ben & Jerry’s founders call for the brand to be ‘freed’ from its owners",
    "url": "https://www.theguardian.com/business/2025/sep/09/ben-jerrys-founders-call-brand-excluded-from-unilever-listing",
    "image": "https://media.guim.co.uk/9bf8c00cecfe2996f27974b3be2a18ae9ff91577/1365_0_6827_5464/500.jpg",
    "summary": "Ben & Jerry's co-founders, Ben Cohen and Jerry Greenfield, express frustration over being \"silenced\" by Unilever regarding social justice issues. They claim that the brand no longer reflects their original values and mission. The founders emphasize their commitment to social justice, highlighting a disconnect between their vision and the company's current direction.",
    "published": "2025-09-09T17:21:56Z"
  },
  {
    "title": "Barry Winter obituary",
    "url": "https://www.theguardian.com/politics/2025/sep/09/barry-winter-obituary",
    "image": "https://media.guim.co.uk/969b85fcc5ba68679c8fb2777e770f8816f5fe25/41_0_1518_1214/500.jpg",
    "summary": "An influential figure in the Independent Labour Party and a respected lecturer in sociology and politics has passed away. Known for their dedication to progressive causes, they left a lasting impact on both political discourse and academic circles. Their contributions will be remembered by colleagues and students alike.",
    "published": "2025-09-09T17:16:27Z"
  }
]