[
  {
    "title": "Australia news live: Labor’s goal of building 1.2m homes in a decade was a ‘pipe dream’, experts say",
    "url": "https://www.theguardian.com/australia-news/live/2025/oct/15/australia-news-live-liberals-infighting-james-paterson-sussan-ley-andrew-hastie-superannuation-jim-chalmers-ntwnfb",
    "image": "https://media.guim.co.uk/7f08ebe6f2af548ddb9a0368768e6341aef05ec5/0_0_3749_3000/500.jpg",
    "summary": "Please provide the specific news content you'd like summarized, and I'll be happy to help!",
    "published": "2025-10-15T05:15:04Z"
  },
  {
    "title": "Candace Owens: Australia’s high court backs minister’s decision to deny visa to US rightwinger",
    "url": "https://www.theguardian.com/australia-news/2025/oct/15/candace-owens-australia-visa-high-court-backs-government-decision-deny",
    "image": "https://media.guim.co.uk/d540bbb0f70e779366b49ccb42a5ab6f13de0c89/348_0_3480_2784/500.jpg",
    "summary": "The Home Affairs Minister's decision to reject a visa application for a planned speaking tour in 2024 has been upheld on character grounds. The rejection was based on concerns regarding the individual's character. This ruling prevents the applicant from entering the country for the event.",
    "published": "2025-10-15T05:04:08Z"
  },
  {
    "title": "Nicola Lamb’s recipes for toffee apple pie and apple crumb loaf",
    "url": "https://www.theguardian.com/food/2025/oct/15/toffee-apple-pie-apple-crumb-loaf-recipes-nicola-lamb",
    "image": "https://media.guim.co.uk/c510f86e68e2a73a98c5ca4409a9c03c807b50ec/139_82_3104_2481/500.jpg",
    "summary": "A new dessert offering features caramelized apples served on a buttery biscuit base. Additionally, there's an apple cake topped with a crumbly, rubbly layer. These sweet treats highlight the flavors of fresh apples in delicious baked goods.",
    "published": "2025-10-15T05:00:15Z"
  },
  {
    "title": "Remembering Mama Africa: struggle of fearless singer Miriam Makeba told in daring dance drama",
    "url": "https://www.theguardian.com/stage/2025/oct/15/singer-miriam-makeba-mimis-shebeen-dance-drama-alesandra-seutin",
    "image": "https://media.guim.co.uk/ea874934f5a135401e73eb58b39e53beaf66ec42/0_1004_2267_1813/500.jpg",
    "summary": "Mimi's Shebeen, choreographed by Alesandra Seutin, explores the journey of a South African legend through exile and rise to prominence. The performance is noted for its beautiful songs and powerful messages. Critics highlight its impactful moments that resonate deeply with audiences.",
    "published": "2025-10-15T05:00:15Z"
  },
  {
    "title": "‘Escapism is down there’: The men finding solace and community in the dark of disused Cornish mines",
    "url": "https://www.theguardian.com/uk-news/2025/oct/15/men-solace-community-dark-cornish-mines-lost-boys-of-carbis-bay",
    "image": "https://media.guim.co.uk/484591d006f3be4d440b57995375e5f8556edf54/560_0_5600_4480/500.jpg",
    "summary": "The new documentary, \"The Lost Boys of Carbis Bay,\" explores the adventures of a group of explorers as they delve into an underground world. It highlights their journey and discoveries, offering a unique glimpse into this hidden realm. The film aims to captivate audiences with the mysteries and stories of these underground explorations.",
    "published": "2025-10-15T05:00:15Z"
  }
]