[
  {
    "title": "Starmer set to question Farage’s love of UK as he gives keynote speech at Labour conference – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/30/labour-conference-starmer-speech-streeting-nhs-reform",
    "image": "https://media.guim.co.uk/80d57f82229d7cee499a40f37db1789b0e7b45ef/416_0_4517_3614/500.jpg",
    "summary": "The Prime Minister plans to emphasize economic growth as a solution to societal divisions in an upcoming address. The speech aims to present a more combative and hopeful tone. This approach seeks to inspire unity and collaboration through economic progress.",
    "published": "2025-09-30T12:40:35Z"
  },
  {
    "title": "‘We’re ending the war on warriors’: Pete Hegseth addresses senior military leaders in Virginia – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/30/us-government-shutdown-funding-trump-vance-portland-hegseth-latest-updates",
    "image": "https://media.guim.co.uk/9c02946809a54650bf70d95388c32f6d80e07807/700_0_6360_5091/500.jpg",
    "summary": "The Defense Secretary addressed a large gathering of hundreds of generals and admirals at the Marine Corps Museum in Quantico. The meeting was organized on short notice, indicating its urgency. Further details about the agenda were not specified.",
    "published": "2025-09-30T12:39:46Z"
  },
  {
    "title": "Netanyahu says he did not agree to Palestinian state as part of Trump Gaza plan, and IDF will remain ‘in most of territory’ – live",
    "url": "https://www.theguardian.com/world/live/2025/sep/30/netanyahu-israel-gaza-hamas-trump-peace-plan-latest-news-middle-east-crisis-live",
    "image": "https://media.guim.co.uk/9b4205aea3f4fabc735b6ffe16d553a37b6532ec/1090_0_4759_3808/500.jpg",
    "summary": "Israeli Prime Minister claims that Israel has successfully isolated Hamas. Meanwhile, Qatar announces plans to engage in discussions with both Hamas and Turkey regarding proposals later today. The situation indicates ongoing diplomatic efforts amid the conflict.",
    "published": "2025-09-30T12:37:02Z"
  },
  {
    "title": "Europe must give strong and united response to Russian drone incursions, says von der Leyen – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/sep/30/europe-russia-drones-ukraine-rutte-von-der-leyen-poland-kellogg-latest-updates",
    "image": "https://media.guim.co.uk/6fdb8185396973882dbb01bfd9ce26b58437039c/1199_0_5994_4795/500.jpg",
    "summary": "The European Commission president held a meeting with the NATO secretary general to discuss security cooperation. Meanwhile, the UK, France, Germany, and Sweden have pledged support to enhance Denmark's security ahead of upcoming summits in Copenhagen. This collaboration underscores a collective effort to strengthen regional security measures.",
    "published": "2025-09-30T12:33:57Z"
  },
  {
    "title": "Men in wet clothes claiming to be Camino pilgrims arrested over alleged ‘narco-sub’ plot",
    "url": "https://www.theguardian.com/world/2025/sep/30/men-in-wet-clothes-claiming-to-be-camino-pilgrims-arrested-over-alleged-narco-sub-plot",
    "image": "https://media.guim.co.uk/a90984793208b169ab07f719d46fb5549fba199f/895_0_2977_2381/500.jpg",
    "summary": "Three men reportedly escaped in a taxi after allegedly transporting 3.65 tonnes of cocaine to Galicia, according to Spanish police. The vessel was intercepted during a drug operation. Authorities are investigating the incident and searching for the suspects.",
    "published": "2025-09-30T12:31:39Z"
  }
]