[
  {
    "title": "Liverpool v Atlético Madrid: Champions League – live",
    "url": "https://www.theguardian.com/football/live/2025/sep/17/liverpool-v-atletico-madrid-champions-league-live",
    "image": "https://media.guim.co.uk/4246286c92fa9119231b08cacdca7eb631cab59c/170_0_2825_2261/500.jpg",
    "summary": "Alexander Isak is set to start for Liverpool in their challenging European opener against Diego Simeone's team. The match will be closely monitored with minute-by-minute updates. Simon Burnton will be providing live coverage throughout the game.",
    "published": "2025-09-17T18:47:08Z"
  },
  {
    "title": "Bayern Munich v Chelsea: Champions League – live",
    "url": "https://www.theguardian.com/football/live/2025/sep/17/bayern-munich-v-chelsea-champions-league-live",
    "image": "https://media.guim.co.uk/9ca16dbbc9e5bb7cd5fbc6a9aba941440f70085d/896_0_3657_2926/500.jpg",
    "summary": "A minute-by-minute report is underway, focusing on the Club World Cup champions as they face Harry Kane and his team in Germany. Luke McLaughlin is providing real-time updates on the match. Fans are eager to see how the champions will perform against a strong opponent.",
    "published": "2025-09-17T18:47:07Z"
  },
  {
    "title": "Thousands of anti-Trump protesters march in London as king and senior royals host US president in Windsor – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/17/donald-trump-uk-state-visit-king-charles-windsor-politics-latest-news-updates-labour-keir-starmer",
    "image": "https://media.guim.co.uk/e09defa9f7d50a364818bb58a72ec246ef7bb46b/340_0_6608_5286/500.jpg",
    "summary": "Anti-Trump protesters gathered in London as the U.S. president participated in events in Windsor leading up to a state banquet. The demonstrations aimed to voice opposition to his policies and actions. The protests highlighted tensions surrounding the president's visit to the UK.",
    "published": "2025-09-17T18:46:45Z"
  },
  {
    "title": "UK to explore extraditing Madeleine McCann suspect Christian Brückner",
    "url": "https://www.theguardian.com/uk-news/2025/sep/17/uk-to-explore-extraditing-madeleine-mccann-suspect-christian-bruckner",
    "image": "https://media.guim.co.uk/3e2b55d68143736afc824be30ba0e1d0845167ba/311_0_2500_2000/500.jpg",
    "summary": "Met Chief Mark Rowley announced that numerous questions still exist regarding an ongoing investigation. He confirmed that detectives are in communication with both German and Portuguese police. Collaborative efforts aim to uncover more information on the case.",
    "published": "2025-09-17T18:44:45Z"
  },
  {
    "title": "Federal Reserve cuts interest rates by a quarter point, for first time in nearly a year – live updates",
    "url": "https://www.theguardian.com/business/live/2025/sep/17/federal-reserve-interest-rate-decision-jerome-powell-trump",
    "image": "https://media.guim.co.uk/8eb9a1b180569b37035d5c61969b9fd83aa9121e/131_0_3063_2450/500.jpg",
    "summary": "The interest rates have been lowered to a range of 4% to 4.25%. This decision is influenced by concerns about political pressure on the independent central bank from former President Trump. The reduction reflects the central bank's response to these external pressures.",
    "published": "2025-09-17T18:44:10Z"
  }
]