[
  {
    "title": "Arsenal v West Ham, Manchester United v Sunderland, and more: football – live",
    "url": "https://www.theguardian.com/football/live/2025/oct/04/arsenal-v-west-ham-manchester-united-v-sunderland-and-more-football-live-clockwatch-score-updates",
    "image": "https://media.guim.co.uk/b210e96bdc50ec4842d1506deba9db6a575045d2/0_0_4533_3627/500.jpg",
    "summary": "Tom Bassam will provide updates on goals and news from various football leagues. The coverage will include live reports and highlights from matches. Fans can stay informed about all the latest happenings in the sport.",
    "published": "2025-10-04T14:15:07Z"
  },
  {
    "title": "Singapore Grand Prix F1 qualifying: George Russell powers to pole position – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/04/singapore-grand-prix-qualifying-formula-one-live",
    "image": "https://media.guim.co.uk/fa49f659cb977c2eeee3ad7ee7c5379c88b719bf/229_0_2383_1906/500.jpg",
    "summary": "Max Verstappen is set to challenge McLaren drivers Oscar Piastri and Lando Norris in the upcoming race. Niall McVeigh will explore whether Verstappen can maintain his competitive edge against the duo. The rivalry promises to add excitement to the season.",
    "published": "2025-10-04T14:13:11Z"
  },
  {
    "title": "Leeds United 1-2 Tottenham Hotspur: Premier League – as it happened",
    "url": "https://www.theguardian.com/football/live/2025/oct/04/leeds-united-v-tottenham-hotspur-premier-league-live",
    "image": "https://media.guim.co.uk/267f476069e4f86e9b375e15f3b9c1c048f88de2/562_0_3466_2773/500.jpg",
    "summary": "Mohammed Kudus scored the decisive goal as Tottenham Hotspur secured their fifth consecutive victory over Leeds. He was also named player of the match for his performance. Scott Murray provided the minute-by-minute coverage of the game.",
    "published": "2025-10-04T14:10:57Z"
  },
  {
    "title": "Israel orders military to halt Gaza City campaign but continues its strikes on the strip",
    "url": "https://www.theguardian.com/world/2025/oct/04/israel-orders-military-to-halt-campaign-on-gaza-city-amid-ongoing-strikes",
    "image": "https://media.guim.co.uk/c242f8b5d5146c3908ff050f1f29cddf95599928/855_0_4320_3456/500.jpg",
    "summary": "The IDF has been instructed to prepare for the initial phase of Donald Trump's plan to end the war in Gaza, following Hamas's agreement to release hostages. This development indicates potential shifts in the conflict's dynamics. The situation remains fluid as diplomatic efforts are underway.",
    "published": "2025-10-04T14:02:06Z"
  },
  {
    "title": "‘Not sure what’s happening’: US national parks in limbo as shutdown drags on",
    "url": "https://www.theguardian.com/us-news/2025/oct/04/us-national-parks-government-shutdown",
    "image": "https://media.guim.co.uk/3894c872a2f92e2a62d4d23e63280d54fc4a822b/272_0_4180_3344/500.jpg",
    "summary": "Several parks are facing closures, while others attempt to operate with minimal staffing. This situation may impact visitor experiences and park services. The reasons behind these operational challenges were not specified in the report.",
    "published": "2025-10-04T14:00:08Z"
  }
]