[
  {
    "title": "World Cup qualifying buildup to England v Andorra, WSL Q&A  and Football League – matchday live",
    "url": "https://www.theguardian.com/football/live/2025/sep/06/world-cup-qualifying-buildup-to-england-v-andorra-wsl-qa-and-football-league-matchday-live",
    "image": "https://media.guim.co.uk/6bbdd2e6e47c70dd6499708786934a74327eed03/0_0_5000_4000/500.jpg",
    "summary": "This article provides the latest updates on football news as teams prepare for Saturday's World Cup qualifying matches and Women's Super League (WSL) action. Key developments and player news leading up to the games are highlighted. Fans can expect exciting matchups as teams aim for crucial wins.",
    "published": "2025-09-06T09:27:12Z"
  },
  {
    "title": " No early election despite Rayner resignation and Farage claims, says prime minister’s key adviser – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/06/no-early-election-angela-rayner-resignation-nigel-farage-reform-uk-politics-live-news-latest",
    "image": "https://media.guim.co.uk/ef89e6d973b2d1173f1dff0d29de38013d336ef3/393_0_3928_3143/500.jpg",
    "summary": "Chief Secretary Darren Jones stated that the resignation of Rayner accelerated a planned reshuffle within the Labour party. He emphasized that there is no division within the party despite the changes. Jones reiterated unity among party members in light of the developments.",
    "published": "2025-09-06T09:26:30Z"
  },
  {
    "title": "‘Every surfer feeling this’: tight-knit community mourns fatal shark attack on Sydney’s northern beaches",
    "url": "https://www.theguardian.com/australia-news/2025/sep/06/sydney-northern-beaches-surfer-fatal-shark-attack",
    "image": "https://media.guim.co.uk/17b2df21164ce829d2b24ec180381562188cc531/284_0_1800_1440/500.jpg",
    "summary": "A seasoned surfer and father tragically lost his life in a recent incident, marking the city's first fatality of its kind in several years. The event has prompted shock and mourning within the local surfing community. Authorities are investigating the circumstances surrounding the incident.",
    "published": "2025-09-06T09:06:28Z"
  },
  {
    "title": "‘Reclaim our flag’: saltire becomes cultural battleground in Scotland as tensions rise over asylum housing",
    "url": "https://www.theguardian.com/uk-news/2025/sep/06/reclaim-our-flag-saltire-cultural-battleground-tensions-asylum-housing",
    "image": "https://media.guim.co.uk/3b1dd1d3613251b595cb1264e2870f919883a915/469_0_4819_3855/500.jpg",
    "summary": "The national flag has emerged as a contentious symbol in protests concerning asylum and migration issues across Scotland, from Falkirk to Aberdeen. Demonstrators express differing views on its meaning and significance in the context of these social issues. The situation highlights the complex relationship between national identity and migration debates in the region.",
    "published": "2025-09-06T09:00:48Z"
  },
  {
    "title": "An ale star cast: pint-pulling Rupert Everett surprises country pub’s punters",
    "url": "https://www.theguardian.com/film/2025/sep/06/pint-pulling-rupert-everett-surprises-country-pub-punters-wiltshire",
    "image": "https://media.guim.co.uk/5a432495518462560fb4d1051ebbb1f0870c2059/0_225_3060_2448/500.jpg",
    "summary": "A Hollywood actor is lending a hand at the Swan at Enford pub in Wiltshire, rallying with neighbors to preserve their local establishment. The community is coming together to address challenges facing the pub. Their efforts highlight the importance of local venues in fostering community spirit.",
    "published": "2025-09-06T09:00:48Z"
  }
]