[
  {
    "title": "Denmark to buy long-range precision weapons as PM warns ‘Russia is testing us’ – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/sep/17/germany-friedrich-merz-bundestag-afd-ukraine-russia-finland-latvia-europe-news-live-updates",
    "image": "https://media.guim.co.uk/bfc8f3d6310e8fd162a24e867929fd94c3440227/250_0_3960_3168/500.jpg",
    "summary": "Danish Prime Minister Mette Frederiksen has announced a significant shift in national defense strategy, emphasizing the need to enhance air defenses against missile threats. This move reflects a changing security landscape and aims to bolster Denmark's readiness against potential aggressors. The initiative underscores a commitment to modernize military capabilities in response to emerging threats.",
    "published": "2025-09-17T11:24:51Z"
  },
  {
    "title": "World Athletics Championships 2025: Gout Gout makes bow, Josh Kerr goes for gold and more – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/17/world-athletics-championships-2025-womens-pole-vault-final-mens-1500m-final-and-more-live",
    "image": "https://media.guim.co.uk/4fa905e78d8d12e2a06b1e5ebaf74616aed88840/761_195_4090_3274/500.jpg",
    "summary": "Yara El-Shaboury provides updates from the fifth evening of events in Tokyo. The report covers the latest developments and highlights from the ongoing action. Stay tuned for real-time news and insights.",
    "published": "2025-09-17T11:24:32Z"
  },
  {
    "title": "‘Radical left media’ is trying to destroy country, claims Trump – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/17/donald-trump-charlie-kirk-free-speech-nyt-cdc-rfk-epstein-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/8734919e626708e8789a816479b02eb95192de85/0_0_4285_3428/500.jpg",
    "summary": "The President is receiving positive feedback regarding his legal case against the New York Times as he prepares for a state visit to the UK. He described the feedback as \"amazing.\" The visit is anticipated to highlight his diplomatic engagements and ongoing legal challenges.",
    "published": "2025-09-17T11:22:04Z"
  },
  {
    "title": "Surrey v Nottinghamshire, Sussex v Yorkshire, and more: county cricket, day three – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/17/surrey-v-nottinghamshire-sussex-v-yorkshire-and-more-county-cricket-day-three-live",
    "image": "https://media.guim.co.uk/6f12be0aeb035998f0fc6c1e7a7f6ac4875cd299/414_0_4574_3659/500.jpg",
    "summary": "Live updates are being provided for matches in the County Championship, covering both Division One and Division Two. The report offers ongoing coverage of key moments and performances from the games. Fans can follow the latest developments as the matches progress.",
    "published": "2025-09-17T11:20:10Z"
  },
  {
    "title": "UK overall inflation remains at 3.8% in August, but food price growth climbs for fifth month in a row - business live",
    "url": "https://www.theguardian.com/business/live/2025/sep/17/uk-inflation-steady-38-in-july-official-figures-federal-reserve-interest-rates-donald-trump-state-visit-business-live",
    "image": "https://media.guim.co.uk/8b6880f735730e03a3aeb86b794481b78d364fca/323_0_3682_2945/500.jpg",
    "summary": "Food prices have surged at the fastest rate since January 2024, driven by increases in vegetables, milk, cheese, and fish. The Bank of England is anticipated to maintain its current interest rates during the upcoming meeting on Thursday. This trend highlights continued inflationary pressures in the UK market.",
    "published": "2025-09-17T11:19:50Z"
  }
]