[
  {
    "title": "NFL on Thanksgiving: Lions v Packers updates before Cowboys v Chiefs – live",
    "url": "https://www.theguardian.com/sport/live/2025/nov/27/nfl-on-thanksgiving-lions-v-packers-updates-cowboys-v-chiefs-live",
    "image": "https://media.guim.co.uk/8bb99de2de86eec1307a4b97dc67e10c000502a7/992_47_4465_3572/500.jpg",
    "summary": "Graham Searles will host a prominent double-header event on Thanksgiving. This marks the beginning of Week 13 in the sports calendar. Fans can look forward to an exciting day of games.",
    "published": "2025-11-27T19:10:59Z"
  },
  {
    "title": "Nottingham Forest v Malmö, Rangers v Braga, and more: Europa League – live ",
    "url": "https://www.theguardian.com/football/live/2025/nov/27/nottingham-forest-v-malmo-rangers-v-braga-and-more-europa-league-live",
    "image": "https://media.guim.co.uk/b98791a7d243c9a25783f769b143911f8dc7a4f5/1156_214_4520_3616/500.jpg",
    "summary": "Michael Butler will provide live updates on the Europa League matches taking place on Thursday night. Fans can expect timely coverage and insights as the games unfold. Stay tuned for the latest scores and highlights.",
    "published": "2025-11-27T19:08:09Z"
  },
  {
    "title": "Wes Streeting calls BMA ‘impossible’ and says they made ‘misleading’ claims",
    "url": "https://www.theguardian.com/society/2025/nov/27/wes-streeting-calls-bma-impossible-and-says-they-made-misleading-claims",
    "image": "https://media.guim.co.uk/bbc2c36fd7b6c9d451d5a3000f7536a3b7155e41/497_0_4357_3486/500.jpg",
    "summary": "The health secretary addressed a speech by the GP committee leader who accused the Labour party of engaging in \"gaslighting\" tactics. The comments reflect rising tensions between healthcare representatives and political figures regarding health policies. The dialogue highlights ongoing issues in the healthcare sector and the need for clarity in communication.",
    "published": "2025-11-27T19:04:38Z"
  },
  {
    "title": "Cricket nerds love precedent so maybe England can channel spirit of Lord’s 2005",
    "url": "https://www.theguardian.com/sport/2025/nov/27/england-cricket-second-test-channel-lords-2005-ashes",
    "image": "https://media.guim.co.uk/80a03fa38130be532c70e2fc49c7c8177ce9466a/274_62_2668_2135/500.jpg",
    "summary": "The 2025 cricket team faces a challenge similar to Michael Vaughan's Ashes winners, needing to adopt a hyper-aggressive style to succeed. A modified strategy in the second Test is crucial for their chances. This approach reflects the necessity for adaptation to overcome obstacles in competition.",
    "published": "2025-11-27T19:00:43Z"
  },
  {
    "title": "Partisan X posts boost political polarisation among users, research finds",
    "url": "https://www.theguardian.com/technology/2025/nov/27/partisan-x-posts-increase-political-polarisation-among-users-social-media-research",
    "image": "https://media.guim.co.uk/bce34435ba0b45acd799c01d4d7f88b251029f96/256_0_2631_2104/500.jpg",
    "summary": "A recent study found that slight modifications in the tone of social media posts within the \"for you\" feed can enhance negative sentiments toward political opponents. This highlights the impact of online content curation on emotional responses and political polarization. The findings suggest that even minor changes in language can significantly influence user perceptions.",
    "published": "2025-11-27T19:00:43Z"
  }
]