[
  {
    "title": "News live: Marles ‘confident’ about future of US relationship; Australian doctor joins Gaza flotilla",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/26/australia-news-live-afl-grand-final-could-spread-queensland-measles-outbreak-albanese-heads-for-uk-talks-ntwnfb",
    "image": "https://media.guim.co.uk/dae860b56a0a2f3ae15625ccfb8a416db1f8bdce/130_0_3297_2638/500.jpg",
    "summary": "I'm sorry, but I need more specific information or text to summarize. Please provide details about the news you'd like summarized.",
    "published": "2025-09-25T23:13:26Z"
  },
  {
    "title": "James Comey, one of Trump’s most frequent targets, indicted by prosector installed by president – live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/25/donald-trump-james-comey-fbi-ice-texas-latest-us-politics-news-updates-live",
    "image": "https://media.guim.co.uk/b3db41a23b873fec6659df36a1379b3cdc6a23e1/0_0_3000_2400/500.jpg",
    "summary": "Former FBI Director has been indicted for one count of making a false statement to Congress and another count of obstruction of justice. The charges stem from alleged misconduct during investigations. This marks a significant legal setback for the former official.",
    "published": "2025-09-25T23:10:00Z"
  },
  {
    "title": "White low-income pupils ‘report lowest enthusiasm for school’ in England",
    "url": "https://www.theguardian.com/education/2025/sep/26/white-low-income-pupils-report-lowest-enthusiasm-for-school-in-england",
    "image": "https://media.guim.co.uk/dc8c4e07c2a7e00672b3364df1086628d66f73dc/960_0_4800_3840/500.jpg",
    "summary": "Research indicates that boys and girls entering secondary school exhibit the lowest levels of engagement compared to other age groups. This trend raises concerns about their enthusiasm for learning and participation in school activities. Strategies may need to be implemented to boost engagement among these students.",
    "published": "2025-09-25T23:01:51Z"
  },
  {
    "title": "Clarkston review – Heartstopper’s Joe Locke joins lonely souls looking to make life matter",
    "url": "https://www.theguardian.com/stage/2025/sep/26/clarkston-review-joe-locke-ruaridh-mollica-samuel-d-hunter-trafalgar-theatre-london",
    "image": "https://media.guim.co.uk/4abfad6b14d7efb44c597cc2556c8eaf67c5100a/324_0_3148_2518/500.jpg",
    "summary": "Samuel D. Hunter's bleak three-hander features Ruaridh Mollica and Sophie Melville, delivering a powerful narrative. The play is characterized by its subtle yet impactful storytelling. The performances leave a profound impression, emphasizing the unspoken emotions in the characters' interactions.",
    "published": "2025-09-25T23:01:50Z"
  },
  {
    "title": "Fighter jets purchase would put UK in breach of nuclear treaty, says CND",
    "url": "https://www.theguardian.com/world/2025/sep/26/uk-fighter-jets-purchase-nuclear-treaty-cnd",
    "image": "https://media.guim.co.uk/bb4e6c1f674e2d9a7c50d3f0f1ba4394e9d84d3f/2320_590_3304_2643/500.jpg",
    "summary": "A legal opinion obtained by a campaign group argues that a recent deal signifies a reversal of the UK's commitment to nuclear disarmament. The group claims the agreement undermines the country's responsibilities under international treaties. This development has raised concerns among advocates for nuclear disarmament and peace.",
    "published": "2025-09-25T23:01:50Z"
  }
]