[
  {
    "title": "ITV shares surge as it holds talks to sell broadcast operations to Sky; world food prices fall – business live",
    "url": "https://www.theguardian.com/business/live/2025/nov/07/itv-talks-sell-broadcasting-arm-sky-shares-bank-of-england-stock-markets-business-live",
    "image": "https://media.guim.co.uk/00ce7b1fbe922b05084eb427bab3c5cca58210fc/239_0_3021_2417/500.jpg",
    "summary": "ITV is engaged in early talks with Sky about potentially selling its Media & Entertainment (M&E) division. The proposed deal has an enterprise value of £1.6 billion. No final agreement has been reached as discussions are ongoing.",
    "published": "2025-11-07T12:39:16Z"
  },
  {
    "title": "EU tightens rules on visas for Russians amid ongoing Ukraine aggression – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/nov/07/europe-latest-news-updates-belgium-airports-brussels-liege-drones-russia-orban-trump-ukraine",
    "image": "https://media.guim.co.uk/3a51f18bd25bbdab3fedbdb643f6da0f25ae9418/666_0_4300_3440/500.jpg",
    "summary": "Russian nationals can no longer obtain multiple-entry visas to the EU. They must now apply for visas individually for each trip. This change impacts their travel privileges significantly.",
    "published": "2025-11-07T12:39:11Z"
  },
  {
    "title": "Minister defends Lammy over mistaken prisoner releases as sex offender is recaptured – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/nov/07/uk-politics-latest-news-david-lammy-prisoners-labour-keir-starmer",
    "image": "https://media.guim.co.uk/b6359f3b609c171c0e308a5ba15b1cf0d7009ba7/323_0_4152_3323/500.jpg",
    "summary": "The accidental release of Brahim Kaddour-Cherif has increased pressure on the justice secretary, following a similar case involving a sex offender from Epping. This incident raises concerns about the effectiveness of the justice system in managing high-risk offenders. Calls for accountability and improved oversight are growing in light of these events.",
    "published": "2025-11-07T12:39:07Z"
  },
  {
    "title": "Tuchel ‘delighted’ to recall Bellingham and Foden; Amorim named manager of the month: football news – live",
    "url": "https://www.theguardian.com/football/live/2025/nov/07/thomas-tuchel-england-squad-jude-bellingham-weekend-team-news-and-more-football-live",
    "image": "https://media.guim.co.uk/906a70bbe6de1dfef1fffb2212c5a4b49e5f2b4c/0_0_5000_4000/500.jpg",
    "summary": "England manager Thomas Tuchel has announced his latest squad ahead of an exciting weekend with numerous Premier League matches. The announcement builds anticipation for the upcoming games. Fans are eager to see how the team performs with the selected players.",
    "published": "2025-11-07T12:38:15Z"
  },
  {
    "title": "Sung Im Her: 1 Degree Celsius review – ragtag band unite to call for climate reset",
    "url": "https://www.theguardian.com/stage/2025/nov/07/sung-im-her-1-degree-celsius-review-queen-elizabeth-hall-london",
    "image": "https://media.guim.co.uk/e685d4696e3ada4e3680072e209fa1daf0884ecd/130_0_2500_2000/500.jpg",
    "summary": "Seven dancers transform their climate anxiety into collective action, showcasing resilience and joy. Through their performance, they symbolize a shift from burden to empowerment in the face of global challenges. The piece emphasizes the importance of unity and hope in addressing climate issues.",
    "published": "2025-11-07T12:32:35Z"
  }
]