[
  {
    "title": "Trump calls for nations to close borders and expel foreigners in UN speech: ‘Your countries are being ruined’",
    "url": "https://www.theguardian.com/us-news/2025/sep/23/trump-un-general-assembly-speech",
    "image": "https://media.guim.co.uk/5f43c35496182bccfac3c662a4ebc9b82bb9a73a/0_0_3642_2913/500.jpg",
    "summary": "President Biden criticized European countries for what he called the \"destruction\" of their cultural heritage due to increased migration. He expressed concern that the influx of migrants could undermine the historical and cultural identity of these nations. This statement reflects ongoing debates over immigration policies and cultural preservation in Europe.",
    "published": "2025-09-23T15:34:17Z"
  },
  {
    "title": "Ed Davey warns NHS will be privatised and gun laws rolled back by ‘hypocrite’ Farage in Lib Dem conference speech – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/23/lib-dem-ed-davey-conference-donald-trump-keir-starmer-labour-reform-tory-latest-politics-live-news-updates",
    "image": "https://media.guim.co.uk/32ee691cb0e28e1ddf16cedba7db7c36ce3c4ab1/857_0_6830_5464/500.jpg",
    "summary": "The leader of the Liberal Democrats has called on Conservative voters to join his party, emphasizing a welcoming stance for those disillusioned with the Tories. He also targeted the Reform Party and far-right groups in the UK, positioning the Liberals as a moderate alternative. This appeal aims to unite voters seeking a change in the political landscape.",
    "published": "2025-09-23T15:30:03Z"
  },
  {
    "title": "Five things we learned from 107 Days, Kamala Harris’s campaign trail memoir",
    "url": "https://www.theguardian.com/us-news/2025/sep/23/kamala-harris-book-takeaways-107-days",
    "image": "https://media.guim.co.uk/1cf22a14ffa66e906d15156c493a9a64ea3a9ad0/599_0_6275_5021/500.jpg",
    "summary": "A former Democratic nominee reflects on peculiar moments from their campaign, highlighting tensions with President Biden. They delve into behind-the-scenes dynamics and explore alternative choices for vice-presidential running mates. The insights shed light on the complexities of political partnerships and campaign strategies.",
    "published": "2025-09-23T15:30:01Z"
  },
  {
    "title": "Trump attacks Europe on migration, Russian energy purchases and climate policies – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/sep/23/copenhagen-oslo-airport-drones-denmark-norway-russia-nato-estonia-europe-live-latest-news-updates",
    "image": "https://media.guim.co.uk/4208963a3a8e2c9fc93d9006f21b394ce1045803/921_463_4051_3241/500.jpg",
    "summary": "At the United Nations, US President criticized Europe's situation, stating it was \"going to hell.\" His remarks highlighted concerns over various challenges facing the continent. The statement has drawn attention and sparked discussions about Europe's current state.",
    "published": "2025-09-23T15:29:41Z"
  },
  {
    "title": "‘Our late-nightmare is over’: TV hosts celebrate Jimmy Kimmel’s return to air",
    "url": "https://www.theguardian.com/tv-and-radio/2025/sep/23/jimmy-kimmel-return-reaction",
    "image": "https://media.guim.co.uk/f7eb5476fc28fc87d8dcb6385f9a9dbcd597900e/701_0_6105_4886/500.jpg",
    "summary": "Late-night hosts acknowledged those who boycotted Disney in response to the company's indefinite suspension of Jimmy Kimmel. They emphasized that the backlash highlighted public support for Kimmel. The situation reflects the ongoing tension between media figures and corporate decisions.",
    "published": "2025-09-23T15:29:19Z"
  }
]