[
  {
    "title": "Australia politics live: Albanese withdraws same ‘unparliamentary’ term that sees Tehan ejected from question time",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/02/australia-politics-live-labor-coalition-anthony-albanese-sussan-ley-question-time-cosmetic-surgery-tobacco-excise-ntwnfb",
    "image": "https://media.guim.co.uk/4073a0d3df956db9ffae3f38da34d19a6cf1c584/600_0_5997_4798/500.jpg",
    "summary": "I'm sorry, but I need specific news content or details to provide a summary. Please share the news you'd like summarized, and I'll be happy to help!",
    "published": "2025-09-02T04:41:13Z"
  },
  {
    "title": "Country diary: Here’s a new one for the Lakes – lavender farming | Andrea Meanwell",
    "url": "https://www.theguardian.com/environment/2025/sep/02/country-diary-heres-a-new-one-for-the-lakes-lavender-farming",
    "image": "https://media.guim.co.uk/a6f0481ef51c84f06ee9504e0ea34e9dd73dab48/57_0_1890_1512/500.jpg",
    "summary": "In Lyth Valley, Lake District, the climate is ideal for growing damsons, a popular local crop. However, the author's visit is motivated by reasons other than the fruit. The focus shifts from agricultural interests to a different purpose.",
    "published": "2025-09-02T04:30:27Z"
  },
  {
    "title": " The plant-based problem: why vegan restaurants are closing – or adding meat to the menu",
    "url": "https://www.theguardian.com/food/2025/sep/02/plant-based-problem-why-vegan-restaurants-closing-or-adding-meat-menu",
    "image": "https://media.guim.co.uk/1bc5ae0a930bcc52be7822d66593de51144b0238/1_0_3732_2986/500.jpg",
    "summary": "Veganism continues to grow in popularity, yet numerous well-known vegan restaurants and chains are closing their doors. This trend raises questions about whether they are casualties of a challenging hospitality climate or a reflection of changing cultural values. The situation highlights a complex interplay between demand for vegan options and the sustainability of vegan businesses.",
    "published": "2025-09-02T04:00:28Z"
  },
  {
    "title": "Prominent UK women tell rightwingers: stop linking immigration to sexual abuse",
    "url": "https://www.theguardian.com/uk-news/2025/sep/02/women-stop-linking-asylum-seekers-sexual-abuse",
    "image": "https://media.guim.co.uk/bee4272c8c52a1b786be770c4b217cf7584dca82/0_0_4950_3960/500.jpg",
    "summary": "An open letter accuses politicians of using violence against women as a tool to incite hate and division among the public. The text criticizes the manipulation of such serious issues for political gain. Advocates are calling for a more constructive approach to address the problem.",
    "published": "2025-09-02T04:00:28Z"
  },
  {
    "title": "France has a massive debt crisis. So why is it spending billions a year subsidising business? | Alexander Hurst",
    "url": "https://www.theguardian.com/commentisfree/2025/sep/02/france-debt-crisis-business-government-collapse-austerity",
    "image": "https://media.guim.co.uk/8c56dbfba18458b07137196823483ad89da647af/169_0_4812_3851/500.jpg",
    "summary": "The government faces a potential collapse due to proposed austerity measures. Alexander Hurst argues that instead of austerity, the government should address issues related to its inflexible labor market. He emphasizes the need for reform to better handle economic challenges.",
    "published": "2025-09-02T04:00:26Z"
  }
]