[
  {
    "title": "Barcelona v PSG, Monaco v Manchester City and more: Champions League and Championship – live",
    "url": "https://www.theguardian.com/football/live/2025/oct/01/barcelona-v-psg-monaco-v-manchester-city-and-more-champions-league-and-championship-live",
    "image": "https://media.guim.co.uk/6779465d8048ae2792f2a5fb3c8ef38066879474/210_120_2554_2043/500.jpg",
    "summary": "Michael Butler will provide live updates on Wednesday's Champions League and Championship matches. Tune in for key moments and developments as the games unfold. Stay informed with real-time coverage of the matches.",
    "published": "2025-10-01T19:13:55Z"
  },
  {
    "title": "Arsenal v Olympiakos: Champions League – live",
    "url": "https://www.theguardian.com/football/live/2025/oct/01/arsenal-v-olympiakos-champions-league-live",
    "image": "https://media.guim.co.uk/e4a6ed03087ef37a6c2dd4eed14a7799a40cba9a/214_0_4419_3536/500.jpg",
    "summary": "Mikel Arteta's team aims to secure their second consecutive win in the league stage. John Brewin provides a minute-by-minute report to keep fans updated. Stay tuned for live updates and insights on the match.",
    "published": "2025-10-01T19:13:42Z"
  },
  {
    "title": "Israel tells Gaza aid flotilla to change course as activists say navy is intercepting boats – Middle East crisis live",
    "url": "https://www.theguardian.com/world/live/2025/oct/01/israel-gaza-aid-global-sumud-flotilla-middle-east-crisis-latest-updates",
    "image": "https://media.guim.co.uk/1dc8eff7cd550ab162294c9a1525393e9bf0e162/107_0_705_564/500.jpg",
    "summary": "The Global Sumud Flotilla, featuring around 500 activists including Greta Thunberg, is reportedly being approached by Israeli navy boats. In response, the Israeli foreign ministry has requested the flotilla to change its course. The situation raises tensions as the activists continue their mission.",
    "published": "2025-10-01T19:12:32Z"
  },
  {
    "title": "US government shutdown live: White House says ‘layoffs are imminent’ as JD Vance uses false claims to blame Democrats for shutdown",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/01/us-government-shutdown-update-2025-shutting-funding-trump-democrats-republicans-live-updates-latest-news",
    "image": "https://media.guim.co.uk/c3c341192462c427995c443709fedd57ab223dd0/450_0_4655_3724/500.jpg",
    "summary": "The vice president inaccurately stated that Democrats are aiming to finance healthcare for undocumented immigrants. Meanwhile, the press secretary warned that a government shutdown would negatively impact federal employees. Tensions rise as political rhetoric intensifies over funding and healthcare issues.",
    "published": "2025-10-01T19:10:59Z"
  },
  {
    "title": "Met plunged into crisis amid fresh claims of misogyny and racism",
    "url": "https://www.theguardian.com/uk-news/2025/oct/01/met-plunged-into-crisis-amid-fresh-claims-of-bigotry-and-excessive-force",
    "image": "https://media.guim.co.uk/34083fff3d2abc7fef0a4416c580b72bc5a343e6/405_0_2330_1864/500.jpg",
    "summary": "Commissioner Mark Rowley acknowledged that prejudice has become deeply ingrained within the police force following a BBC Panorama investigation. He emphasized the urgent need for reform to address these issues. The investigation has raised serious concerns about discrimination within the police.",
    "published": "2025-10-01T19:06:45Z"
  }
]