[
  {
    "title": "Australia news live: Dan Tehan says Liberals want to revive nuclear policy; a third of big companies paid no tax",
    "url": "https://www.theguardian.com/australia-news/live/2025/oct/02/australia-news-live-dan-tehan-liberals-nuclear-sussan-ley-coalition-anthony-albanese-labor-flotilla-bhp-china-ntwnfb",
    "image": "https://media.guim.co.uk/ed2a1f2e0c7fbd5994a1e8c4e056ddc12f119061/445_0_2109_1688/500.jpg",
    "summary": "I apologize, but it seems that there is no specific news provided for summarization. Please provide the details or content you'd like me to summarize, and I'll gladly assist!",
    "published": "2025-10-01T22:09:43Z"
  },
  {
    "title": "Trump administration suggests layoffs ‘imminent’ as some federal staff told to ‘blame Democrats’ in out of office email notes – live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/01/us-government-shutdown-update-2025-shutting-funding-trump-democrats-republicans-live-updates-latest-news",
    "image": "https://media.guim.co.uk/c3c341192462c427995c443709fedd57ab223dd0/450_0_4655_3724/500.jpg",
    "summary": "Reports indicate that employees of the Department of Health and Human Services were instructed to use their official email accounts to convey messages that blame Democrats. This directive has raised concerns about the misuse of government resources for political purposes. The situation highlights ongoing tensions between government agencies and political parties.",
    "published": "2025-10-01T22:09:02Z"
  },
  {
    "title": "Greta Thunberg arrested by Israeli forces after military boards aid flotilla headed for Gaza – Middle East crisis live",
    "url": "https://www.theguardian.com/world/live/2025/oct/01/israel-gaza-aid-global-sumud-flotilla-middle-east-crisis-latest-updates",
    "image": "https://media.guim.co.uk/1dc8eff7cd550ab162294c9a1525393e9bf0e162/107_0_705_564/500.jpg",
    "summary": "The Israeli foreign ministry shared a video showing climate activist Greta Thunberg being arrested. This occurred as vessels carrying around 500 activists were intercepted approximately 75 miles off the coast of the conflict-ridden area. The interception highlights ongoing tensions and the involvement of prominent figures in the region's issues.",
    "published": "2025-10-01T22:02:53Z"
  },
  {
    "title": "Paris Saint-Germain stun Barcelona with late Gonçalo Ramos winner",
    "url": "https://www.theguardian.com/football/2025/oct/01/barcelona-paris-saint-germain-match-report",
    "image": "https://media.guim.co.uk/13a2c047321dc94837e084ff9ebb33a8f0ef7bf2/279_92_3392_2713/500.jpg",
    "summary": "Ferran Torres put Barcelona in front with a first-half goal, but Paris Saint-Germain (PSG) responded strongly. PSG turned the match around with goals from Senny Mayulu and Gonçalo Ramos. Ultimately, PSG secured a 2-1 victory over Barcelona.",
    "published": "2025-10-01T21:38:58Z"
  },
  {
    "title": "Arsenal 2-0 Olympiakos: Champions League – as it happened",
    "url": "https://www.theguardian.com/football/live/2025/oct/01/arsenal-v-olympiakos-champions-league-live",
    "image": "https://media.guim.co.uk/e9abbfb43178bb15256ac9f00611bdd97d255c12/250_0_4644_3715/500.jpg",
    "summary": "Arsenal secured their second group-stage victory with goals from Gabriel Martinelli and a late strike by Bukayo Saka. The team showcased strong performance in the match. This win boosts their position in the tournament standings.",
    "published": "2025-10-01T21:34:11Z"
  }
]