[
  {
    "title": "What is an autopen and why can’t Trump stop talking about it?",
    "url": "https://www.theguardian.com/us-news/2025/nov/29/what-is-an-autopen-and-why-cant-trump-stop-talking-about-it",
    "image": "https://media.guim.co.uk/e76f429e377cc11182cd629ed59c306c52ba565d/447_0_6864_5496/500.jpg",
    "summary": "The first autopen was patented in the 1800s, enabling automatic signature replication. It has been utilized by numerous American presidents for signing documents. This invention has allowed for efficient processing of paperwork, especially during busy schedules.",
    "published": "2025-11-29T01:35:52Z"
  },
  {
    "title": "Trump news at a glance: president goes after Biden executive orders with baseless autopen claims",
    "url": "https://www.theguardian.com/us-news/2025/nov/29/trump-administration-news-updates-today",
    "image": "https://media.guim.co.uk/fcd85e45c85cbde48cae498f511144a64392e654/581_0_5000_4000/500.jpg",
    "summary": "Former President Donald Trump, without providing evidence, accused President Joe Biden of not personally authorizing certain orders in his latest criticism. This statement aligns with ongoing tensions between the two leaders as the political landscape heats up. The news reflects the critical and contentious nature of U.S. politics as the 2024 election approaches.",
    "published": "2025-11-29T01:21:58Z"
  },
  {
    "title": "Imran Sherwani, Great Britain Olympic hockey hero, dies aged 63",
    "url": "https://www.theguardian.com/sport/2025/nov/29/imran-sherwani-great-britain-olympic-hockey-hero-dies-aged-63",
    "image": "https://media.guim.co.uk/8565342cf39bf42310c09c460e25c59c673764d7/177_0_2003_1602/500.jpg",
    "summary": "Imran Sherwani, a member of the Great Britain hockey team that clinched Olympic gold in 1988, has passed away at the age of 63. His family made the announcement, grieving the loss of the athlete. Sherwani's contributions to hockey will be remembered by fans and fellow players alike.",
    "published": "2025-11-29T00:07:47Z"
  },
  {
    "title": "Weekend crossword No 777",
    "url": "https://www.theguardian.com/crosswords/weekend/777",
    "summary": "The weekend crossword No 777 presents an engaging challenge for puzzle enthusiasts. It features a variety of clues that test vocabulary and general knowledge. Many solvers enjoy the satisfaction of completing such crosswords as a leisurely weekend activity.",
    "published": "2025-11-29T00:00:21Z"
  },
  {
    "title": "Trump says he will cancel all Biden executive orders signed by autopen – as it happened ",
    "url": "https://www.theguardian.com/us-news/live/2025/nov/28/trump-washington-dc-shooting-politics-updates",
    "image": "https://media.guim.co.uk/fcd85e45c85cbde48cae498f511144a64392e654/581_0_5000_4000/500.jpg",
    "summary": "Trump has made unfounded claims on social media asserting that Biden did not personally authorize key orders, intensifying his ongoing campaign against his predecessor. This statement continues Trump's pattern of challenging Biden's decisions. The post highlights the ongoing political tensions between the two leaders.",
    "published": "2025-11-28T23:43:05Z"
  }
]