[
  {
    "title": "Australia politics live: Angus Taylor ejected after lights briefly go out during question time; childcare costs up 11% as inflation spikes",
    "url": "https://www.theguardian.com/australia-news/live/2025/nov/26/politics-live-labor-epbc-nature-laws-murray-watt-greens-coalition-anthony-albanese-sussan-ley-ted-obrien-national-press-club-ndis-fines-cpi-question-time-ntwnfb",
    "image": "https://media.guim.co.uk/45d9a0865d21a419bf18b4749f4c223662ee0d0b/28_0_6880_5504/500.jpg",
    "summary": "Please provide the news article you want summarized, and I'll be happy to help!",
    "published": "2025-11-26T04:22:40Z"
  },
  {
    "title": "Vitamin supplements with high levels of B6 will removed from general sale in Australia - here’s what you need to know",
    "url": "https://www.theguardian.com/australia-news/2025/nov/26/vitamin-supplements-with-high-levels-of-b6-will-removed-from-general-sale-in-australia-heres-what-you-need-to-know",
    "image": "https://media.guim.co.uk/536d0e74aa45ce99357115cc3581de245b51fd74/64_0_5084_4065/500.jpg",
    "summary": "The Therapeutic Goods Administration is implementing new regulations, prompting immediate action for compliance. In the meantime, individuals and businesses should stay informed about the upcoming rules. It's advisable to prepare by reviewing current practices and ensuring alignment with the expected guidelines.",
    "published": "2025-11-26T04:22:01Z"
  },
  {
    "title": "Matildas bubble not burst yet, claims Asian Cup chief, as big venues approach sell-outs ",
    "url": "https://www.theguardian.com/football/2025/nov/26/matildas-bubble-not-burst-yet-claims-asian-cup-chief-as-big-venues-approach-sell-outs",
    "image": "https://media.guim.co.uk/391aebcc8d0c0f5556429630d7a6e6b9ac326e65/422_0_4394_3514/500.jpg",
    "summary": "Organizers of the Women's Asian Cup are pleased with their decision to host Matildas matches in Australia's largest stadiums. The choice has proven successful, reflecting the strong support for women's soccer in the country. This move is seen as a validation of their efforts to elevate the profile of women's sports.",
    "published": "2025-11-26T04:02:09Z"
  },
  {
    "title": "Inflation up to 3.8% as price pressures rise and hopes for Reserve Bank interest rate cuts fall",
    "url": "https://www.theguardian.com/business/2025/nov/26/australia-inflation-rate-cpi-consumer-price-index-figure-rba-reserve-bank",
    "image": "https://media.guim.co.uk/859eb6012737d74f03453792c0cf92e2e9b5bf3b/382_0_3802_3043/500.jpg",
    "summary": "Treasurer Jim Chalmers announced that the government will decide on extending the energy rebate in the coming weeks. This decision comes as rising costs of living continue to impact households. The extension aims to provide financial relief to affected residents.",
    "published": "2025-11-26T03:49:44Z"
  },
  {
    "title": "All-male lineup take top slots at ABC Sydney after Chris Bath’s shock departure",
    "url": "https://www.theguardian.com/media/2025/nov/26/chris-bath-leaving-abc-sydney-all-male-lineup",
    "image": "https://media.guim.co.uk/e83bc8fa10bc3f5b7a92e917d959479d6a1e512d/142_99_4796_3837/500.jpg",
    "summary": "The director of audio acknowledges ongoing challenges in achieving diversity within the station, responding to staff concerns about the lack of female presenters. Despite efforts made, many employees feel the need for more significant changes. The director emphasizes the commitment to improving representation moving forward.",
    "published": "2025-11-26T03:42:37Z"
  }
]