[
  {
    "title": "Snooker’s answer to Luke Littler? Meet teenage sensation Stan Moody",
    "url": "https://www.theguardian.com/sport/2025/aug/31/snookers-answer-to-luke-littler-meet-teenage-sensation-stan-moody",
    "image": "https://media.guim.co.uk/50abe1fa4d627b32f7e97bef2fad805921b08119/366_0_3273_2618/500.jpg",
    "summary": "A Halifax young talent has broken into the world's top 64 in their sport, potentially bringing much-needed attention to the game in the UK. This achievement highlights their potential to inspire interest and growth in the sport. The athlete's success is seen as a catalyst for attracting a mainstream audience.",
    "published": "2025-08-31T07:00:23Z"
  },
  {
    "title": "Phenomenon Nick Woltemade has graceful flow to be Isak’s substitute",
    "url": "https://www.theguardian.com/football/2025/aug/31/nick-woltemade-alexander-isak-newcastle-stuttgart-bayern-munich-transfer-window",
    "image": "https://media.guim.co.uk/06f4f4b653bcaf2192baf5a4364028bfeebe11a8/374_0_3731_2984/500.jpg",
    "summary": "A German striker, previously linked to Bayern Munich, has declined their offer and is now set to join Newcastle. The transfer involves a £70 million deal, with the player eager to embrace the role of Newcastle's next iconic No 9. This decision marks a significant step in his career as he aims to make his mark at the club.",
    "published": "2025-08-31T07:00:23Z"
  },
  {
    "title": "Trump’s anti-press tactics are bad enough in the US. Now Reform is importing them to the Midlands | Jon Allsop",
    "url": "https://www.theguardian.com/commentisfree/2025/aug/31/donald-trump-press-us-reform-midlands-nottinghamshire-council",
    "image": "https://media.guim.co.uk/621348df62a58cb90abb9a3ff066d9b47b4f85cc/379_0_3009_2407/500.jpg",
    "summary": "Nottinghamshire council is adopting strategies similar to those of the US president, as highlighted by journalist Jon Allsop. However, Allsop warns that the council might underestimate the importance of media support in its initiatives. This shift in approach could lead to unforeseen challenges in garnering public and media backing.",
    "published": "2025-08-31T07:00:23Z"
  },
  {
    "title": "Neo-Nazis and politicians among protesters at anti-immigration March for Australia rallies",
    "url": "https://www.theguardian.com/australia-news/2025/aug/31/march-for-australia-neo-nazis-among-protesters-at-anti-immigration-rallies",
    "image": "https://media.guim.co.uk/a344a1e217f5a63156336dff2c2a329ac892e18d/219_0_1333_1067/500.jpg",
    "summary": "One Nation leader Pauline Hanson participated in a gathering in Canberra, highlighting her party's activities. Meanwhile, a far-right figure addressed a crowd outside the state parliament in Melbourne. Both events reflect ongoing tensions and developments within Australia's political landscape.",
    "published": "2025-08-31T06:59:35Z"
  },
  {
    "title": "Pauline Hanson joins crowds in Canberra as anti-immigration protests heat up across country – as it happened",
    "url": "https://www.theguardian.com/australia-news/live/2025/aug/31/australia-news-live-victoria-premier-anti-immigrant-protests-sydney-marathon-porepunkah-shooting-sunday-ntwnfb",
    "image": "https://media.guim.co.uk/8252ca3786a97d15d1feedc9cc42f5452d2cb8f7/428_0_5000_4000/500.jpg",
    "summary": "The blog has officially ceased operations. Readers will no longer have access to new content or updates. Thank you for your support during its run.",
    "published": "2025-08-31T06:03:30Z"
  }
]