[
  {
    "title": "Israeli hostages released: all living captives freed as Trump tells Knesset ‘age of terror’ is over – latest updates",
    "url": "https://www.theguardian.com/world/live/2025/oct/13/gaza-ceasefire-live-updates-israel-hostages-release-hamas-trump-middle-east",
    "image": "https://media.guim.co.uk/6ba849e25a3ab7eec8e3518a2e28c910b05f978a/243_0_3247_2597/500.jpg",
    "summary": "Donald Trump expressed pride in being referred to as the \"greatest friend Israel ever had in the White House\" following the release of hostages by Hamas. His comments come amid ongoing discussions about U.S.-Israel relations. The situation highlights the complexities of geopolitical dynamics in the region.",
    "published": "2025-10-13T12:40:30Z"
  },
  {
    "title": "French political crisis continues as Lecornu unveils new government – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/oct/13/france-political-crisis-lecornu-macron-sarkozy-ukraine-russia-gaza-europe-news-latest-updates",
    "image": "https://media.guim.co.uk/40fda9c4fcc0ddae98a6037c30580e54954c3faf/947_0_6172_4938/500.jpg",
    "summary": "Marine Le Pen and Éric Ciotti have united to submit a joint motion of no confidence against the government. This action is supported by the leftist party France Unbowed, which is also aiming to topple the current administration. The political alliance highlights growing dissent and instability within the French government.",
    "published": "2025-10-13T12:39:00Z"
  },
  {
    "title": "H is for Hawk review – Claire Foy is tremendously authentic in eccentric grief drama",
    "url": "https://www.theguardian.com/film/2025/oct/13/h-is-for-hawk-review-claire-foy-london-film-festival-helen-macdonald",
    "image": "https://media.guim.co.uk/33c257f482c9b7664c75f5cafa431cec320a05f8/501_0_5013_4011/500.jpg",
    "summary": "The film, adapted from Helen Macdonald's bestselling memoir, features Foy as a grieving academic who takes on the challenge of training a goshawk. Her performance effectively captures the emotional depth of loss and the complexities of nature. The story intertwines themes of grief, healing, and the bond between humans and animals.",
    "published": "2025-10-13T12:27:26Z"
  },
  {
    "title": "Richard Tice confirms Reform abandoning firm commitment to most of the £90bn tax cuts in its 2024 manifesto – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/oct/13/china-spy-trial-keir-starmer-egypt-margaret-thatcher-anniversary-uk-politics-live-news-updates",
    "image": "https://media.guim.co.uk/621b8996ca1041677f372d59e8a1755a20e6c81f/1835_0_6039_4831/500.jpg",
    "summary": "Reform UK's deputy leader has clarified that their tax cut plans have shifted from being a firm commitment to merely an aspiration. This change in language suggests a potential softening of their fiscal policy. The statement highlights ongoing challenges related to delivering on such promises.",
    "published": "2025-10-13T12:27:18Z"
  },
  {
    "title": "Tennessee community mourns 16 killed in munitions plant explosion",
    "url": "https://www.theguardian.com/us-news/2025/oct/13/tennessee-munitions-plant-explosion",
    "image": "https://media.guim.co.uk/1923e36236ff2fed38708adb0373c43a01d587ac/391_0_4605_3684/500.jpg",
    "summary": "The explosion at Accurate Energetic Systems, which completely demolished a building, remains unexplained. Investigators have ruled out foul play as a potential cause. Further inquiries are ongoing to determine the factors leading to the incident.",
    "published": "2025-10-13T12:24:48Z"
  }
]