[
  {
    "title": "Euro and Paris stock market slide as French prime minister Sebastien Lecornu resigns – business live",
    "url": "https://www.theguardian.com/business/live/2025/oct/06/yen-slumps-nikkei-record-sanae-takaichi-wins-election-gold-nears-4000-rally-continues-business-live-news",
    "image": "https://media.guim.co.uk/bcc4965e0a3de7e5575e75c132ebc3449419bcc8/553_0_5525_4420/500.jpg",
    "summary": "Financial markets are experiencing fluctuations due to various economic indicators and reports. Analysts are closely monitoring unemployment rates, inflation data, and central bank policies for potential impacts. Investors are advised to stay alert as global economic conditions continue to evolve.",
    "published": "2025-10-06T08:20:15Z"
  },
  {
    "title": "Stride defends Tory plan to slash overseas aid spending to 0.1% of national income – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/oct/06/conservative-tory-party-conference-spending-welfare-immigration-labour-starmer-reform-uk-politics-live-news-updates",
    "image": "https://media.guim.co.uk/9add19123acfc62b1b4f9ed143473300bf9cd54c/1153_374_3351_2681/500.jpg",
    "summary": "During the Tory party conference in Manchester, the Shadow Chancellor outlined comprehensive cost-cutting measures aimed at economic recovery. These plans focus on reducing government spending while addressing key issues like inflation and public services. The proposals aim to strengthen the party's fiscal strategy ahead of upcoming elections.",
    "published": "2025-10-06T08:15:45Z"
  },
  {
    "title": "Gaza ceasefire talks live: Trump urges negotiators to ‘move fast’ as meeting set to begin in Egypt",
    "url": "https://www.theguardian.com/world/live/2025/oct/06/gaza-ceasefire-peace-talks-hamas-israel-trump-egypt-middle-east-crisis-live-news-updates",
    "image": "https://media.guim.co.uk/77ffa5338dab959754bd7baa17c38be9d8403031/357_0_4748_3798/500.jpg",
    "summary": "Negotiators from the US, Israel, and Hamas are scheduled to start discussions in Egypt. The US president indicated that the first phase of talks is expected to conclude within the week. This meeting aims to address ongoing tensions in the region.",
    "published": "2025-10-06T08:15:29Z"
  },
  {
    "title": "Nearly a third of bosses report increase in cyber-attacks on their supply chains ",
    "url": "https://www.theguardian.com/business/2025/oct/06/nearly-a-third-of-bosses-report-increase-in-cyber-attacks-on-their-supply-chains",
    "image": "https://media.guim.co.uk/2a0c0e0952f82e73fcf8be9a3f45762dc8d6fe0d/347_0_2807_2246/500.jpg",
    "summary": "A recent CIPS survey indicates that procurement managers are increasingly prioritizing cyber threats among their top concerns. The rise in digital vulnerabilities highlights the need for enhanced cybersecurity measures within procurement processes. This shift reflects growing awareness of the potential impact of cyber risks on business operations.",
    "published": "2025-10-06T08:00:58Z"
  },
  {
    "title": "The Elements by John Boyne review – intertwined tales of trauma",
    "url": "https://www.theguardian.com/books/2025/oct/06/the-elements-by-john-boyne-review-intertwined-tales-of-trauma",
    "image": "https://media.guim.co.uk/8c28c459137c2612817f5c3382c1793142b56966/455_38_4479_3584/500.jpg",
    "summary": "Four novellas explore the lives of damaged individuals burdened by the crimes they've endured. While the storytelling captivates initially, the overall impact becomes emotionally overwhelming. Ultimately, the series may leave readers with a sense of numbness rather than resolution.",
    "published": "2025-10-06T08:00:58Z"
  }
]