[
  {
    "title": "Thousands in England unable to access weight loss jabs via GP, figures reveal",
    "url": "https://www.theguardian.com/society/2025/sep/04/mounjaro-weight-loss-jabs-access-nhs-gp",
    "image": "https://media.guim.co.uk/dd8b5a330c676f676bb7bf9dfe06cf06d589eb8f/480_0_4410_3527/500.jpg",
    "summary": "Doctors have criticized the NHS rollout of Mounjaro, stating that it's inadequate, as less than half of the commissioning bodies are prescribing the medication. This limited accessibility raises concerns about the effectiveness and reach of the program. The situation highlights ongoing challenges in the NHS's approach to new treatments.",
    "published": "2025-09-04T22:30:06Z"
  },
  {
    "title": "Australia news live: Albanese holds ‘constructive’ phone call with Trump; two die on road trying to save kangaroo",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/05/australia-news-live-albanese-trump-tariffs-meeting-porepunkah-police-officer-funerals-ntwnfb",
    "image": "https://media.guim.co.uk/a67e7b107aeb1936688d9fcfe28d8854802b053c/0_1_5000_3998/500.jpg",
    "summary": "Please provide the specific news article or details you'd like summarized, and I'll be happy to help!",
    "published": "2025-09-04T22:26:46Z"
  },
  {
    "title": "Fired health official offers to testify under oath after RFK Jr accused her of lying in heated Senate hearing – live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/04/donald-trump-tariffs-immigration-technology-epstein-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/3b26904f7b22257a97a56722544fab5915e691d1/500_0_5000_4000/500.jpg",
    "summary": "The former CDC director, recently dismissed, has stated she is willing to testify about her experience regarding pressure to approve a panel that included individuals with anti-vaccine opinions. Her statement comes in response to accusations of dishonesty from RFK Jr. The controversy highlights ongoing tensions surrounding public health messaging and the influence of differing viewpoints on vaccine safety.",
    "published": "2025-09-04T22:23:39Z"
  },
  {
    "title": "European leaders press Trump over peacekeeper plan for Ukraine",
    "url": "https://www.theguardian.com/world/2025/sep/04/european-leaders-pressure-trump-to-reveal-how-much-support-us-will-give-ukraine",
    "image": "https://media.guim.co.uk/7e3e9d81cbb1f7c77b148fd40553fadfda48e4d9/200_0_4005_3204/500.jpg",
    "summary": "Leaders have urged the president to clarify the security guarantees the U.S. could provide to a European force if a ceasefire is established. This call highlights concerns about the stability and protection of European allies. The discussion aims to strengthen support and assurance in the face of ongoing conflicts.",
    "published": "2025-09-04T22:16:55Z"
  },
  {
    "title": "UK failing Gaza by allowing jets with British parts to bomb hospitals, says surgeon",
    "url": "https://www.theguardian.com/world/2025/sep/04/uk-failing-gaza-by-allowing-jets-with-british-parts-to-bomb-hospitals-says-surgeon",
    "image": "https://media.guim.co.uk/b511dfe7fd071aaeeb5dd2fb83a737a8eb8aa54f/418_0_6439_5151/500.jpg",
    "summary": "Prof. Nick Maynard stated before an independent Gaza tribunal that it is \"inconceivable\" for Hamas to use hospitals as command centers. His comments come amidst ongoing tensions and accusations regarding warfare practices. The statement highlights concerns over the implications for civilian safety in conflict areas.",
    "published": "2025-09-04T22:03:11Z"
  }
]