[
  {
    "title": "Giorgio Armani’s final show: a catwalk memorial choreographed by himself",
    "url": "https://www.theguardian.com/fashion/2025/sep/29/giorgio-armanis-final-show-a-catwalk-memorial-choreographed-by-himself",
    "image": "https://media.guim.co.uk/8ab9470ec7a0885d3d3331a8692dfb788728deea/452_0_4520_3616/500.jpg",
    "summary": "A designer's 50th anniversary celebration turned out to be both somber and lavish, exceeding his original expectations. The event evoked a mix of emotions, highlighting reflections on the past. Ultimately, it became a grand homage to his career and contributions to the field.",
    "published": "2025-09-29T08:24:10Z"
  },
  {
    "title": "Moldova voters choose pro-EU government over Moscow-leaning alliance – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/sep/29/moldova-voters-pro-eu-government-russia-drones-europe-live",
    "image": "https://media.guim.co.uk/b5ee027ff34740dacd919e5428404ea832a216b7/876_0_5201_4161/500.jpg",
    "summary": "President Maia Sandu of Moldova accused Russia of employing covert tactics to influence the country's voters. She expressed concern over external interference in the electoral process. Sandu's statements highlight ongoing tensions between Moldova and Russia regarding political influence.",
    "published": "2025-09-29T08:23:28Z"
  },
  {
    "title": "Pharma shake-up: Surprise change of CEO at GSK, as AstraZeneca announces New York stock market listing – business live",
    "url": "https://www.theguardian.com/business/live/2025/sep/29/moral-hazard-fears-jlr-jaguar-land-rover-government-loan-gsk-ceo-astrazeneca-listing-dollar-shutdown-business-live-news",
    "image": "https://media.guim.co.uk/93a963962303e4034d3bdd8149d02e3940fdd356/333_0_3333_2668/500.jpg",
    "summary": "Financial markets are experiencing volatility due to changing economic indicators and global events. Analysts are closely monitoring inflation rates, interest adjustments, and the impact of geopolitical tensions. Investor sentiment remains cautious as central banks respond to evolving economic conditions.",
    "published": "2025-09-29T08:16:45Z"
  },
  {
    "title": "Half Light by Mahesh Rao review – a tale of forbidden love in India",
    "url": "https://www.theguardian.com/books/2025/sep/29/half-light-by-mahesh-rao-review-a-tale-of-forbidden-love-in-india",
    "image": "https://media.guim.co.uk/1fa6407acb34e47f33980c1807b398e571b23ae3/541_0_4680_3744/500.jpg",
    "summary": "In Darjeeling, a tumultuous love affair between two men ends violently, highlighting themes of heartbreak and secrecy. The narrative shifts to their separate lives in Mumbai, exploring the aftermath of their relationship. Ultimately, the story delves into the complexities of love and individual journeys.",
    "published": "2025-09-29T08:00:36Z"
  },
  {
    "title": "Occult objects, a dead dynasty and a mobile bookshop: ten cosy new video games for autumn",
    "url": "https://www.theguardian.com/games/2025/sep/29/occult-objects-a-dead-dynasty-and-a-mobile-bookshop-ten-cosy-new-video-games-for-autumn",
    "image": "https://media.guim.co.uk/062bce0e02f28e4bc356574ce516be62a4de819d/186_0_5600_4480/500.jpg",
    "summary": "As colder weather sets in, a roundup of top gaming recommendations highlights a variety of immersive experiences. The list features shopkeeping simulations and engaging dating games perfect for cozy indoor play. These titles promise to provide enjoyable entertainment as the seasons change.",
    "published": "2025-09-29T08:00:35Z"
  }
]