[
  {
    "title": "Budget 2025 live: Rachel Reeves scraps two-child benefit cap and raises taxes as OBR apologises for leaking details",
    "url": "https://www.theguardian.com/uk-news/live/2025/nov/26/budget-2025-rachel-reeves-tax-cash-isa-minimum-wage-latest-news-updates",
    "image": "https://media.guim.co.uk/bdad1af31f722ce81ef2ae9113629a4bd79d76c9/316_0_1350_1080/500.jpg",
    "summary": "The Office for Budget Responsibility (OBR) attributed the premature publication of fiscal forecasts to a \"technical error.\" This occurred shortly before the chancellor was set to deliver her statement. The incident raised concerns about the handling of sensitive financial information.",
    "published": "2025-11-26T13:33:03Z"
  },
  {
    "title": "Ex-Countdown champion detained in hospital after attacking rival player with knife",
    "url": "https://www.theguardian.com/tv-and-radio/2025/nov/26/ex-countdown-champion-detained-in-hospital-after-attacking-rival-player-with-knife",
    "image": "https://media.guim.co.uk/45715811aad0af06df157963258e9bf777ef8d15/107_0_686_549/500.jpg",
    "summary": "John Cowen, a man with schizophrenia, will stay in the hospital for an indefinite period following his attack on a player during a tournament. The incident raised concerns about his mental health and public safety. Authorities have decided that hospitalization is the best course of action for both Cowen and the community.",
    "published": "2025-11-26T13:29:53Z"
  },
  {
    "title": "Russia welcomes ‘aspects’ of new US plan to end Ukraine war – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/nov/26/russia-ukraine-war-peace-plan-europe-latest-news-updates",
    "image": "https://media.guim.co.uk/5e8cb749d8f50161a3d089c9b00ce1c7b01fc343/280_0_3065_2452/500.jpg",
    "summary": "Kremlin aide Yuri Ushakov indicated that certain aspects of an undisclosed plan will necessitate expert-level discussions. He suggested that these parts are sensitive or complex and not ready for public disclosure. The discussions aim to ensure thorough consideration before any potential announcements.",
    "published": "2025-11-26T13:29:48Z"
  },
  {
    "title": "How does freezing tax thresholds affect your own tax bill?",
    "url": "https://www.theguardian.com/uk-news/ng-interactive/2025/nov/26/how-does-freezing-tax-thresholds-affect-your-own-tax-bill",
    "image": "https://media.guim.co.uk/cc914bb7529b48ff63508f8cd64699218e04e19e/1_0_4998_4000/500.png",
    "summary": "Rachel Reeves is freezing tax thresholds to address the gap in the public accounts. This decision may impact individual tax bills for many. Details on how it will specifically affect taxpayers are yet to be fully outlined.",
    "published": "2025-11-26T13:29:19Z"
  },
  {
    "title": "Departing Marjorie Taylor Greene ‘the canary in the coal mine’ for Republicans, says former House speaker – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/nov/26/us-politics-latest-news-pete-hegseth-donald-trump-marjorie-taylor-greene-mark-kelly",
    "image": "https://media.guim.co.uk/2109e72e5ddba8029b809e0c5a54af8add559cfc/836_0_4313_3451/500.jpg",
    "summary": "Kevin McCarthy noted that the departure of a Trump loyalist who became critical reflects deeper issues within the Republican Party. He indicated that this exit signifies challenges the party may face moving forward. McCarthy's comments highlight concerns about unity and direction among GOP members.",
    "published": "2025-11-26T13:22:33Z"
  }
]