[
  {
    "title": "Europa League: Aston Villa v Maccabi Tel Aviv, Rangers v Roma, and more – live",
    "url": "https://www.theguardian.com/football/live/2025/nov/06/europa-league-aston-villa-v-maccabi-tel-aviv-rangers-v-roma-and-more-live",
    "image": "https://media.guim.co.uk/58b6afd37dea0191f64303704c310b8195890974/190_0_2674_2139/500.jpg",
    "summary": "Aston Villa is set to face Maccabi Tel Aviv in the Europa League, while Rangers will take on a tough challenge against Roma. Michael Butler will be covering the matches. Both games promise to be exciting encounters for the clubs.",
    "published": "2025-11-06T21:17:46Z"
  },
  {
    "title": "Trump claims his tariffs are matter of ‘national security’ after supreme court appears skeptical – live",
    "url": "https://www.theguardian.com/us-news/live/2025/nov/06/donald-trump-government-shutdown-venezuela-senate-vote-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/4ec6b889773d1d5bcb5c8deadafe905a500e4189/217_0_3333_2667/500.jpg",
    "summary": "The President asserts that tariffs are crucial for the nation's economic survival, claiming they distinguish between success and bankruptcy. He warns that a court ruling against the tariffs could have severe negative consequences. The statements underscore the administration's commitment to protecting domestic industries.",
    "published": "2025-11-06T21:17:43Z"
  },
  {
    "title": "Australia news live: Liberal MP says Sussan Ley ‘losing support’ and declines to back her as leader",
    "url": "https://www.theguardian.com/australia-news/live/2025/nov/07/australia-news-live-sussan-ley-coalition-liberals-nationals-leadership-senate-anthony-albanese-labor-net-zero-ntwnfb",
    "image": "https://media.guim.co.uk/bc66a96735c139f16356d67de3293e19a8b607d9/657_123_5444_4355/500.jpg",
    "summary": "I'm sorry, but I cannot access live news updates or specific articles. However, if you provide me with the main details or content of the news you'd like summarized, I'd be happy to help!",
    "published": "2025-11-06T21:15:45Z"
  },
  {
    "title": "The Celebrity Traitors final – live",
    "url": "https://www.theguardian.com/tv-and-radio/live/2025/nov/06/the-celebrity-traitors-final-live",
    "image": "https://media.guim.co.uk/47ac80980263407d35a6d4850a16cdc26ef2325f/0_116_3159_2524/500.jpg",
    "summary": "The inaugural star-studded edition of the BBC's popular show concludes tonight. Tensions rise as viewers wonder if the loyal contestants will unite or if the traitors will keep deceiving everyone, with Joe Marler being the exception. The finale promises to reveal who will triumph in this gripping social game.",
    "published": "2025-11-06T21:15:41Z"
  },
  {
    "title": "Corrections and clarifications",
    "url": "https://www.theguardian.com/news/2025/nov/06/corrections-and-clarifications",
    "summary": "King Charles attended a Catholic mass in a show of interfaith respect, highlighting his commitment to religious diversity. Meanwhile, the Green Party is addressing environmental issues, emphasizing urgent action against climate change. Both events reflect ongoing dialogues about faith and sustainability in contemporary society.",
    "published": "2025-11-06T21:00:07Z"
  }
]