[
  {
    "title": "Utah officials share video of Charlie Kirk shooting suspect as governor pledges death penalty - live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/11/charlie-kirk-shot-latest-news-updates-utah-university-donald-trump",
    "image": "https://media.guim.co.uk/d8cfa6157556efb50498631a804138f433f155df/0_0_2500_2000/500.jpg",
    "summary": "A briefing has been held after four new images of a suspect were released in a criminal investigation. Authorities are offering a reward of $100,000 for information leading to the suspect's capture. This development aims to encourage public assistance in solving the case.",
    "published": "2025-09-12T05:32:30Z"
  },
  {
    "title": "Australia news live: Labor approves extension of Woodside’s North West Shelf gas export project until 2070",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/12/anthony-albanese-pacific-islands-forum-woodside-north-west-shelf-decision-sussan-ley-labor-coalition-ntwnfb",
    "image": "https://media.guim.co.uk/3eda66735bf1b8bb18f71ba08ce1009970f28e68/344_0_5228_4183/500.jpg",
    "summary": "Please provide the news article or details you'd like summarized, and I'll be happy to help!",
    "published": "2025-09-12T05:26:23Z"
  },
  {
    "title": "Prince Harry makes surprise visit to Ukraine pledging support for thousands injured in war",
    "url": "https://www.theguardian.com/uk-news/2025/sep/12/prince-harry-ukraine-visit-kyiv",
    "image": "https://media.guim.co.uk/216ae0cf56521879f5b39b8a6c8726681dc215b0/138_0_3413_2732/500.jpg",
    "summary": "Prince Harry and his team from the Invictus Games Foundation have received an invitation to Kyiv, where they will unveil new initiatives aimed at supporting wounded veterans. This visit underscores their ongoing commitment to the well-being of ill and injured service members. Further details about the initiatives will be shared during their time in Ukraine.",
    "published": "2025-09-12T05:22:22Z"
  },
  {
    "title": "TV tonight: The Office spin-off The Paper hits its stride",
    "url": "https://www.theguardian.com/tv-and-radio/2025/sep/12/tv-tonight-the-office-spin-off-the-paper-hits-its-stride",
    "image": "https://media.guim.co.uk/fef863b929f519c866661fbe1eda6fd3d752d08b/110_0_2500_2000/500.jpg",
    "summary": "The Toledo Truth Teller faces undercover operations and sabotage in its newsroom. Additionally, Robert Eggers has released a remake of a classic 1922 horror film. Tune in this evening for more details on these developments.",
    "published": "2025-09-12T05:20:26Z"
  },
  {
    "title": "Friday briefing: What the killing of Charlie Kirk means for a polarised country",
    "url": "https://www.theguardian.com/world/2025/sep/12/friday-briefing-what-the-killing-of-charlie-kirk-means-for-a-polarised-country",
    "image": "https://media.guim.co.uk/3446dae70c13b7747f5928ccf8ef66872af48180/474_0_4736_3789/500.jpg",
    "summary": "Today's newsletter analyzes the recent assassination of a key figure in the MAGA movement, dubbed the 'youth whisperer.' It explores the incident within the context of increasing political violence in the United States. The discussion aims to understand the implications of this event on the current political landscape.",
    "published": "2025-09-12T05:17:34Z"
  }
]