[
  {
    "title": "Australia news live: PM takes aim at Ley over climate target comment; NSW Greens push for laws to keep cats inside",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/19/australia-news-live-cheaper-energy-chris-bowen-climate-bush-search-crashed-plane-pilot-julie-bishop-ntwnfb",
    "image": "https://media.guim.co.uk/48a04baa16f023c83da76ad54494c4539f55b8bb/1612_200_4281_3427/500.jpg",
    "summary": "Could you please provide the news article or information you'd like me to summarize?",
    "published": "2025-09-19T06:49:41Z"
  },
  {
    "title": "Chancellor’s problems deepen as UK government borrowing jumps in August, and consumer confidence slips – business live",
    "url": "https://www.theguardian.com/business/live/2025/sep/19/uk-government-borrowing-rises-consumer-confidence-slips-reeves-budget-business-live-news",
    "image": "https://media.guim.co.uk/156005abd5022a48f2801c0646db8d04e1e02dfe/264_0_6827_5464/500.jpg",
    "summary": "Stay updated with continuous coverage of the latest developments in the economy and financial markets. Key updates include market trends, policy changes, and economic indicators impacting global financial stability. Analysts provide insights on how these factors affect investments and the broader economy.",
    "published": "2025-09-19T06:49:03Z"
  },
  {
    "title": "Seven teenagers charged with murder after stabbing deaths of two boys in Melbourne",
    "url": "https://www.theguardian.com/australia-news/2025/sep/19/seven-teenagers-arrested-over-stabbing-deaths-of-two-teenagers-in-melbourne-ntwnfb",
    "image": "https://media.guim.co.uk/da1c41a5aaaa12b02c4b1897de6f0128d0778b24/0_0_5000_4000/500.jpg",
    "summary": "Two individuals have been charged following tragic incidents in Cobblebank on September 6, which led to the deaths of 15-year-old Dau Akueng and 12-year-old Chol Achiek. The charges stem from circumstances surrounding these fatalities. Investigations into the incidents are ongoing.",
    "published": "2025-09-19T06:46:10Z"
  },
  {
    "title": "For comedians around the world, the laughs often end as democracy fades",
    "url": "https://www.theguardian.com/world/2025/sep/19/for-comedians-around-the-world-the-laughs-often-end-as-democracy-fades",
    "image": "https://media.guim.co.uk/4e1abd6580cea2c886b5b49cee3fb193beed1c9e/563_33_1017_814/500.jpg",
    "summary": "The recent silencing of Jimmy Kimmel raises concerns about freedom of expression in the U.S., drawing parallels to tactics used by authoritarian regimes in countries like Egypt and India. Critics argue that this trend threatens the integrity of democratic discourse. The situation highlights the growing challenges faced by public figures in freely expressing their views.",
    "published": "2025-09-19T06:40:10Z"
  },
  {
    "title": "UK borrowing rises to worse-than-expected £18bn in August",
    "url": "https://www.theguardian.com/business/2025/sep/19/uk-borrowing-budget-rachel-reeves",
    "image": "https://media.guim.co.uk/6a45b18070d834b20f2637ae0f4dc5b4296c83d1/595_0_4899_3922/500.jpg",
    "summary": "The Treasury is set to present a budget that is anticipated to include tax increases aimed at addressing a significant budget deficit. This projected deficit highlights the need for fiscal measures to stabilize the economy. The proposed tax rises aim to restore financial balance amidst ongoing financial challenges.",
    "published": "2025-09-19T06:06:19Z"
  }
]