[
  {
    "title": "Manchester United v Arsenal: Women’s Super League – live",
    "url": "https://www.theguardian.com/football/live/2025/sep/21/manchester-united-v-arsenal-womens-super-league-live",
    "image": "https://media.guim.co.uk/0e8234af7a3a7206677bcc5fb2aa01de253e0926/126_0_2020_1615/500.jpg",
    "summary": "Emillia Hawkins is providing a minute-by-minute report on an exciting event in Leigh, where two 100% WSL records are set to be challenged. The atmosphere is charged as participants aim to make history. Stay tuned for live updates on the unfolding action.",
    "published": "2025-09-21T15:27:58Z"
  },
  {
    "title": "Arsenal v Manchester City: Premier League – live",
    "url": "https://www.theguardian.com/football/live/2025/sep/21/arsenal-v-manchester-city-premier-league-live-score-updates",
    "image": "https://media.guim.co.uk/8863b84b70a0f29c496d8fba24ab3113bb565e14/622_0_7200_5760/500.jpg",
    "summary": "Two title contenders are facing off in north London, and Rob Smyth is providing live updates on the match. Fans can follow along for real-time developments and insights as the game unfolds. Stay tuned for the latest news and highlights.",
    "published": "2025-09-21T15:25:04Z"
  },
  {
    "title": "Hundreds plunge in Chicago River for first official swim in nearly 100 years",
    "url": "https://www.theguardian.com/us-news/2025/sep/21/chicago-river-swim",
    "image": "https://media.guim.co.uk/5dce02253af926ceb9c05a6301b7bf379650bf07/660_0_4926_3941/500.jpg",
    "summary": "A group undertook a mile-long swim in a previously polluted river, showcasing a significant milestone in environmental cleanliness. This event marks a pivotal moment following key progress made by the U.S. in efforts to clean up polluted waterways. The swim symbolizes hope and community engagement in restoring natural habitats.",
    "published": "2025-09-21T15:24:42Z"
  },
  {
    "title": "UK recognises Palestine as an independent state",
    "url": "https://www.theguardian.com/uk-news/2025/sep/21/uk-recognises-palestine-as-an-independent-state",
    "image": "https://media.guim.co.uk/4ebf5b388ecfc7a4002ba9822bb552e74a684c33/462_0_4617_3693/500.jpg",
    "summary": "Keir Starmer announced a policy shift regarding the UK's stance on Israel and Palestine, marking the 70th anniversary of the end of the British mandate in Palestine. This announcement reflects the ongoing complexities of the region's historical context. Starmer’s statement aims to address current issues and potentially reshape UK foreign relations in the Middle East.",
    "published": "2025-09-21T15:24:42Z"
  },
  {
    "title": "Ireland v England: third men’s T20 cricket international – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/21/cricket-ireland-v-england-third-mens-t20-cricket-international-live",
    "image": "https://media.guim.co.uk/c3fe1487c2eba37cf766f01f1a0b0c17093a2076/1461_0_1431_1146/500.jpg",
    "summary": "In the third match of the series at Malahide, James Wallace provided detailed over-by-over coverage. The match showcased key performances and shifts in momentum. Fans and analysts eagerly followed the game's progress as it unfolded.",
    "published": "2025-09-21T15:24:23Z"
  }
]