[
  {
    "title": "Charlie Kirk memorial: Trump arrives inside stadium to cheers as tens of thousands attend service - latest updates",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/21/charlie-kirk-funeral-memorial-time-updates-arizona",
    "image": "https://media.guim.co.uk/b97ac5cf4483d7b6b379de2c2f188baef7303123/148_0_5000_4000/500.jpg",
    "summary": "The US president is set to speak at an event in Glendale, Arizona, attracting attention from notable right-wing commentators. Among the attendees are Steve Bannon and Elon Musk. The gathering underscores the ongoing influence of such figures in contemporary political discourse.",
    "published": "2025-09-21T20:23:40Z"
  },
  {
    "title": "Mikel Arteta is allowed to learn, but time won’t wait for him | Barney Ronay",
    "url": "https://www.theguardian.com/football/2025/sep/21/mikel-arteta-arsenal-pep-guardiola-manchester-city-premier-league",
    "image": "https://media.guim.co.uk/c751261d782026263cfb9de1f5d5653a582608a3/1_0_2429_1944/500.jpg",
    "summary": "The manager only adopted an aggressive strategy against Manchester City after the halftime break, when his team was trailing by one goal. This shift aimed to equalize and change the course of the match. Previously, the team's approach had been more cautious.",
    "published": "2025-09-21T20:11:31Z"
  },
  {
    "title": "Latest recognitions of Palestinian state will deepen global diplomatic rifts",
    "url": "https://www.theguardian.com/world/2025/sep/21/latest-recognitions-of-palestinian-state-will-deepen-global-diplomatic-rifts",
    "image": "https://media.guim.co.uk/bca4c3a86e5fa2f95626ced81b245e010a07a24a/374_0_3722_2979/500.jpg",
    "summary": "Israel has warned of potential annexations in the West Bank in response to escalating tensions. Concurrently, the UK, Canada, and Australia have made announcements that may further heighten friction with the United States. This situation reflects a complex geopolitical landscape fraught with conflict and differing national interests.",
    "published": "2025-09-21T20:00:52Z"
  },
  {
    "title": "Corrections and clarifications",
    "url": "https://www.theguardian.com/news/2025/sep/21/corrections-and-clarifications1",
    "summary": "Yvette Cooper and Wes Streeting, prominent UK politicians, have recently made headlines. They discussed key policy issues and the need for renewed focus on public services. Their statements emphasize the importance of addressing current challenges facing the nation.",
    "published": "2025-09-21T20:00:52Z"
  },
  {
    "title": "At least 40 killed in Gaza and five in Lebanon in Israeli strikes",
    "url": "https://www.theguardian.com/world/2025/sep/21/at-least-40-killed-in-gaza-and-five-in-lebanon-in-israeli-strikes",
    "image": "https://media.guim.co.uk/1a433d58eb00036d967a91d0ff05b7bed7fa1a3b/670_0_6159_4928/500.jpg",
    "summary": "The military intensifies its campaign to take control of Gaza City, focusing on high-rise buildings as key targets. Authorities have ordered residents to evacuate the area amid escalating tensions. The situation continues to develop, with increasing concerns for civilian safety.",
    "published": "2025-09-21T19:49:05Z"
  }
]