[
  {
    "title": "Judge blocks suspension of Snap food aid during shutdown – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/31/donald-trump-filibuster-shutdown-snap-food-refugees-drug-boats-latest-news-updates",
    "image": "https://media.guim.co.uk/07b229d1eac114f30d6758b19b617cbe5a13903d/421_0_6569_5254/500.jpg",
    "summary": "A federal court ruling was issued just hours before potential cuts to food stamp benefits affecting over 40 million Americans. The decision may significantly impact low-income households reliant on these assistance programs. The ruling highlights ongoing legal battles surrounding food security initiatives in the U.S.",
    "published": "2025-10-31T19:14:29Z"
  },
  {
    "title": "Trump administration blocked from suspending Snap benefits for millions of Americans",
    "url": "https://www.theguardian.com/us-news/2025/oct/31/judge-blocks-trump-snap-suspension",
    "image": "https://media.guim.co.uk/f9d2e6cdc61b8fdc2a7babec150550ec6eea7d7f/392_0_3900_3122/500.jpg",
    "summary": "A judge has granted a temporary restraining order, while another has mandated the government to maintain funding for a program supporting low-income households. This ruling ensures continued assistance for those in need. The decision highlights ongoing legal disputes over government support for vulnerable populations.",
    "published": "2025-10-31T19:11:56Z"
  },
  {
    "title": "Mary Earps says she told Wiegman she was rewarding Hampton’s ‘bad behaviour’",
    "url": "https://www.theguardian.com/football/2025/oct/31/mary-earps-sarina-wiegman-england-lionesses",
    "image": "https://media.guim.co.uk/126a24d75d09d7d089554dee578443dce798dc0e/752_1767_3596_2875/500.jpg",
    "summary": "Mary Earps expressed her discontent to Lionesses head coach Sarina Wiegman about the decision to reinstate rival goalkeeper Hannah Hampton to the team. Earps believes that this move sends a message that \"bad behaviour is being rewarded.\" Her protest highlights concerns about the team's selections and the implications for team culture.",
    "published": "2025-10-31T19:00:13Z"
  },
  {
    "title": "M&S launches ‘secret support’ pants that offer men a ‘subtle lift’",
    "url": "https://www.theguardian.com/fashion/2025/oct/31/ms-launches-new-secret-support-pants-that-offer-men-a-subtle-lift",
    "image": "https://media.guim.co.uk/53a878e13d28c5523ad29bfcf74b4754634d35fb/0_428_840_672/500.jpg",
    "summary": "A retailer has launched innovative underwear designed to enhance male physique, akin to a push-up bra for women. This new product aims to boost men's confidence and self-esteem in their appearance. The initiative marks a growing trend in male undergarment development focused on enhancing comfort and support.",
    "published": "2025-10-31T18:54:27Z"
  },
  {
    "title": "Palace’s statement on Andrew is ‘vindication’ for Virginia Giuffre, says her family",
    "url": "https://www.theguardian.com/uk-news/2025/oct/31/buckingham-palace-statement-andrew-virginia-giuffre-family",
    "image": "https://media.guim.co.uk/11a7c51d62b2f27f0a280782f9278865b6901c0c/905_0_4433_3548/500.jpg",
    "summary": "Women’s rights groups have applauded a recent announcement, viewing it as a significant statement of support for survivors of abuse. They believe it highlights the importance of acknowledging and addressing issues of gender-based violence. The announcement is seen as a crucial step towards providing justice and empowerment for affected individuals.",
    "published": "2025-10-31T18:54:04Z"
  }
]