[
  {
    "title": "Estonia requests Nato article 4 consultation after ‘unacceptable’ violation of its airspace by Russian MiG-31s – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/sep/19/eu-sanctions-russia-oil-ukraine-vladimir-putin-volodymyr-zelenskyy-donald-trump-france-macron-europe-live-news",
    "image": "https://media.guim.co.uk/2b9a3bdac6c1558afbf9445cff2c5644686bbd7f/242_0_2049_1639/500.jpg",
    "summary": "NATO has condemned Russia's \"reckless behavior\" following the interception of three MiG-31 fighters over Estonian airspace by its jets. This incident raises tensions in the region and highlights ongoing concerns regarding air safety and military provocations. NATO remains vigilant in monitoring Russian activities near its borders.",
    "published": "2025-09-19T20:27:27Z"
  },
  {
    "title": "Senate fails to pass short-term funding bill, with both parties blaming the other for looming government shutdown – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/19/donald-trump-jimmy-kimmel-suspension-abc-federal-reserve-lisa-cook-us-politics-live-news",
    "image": "https://media.guim.co.uk/c489c989c8ff25c7413543bfe3208e78c9028d55/562_342_2946_2357/500.jpg",
    "summary": "The Republican-controlled Senate has rejected a continuing resolution passed by the House, putting government funding at risk. Without further action, funding is set to expire at the end of September. This decision intensifies the urgency for lawmakers to reach a consensus to avoid a government shutdown.",
    "published": "2025-09-19T20:25:43Z"
  },
  {
    "title": "New Zealand 19-34 Canada: Women’s Rugby World Cup 2025 semi-final – as it happened",
    "url": "https://www.theguardian.com/sport/live/2025/sep/19/new-zealand-v-canada-womens-rugby-world-cup-2025-semi-final-live",
    "image": "https://media.guim.co.uk/59364719b0984a1bd061611b73955c7a4012834a/314_0_4760_3809/500.jpg",
    "summary": "Canada delivered a powerful performance by scoring five tries, decisively defeating the Black Ferns and ending their title defense. This victory secures Canada's spot in the final. The match showcased Canada's strength and skill on the field.",
    "published": "2025-09-19T20:22:50Z"
  },
  {
    "title": "UK Snapchat predator jailed for 14 years for raping girl, 12, and exploiting dozens of others",
    "url": "https://www.theguardian.com/technology/2025/sep/19/snapchat-predator-stuart-latham-jailed-for-14-years-for-rape-and-exploitation-of-dozens-of-girls",
    "image": "https://media.guim.co.uk/4b2c4178a5673b35bc599e6b136d6b1773a253d8/0_562_2922_2338/500.jpg",
    "summary": "Stuart Latham has confessed to 49 offenses in a significant online child sexual abuse case in the UK. His admissions highlight the growing concern over online exploitation of children. Authorities are intensifying efforts to combat such crimes and protect vulnerable individuals.",
    "published": "2025-09-19T20:16:37Z"
  },
  {
    "title": "RFK Jr’s vaccine advisers remove prescription need for Covid vaccine, emphasizing personal choice",
    "url": "https://www.theguardian.com/us-news/2025/sep/19/acip-vote-no-prescription-covid-vaccine",
    "image": "https://media.guim.co.uk/df5d121a11d5154a81630ec718279a6fe55407ed/446_0_4458_3567/500.jpg",
    "summary": "After a contentious meeting, healthcare professionals and experts expressed confusion over the committee's recommendations. Many found the guidance unclear and lacking in direction. The discussions highlighted significant differences in opinions on healthcare strategies moving forward.",
    "published": "2025-09-19T20:13:49Z"
  }
]