[
  {
    "title": "US airlines cancel flights after aviation agency directive to cut air traffic",
    "url": "https://www.theguardian.com/world/2025/nov/06/us-40-airports-traffic-reduced",
    "image": "https://media.guim.co.uk/bbbd9683d23624d486d4a2143b34bd2d864d4c6a/725_0_5960_4768/500.jpg",
    "summary": "United, Southwest, and Delta airlines will be cutting back on flights due to the ongoing government shutdown. This decision comes as they face decreased passenger demand and operational challenges. The airline industry is adapting to the uncertainties created by the shutdown's impact on travel.",
    "published": "2025-11-06T23:17:11Z"
  },
  {
    "title": "Tesla shareholders approve $1tn pay package for Elon Musk",
    "url": "https://www.theguardian.com/technology/2025/nov/06/tesla-1tn-pay-package-elon-musk",
    "image": "https://media.guim.co.uk/5718d2eee7f2e39bcd49fe4090909f5e98bdc006/161_0_3551_2841/500.jpg",
    "summary": "Chants of \"Elon\" celebrated the approval of a controversial compensation plan for Elon Musk. The decision faced significant opposition from several high-profile investors who expressed concerns about its implications. Despite the dissent, the plan was ultimately approved, showcasing Musk's enduring influence within the company.",
    "published": "2025-11-06T23:14:48Z"
  },
  {
    "title": "Australia news live: Liberal senator says Sussan Ley ‘losing support’ and declines to back her as leader",
    "url": "https://www.theguardian.com/australia-news/live/2025/nov/07/australia-news-live-sussan-ley-coalition-liberals-nationals-leadership-senate-anthony-albanese-labor-net-zero-ntwnfb",
    "image": "https://media.guim.co.uk/bc66a96735c139f16356d67de3293e19a8b607d9/657_123_5444_4355/500.jpg",
    "summary": "It seems that you may have intended to provide a specific news article or topic to summarize, but there wasn't any content included in your request. Please provide the text or context you'd like summarized, and I'd be happy to help!",
    "published": "2025-11-06T23:14:25Z"
  },
  {
    "title": "Trump administration ‘failed to consider the harms’ in not supporting Snap, judge says in ruling that demands funds by Friday – live",
    "url": "https://www.theguardian.com/us-news/live/2025/nov/06/donald-trump-government-shutdown-venezuela-senate-vote-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/4ec6b889773d1d5bcb5c8deadafe905a500e4189/217_0_3333_2667/500.jpg",
    "summary": "A federal judge in Rhode Island ruled that the Trump administration must disburse the complete November Snap food aid benefits to states within 24 hours. This order aims to ensure timely assistance for those reliant on the program. The decision emphasizes the urgency of providing support amidst ongoing economic challenges.",
    "published": "2025-11-06T23:13:45Z"
  },
  {
    "title": "The Celebrity Traitors final – as it happened",
    "url": "https://www.theguardian.com/tv-and-radio/live/2025/nov/06/the-celebrity-traitors-final-live",
    "image": "https://media.guim.co.uk/47ac80980263407d35a6d4850a16cdc26ef2325f/0_116_3159_2524/500.jpg",
    "summary": "The inaugural star-based edition of the BBC hit show has concluded with suspenseful outcomes. Viewers are left wondering if the loyal contestants managed to unite or if a deceiver manipulated the situation. The finale promises thrilling revelations for fans.",
    "published": "2025-11-06T23:03:09Z"
  }
]