[
  {
    "title": "‘We can’t eat. We can’t sleep. It’s a disaster’: the small boat detainees waiting to be sent back to France",
    "url": "https://www.theguardian.com/uk-news/2025/sep/15/we-cant-eat-we-cant-sleep-its-a-disaster-the-small-boat-detainees-waiting-to-be-sent-back-to-france",
    "image": "https://media.guim.co.uk/f1e6dd3c26dd27283e680354c4692361d73c799b/641_193_3697_2957/500.jpg",
    "summary": "This week, the UK began implementing its 'one in, one out' deportation scheme, allowing the first migrants to be flown out of the country. Many affected individuals express fear and confusion regarding the new policy. The initiative has sparked significant concern and debate over its implications for migrant rights.",
    "published": "2025-09-15T15:28:02Z"
  },
  {
    "title": "Trump threatens to call national emergency in Washington DC over Ice cooperation – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/15/donald-trump-politics-washington-dc-national-emergency-ice-charlie-kirk-live-news-updates",
    "image": "https://media.guim.co.uk/be55a3a43c721979621ff247058474aa7a4a8c69/414_0_5000_4000/500.jpg",
    "summary": "The President has pledged to \"federalize\" the capital city following a statement from the mayor indicating that local police will not collaborate with Immigration and Customs Enforcement (ICE) in immigration enforcement actions. This move reflects increasing tensions between federal and local authorities over immigration policies. The President's announcement suggests a push for greater federal control in response to local decisions regarding ICE's activities.",
    "published": "2025-09-15T15:27:41Z"
  },
  {
    "title": "US’s Rubio says efforts to recognise Palestinian state make it harder to end war – Middle East crisis live",
    "url": "https://www.theguardian.com/world/live/2025/sep/15/israel-gaza-hamas-qatar-marco-rubio-netanyahu-middle-east-crisis-live-news-updates",
    "image": "https://media.guim.co.uk/fddb7ab0a9b69e8ce9e3c0f19cb06b88eac70042/159_0_1238_990/500.jpg",
    "summary": "The Secretary of State held a press conference with Israeli Prime Minister Benjamin Netanyahu in Jerusalem. The meeting focused on key diplomatic issues and regional stability. Both leaders emphasized the importance of U.S.-Israel relations amid ongoing tensions in the area.",
    "published": "2025-09-15T15:26:33Z"
  },
  {
    "title": "Party conference season is here – and it’s a spectacle beyond redemption | Zoe Williams",
    "url": "https://www.theguardian.com/commentisfree/2025/sep/15/party-conference-season-is-here-its-spectacle-beyond-redemption",
    "image": "https://media.guim.co.uk/33c4dedb951a8b0ad7ce64b83b428613313ff2c5/785_71_3395_2716/500.jpg",
    "summary": "Zoe Williams critiques the current political discourse, calling it a meaningless spectacle where leaders deliver speeches and commentators react, yet real life remains unaffected. She suggests that the entire process lacks genuine substance and relevance to ordinary people. This reflection highlights a disconnect between political rhetoric and everyday reality.",
    "published": "2025-09-15T15:20:30Z"
  },
  {
    "title": "Top Starmer aide resigns over explicit Diane Abbott messages in further blow to PM – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/15/keir-starmer-peter-mandelson-labour-reform-tories-uk-politics-live-news-updates",
    "image": "https://media.guim.co.uk/14e971cefa4204c99b097dae19bf090c12945f9e/0_0_2708_2166/500.jpg",
    "summary": "Paul Ovenden, the director of strategy, has resigned to prevent becoming a distraction for the organization following the emergence of derogatory emails. His decision comes amidst increasing scrutiny over the controversial content of these communications. Ovenden's departure highlights the impact of internal issues on leadership and workplace environment.",
    "published": "2025-09-15T15:15:20Z"
  }
]