[
  {
    "title": "Arsenal v Liverpool: Women’s Super League – live",
    "url": "https://www.theguardian.com/football/live/2025/dec/06/arsenal-v-liverpool-womens-super-league-live",
    "image": "https://media.guim.co.uk/d0c069e5365e8baf65970cfcf94bc2e441d10b34/266_0_2500_2000/500.jpg",
    "summary": "The Women's Super League (WSL) season is back, with Arsenal aiming to revitalize their title pursuit as they face the bottom-placed team. Emillia Hawkins provides live updates on the match. Fans are eager to see if Arsenal can secure a much-needed victory.",
    "published": "2025-12-06T13:26:13Z"
  },
  {
    "title": "F1 Abu Dhabi Grand Prix: qualifying updates for the season finale – live",
    "url": "https://www.theguardian.com/sport/live/2025/dec/06/f1-abu-dhabi-grand-prix-qualifying-updates-for-the-season-finale-live",
    "image": "https://media.guim.co.uk/44fdd6eedd2a040008a801f36084609d3f922ef0/623_215_2669_2135/500.jpg",
    "summary": "Philip Cornwall will provide live coverage of the qualifying session as the competition for the world drivers' title intensifies. This final round features a three-way battle among the leading contenders. Fans can expect thrilling updates and insights during this crucial event.",
    "published": "2025-12-06T13:26:10Z"
  },
  {
    "title": "Aston Villa v Arsenal: Premier League – live",
    "url": "https://www.theguardian.com/football/live/2025/dec/06/aston-villa-v-arsenal-premier-league-live",
    "image": "https://media.guim.co.uk/3d762fb20cb977da98ea9cbdac765429b355050f/176_0_2774_2219/500.jpg",
    "summary": "Barry Glendenning will provide live updates as the leaders navigate a challenging match at Villa Park. Fans can follow the minute-by-minute coverage for insights and developments during the game. The excitement builds as the teams face off in this crucial encounter.",
    "published": "2025-12-06T13:26:01Z"
  },
  {
    "title": "Tower of London partially closed after food thrown at crown jewels display ",
    "url": "https://www.theguardian.com/uk-news/2025/dec/06/tower-of-london-closes-apple-crumble-thrown-on-crown-jewels-display-case",
    "image": "https://media.guim.co.uk/d111da60f69b98ea0e6114215754db972566ea55/3_0_3780_3024/500.jpg",
    "summary": "Four individuals were arrested during a protest organized by the civil-resistance group Take Back Power, which aimed to raise awareness about inequality in the UK. The demonstration highlighted ongoing social and economic disparities. Authorities responded to the gathering, leading to the arrests amid the protest activities.",
    "published": "2025-12-06T13:19:01Z"
  },
  {
    "title": "Why is Michael Jordan suing Nascar? The blockbuster antitrust trial, explained",
    "url": "https://www.theguardian.com/sport/2025/dec/06/michael-jordan-nascar-antitrust-lawsuit-explained",
    "image": "https://media.guim.co.uk/f005fa72c6a733bc71bccf015af8974f157d049b/576_0_5764_4614/500.jpg",
    "summary": "Michael Jordan's lawsuit against NASCAR alleges that the organization exerts excessive control over racing teams and their finances. The case centers on issues of governance and financial equity within the sport. The trial's outcome could significantly impact the structure and dynamics of NASCAR racing.",
    "published": "2025-12-06T13:15:53Z"
  }
]