[
  {
    "title": "Tory conference to open as Home Office announces plan to strengthen anti-protest laws – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/oct/05/conservative-tory-conference-kemi-badenoch-echr-immigration-uk-politics-live-news-updates",
    "image": "https://media.guim.co.uk/070a48f58b985f23c9b5d38719ae508c04ede0e2/253_0_3333_2667/500.jpg",
    "summary": "New measures have been introduced to simplify the process for police to halt protests by taking into account the 'cumulative' impact of multiple demonstrations. This is aimed at enhancing public safety and reducing disruptions. Critics argue that these measures may infringe on the right to peaceful assembly.",
    "published": "2025-10-05T08:20:32Z"
  },
  {
    "title": "Police to get new powers to crack down on repeated protests, says Home Office",
    "url": "https://www.theguardian.com/uk-news/2025/oct/05/police-to-get-new-powers-to-crack-down-on-repeated-protests-says-home-office",
    "image": "https://media.guim.co.uk/3c8dec7e8b1e2b12aa93520900de6772e9edd72c/497_0_2503_2003/500.jpg",
    "summary": "Authorities have announced increased security measures in London following a pro-Palestinian demonstration that resulted in the arrest of nearly 500 individuals. The decision aims to address public safety concerns and maintain order during future protests. Police are intensifying their monitoring efforts to prevent further unrest.",
    "published": "2025-10-05T08:19:46Z"
  },
  {
    "title": "NRL 2025 grand final: Melbourne Storm v Brisbane Broncos – rugby league live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/05/nrl-2025-grand-final-melbourne-storm-v-brisbane-broncos-rugby-league-live",
    "image": "https://media.guim.co.uk/e28c8df68c558208dc5622b37485d4db8b94e50e/513_0_2407_1925/500.jpg",
    "summary": "The Storm and Broncos face off in the men’s decider at Accor Stadium. Jonathan Howcroft provides live updates throughout the match. Stay tuned for minute-by-minute coverage of the game.",
    "published": "2025-10-05T08:17:25Z"
  },
  {
    "title": "Postecoglou searching for Forest win, WSL action and Ipswich v Norwich – matchday live",
    "url": "https://www.theguardian.com/football/live/2025/oct/05/postecoglou-nottingham-forest-wsl-ipswich-norwich-matchday-live",
    "image": "https://media.guim.co.uk/42ba77261cee77e46e1fea7309b8a53ae5c0e6f2/0_0_5000_4000/500.png",
    "summary": "Join our writers for timely updates, previews, and lively discussions as football action unfolds on a busy day. Stay informed about all the latest developments in the sport. Don't miss out on the excitement!",
    "published": "2025-10-05T08:17:18Z"
  },
  {
    "title": "Gaza ceasefire talks live: negotiators due in Cairo",
    "url": "https://www.theguardian.com/world/live/2025/oct/05/gaza-ceasefire-israel-palestine-hamas-trump-cairo-negotiations-middle-east-crisis-live-news-updates",
    "image": "https://media.guim.co.uk/b1933ca7d0714a17c283bd1c621f7a575a22e5d2/960_0_4800_3840/500.jpg",
    "summary": "Israeli Prime Minister Netanyahu expressed optimism about announcing a hostage deal with Hamas soon. Meanwhile, Hamas has agreed to certain aspects of Trump’s Gaza plan. This development indicates potential progress in negotiations amid ongoing tensions.",
    "published": "2025-10-05T08:12:55Z"
  }
]