[
  {
    "title": "South Korea’s tattooists win legal recognition but their fight isn’t over",
    "url": "https://www.theguardian.com/world/2025/nov/03/south-korea-tattoo-artist-legalisation-non-medical-doy",
    "image": "https://media.guim.co.uk/59f1e34452d14a00c1ef1231b0335c509892b84c/415_0_5840_4672/500.jpg",
    "summary": "Tattoo artists have celebrated the passing of a landmark law after 33 years of operating underground. Despite this victory, prosecutions against unlicensed tattooing still persist. The law aims to regulate the industry and promote safe practices among artists.",
    "published": "2025-11-03T04:24:44Z"
  },
  {
    "title": "Australia politics live: Sarah Hanson-Young says Senate question time has become ‘an absolute farce’",
    "url": "https://www.theguardian.com/australia-news/live/2025/nov/03/australia-politics-live-nationals-net-zero-liberals-labor-bulk-billing-optus-sussan-ley-anthony-albanese-question-time",
    "image": "https://media.guim.co.uk/164e0486c509b83fe197cf1d8972f38d9d372427/644_0_6435_5148/500.jpg",
    "summary": "I'm sorry, but I need the specific news article or details to create a summary. Please provide the content you'd like summarized!",
    "published": "2025-11-03T04:23:26Z"
  },
  {
    "title": "Eli Katoa’s seizure and brain bleed prompts calls for NRL to assess concussion protocols ",
    "url": "https://www.theguardian.com/sport/2025/nov/03/eli-katoa-injury-seizure-brain-bleed-nrl-concussion-protocols",
    "image": "https://media.guim.co.uk/8b9a9ea41936aa45a9e4a66eb345cbec6a6e23ee/249_0_3090_2472/500.jpg",
    "summary": "The NRL is evaluating the application of concussion protocols following Tonga star's emergency surgery. Concerns have been raised about the handling of his condition. An inquiry may be launched to ensure player safety in future.",
    "published": "2025-11-03T03:59:03Z"
  },
  {
    "title": "Cop out? Anthony Albanese wants to host the next global climate summit – so why isn’t he attending this one?",
    "url": "https://www.theguardian.com/australia-news/2025/nov/03/australia-prime-minister-not-attending-cop30-belem-brazil-anthony-albanese",
    "image": "https://media.guim.co.uk/aeec3258b4086af444b8f5ecbefe83f846b391cf/396_0_3509_2808/500.jpg",
    "summary": "The Australian Prime Minister's decision to skip Cop30 could lead to doubts regarding his commitment to co-hosting Cop31 in Adelaide. Critics may interpret his absence as a lack of seriousness towards climate negotiations. This situation puts the future of Australia's role in international climate discussions under scrutiny.",
    "published": "2025-11-03T02:26:18Z"
  },
  {
    "title": "Trump news at a glance: Republicans insist Trump is ‘desperate’ to resolve shutdown as Snap payments end",
    "url": "https://www.theguardian.com/us-news/2025/nov/03/trump-administration-news-updates-today",
    "image": "https://media.guim.co.uk/3b1235b68960601453754c14ff1944446a83318f/618_0_6178_4944/500.jpg",
    "summary": "Mike Johnson asserts that the \"big-hearted\" president aims to reopen the government. The FBI has dismissed an official following Patel's outrage over reports related to the use of a government jet. These reflect significant developments in U.S. politics as of November 2nd.",
    "published": "2025-11-03T02:00:19Z"
  }
]