[
  {
    "title": "Australia news live: Chalmers reveals surprise changes to super tax plans; fears social media ban will impose ‘social gap’ on youth",
    "url": "https://www.theguardian.com/australia-news/live/2025/oct/13/australia-news-live-qantas-hack-data-leak-scam-warning-nsw-sydney-potholes-social-media-ban-anika-wells-albanese-sussan-ley-labor-liberal-coalition-ntwnfb",
    "image": "https://media.guim.co.uk/370101a991eb6ba7f162a9d4642273df9ba4ca8e/174_0_5588_4471/500.jpg",
    "summary": "Could you please provide the news article or details you'd like me to summarize?",
    "published": "2025-10-13T01:39:10Z"
  },
  {
    "title": "Gaza ceasefire live: Israeli hostages due to be released as Trump says ‘war is over’ and flies to Middle East",
    "url": "https://www.theguardian.com/world/live/2025/oct/13/gaza-ceasefire-live-updates-israel-hostages-release-hamas-trump-middle-east",
    "image": "https://media.guim.co.uk/0dd046a65799a4d82be460f1daeb08007faaa040/831_0_4167_3335/500.jpg",
    "summary": "US President is set to arrive in Israel as Hamas is anticipated to release 20 living Israeli hostages. This visit comes amid ongoing tensions in the region. Stay updated for further developments.",
    "published": "2025-10-13T01:35:43Z"
  },
  {
    "title": "Trump news at a glance: Insurrection Act on the cards, says Vance, as president touts peace in the Middle East ",
    "url": "https://www.theguardian.com/us-news/2025/oct/13/trump-administration-news-updates-today",
    "image": "https://media.guim.co.uk/b3dcc9b11616699c54f80e4da3687ad2d37d29f8/501_0_3582_2867/500.jpg",
    "summary": "Senator JD Vance has revealed that the White House is actively contemplating the use of the Insurrection Act of 1807 amidst rising tensions as former President Donald Trump prepares to travel to Israel. This potential move reflects escalating political dynamics in relation to Trump’s actions. The situation continues to unfold as implications for national security and governance are assessed.",
    "published": "2025-10-13T01:28:40Z"
  },
  {
    "title": "Tony Blair wins nod from Palestinian Authority for role in postwar Gaza",
    "url": "https://www.theguardian.com/world/2025/oct/12/tony-blair-wins-nod-from-palestine-authority-for-role-in-postwar-gaza",
    "image": "https://media.guim.co.uk/bf8cba4e62f06140e2206bee094fef191b568021/595_0_4453_3563/500.jpg",
    "summary": "A senior leader from the Palestinian Authority has expressed willingness to collaborate with former UK Prime Minister on efforts for recovery following a ceasefire. This collaboration aims to address the humanitarian and reconstruction needs of the affected areas. The move signals a potential shift in diplomatic efforts to support stability in the region.",
    "published": "2025-10-13T01:22:08Z"
  },
  {
    "title": "Swimming Australia moves to shut down Mollie O’Callaghan ‘fake quotes’ about transgender athlete",
    "url": "https://www.theguardian.com/sport/2025/oct/13/mollie-ocallaghan-fake-quotes-transgender-athlete-lia-thomas-meta-swimming-australia",
    "image": "https://media.guim.co.uk/05e636923fce66afc202241e9739197fbc1df740/524_0_5333_4267/500.jpg",
    "summary": "A quote falsely attributed to swimmer Lia Thomas circulated on Facebook and X, causing confusion amid ongoing discussions about her eligibility in women's competitions. World Aquatics has ruled that Thomas is barred from competing in the female category. This situation highlights the ongoing debate surrounding transgender athletes in sports.",
    "published": "2025-10-13T01:04:45Z"
  }
]