[
  {
    "title": "England v Pakistan: Women’s Cricket World Cup – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/15/england-v-pakistan-womens-cricket-world-cup-live",
    "image": "https://media.guim.co.uk/3dad24b838f3b6c950bc3b6ad55efaa4f1579a5d/548_0_3527_2823/500.jpg",
    "summary": "England is set to face Pakistan in Colombo as they look to preserve their perfect record in the tournament. The match promises to be an exciting showdown. Fans can follow the over-by-over updates from the event.",
    "published": "2025-10-15T11:14:57Z"
  },
  {
    "title": "Gaza ceasefire live: Israel says body handed over by Hamas is not a hostage amid reports vital aid crossing to reopen",
    "url": "https://www.theguardian.com/world/live/2025/oct/15/gaza-ceasefire-israel-hamas-palestine-aid-hostages-detainees-prisoners-live-news-updates",
    "image": "https://media.guim.co.uk/3093bfa75b3c41b98b5b416696388939853853c4/428_0_4301_3441/500.jpg",
    "summary": "Israel announced that the flow of aid into Gaza would be reduced by half and that the Rafah crossing would not open as scheduled. This decision is attributed to delays in recovering the bodies of hostages. The situation highlights ongoing tensions and humanitarian concerns in the region.",
    "published": "2025-10-15T11:14:49Z"
  },
  {
    "title": "Starmer says he will publish witness statements for China spy trial as he faces Badenoch – PMQs live",
    "url": "https://www.theguardian.com/politics/live/2025/oct/15/keir-starmer-kemi-badenoch-pmqs-china-epping-rachel-reeves-imf-uk-politics-live-news-updates",
    "image": "https://media.guim.co.uk/9c3060b4995cac9ca35eee883589ef3fa7d0ab92/357_0_1104_883/500.jpg",
    "summary": "The Prime Minister plans to release full statements regarding a recent case, asserting that the previous government is to blame for its failures. He seeks transparency in the matter by making all relevant information accessible. This move aims to clarify accountability and address concerns surrounding the situation.",
    "published": "2025-10-15T11:13:56Z"
  },
  {
    "title": "Supreme court to hear Voting Rights Act challenge that could affect control of Congress – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/15/donald-trump-federal-government-shutdown-redistricting-voting-rights-act-kash-patel-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/7e8775e32cb6047f194b2f5815622a3aa4c8c769/1248_0_6269_5015/500.jpg",
    "summary": "Republican parties are pushing to have Section 2 of the Voting Rights Act, which aims to prevent voting discrimination, declared unconstitutional. This move coincides with ongoing national disputes over redistricting. The initiative reflects broader tensions regarding voting rights and electoral fairness.",
    "published": "2025-10-15T11:13:55Z"
  },
  {
    "title": "Rachel Reeves to pitch UK as ‘beacon of stability and growth’ at IMF; UK bankers to get bonuses faster – business live",
    "url": "https://www.theguardian.com/business/live/2025/oct/15/rachel-reeves-uk-beacon-of-stability-growth-imf-budget-tax-spending-stock-markets-business-live-news",
    "image": "https://media.guim.co.uk/5b8bdff87a5b43e5629205086456b5ddbc437c73/625_0_6253_5005/500.jpg",
    "summary": "The latest economic and financial news highlights ongoing developments in global markets, including fluctuations in stock prices and economic indicators. Analysts are closely monitoring central bank policies and inflation rates as businesses adapt to evolving conditions. Investors are reacting to these changes, shaping trading strategies and market sentiment.",
    "published": "2025-10-15T11:08:57Z"
  }
]