[
  {
    "title": "Tuna firm Princes floats valued at nearly £1.2bn in boost for London market",
    "url": "https://www.theguardian.com/business/2025/oct/31/tinned-tuna-firm-princes-for-london-market-ipo-stock",
    "image": "https://media.guim.co.uk/ea7777031e7b0d21327ebe76782d8fb4130413bc/877_565_2507_2005/500.jpg",
    "summary": "The Business Secretary praised the IPO as a significant endorsement, despite the shares debuting at the lower end of the anticipated price range. This indicates a strong belief in the company's potential, even with initial investor caution. Overall, the launch reflects mixed sentiments about market conditions and investor demand.",
    "published": "2025-10-31T11:15:13Z"
  },
  {
    "title": "Australia v India: second men’s Twenty20 international – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/31/australia-v-india-t20-live-second-twenty20-international-cricket-aus-vs-ind-latest",
    "image": "https://media.guim.co.uk/1d58ab90842a58dcddee409d73784edd9bcc726e/799_253_4687_3749/500.jpg",
    "summary": "Australia is pursuing 126 runs to secure victory at a sold-out Melbourne Cricket Ground (MCG) and take an early lead in the T20I series. The match is being reported on an over-by-over basis by Martin Pegan. Fans are eagerly watching the action unfold.",
    "published": "2025-10-31T11:13:43Z"
  },
  {
    "title": "Trump calls for Senate to scrap filibuster in order to force end to month-long government shutdown – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/31/donald-trump-filibuster-shutdown-snap-food-refugees-drug-boats-latest-news-updates",
    "image": "https://media.guim.co.uk/e4fa98b006ecd4a9554d3cae08825d75d3582b91/915_0_4585_3669/500.jpg",
    "summary": "Snap food benefits will end this weekend as the government shutdown approaches the duration of the record set in 2018-2019. This termination affects millions who rely on the assistance for nourishment. The looming shutdown raises concerns about food security and economic stability for vulnerable populations.",
    "published": "2025-10-31T11:10:08Z"
  },
  {
    "title": "Slot targets Liverpool recovery; Paquetá warned by FA: football news – live",
    "url": "https://www.theguardian.com/football/live/2025/oct/31/weekend-team-news-and-previews-football-live",
    "image": "https://media.guim.co.uk/37eda24d18a567a671c31eb159ff2f2f449dbbd6/0_0_6313_5051/500.jpg",
    "summary": "Join our writers for a preview of the upcoming weekend's football matches, featuring key insights and analysis. Stay updated on the latest team news and player performances. Don't miss out on essential tips and predictions to enhance your weekend viewing experience.",
    "published": "2025-10-31T11:09:01Z"
  },
  {
    "title": "Ukraine reports fresh Russian attacks and says Moscow has used ‘secret’ missile in recent months – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/oct/31/ukraine-russian-attacks-secret-missile-netherlands-dutch-elections-europe-live-latest-news-updates",
    "image": "https://media.guim.co.uk/97b92369719435dfe021905cda7094521b5b4592/279_0_1187_950/500.jpg",
    "summary": "The emergence of the 9M729 cruise missile led Donald Trump to withdraw from a nuclear arms control agreement with Russia during his first term. This decision reflected escalating tensions between the U.S. and Russia. The withdrawal marked a significant shift in nuclear policy and arms control efforts.",
    "published": "2025-10-31T11:02:30Z"
  }
]