[
  {
    "title": "Manchester United v Chelsea: Women’s Super League – live",
    "url": "https://www.theguardian.com/football/live/2025/oct/03/manchester-united-v-chelsea-womens-super-league-live",
    "image": "https://media.guim.co.uk/bca36e71c858b4081154331f66814563b23c1037/628_0_6073_4860/500.jpg",
    "summary": "The reigning champions face Manchester United in what is being considered their toughest match of the season. Scott Murray provides a minute-by-minute report on the game. Fans eagerly await the outcome of this high-stakes encounter.",
    "published": "2025-10-03T18:27:04Z"
  },
  {
    "title": "US government shutdown: White House reviewing aid that can potentially be cut in Portland, says press secretary – live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/03/shutdown-congress-trump-senate-latest-updates",
    "image": "https://media.guim.co.uk/d163936223a09fe19ab2e49ad64ee6a2e33c9bb6/610_0_6103_4885/500.jpg",
    "summary": "Karoline Leavitt emphasized that states permitting anarchy will not receive funding. This statement comes amid polling indicating that 78% of adults support the extension of healthcare subsidies. The remarks highlight the intersection of state governance and federal financial support.",
    "published": "2025-10-03T18:26:14Z"
  },
  {
    "title": "Sean ‘Diddy’ Combs sentencing live: mogul’s children say he is ‘changed man’; prosecutor says he is casting himself as ‘victim’",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/03/sean-diddy-combs-sentencing-trial-conviction-latest-updates",
    "image": "https://media.guim.co.uk/275587ab041d168427a6e4ce98fef167deb4dc24/105_0_2812_2250/500.jpg",
    "summary": "Combs, facing potential long prison time for prostitution convictions from July, is scheduled to address the court soon. Her situation is drawing attention as she prepares to speak. The outcome of her statement could influence her sentencing.",
    "published": "2025-10-03T18:25:36Z"
  },
  {
    "title": "Paul ‘Bonehead’ Arthurs to miss Oasis tour leg for cancer treatment",
    "url": "https://www.theguardian.com/music/2025/oct/03/paul-bonehead-arthurs-to-miss-oasis-tour-leg-for-cancer-treatment",
    "image": "https://media.guim.co.uk/3606e855a7f59e96d0bb2ff53a717d7a219ad648/177_0_3278_2622/500.jpg",
    "summary": "The rhythm guitarist will miss performances in Seoul, Tokyo, Melbourne, and Sydney to undergo prostate treatment. This decision was made to prioritize his health. Further details about his recovery and potential return are yet to be announced.",
    "published": "2025-10-03T18:19:22Z"
  },
  {
    "title": "Sean ‘Diddy’ Combs expected to speak in court as prosecution witness backs out last-minute",
    "url": "https://www.theguardian.com/music/2025/oct/03/sean-diddy-combs-criminal-sentencing",
    "image": "https://media.guim.co.uk/048d808f14f0caa52856512b05bf746770009a79/500_0_5000_4000/500.jpg",
    "summary": "The prospect of a lighter sentence for disgraced hip-hop mogul Sean Combs appears to be fading. A judge indicated that Combs has not fully demonstrated remorse for his actions, impacting his potential sentence. This development comes as the court deliberates on the appropriate consequences for his conduct.",
    "published": "2025-10-03T18:17:39Z"
  }
]