[
  {
    "title": "Cristian Romero ‘so angry’ about Spurs’ past but future is clear under Frank",
    "url": "https://www.theguardian.com/football/2025/sep/15/cristian-romero-tottenham-villarreal-champions-league",
    "image": "https://media.guim.co.uk/ca0ff72fdb7a95bddb6539b227b26b5e80363e4a/419_0_4485_3590/500.jpg",
    "summary": "Tottenham's captain emphasizes the team's newfound unity as they begin their Champions League campaign. He believes the players and management are aligned and working towards common goals. The optimism reflects a positive shift within the club as they strive for success in the tournament.",
    "published": "2025-09-15T19:17:51Z"
  },
  {
    "title": "Police search for 11 violent disorder suspects after ‘unite the kingdom’ march",
    "url": "https://www.theguardian.com/politics/2025/sep/15/police-search-for-11-violent-disorder-suspects-after-unite-the-kingdom-march",
    "image": "https://media.guim.co.uk/695d8d8dea434f22bf88e0ada3145f5845e86f10/1090_0_7920_6336/500.jpg",
    "summary": "The Metropolitan Police are seeking public assistance to identify individuals who assaulted officers with kicks and punches during recent incidents. They have released images and descriptions of the suspects, appealing for information to aid their investigation. The police emphasize the seriousness of these offences against law enforcement personnel.",
    "published": "2025-09-15T19:01:29Z"
  },
  {
    "title": "Conflict, aid cuts and equality backlash causing ‘stagnation and regression’ of women’s rights – UN",
    "url": "https://www.theguardian.com/global-development/2025/sep/15/global-progress-gender-equality-womens-rights-sdg--un",
    "image": "https://media.guim.co.uk/7a586f2f0c8d97f1bf66b870a10e952608297be5/989_0_5600_4480/500.jpg",
    "summary": "A report urges governments to recommit to renewed action during the upcoming general assembly in New York, emphasizing that \"a different path is still possible.\" It highlights the importance of collaborative efforts to address pressing global challenges. The call aims to inspire leaders to take decisive and effective measures.",
    "published": "2025-09-15T19:00:15Z"
  },
  {
    "title": "Amazon to offer Champions League viewers new immersive in-game data",
    "url": "https://www.theguardian.com/football/2025/sep/15/amazon-prime-video-prime-vision-data-champions-league-football",
    "image": "https://media.guim.co.uk/a7aeeb1d16a5c42c1260a4385bb68dc614dcaa53/252_0_1350_1080/500.jpg",
    "summary": "Amazon Prime Video is set to enhance Champions League match coverage this season by introducing a new format that emphasizes player data, drawing inspiration from video games. This innovative approach aims to provide viewers with a more engaging and informative experience. Fans can expect a fresh perspective on the games, highlighting player performance and statistics in real-time.",
    "published": "2025-09-15T19:00:14Z"
  },
  {
    "title": "Vance urges people to go hard against anyone ‘justifying or celebrating’ Charlie Kirk’s killing – live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/15/donald-trump-politics-washington-dc-national-emergency-ice-charlie-kirk-live-news-updates",
    "image": "https://media.guim.co.uk/aef7e68e1b24d06d0ca8cf103cbf1f34c0976c2c/33_0_3190_2552/500.jpg",
    "summary": "JD Vance expressed that the Trump administration would take action against individuals and groups that celebrate the death of political figure Kirk and promote violence against political opponents. He emphasized a commitment to countering such sentiments. Vance's remarks highlight a stance against political extremism and violence.",
    "published": "2025-09-15T18:59:50Z"
  }
]