[
  {
    "title": "England v South Africa: first men’s T20 international – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/10/england-v-south-africa-first-mens-t20-international-live",
    "image": "https://media.guim.co.uk/dbf6319e221ec37af9651e687eec6484b3445440/542_0_5000_4000/500.jpg",
    "summary": "Tim de Lisle will provide live, over-by-over coverage of the inaugural men's T20 match between England and South Africa in Cardiff. Fans can tune in for real-time updates and insights as the game unfolds. Don't miss the excitement of this highly anticipated cricket showdown!",
    "published": "2025-09-10T17:28:26Z"
  },
  {
    "title": "Samantha Cameron to wind down her Cefinn womenswear brand",
    "url": "https://www.theguardian.com/fashion/2025/sep/10/samantha-cameron-to-wind-down-her-cefinn-womenswear-brand",
    "image": "https://media.guim.co.uk/b40cccaf7db58cbbc41b85dd22619898832256ce/0_74_2256_1805/500.jpg",
    "summary": "A designer is set to release her final collection for sale online and in her two London shops at the end of the month. This marks the conclusion of her creative journey. Fans and customers are encouraged to look out for the launch.",
    "published": "2025-09-10T17:27:47Z"
  },
  {
    "title": "Poland dismisses Russia’s claim drone incursion was unintentional as UK considers bolstering Nato air defences – live",
    "url": "https://www.theguardian.com/world/live/2025/sep/10/poland-pm-condemns-repeated-violation-of-airspace-amid-russian-attack-on-ukraine-follow-live",
    "image": "https://media.guim.co.uk/af9ce4f2b1a08165cd41b8e5723aeb0ebfaa1e06/211_0_2108_1686/500.jpg",
    "summary": "Poland's Deputy Prime Minister stated that recent Russian drone activity was not accidental, asserting that the drones intentionally targeted Polish territory. This claims highlights rising tensions and security concerns in the region. The incident underscores the growing threat posed by Russian military actions to neighboring countries.",
    "published": "2025-09-10T17:26:29Z"
  },
  {
    "title": "Camra cancels Britain’s biggest beer festival next year amid ‘budget shortfalls’",
    "url": "https://www.theguardian.com/business/2025/sep/10/camra-cancels-great-british-beer-festival",
    "image": "https://media.guim.co.uk/159601f61c5fb8158e4dabd3bd755a47af52f863/198_0_3640_2912/500.jpg",
    "summary": "The Great British Beer Festival has been canceled due to rising costs and stagnant membership reported by the Campaign for Real Ale (CAMRA). Organizers cited financial challenges as a significant factor in the decision. This cancellation marks a setback for real ale enthusiasts in the UK.",
    "published": "2025-09-10T17:24:06Z"
  },
  {
    "title": "Drones in Poland are another unsettling post-Alaska escalation by Russia",
    "url": "https://www.theguardian.com/world/2025/sep/10/drones-poland-post-alaska-escalation-russia-analysis",
    "image": "https://media.guim.co.uk/ddf06fd2cd6129c45b0b2f413f928a9c5da6f60a/723_0_4917_3933/500.jpg",
    "summary": "The Kremlin's actions in Ukraine have extended into a NATO member state, raising concerns about regional security. The motivations behind this incursion remain ambiguous, leaving speculation about whether it is intended to instill fear or assess NATO's response. The situation underscores the ongoing tensions between Russia and NATO countries.",
    "published": "2025-09-10T17:18:16Z"
  }
]