[
  {
    "title": "UK overall inflation remains at 3.8% in August, but food price growth climbs for fifth month in a row - business live",
    "url": "https://www.theguardian.com/business/live/2025/sep/17/uk-inflation-steady-38-in-july-official-figures-federal-reserve-interest-rates-donald-trump-state-visit-business-live",
    "image": "https://media.guim.co.uk/8b6880f735730e03a3aeb86b794481b78d364fca/323_0_3682_2945/500.jpg",
    "summary": "Food prices have surged at the fastest rate since January 2024, driven by increases in vegetables, milk, cheese, and fish. Meanwhile, the Bank of England is anticipated to maintain current interest rates in its upcoming decision on Thursday. This inflation in food costs highlights ongoing economic pressures on consumers.",
    "published": "2025-09-17T07:28:27Z"
  },
  {
    "title": "Israel says it has opened ‘temporary’ route for residents to flee Gaza City after launching ground offensive – Middle East crisis live",
    "url": "https://www.theguardian.com/world/live/2025/sep/17/israel-gaza-offensive-middle-east-latest-news-updates",
    "summary": "The Israeli military announced that Salah al-Din street will be open for movement for a limited period of 48 hours. This decision may impact logistics and access in the area. Further details on the reasons for this temporary opening are not provided.",
    "published": "2025-09-17T07:26:33Z"
  },
  {
    "title": "Australia news live: Conroy says Labor unconcerned by PNG-China discussions and blames ‘process delay’ for failure to sign treaty",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/17/australia-news-live-liberal-sussan-ley-net-zero-target-climate-crisis-anthony-albanese-donald-trump-trade-tariffs-politics-ntwnfb",
    "image": "https://media.guim.co.uk/96d530493494aaa80fb4e32dbab10a0744f02c83/318_0_4583_3667/500.jpg",
    "summary": "Please provide the news you'd like to summarize, and I'll be happy to help!",
    "published": "2025-09-17T07:16:52Z"
  },
  {
    "title": "Football’s greatest scorer with initials XG and most goals and assists with initials GA | The Knowledge",
    "url": "https://www.theguardian.com/football/2025/sep/17/greatest-scorer-initials-xg-most-goals-assists-initials-ga-the-knowledge",
    "image": "https://media.guim.co.uk/4344bb04acb2077876374f4296d41ec01bdabd76/0_380_2731_2183/500.jpg",
    "summary": "The news highlights national teams that feature the top-10 scorers of the 21st century. It also discusses two instances where teams wore different kits in the same match, along with notable moments from a referee's coin toss. This collection showcases unique aspects of football culture and history.",
    "published": "2025-09-17T07:00:28Z"
  },
  {
    "title": "Bayern plan to make Chelsea rue letting Nicolas Jackson go in ominous reunion | Jacob Steinberg",
    "url": "https://www.theguardian.com/football/2025/sep/17/bayern-munich-chelsea-champions-league-nicolas-jackson",
    "image": "https://media.guim.co.uk/a46916deb64175ddee1215d7242e731e95aec1d5/1273_367_3613_2890/500.jpg",
    "summary": "Enzo Maresca's team returns to the site of their first Champions League victory for a match against Vincent Kompany's side. They will have to navigate a tactical showdown against their former striker. The encounter promises to be competitive as both teams seek a crucial win.",
    "published": "2025-09-17T07:00:28Z"
  }
]