[
  {
    "title": "Liz Truss warns there is ‘a reckoning coming’ for central banks, and backs Trump in Fed battle; US growth revised higher amid AI boom – business live",
    "url": "https://www.theguardian.com/business/live/2025/aug/28/tesla-sales-fall-across-europe-byd-bond-market-shares-ftse-business-live-news-updates",
    "image": "https://media.guim.co.uk/cfdb5cc7bda6dc4d6aea2245075bdbf20e3d9fad/484_0_4840_3872/500.jpg",
    "summary": "Former Prime Minister criticizes the Bank of England, warning that the UK is in an \"economic doom loop.\" Concerns about the country's financial outlook are heightened amidst ongoing economic challenges. The situation becomes a focal point in the latest updates on economic and financial news.",
    "published": "2025-08-28T13:36:07Z"
  },
  {
    "title": "Home Office says injunction against Epping hotel would have ‘serious impact’ on UK’s ability to house asylum seekers - UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/aug/28/latest-uk-politics-news-keir-starmer-rachel-reeves-labour-live-updates",
    "image": "https://media.guim.co.uk/ce98a439324cf0ec721f78c26607e0cdcd8d57b5/137_0_2501_2001/500.jpg",
    "summary": "The director of asylum support testified at a court of appeal hearing that closing the Bell Hotel could set a dangerous precedent. He warned that such a decision might lead to public disorder in other areas. The implications of this closure are under scrutiny as the case unfolds.",
    "published": "2025-08-28T13:35:06Z"
  },
  {
    "title": "UK and EU summon top Russian diplomats after strikes hit British Council and EU offices in deadly attack on Kyiv - Europe live",
    "url": "https://www.theguardian.com/world/live/2025/aug/28/ukraine-kyiv-strike-russia-europe-zelenskyy-putin-updates-live-news-latest",
    "image": "https://media.guim.co.uk/73f3dc40757f1c02fa6275f97f063d845d9d9749/184_0_1778_1422/500.jpg",
    "summary": "An overnight raid has resulted in the deaths of over a dozen people, prompting condemnation from European leaders who decry the \"deliberate\" targeting of civilians and key institutions. The incident has raised significant concerns over escalating violence and the protection of human rights in the affected area. International calls for accountability and restraint are expected to follow the tragic event.",
    "published": "2025-08-28T13:23:36Z"
  },
  {
    "title": "Russian missile and drone attack on Kyiv kills at least 18 people",
    "url": "https://www.theguardian.com/world/2025/aug/28/russia-launches-kyiv-attack-ukraine-capital-deaths-injuries",
    "image": "https://media.guim.co.uk/df5e0f5c0b0c3ad4164c8fe97f31769a69c1913e/509_0_3340_2672/500.jpg",
    "summary": "Ukrainian President Volodymyr Zelenskyy criticized Moscow for opting for military actions over diplomatic efforts, following a series of strikes on more than 20 locations. He emphasized that Russia's choice of ballistics reflects its disregard for negotiations. The statement highlights the ongoing tensions and the impact of continued conflict in the region.",
    "published": "2025-08-28T12:46:55Z"
  },
  {
    "title": "West Ham poised to sign Southampton’s Mateus Fernandes in £38m deal",
    "url": "https://www.theguardian.com/football/2025/aug/28/west-ham-mateus-fernandes-southampton-transfer-latest",
    "image": "https://media.guim.co.uk/0fc2e0ae8a3801a40f99aa7c023a2ea2f0f36f1d/232_251_2034_1627/500.jpg",
    "summary": "West Ham is set to acquire Mateus Fernandes from Southampton. Additionally, they are close to finalizing the signing of Soungoutou Magassa from Monaco. These deals reflect the club's ongoing efforts to strengthen their squad.",
    "published": "2025-08-28T12:44:24Z"
  }
]