[
  {
    "title": "Rescuers free man trapped in partly collapsed medieval tower in Rome",
    "url": "https://www.theguardian.com/world/2025/nov/03/rome-tower-collapse-torre-dei-conti-italy",
    "image": "https://media.guim.co.uk/fadff127ec6291de745b406d9a400ef8e6f43851/512_0_2560_2048/500.jpg",
    "summary": "A Romanian worker was rescued from the rubble of Torre dei Conti in Italy and has been taken to the hospital in serious condition. The incident highlights ongoing safety concerns in construction sites. Authorities are investigating the circumstances surrounding the collapse.",
    "published": "2025-11-03T23:12:44Z"
  },
  {
    "title": "Americans ‘dumbfounded by cruelty’ of Trump officials slashing Snap benefits",
    "url": "https://www.theguardian.com/us-news/2025/nov/03/trump-snap-benefits-reactions",
    "image": "https://media.guim.co.uk/48003e75d309be0c518b90b37844299b7ab5ea37/322_0_3901_3122/500.jpg",
    "summary": "42 million people enrolled in the program are concerned that losing their benefits will drastically impact their lives. Many express fears of financial instability and uncertainty if the support ends. The potential cutoff could exacerbate existing struggles for those relying on the assistance.",
    "published": "2025-11-03T23:07:25Z"
  },
  {
    "title": "Trump threatens to pull federal funds for New York City if Zohran Mamdani wins mayoral election – live",
    "url": "https://www.theguardian.com/us-news/live/2025/nov/03/us-government-shutdown-donald-trump-latest-politics-news",
    "image": "https://media.guim.co.uk/139a25c4e14a11363858c7bc3965c8693914226b/436_0_4631_3703/500.jpg",
    "summary": "President Biden has expressed support for former New York Governor Andrew Cuomo, who is now running as an independent candidate despite his controversial resignation. This endorsement comes as Cuomo seeks to revive his political career following allegations of misconduct. Biden's backing raises questions about the potential impact on the upcoming elections.",
    "published": "2025-11-03T23:05:49Z"
  },
  {
    "title": "Australia news live: police pepper-spray protesters and make arrests outside Sydney weapons expo; Tim Wilson says Ley mustn’t lose ‘moral authority’ on policy",
    "url": "https://www.theguardian.com/australia-news/live/2025/nov/04/australia-politics-live-keating-trump-anthony-albanese-sussan-ley-david-littleproud-net-zero-policy-coalition-question-time-energy-policy-ntwnfb",
    "image": "https://media.guim.co.uk/12271e2481142985fa44991ce34c238f5739b4fd/668_0_7857_6286/500.jpg",
    "summary": "Please provide the news article or information you'd like summarized, and I'll be happy to help!",
    "published": "2025-11-03T23:03:26Z"
  },
  {
    "title": "Pornography depicting strangulation to become criminal offence in the UK",
    "url": "https://www.theguardian.com/society/2025/nov/03/pornography-depicting-strangulation-to-become-criminal-offence-in-the-uk",
    "image": "https://media.guim.co.uk/b17aa568a5dbecc2fb85fa7195b14eb72c95c406/320_0_4333_3467/500.jpg",
    "summary": "Tech platforms may face new legal requirements to prevent users from accessing harmful content, often referred to as 'choking' material. This initiative aims to enhance user safety and regulate the type of content available online. The move stems from increasing concerns about the impact of harmful material on users.",
    "published": "2025-11-03T22:30:11Z"
  }
]