[
  {
    "title": "Covid inquiry live: Boris Johnson to be questioned over impact of pandemic on children",
    "url": "https://www.theguardian.com/uk-news/live/2025/oct/21/covid-19-inquiry-boris-johnson-pandemic-children-lockdown-impact-live-updates",
    "image": "https://media.guim.co.uk/ce747b151ab85d3eb55a46c14e44d8428ea1c3aa/1136_1053_2303_1843/500.jpg",
    "summary": "The former prime minister is testifying at the UK's Covid-19 inquiry. The inquiry aims to investigate the government's handling of the pandemic. This appearance highlights ongoing scrutiny over decisions made during the crisis.",
    "published": "2025-10-21T08:25:02Z"
  },
  {
    "title": "Defiant Sarkozy begins jail sentence as lawyer says he will be held in solitary confinement – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/oct/21/nicolas-sarkozy-france-jail-russia-ukraine-europe-news-live-updates",
    "image": "https://media.guim.co.uk/2b5cd7d1e8743daefc14f0cb0f50323a981871d7/1629_167_5072_4057/500.jpg",
    "summary": "France's former president has been convicted of receiving Libyan funds for his 2007 election campaign. He has begun serving his sentence at La Santé prison in Paris. This ruling marks a significant legal setback for the former leader.",
    "published": "2025-10-21T08:22:48Z"
  },
  {
    "title": "Reeves’s pledge to save firms £6bn by cutting red tape dismissed as not ‘remotely serious’ by Tories – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/oct/21/rachel-reeves-economy-starmer-labour-streeting-sentencing-bill-uk-politics-live-news-updates",
    "image": "https://media.guim.co.uk/82b1f5de3873010e16591eb56fc15dfe9fbe82de/239_0_5000_4000/500.jpg",
    "summary": "The Chancellor and Business Secretary are speaking at a regional summit in Birmingham, focusing on strategies to address the UK's challenging economic conditions. They aim to engage with local leaders and businesses to find solutions and stimulate growth. The event comes amid a backdrop of a bleak economic forecast for the country.",
    "published": "2025-10-21T08:21:32Z"
  },
  {
    "title": "Gaza ceasefire live: Vance heads to Israel as Qatar condemns ‘continued violation’ of ceasefire",
    "url": "https://www.theguardian.com/world/live/2025/oct/21/israel-gaza-ceasefire-jd-vance-hostages-hamas-netanyahu-latest-news-updates",
    "image": "https://media.guim.co.uk/8870f4ed14d0ebbc3b4214bad06ab0305615597a/321_469_3393_2714/500.jpg",
    "summary": "US Vice President Kamala Harris visited Israel shortly after two former Trump envoys held discussions with Prime Minister Benjamin Netanyahu. The trip underscores ongoing diplomatic efforts and communication between the U.S. and Israel. Harris's visit aims to strengthen ties and address regional issues amidst current geopolitical tensions.",
    "published": "2025-10-21T08:21:05Z"
  },
  {
    "title": "Rachel Reeves’s fiscal headroom ’all but exhausted’ as borrowing rises over forecast; Amazon Web Services outage ‘resolved’ – business live",
    "url": "https://www.theguardian.com/business/live/2025/oct/21/uk-borrowing-outstrips-forecasts-reeves-amazon-web-services-outage-resolved-bank-of-england-stock-markets-business-live-news",
    "image": "https://media.guim.co.uk/33043e635ce2b16bdd760078e1df4511ce16a2d7/499_0_5002_4002/500.jpg",
    "summary": "Economists predict that the UK Chancellor will increase taxes next month due to the country’s borrowing reaching a five-year high. This move is seen as a response to growing fiscal challenges. Policymakers are under pressure to address the increasing national debt.",
    "published": "2025-10-21T08:20:59Z"
  }
]