[
  {
    "title": "Poland scrambles aircraft as Russia attacks Ukraine with hundreds of drones and missiles – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/sep/20/poland-russia-estonia-ukraine-war-europe-latest-news-updates",
    "image": "https://media.guim.co.uk/9de5578fe9d20bd6356e8ddd441f42a976ebaa2a/87_0_1091_873/500.jpg",
    "summary": "Poland scrambled its aircraft to safeguard its airspace amid heightened tensions. This response came after Ukraine reported a substantial Russian attack involving over 600 drones and missiles. The situation underscores growing security concerns in the region.",
    "published": "2025-09-20T08:38:18Z"
  },
  {
    "title": "Merseyside derby buildup, Manchester United v Chelsea and more – matchday live",
    "url": "https://www.theguardian.com/football/live/2025/sep/20/merseyside-derby-buildup-manchester-united-v-chelsea-and-more-matchday-live",
    "image": "https://media.guim.co.uk/ad753a7e6b1df38fa2c81520250ccc6050c5cf8e/0_0_5000_4000/500.jpg",
    "summary": "Emillia Hawkins will provide comprehensive coverage of today's key football events. Tune in for news updates, analytical insights, and buildup to the matches. Stay informed and ready for all the action!",
    "published": "2025-09-20T08:36:33Z"
  },
  {
    "title": "Collingwood v Brisbane: AFL 2025 first preliminary final – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/20/afl-2025-first-preliminary-final-collingwood-magpies-v-brisbane-lions-live",
    "image": "https://media.guim.co.uk/f2d19b8e8299525aceec40ba29a44d7cfa9e1da9/479_0_3104_2483/500.jpg",
    "summary": "Collingwood and Brisbane are set to face off at the MCG for a chance to compete against Geelong in the grand final. The match promises to be a thrilling showdown as both teams vie for the coveted position. Martin Pegan will provide live updates throughout the game.",
    "published": "2025-09-20T08:33:07Z"
  },
  {
    "title": "The aide, the associate, the ‘Chinese agent’ – and the collapse of a long-awaited UK spy trial",
    "url": "https://www.theguardian.com/uk-news/2025/sep/20/collapse-uk-spy-trial-china-christopher-cash-christopher-berry",
    "image": "https://media.guim.co.uk/33f77b501863cc75fbdbf3e359ff751a58372653/2021_0_4440_3554/500.jpg",
    "summary": "The case against Christopher Cash and Christopher Berry was unexpectedly dismissed, raising concerns about the decision-making process of the Crown Prosecution Service (CPS). The abrupt ending has prompted inquiries into the reasons behind the move. Critics are calling for clarification on the case's developments and the CPS's handling of similar situations.",
    "published": "2025-09-20T08:04:54Z"
  },
  {
    "title": "Parliament vulnerable to ‘foreign actors’ after China spying charges dropped, Commons speaker says",
    "url": "https://www.theguardian.com/uk-news/2025/sep/20/parliament-vulnerable-to-foreign-actors-after-china-spying-charges-dropped-commons-speaker-says",
    "image": "https://media.guim.co.uk/dba6ef6162d8edf3764cd64a0f92058cec0b6ec0/0_0_6703_5366/500.jpg",
    "summary": "UK Speaker Lindsay Hoyle has expressed concern over prosecutors dropping a case, suggesting it creates an opportunity for spies. He emphasized the implications this decision could have for national security. Hoyle's remarks highlight the ongoing challenges faced in handling espionage cases.",
    "published": "2025-09-20T08:04:50Z"
  }
]