[
  {
    "title": "Politics live: Albanese and Wong welcome first phase of Gaza peace plan and thank Donald Trump",
    "url": "https://www.theguardian.com/australia-news/live/2025/oct/09/australia-politics-live-opera-house-rally-palestine-gaza-parliament-senate-estimates-anthony-albanese-sussan-ley-question-time-ntwnfb",
    "image": "https://media.guim.co.uk/bce049185634560fc7d935e21eddb8ba2e189a8f/536_0_6880_5504/500.jpg",
    "summary": "I'm sorry, but I need more specific details about the news you want summarized. Please provide the content or key points you'd like me to summarize.",
    "published": "2025-10-09T01:24:44Z"
  },
  {
    "title": "Gaza ceasefire live: Hostages and prisoners to be released within 72 hours of deal starting - Hamas",
    "url": "https://www.theguardian.com/world/live/2025/oct/08/gaza-ceasefire-talks-israel-hamas-trump-us-qatar-turkey-egypt-live-news-updates",
    "image": "https://media.guim.co.uk/fed85a0e98dd8f5bd8cb8d87764405150bb8f946/500_0_5000_4000/500.jpg",
    "summary": "Donald Trump declared that all hostages would be released \"very soon,\" signaling progress in negotiations. He also stated that Israel plans to withdraw its troops to a mutually agreed-upon line. This announcement suggests a potential easing of tensions in the region.",
    "published": "2025-10-09T01:23:33Z"
  },
  {
    "title": "White House gives platform to conservative influencers to air grievances during ‘antifa roundtable’ – live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/08/donald-trump-james-comey-justice-department-national-guard-chicago-antifa-government-shutdown-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/e98a840458f5c01a13c2a0283df99f33a44cef7a/613_0_6683_5349/500.jpg",
    "summary": "Witnesses at the White House report being assaulted by leftwing protesters. However, they do not acknowledge that they frequently engage with these individuals and film their reactions. This omission highlights a complex dynamic between the protesters and those interacting with them.",
    "published": "2025-10-09T01:18:11Z"
  },
  {
    "title": "‘Humanitarian’ visa must be created for Pacific Islanders displaced by climate crisis, experts say ",
    "url": "https://www.theguardian.com/world/2025/oct/09/climate-crisis-humanitarian-visa-displaced-pacific-islanders",
    "image": "https://media.guim.co.uk/84169314a5f8ec3efe99f1f25b7d5f010ad4d330/304_0_1440_1152/500.jpg",
    "summary": "There are increasing calls for reforms to facilitate migration from Pacific nations affected by the climate crisis, with a focus on making it easier for these individuals to move to New Zealand. Advocates argue that this is essential for the future of communities facing rising sea levels and extreme weather events. The proposed changes aim to address urgent humanitarian needs and support vulnerable populations.",
    "published": "2025-10-09T01:02:25Z"
  },
  {
    "title": "Ukraine war briefing: Analysts flag Kremlin scare campaign against use of Tomahawks ",
    "url": "https://www.theguardian.com/world/2025/oct/09/ukraine-war-briefing",
    "image": "https://media.guim.co.uk/af5ea0797eb95b8173744b683a5e67a48ed8e7c7/103_0_3295_2637/500.jpg",
    "summary": "A Russian lawmaker warned that the U.S. missiles provided to Ukraine would lead to repercussions for those causing harm to Russia. As the Ukrainian counteroffensive continues, Russia is reportedly suffering significant losses. This marks the 1,324th day of the ongoing conflict.",
    "published": "2025-10-09T00:53:25Z"
  }
]