[
  {
    "title": "Vladimir Putin arrives in China for security summit – Ukraine war live",
    "url": "https://www.theguardian.com/world/live/2025/aug/31/russia-ukraine-war-control-major-ukrainian-city-latest-updates-news-live",
    "image": "https://media.guim.co.uk/544de0f374aa00a9bf9f9df3cc80afaf27bdb9ee/438_0_3683_2946/500.jpg",
    "summary": "Russian President Vladimir Putin and Indian Prime Minister Narendra Modi are among over 20 world leaders participating in the Shanghai Cooperation Organisation summit in Tianjin. The summit focuses on regional security, economic cooperation, and counterterrorism efforts. This gathering highlights the increasing importance of the SCO in international diplomacy.",
    "published": "2025-08-31T09:26:07Z"
  },
  {
    "title": "Bridget Phillipson: parents must do more about bad behaviour and attendance in schools",
    "url": "https://www.theguardian.com/politics/2025/aug/31/bridget-phillipson-parents-must-do-more-about-bad-behaviour-and-attendance-in-schools",
    "image": "https://media.guim.co.uk/98316909ecba73b09eb96859bd0f7f8ecb66ce9b/179_0_4086_3270/500.jpg",
    "summary": "The Education Secretary has identified 800 schools for targeted support to address challenges stemming from the Covid-19 pandemic. This initiative aims to enhance educational outcomes and reverse negative trends in student performance. The focus is on providing additional resources to improve learning environments and bolster student success.",
    "published": "2025-08-31T09:16:33Z"
  },
  {
    "title": "Why we’ve all fallen for The Summer I Turned Pretty: ‘Endless, wonderful melodrama’",
    "url": "https://www.theguardian.com/tv-and-radio/2025/aug/31/the-summer-i-turned-pretty-amazon-fans",
    "image": "https://media.guim.co.uk/6f85f656b4980ed6e9320b45e6cda4860255059b/224_0_2500_2000/500.jpg",
    "summary": "The third season of the Amazon teen drama has gained significant popularity, becoming a certified phenomenon among audiences. It has sparked watch parties and generated intense fan reactions. Viewers are increasingly engaged and passionate about the show's developments.",
    "published": "2025-08-31T09:14:25Z"
  },
  {
    "title": "‘All the power is with the employer’: why zero-hours workers welcome Labour’s rights bill",
    "url": "https://www.theguardian.com/uk-news/2025/aug/31/why-zero-hours-workers-welcome-labour-rights-bill",
    "image": "https://media.guim.co.uk/dab8f7f49735f53e8a5953876debe7c4a3a1922b/422_0_6880_5504/500.jpg",
    "summary": "Critics are urging the government to modify the legislation, highlighting concerns about its impact. However, many employees believe that the proposed changes are urgently needed. The situation reflects a tension between different stakeholders regarding the legislation's implementation.",
    "published": "2025-08-31T09:00:26Z"
  },
  {
    "title": "Bullfights, ballet and hot jazz: inside Picasso’s scandalous theatre of sex and death",
    "url": "https://www.theguardian.com/artanddesign/2025/aug/31/pablo-picasso-theatre-dance-tate-modern-weeping-woman",
    "image": "https://media.guim.co.uk/393c59ec22c527bceb919ce74cff9dd2d17ffd1f/0_922_2332_1865/500.jpg",
    "summary": "A new exhibition highlights the dramatic aspects of renowned Spanish artist Pablo Picasso, known for his cubist portraits. It showcases his work in costume design for the Ballet Russes and his fascination with the intensity of bullfighting. The exhibition emphasizes Picasso's uncompromising artistic vision.",
    "published": "2025-08-31T09:00:26Z"
  }
]