[
  {
    "title": "Australia news live: Conroy says Canavan’s ‘fear and panic’ comments on climate report show Coalition is woefully out of touch",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/16/australia-news-live-sydney-airport-social-media-ban-anthony-albanese-chris-bowen-climate-crisis-carbon-emissions-png-treaty-ntwnfb",
    "image": "https://media.guim.co.uk/7db39c98677f3ad105db79149d73da7429530283/330_0_4560_3648/500.jpg",
    "summary": "I'm sorry, but I need more context or details about the news you want summarized. Please provide the relevant information or text.",
    "published": "2025-09-15T23:22:09Z"
  },
  {
    "title": "Trump to send national guard to Memphis and says Chicago is ‘probably next’",
    "url": "https://www.theguardian.com/us-news/2025/sep/15/trump-national-guard-democratic-run-memphis",
    "image": "https://media.guim.co.uk/f805d7ffba56fea64f841d007b443dfcd61d7864/0_0_4853_3885/500.jpg",
    "summary": "The administration is intensifying efforts to address urban crime in Democratic-run cities by expanding military-led responses. This initiative aims to provide additional support and resources to local law enforcement. Critics of the move argue it could lead to increased tensions between communities and law enforcement.",
    "published": "2025-09-15T23:16:40Z"
  },
  {
    "title": "Trump announces he will send national guard to Memphis, with Chicago ‘probably next’ – live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/15/donald-trump-politics-washington-dc-national-emergency-ice-charlie-kirk-live-news-updates",
    "image": "https://media.guim.co.uk/0ac757da2bfa9a7f214155fb02da71980412ebbf/454_0_4774_3819/500.jpg",
    "summary": "The US president announced the deployment of federal resources similar to the approach taken in Washington DC, expanding support to include St. Louis among other cities. This decision aims to address emerging challenges in urban areas. The specifics of the deployment strategy remain under discussion.",
    "published": "2025-09-15T23:13:33Z"
  },
  {
    "title": "Materialists effect: mentions of A24 film studio up 65% in dating app profiles",
    "url": "https://www.theguardian.com/film/2025/sep/16/materialists-a24-studio-dating-app-profiles-feeld",
    "image": "https://media.guim.co.uk/88200cfc52603ec69e81affd3207cdcb3f35870f/0_913_2171_1735/500.jpg",
    "summary": "Feeld, an alternative dating app, has evolved from a niche platform to a globally recognized brand in edgy and popular entertainment. The app has gained attention for its unique approach to dating. Its success reflects the growing acceptance of alternative relationship styles in mainstream culture.",
    "published": "2025-09-15T23:01:19Z"
  },
  {
    "title": "First ‘one in, one out’ deportation flight reportedly takes off without migrants",
    "url": "https://www.theguardian.com/uk-news/2025/sep/15/first-one-in-one-out-deportation-flight-reportedly-takes-off-without-migrants",
    "image": "https://media.guim.co.uk/cbaab51b5205c08276fce498c36d3549fcb660fd/625_0_3333_2667/500.jpg",
    "summary": "A group of individuals who crossed the Channel by boat were reportedly misidentified as having traveled on an Air France flight. This revelation followed a legal challenge regarding their origin. The clarification aims to address misinformation about their travel route.",
    "published": "2025-09-15T22:46:19Z"
  }
]