[
  {
    "title": "Gaza ceasefire talks live: negotiations to continue as Israelis mark two-year anniversary of 7 October attacks",
    "url": "https://www.theguardian.com/world/live/2025/oct/07/gaza-ceasefire-peace-talks-israel-hamas-egypt-7-october-anniversary-middle-east-crisis-live-news-updates",
    "image": "https://media.guim.co.uk/4aee60d80faebf0b6be070442cd901dd2e71d5ce/52_0_4583_3667/500.jpg",
    "summary": "On the first day of Gaza talks in Egypt, discussions between Hamas and mediators concluded with a \"positive atmosphere,\" according to local media. The meetings aim to address ongoing conflicts and seek resolutions. Further developments are expected as negotiations continue.",
    "published": "2025-10-07T10:20:07Z"
  },
  {
    "title": "England v Bangladesh: Women’s Cricket World Cup – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/07/england-v-bangladesh-womens-cricket-world-cup-live",
    "image": "https://media.guim.co.uk/1b6ccb1246306aac1e9f0d187b0447aafca190dc/327_0_3002_2402/500.jpg",
    "summary": "Nat Sciver-Brunt's team aims to capitalize on their recent dominating victory against South Africa. Follow Taha Hashim for live updates and insights. The match promises to showcase their continuing momentum in the tournament.",
    "published": "2025-10-07T10:19:40Z"
  },
  {
    "title": "Badenoch defends Jenrick over comments that he ‘did not see another white face’ in Birmingham – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/oct/07/conservative-tory-conference-kemi-badenoch-jenrick-starmer-labour-protests-reform-uk-politics-live-news-updates",
    "image": "https://media.guim.co.uk/963962bdc3a47355da4ce01a4c60b10e0d5213e9/17_0_3327_2661/500.jpg",
    "summary": "The Conservative leader indicated that his comments reported by The Guardian might have been misinterpreted. He clarified that his intention was merely to make an observation. This statement aims to address any potential misunderstandings stemming from the report.",
    "published": "2025-10-07T10:18:37Z"
  },
  {
    "title": "Trump threatens to invoke Insurrection Act as Bondi faces Senate – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/07/donald-trump-national-guard-pam-bondi-mark-carney-government-shutdown-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/badd39374c96b1635a40b20a5df2d7d91e2b9e83/495_0_5000_4000/500.jpg",
    "summary": "Legal disputes surrounding troop deployments are ongoing, with the attorney general expected to be questioned regarding the handling of Epstein files. These issues are part of broader legal challenges facing the government. The situation highlights the complexities of military and legal oversight.",
    "published": "2025-10-07T10:18:20Z"
  },
  {
    "title": "UK investors quit ‘sky-high’ stock markets at record pace; EU to raise tariffs on foreign steel imports – business live",
    "url": "https://www.theguardian.com/business/live/2025/oct/07/uk-house-price-growth-slowest-april-2024-trump-truck-imports-25-tariff-1-november-stock-markets-business-live-news",
    "image": "https://media.guim.co.uk/0dc9ffc84b3b0828c76d332fc5e85889fdd458d7/356_0_3172_2537/500.jpg",
    "summary": "The European Commission has proposed a 50% tariff on foreign steel imports, raising concerns from UK unions. They claim this move poses an \"existential threat\" to the UK steel industry. The proposed tariffs are intended to protect European producers from unfair competition.",
    "published": "2025-10-07T10:13:29Z"
  }
]