[
  {
    "title": "Australia news live: Jim Chalmers concerned by reports China blockading BHP iron ore; police find footprint in search for missing boy",
    "url": "https://www.theguardian.com/australia-news/live/2025/oct/01/australia-news-live-nicole-kidman-divorce-keith-urban-sussan-ley-coalition-andrew-hastie-anthony-albanese-housing-ntwnfb",
    "image": "https://media.guim.co.uk/62019b0c4f34228bde28a31f00257b6dea77e50a/1109_438_5541_4435/500.jpg",
    "summary": "Could you please provide the news article or details you want summarized?",
    "published": "2025-10-01T04:22:07Z"
  },
  {
    "title": "US government shuts down after failure to pass funding bill – live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/30/us-government-shutdown-funding-trump-vance-portland-hegseth-latest-updates",
    "image": "https://media.guim.co.uk/f1df06e9e9b4a4893f80093c8cb695c9adec448f/249_0_3713_2970/500.jpg",
    "summary": "Competing bills in the Senate were rejected amid accusations of partisan politics from both Republicans and Democrats. Each party blamed the other for not reaching a consensus. The standoff highlights ongoing divisions in Congress.",
    "published": "2025-10-01T04:19:46Z"
  },
  {
    "title": "‘It’s unsustainable’: homes in Great Britain brace for winter with soaring energy debts",
    "url": "https://www.theguardian.com/money/2025/oct/01/homes-in-great-britain-brace-for-winter-with-soaring-energy-debts",
    "image": "https://media.guim.co.uk/2333ca6363edcfd7ee1b4e992b8271ae192bb86b/695_0_6246_5000/500.jpg",
    "summary": "The annual dual-fuel charge has increased to £1,755, prompting charities to issue warnings about the record £4.4 billion debt owed to energy suppliers. This financial burden is significantly impacting vulnerable households. The situation highlights ongoing concerns about energy affordability and support for those struggling to pay their bills.",
    "published": "2025-10-01T04:01:01Z"
  },
  {
    "title": "‘Unprecedented in history’: global academic freedom group warns of dismantling in US",
    "url": "https://www.theguardian.com/us-news/2025/oct/01/academic-freedom-us",
    "image": "https://media.guim.co.uk/96da7a22cf68de3b691539be350a500487974c87/456_0_4560_3648/500.jpg",
    "summary": "A report from Scholars at Risk has documented approximately 40 attacks on academic freedom in the United States during the first half of 2025. The findings highlight growing concerns over the protection of intellectual inquiry and expression in academic institutions. This surge in incidents raises alarms about the state of academic freedom in the country.",
    "published": "2025-10-01T04:01:01Z"
  },
  {
    "title": "US government shuts down after Democrats refuse to back Republican funding plan",
    "url": "https://www.theguardian.com/us-news/2025/oct/01/us-government-shuts-down",
    "image": "https://media.guim.co.uk/f3f1e7cc6d6cdd54a6b3b5e610e18b0d2307b4a9/246_0_2990_2392/500.jpg",
    "summary": "The U.S. government has experienced its first shutdown in nearly seven years, as Republican lawmakers are accused of jeopardizing healthcare funding in a contentious spending bill. This political stalemate highlights ongoing debates over budget priorities and the implications for public services. The impasse has sparked concerns among citizens regarding the impact on essential services and programs.",
    "published": "2025-10-01T04:00:51Z"
  }
]