[
  {
    "title": "Liverpool v Everton, Spurs v West Ham, Manchester United v Leicester and more: WSL – live ",
    "url": "https://www.theguardian.com/football/live/2025/sep/07/liverpool-v-everton-spurs-v-west-ham-manchester-united-v-leicester-and-more-wsl-live",
    "image": "https://media.guim.co.uk/0ccc23b4b62db983ee169b7ca3a849b4a45e8e82/316_0_3886_3108/500.jpg",
    "summary": "The Women's Super League features key matchups with Tottenham facing West Ham, Liverpool against Everton, and Manchester United taking on Leicester. Coverage will be provided by Billy Munday. The matches promise exciting action in women's football.",
    "published": "2025-09-07T10:31:41Z"
  },
  {
    "title": "England v South Africa: third men’s one-day international – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/07/england-v-south-africa-third-mens-one-day-international-live",
    "image": "https://media.guim.co.uk/34eb97c1d34755244d69eb3739a16cf64d0bfd0a/157_0_2844_2276/500.jpg",
    "summary": "South Africa has secured the ODI series win against England. The final match will take place at the Utilita Bowl, giving England a chance to redeem themselves. Fans and writers are eager to see if England can salvage some pride in the concluding game.",
    "published": "2025-09-07T10:31:38Z"
  },
  {
    "title": "The Party Girls review – Mitford sisters get-together is missing some life and soul",
    "url": "https://www.theguardian.com/stage/2025/sep/07/the-party-girls-review-mitford-sisters-marlowe-theatre",
    "image": "https://media.guim.co.uk/4f8cfbf2958e0739a6b906534c291e8ace6fd447/760_0_5730_4585/500.jpg",
    "summary": "Amy Rosenthal's drama delves into the dynamics of aristocratic It girls and sibling relationships. However, it fails to introduce fresh insights or highlight its relevance to contemporary issues. Overall, the narrative feels familiar and lacks originality.",
    "published": "2025-09-07T10:27:22Z"
  },
  {
    "title": "Anderson eyes England World Cup place, Germany v Northern Ireland, WSL and more – matchday live",
    "url": "https://www.theguardian.com/football/live/2025/sep/07/merseyside-derby-in-wsl-england-reaction-and-germany-v-northern-ireland-matchday-live",
    "image": "https://media.guim.co.uk/cd3d3ca279338ef428ad76095ec2ef9650016fdf/784_0_4633_3706/500.jpg",
    "summary": "The latest football updates highlight an exciting weekend in the Women's Super League (WSL) as teams prepare for their matches. Additionally, Northern Ireland's national team gears up for a crucial World Cup qualifier against Germany. Fans can expect intense action and significant implications for both leagues and tournaments.",
    "published": "2025-09-07T10:24:46Z"
  },
  {
    "title": "Nigel Farage says Reform UK will not make pact with Boris Johnson",
    "url": "https://www.theguardian.com/politics/2025/sep/07/nigel-farage-boris-johnson-not-welcome-reform-pact",
    "image": "https://media.guim.co.uk/e8fdc1fde091603e4d251b5454d8f9334105a46a/0_534_5504_4403/500.jpg",
    "summary": "Reform leader criticized the former Prime Minister's immigration policies, asserting that the public will \"never forgive\" him for them. This statement followed Nadine Dorries' call for unity within the party. The comments highlight ongoing divisions and frustrations regarding immigration strategies.",
    "published": "2025-09-07T10:05:13Z"
  }
]