[
  {
    "title": "What to expect in budget 2025: tax, VAT, pensions, savings and more",
    "url": "https://www.theguardian.com/uk-news/2025/nov/25/budget-2025-tax-vat-pensions-savings-rachel-reeves",
    "image": "https://media.guim.co.uk/32d65d64827809daa41b207e1da183366e166ae2/1182_165_4672_3738/500.jpg",
    "summary": "Rachel Reeves is expected to make a significant announcement following months of speculation. The details of her statement are anticipated to reveal key insights into her plans or initiatives. This announcement could have notable implications for her political agenda and current issues.",
    "published": "2025-11-25T15:21:08Z"
  },
  {
    "title": "Ukraine ‘supports essence of peace deal’ following Geneva talks, Ukrainian official reportedly says - Europe live ",
    "url": "https://www.theguardian.com/world/live/2025/nov/25/us-russia-ukraine-peace-talks-abu-dhabi-kyiv-strikes-zelenskyy-putin-europe-live-news",
    "image": "https://media.guim.co.uk/eb053601e69d2a0f8cc056d984033cbd97ca488f/252_0_4589_3672/500.jpg",
    "summary": "An official informed Reuters that crucial discussions are still required between Ukrainian President Zelenskyy and former U.S. President Trump. These sensitive topics are pivotal for future relations and negotiations. Clarity on these issues could impact bilateral cooperation and support.",
    "published": "2025-11-25T15:20:16Z"
  },
  {
    "title": "Venues cancelled Katie Hopkins shows after man blackmailed them, court told",
    "url": "https://www.theguardian.com/uk-news/2025/nov/25/venues-cancelled-katie-hopkins-shows-after-man-blackmailed-them-court-told",
    "image": "https://media.guim.co.uk/bb9e0c82c31cdbff62f75e82159465c00260564c/291_61_2538_2030/500.jpg",
    "summary": "Oliver Hutchings has been accused of threatening to disrupt UK shows and campaigning against venues that host controversial figure Katie Hopkins. The allegations involve intimidation tactics aimed at event organizers. The situation has raised concerns about freedom of expression and the right to protest in the arts.",
    "published": "2025-11-25T15:14:31Z"
  },
  {
    "title": "Turner & Constable review – boiling portentous skies versus two men and a dog",
    "url": "https://www.theguardian.com/artanddesign/2025/nov/25/turner-constable-review-tate-britain",
    "image": "https://media.guim.co.uk/eee141d79e8fa12f76908c4fb9119adcd702902a/484_0_6604_5286/500.jpg",
    "summary": "In a stunning exhibition, John Constable triumphs over JMW Turner. Despite the competition, the immersive quality of the artwork captivates viewers, evoking sensory experiences of sounds and scents. The sublime nature of the pieces showcased overshadows the rivalry.",
    "published": "2025-11-25T15:14:18Z"
  },
  {
    "title": "Jacob Zuma’s daughter accused of tricking men into fighting for Russia in Ukraine",
    "url": "https://www.theguardian.com/world/2025/nov/25/jacob-zuma-daughter-accused-tricking-men-fighting-for-russia-in-ukraine",
    "image": "https://media.guim.co.uk/72de469fe117dd2b7b6bdb69408193f43c7e7098/1125_0_5625_4500/500.jpg",
    "summary": "South African police are investigating allegations made by one of former President Jacob Zuma's daughters against Duduzile Zuma-Sambudla. The nature of the allegations has not been disclosed. The investigation underscores ongoing family tensions within the Zuma clan.",
    "published": "2025-11-25T15:13:59Z"
  }
]