[
  {
    "title": "Pound dips after UK economy doesn’t grow in July; Ocado shares slide amid robotic warehouses demand fears – business live",
    "url": "https://www.theguardian.com/business/live/2025/sep/12/uk-gdp-report-economy-july-tariffs-inflation-consumer-confidence-business-live",
    "image": "https://media.guim.co.uk/c6be9b8c1d79a51bd79ae817a30de8a7c44a0aad/166_0_4934_3948/500.jpg",
    "summary": "The UK Treasury spokesperson indicated that the economy appears \"stuck\" following stagnant GDP figures for July. This lack of growth highlights ongoing economic challenges. The unchanged GDP reflects broader concerns about the health of the UK economy.",
    "published": "2025-09-12T14:33:44Z"
  },
  {
    "title": "Charlie Kirk shooting latest: Utah governor confirms identity of suspect in custody, saying ‘we got him’",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/12/charlie-kirk-shooter-suspect-latest-news-updates-donald-trump-utah",
    "image": "https://media.guim.co.uk/ca8554f3ef7bb4b9452f7942dced10abb093acdf/58_0_6000_4800/500.jpg",
    "summary": "Utah Governor Spencer Cox reported that Tyler Robinson, 22, admitted to a family friend that he shot Kirk. The FBI director confirmed that Robinson was taken into custody at 10 PM Mountain Time. The investigation is ongoing.",
    "published": "2025-09-12T14:33:05Z"
  },
  {
    "title": "‘They are the strongest’: Arteta says Liverpool have best squad in Premier League",
    "url": "https://www.theguardian.com/football/2025/sep/12/arsenal-mikel-arteta-says-liverpool-have-best-squad-in-premier-league",
    "image": "https://media.guim.co.uk/e5101b6fa5fac56b68c1d442c38c66a589d159fa/316_140_3426_2742/500.jpg",
    "summary": "Mikel Arteta has praised Liverpool for having the strongest squad in the Premier League following their signing of Alexander Isak. He acknowledges the team's depth and quality, particularly with this latest addition. Arteta's comments reflect the competitive nature of the league and the challenges faced by other clubs.",
    "published": "2025-09-12T14:30:41Z"
  },
  {
    "title": "Sarah Connolly/Joseph Middleton: The World Feels Dusty album review – powerful narrations spanning Ella Fitzgerald to Emily Dickinson",
    "url": "https://www.theguardian.com/music/2025/sep/12/sarah-connolly-joseph-middleton-the-world-feels-dusty-album-review",
    "image": "https://media.guim.co.uk/801a30cf02f0357b791a497abf3b077eaad0d589/0_1048_5685_4545/500.jpg",
    "summary": "Connolly and Middleton deliver a vibrant, full-color piano performance, focusing meticulously on every word and harmonic shift. Their interpretation showcases an engaging immediacy that captivates the audience. The duo's attention to detail enhances the overall musical experience.",
    "published": "2025-09-12T14:30:37Z"
  },
  {
    "title": "Amorim says United are ‘a better team’; Wissa, Ramsey and Delap face injury layoffs – live",
    "url": "https://www.theguardian.com/football/live/2025/sep/12/premier-league-buildup-press-conferences-team-news-live",
    "image": "https://media.guim.co.uk/0250b89bfc3530fb3d3da9dea2d24590792d753b/184_0_1373_1098/500.jpg",
    "summary": "Barry Glendenning will be providing updates as the Premier League resumes after the international break. Fans can expect the latest news and insights about the league's returning matches. Stay tuned for all the action and developments!",
    "published": "2025-09-12T14:30:36Z"
  }
]