[
  {
    "title": "Terence Crawford defeats Canelo Álvarez to win undisputed super middleweight championship – live reaction",
    "url": "https://www.theguardian.com/sport/live/2025/sep/13/canelo-alvarez-v-terence-crawford-undisputed-super-middleweight-championship-live-buildup",
    "image": "https://media.guim.co.uk/c45957b7834181efbc888573c9a680c694e4de7d/0_848_2422_1938/500.jpg",
    "summary": "Canelo Álvarez and Terence Crawford faced off at Allegiant Stadium in a highly anticipated boxing match. Bryan Graham reported on the event, highlighting its significance in the boxing world. The fight is regarded as one of the most significant showdowns in recent years.",
    "published": "2025-09-14T06:31:33Z"
  },
  {
    "title": "Terence Crawford stuns Canelo Álvarez to become undisputed super middleweight champion",
    "url": "https://www.theguardian.com/sport/2025/sep/13/terence-crawford-canelo-alvarez-fight-report-undisputed",
    "image": "https://media.guim.co.uk/1da56bc2b59f6fbf22965eb3f9e9fe18d1e8f9ed/653_0_6530_5227/500.jpg",
    "summary": "Terence Crawford defeated Canelo Álvarez by decision in front of 70,000 fans in Las Vegas, capturing all four super-middleweight belts. This victory solidifies Crawford's status in boxing history. The match showcased Crawford's skill and strategy against the renowned champion.",
    "published": "2025-09-14T06:10:24Z"
  },
  {
    "title": "The question for the NSW Liberals after the Kiama drubbing is: can anyone do better than Mark Speakman?",
    "url": "https://www.theguardian.com/australia-news/2025/sep/14/the-question-for-the-nsw-liberals-after-the-kiama-drubbing-is-can-anyone-do-better-than-mark-speakman",
    "image": "https://media.guim.co.uk/51a3273d5e6fccece7dc70ef85a0ddcb2b5c63ae/826_0_4133_3306/500.jpg",
    "summary": "Kellie Sloane has dismissed the possibility of relocating a spill, while James Griffin is hesitant to pursue it. Alister Henskens is believed to lack sufficient support. Consequently, the leader appears to be secure for the time being.",
    "published": "2025-09-14T06:08:07Z"
  },
  {
    "title": "Court room or soap opera? Employment tribunals aren’t as boring as they sound",
    "url": "https://www.theguardian.com/money/2025/sep/14/employment-tribunals-court-room-or-soap-opera",
    "image": "https://media.guim.co.uk/95ca18531c7e6437edcf99937ed5db0e90f280cf/279_0_5000_4000/500.jpg",
    "summary": "A tribunal is examining whether calling a boss a \"dickhead\" constitutes acceptable workplace behavior or harassment. The case raises questions about workplace conduct and the boundaries of professional language. Judges face a challenging task in interpreting the nuances of these claims.",
    "published": "2025-09-14T06:00:27Z"
  },
  {
    "title": "Chinese carmakers told to improve locking devices for UK market ",
    "url": "https://www.theguardian.com/business/2025/sep/14/chinese-carmakers-told-improve-locking-devices-uk-market",
    "image": "https://media.guim.co.uk/921e6510112401afcf08afeab0a187e81122580a/503_0_2497_1998/500.jpg",
    "summary": "UK insurers are calling for significant changes to regulations regarding vehicle sales due to alarming rates of car theft that surpass those in China. The rise in theft incidents has prompted discussions on enhancing security features and monitoring measures. Insurers aim to protect consumers and reduce losses associated with stolen vehicles.",
    "published": "2025-09-14T06:00:26Z"
  }
]