[
  {
    "title": "Trump’s ‘cruel’ autism claims; a legal win for the greater glider; and which AFL grand final team to back",
    "url": "https://www.theguardian.com/australia-news/2025/sep/23/afternoon-update-tuesday-ntwnfb",
    "image": "https://media.guim.co.uk/595ec2fbf5f5d1cea70e97319e06139d7c07e698/345_0_4680_3744/500.jpg",
    "summary": "Australia's chief medical officer, along with other experts, has criticized the Trump administration's recent announcement. The condemnation stems from concerns about public health implications and the potential impacts on global cooperation. This highlights the ongoing tensions between international health leaders and U.S. policy decisions.",
    "published": "2025-09-23T06:45:35Z"
  },
  {
    "title": "Gold price on track for best year since 1979 as it hits record high – business live",
    "url": "https://www.theguardian.com/business/live/2025/sep/23/gold-price-on-track-best-year-since-1979-record-high-global-economy-uk-growth-business-live-news",
    "image": "https://media.guim.co.uk/b81f258a8a10268e186bfdb55c3fc3ba832ad6b3/458_0_4583_3667/500.jpg",
    "summary": "The latest economic and financial news highlights ongoing market fluctuations and key developments in monetary policy. Investors are closely monitoring inflation rates and central bank responses, which are impacting global markets. Analysts are providing rolling coverage to keep stakeholders informed on the evolving economic landscape.",
    "published": "2025-09-23T06:44:06Z"
  },
  {
    "title": "Australia news live: two MPs cleared in Jacinta Allan manure investigation; search for couple missing in Tasmanian light plane called off",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/23/australia-news-live-albanese-new-york-palestine-united-nations-donald-trump-mark-butler-paracetamol-pregnancy-ntwnfb",
    "image": "https://media.guim.co.uk/a7550bd072c921726a2c637d58a1089367b8fe73/1248_0_6240_4992/500.jpg",
    "summary": "Please provide the news you would like summarized, and I'll be happy to help!",
    "published": "2025-09-23T06:40:00Z"
  },
  {
    "title": "Sky News Australia staffer helped arrange bacon on guest’s shirt before offensive anti-Islam interview",
    "url": "https://www.theguardian.com/media/2025/sep/23/sky-news-australia-staffer-helped-arrange-bacon-on-guests-shirt-before-offensive-anti-islam-interview",
    "image": "https://media.guim.co.uk/887bff83c4cbb1fde25c3ee75cd03415140fee7e/110_27_829_663/500.jpg",
    "summary": "UK influencer Ryan Williams shared a lighthearted interaction with a staff member, highlighting that News Corp had prior knowledge of the content before a segment aired. This revelation raises questions about editorial transparency. The incident underscores the relationship between influencers and media organizations in content creation.",
    "published": "2025-09-23T06:15:39Z"
  },
  {
    "title": "Will There Ever Be Another You by Patricia Lockwood review – long Covid from the inside",
    "url": "https://www.theguardian.com/books/2025/sep/23/will-there-ever-be-another-you-by-patricia-lockwood-review-long-covid-from-the-inside",
    "image": "https://media.guim.co.uk/62128c555fd51e7115f50110536f58450cfa9756/59_660_3377_2701/500.jpg",
    "summary": "The cult author's new autofictional book serves as a follow-up to \"No One Is Talking About This.\" It explores the theme of personal breakdown, delving into the author's emotional struggles. The story combines introspection with a reflective narrative style.",
    "published": "2025-09-23T06:00:42Z"
  }
]