[
  {
    "title": "Trump tells foreign firms to ‘respect’ immigration laws after Hyundai raid – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/08/donald-trump-immigration-hyundai-tariffs-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/206b6a050c7692b19e2a312a1b21419be68db1c9/224_0_2045_1636/500.jpg",
    "summary": "The President expressed support for foreign investments in the U.S. economy. However, he emphasized the importance of these companies hiring and training American workers. This initiative aims to enhance job opportunities for the domestic workforce.",
    "published": "2025-09-08T10:40:27Z"
  },
  {
    "title": "Leicestershire v Gloucestershire, Somerset v Yorkshire and more: county cricket – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/08/county-championship-cricket-surrey-warwickshire-somerset-yorkshire-live",
    "image": "https://media.guim.co.uk/b6d442410dab7c1ed66ed107304030f9d8ffb908/0_0_4940_3953/500.jpg",
    "summary": "Tanya Aldred provides live updates as the County Championship resumes after a month-long hiatus. Fans can expect highlights from matches happening across various grounds. Stay tuned for the latest scores and key moments from the day's play.",
    "published": "2025-09-08T10:39:30Z"
  },
  {
    "title": "Hopes rise for green economy boom at Africa Climate Summit ",
    "url": "https://www.theguardian.com/environment/2025/sep/08/green-economy-boom-africa-climate-summit-renewable-energy-solar",
    "image": "https://media.guim.co.uk/ba407c567828cd71169084e4965e4316b837874a/285_0_3750_3001/500.jpg",
    "summary": "Africa is experiencing a significant boom in renewable energy, particularly in solar power, setting new records. However, there remains a critical need for increased financing to support and sustain this growth. Experts emphasize that addressing this funding gap is essential for the continent's renewable energy future.",
    "published": "2025-09-08T10:38:22Z"
  },
  {
    "title": "First Thing: 300 South Koreans detained at Hyundai plant in US to be released, says Seoul",
    "url": "https://www.theguardian.com/us-news/2025/sep/08/first-thing-300-south-koreans-detained-at-hyundai-plant-in-us-to-be-released-says-seoul",
    "image": "https://media.guim.co.uk/9da54cd1051c652db1e0619d82cb7c127161d798/314_0_2083_1666/500.jpg",
    "summary": "The arrest of workers has created tensions between Seoul and Washington. Additionally, there are concerns about Myanmar scam centers that are believed to be holding around 100,000 trafficked individuals. This situation highlights ongoing issues related to human trafficking and international relations.",
    "published": "2025-09-08T10:37:36Z"
  },
  {
    "title": "Piastri and Norris say team is ‘priority No 1’ amid McLaren team orders controversy",
    "url": "https://www.theguardian.com/sport/2025/sep/08/oscar-piastri-lando-norris-team-priority-no-1-mclaren-team-orders-controversy-f1",
    "image": "https://media.guim.co.uk/62be0b1988c27f22d6eb0f3f1cb2b52842655747/333_295_3485_2788/500.jpg",
    "summary": "Lando Norris and Oscar Piastri emphasized that their focus on team orders during the Italian Grand Prix was primarily to protect each other as teammates. They highlighted the importance of collaboration within the McLaren team. The strategy aimed to ensure both drivers could achieve the best possible results together.",
    "published": "2025-09-08T10:35:04Z"
  }
]