[
  {
    "title": "Trump to host GOP senators at White House amid demolition work and government shutdown – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/21/donald-trump-republicans-white-house-ballroom-government-shutdown-troops-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/e5547632d1355dcd8c7a05bd41265382e48e6347/577_0_6535_5228/500.jpg",
    "summary": "The president is hosting a lunch for Republicans in the Rose Garden. This event coincides with ongoing construction on the east wing of the White House. The gathering aims to foster relationships and discuss party matters.",
    "published": "2025-10-21T11:15:00Z"
  },
  {
    "title": "Defiant Sarkozy begins jail sentence as lawyer says he will be held in solitary confinement – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/oct/21/nicolas-sarkozy-france-jail-russia-ukraine-europe-news-live-updates",
    "image": "https://media.guim.co.uk/2b5cd7d1e8743daefc14f0cb0f50323a981871d7/1629_167_5072_4057/500.jpg",
    "summary": "Former French President Nicolas Sarkozy has been sentenced to prison after being convicted of criminal conspiracy related to illegal funding for his 2007 campaign. He has begun serving his sentence at La Sante prison in Paris. This marks a significant moment in French political history, as he becomes one of the few former leaders to face imprisonment.",
    "published": "2025-10-21T11:13:22Z"
  },
  {
    "title": "Covid inquiry live: children paid ‘huge price’ to protect rest of society in pandemic, says Johnson",
    "url": "https://www.theguardian.com/uk-news/live/2025/oct/21/covid-19-inquiry-boris-johnson-pandemic-children-lockdown-impact-live-updates",
    "image": "https://media.guim.co.uk/c803674b912e35f131fddeaa2c9b8a94abc1915a/232_0_1350_1080/500.jpg",
    "summary": "The former prime minister faced questioning regarding the effects of the pandemic on youth, expressing regret over school closures. He stated a preference for exploring alternative solutions during that period. His comments highlight ongoing concerns about the long-term impact of the pandemic on young people's education and mental health.",
    "published": "2025-10-21T11:12:19Z"
  },
  {
    "title": "Bank of England compares collapse of US private credit firms to 2007 subprime crisis - business live",
    "url": "https://www.theguardian.com/business/live/2025/oct/21/uk-borrowing-outstrips-forecasts-reeves-amazon-web-services-outage-resolved-bank-of-england-stock-markets-business-live-news",
    "image": "https://media.guim.co.uk/33043e635ce2b16bdd760078e1df4511ce16a2d7/499_0_5002_4002/500.jpg",
    "summary": "Governor Andrew Bailey has stated that the collapse of First Brands and Tricolor raises questions about whether it is an isolated incident or indicative of broader economic issues. He described the situation as potentially a \"canary in the coalmine.\" The uncertainty surrounding these failures highlights concerns about overall market stability.",
    "published": "2025-10-21T11:11:41Z"
  },
  {
    "title": "Joke’s on you, fleshbag! Channel 4’s first AI presenter is dizzyingly grim on so many levels",
    "url": "https://www.theguardian.com/tv-and-radio/2025/oct/21/channel-4-first-ai-presenter-dispatches",
    "image": "https://media.guim.co.uk/7c0912a6519776be4b43a52d1c4d0adbfe33bc5e/290_0_1340_1073/500.jpg",
    "summary": "The AI-generated host of Channel 4's Dispatches, while innovative, raises concerns regarding the network's environmental impact. Her lack of emotion could put traditional hosts like Krishnan Guru-Murthy and Kevin McCloud at risk of obsolescence. The integration of AI in broadcasting prompts a reevaluation of the human element in television.",
    "published": "2025-10-21T11:10:38Z"
  }
]