[
  {
    "title": "Australia news live: Gaza flotilla activist says aid fight will continue as Palestine supporters rally in Sydney and Melbourne",
    "url": "https://www.theguardian.com/australia-news/live/2025/oct/12/australia-news-live-pro-palestine-rally-sydney-optus-anthony-albanese-sussan-ley",
    "image": "https://media.guim.co.uk/d9f17865ac6ee13ef1595cbcade2bd9590bee2e5/39_0_2461_1970/500.jpg",
    "summary": "I apologize, but I need more context or information about the specific news you would like summarized. Please provide details or the content you want me to summarize!",
    "published": "2025-10-12T02:56:01Z"
  },
  {
    "title": "Trump news at a glance: US troops will be paid despite shutdown, president claims",
    "url": "https://www.theguardian.com/us-news/2025/oct/12/trump-administration-news-updates-today",
    "image": "https://media.guim.co.uk/dbb5363bd94260dc1f45402ea80021b23ce3b793/2315_0_5877_4704/500.jpg",
    "summary": "Donald Trump announced he has instructed the defense secretary to release funds on October 15. The news highlights significant developments in US politics reported on October 11. The focus remains on the implications of financial decisions in the political landscape.",
    "published": "2025-10-12T01:16:12Z"
  },
  {
    "title": "Rolling Stones’s Ronnie Wood says he is working on new songs with Rod Stewart",
    "url": "https://www.theguardian.com/music/2025/oct/12/ronnie-wood-and-rod-stewart-working-together-on-songs-again-rolling-stone-says",
    "image": "https://media.guim.co.uk/aa3a3870e19578ed3b350480bf794283630d95fd/156_0_1567_1253/500.jpg",
    "summary": "On \"Desert Island Discs,\" a guitarist reflected on his collaboration with a former member of the Faces from the 1960s. He mentioned that the duo has a \"good body of songs going.\" This reveals ongoing creative efforts and highlights their musical legacy.",
    "published": "2025-10-11T23:01:35Z"
  },
  {
    "title": "The dream of turning empty office blocks into apartments appears over. What went wrong?",
    "url": "https://www.theguardian.com/australia-news/2025/oct/12/converting-empty-office-blocks-apartments-appears-over",
    "image": "https://media.guim.co.uk/f24d52674b94b438e5674b23e3617c66f33c17d8/386_0_2699_2160/500.jpg",
    "summary": "Strict planning regulations and rising renovation costs are discouraging landlords and developers from investing in housing. This situation has intensified calls for government action to address the ongoing housing shortage. Stakeholders are urging measures to ease the financial burdens and facilitate housing development.",
    "published": "2025-10-11T23:00:36Z"
  },
  {
    "title": "‘Uneasy alliance’: why Brisbane’s Olympics has a former LNP premier and Greens radical fighting on the same side",
    "url": "https://www.theguardian.com/sport/2025/oct/12/queensland-brisbane-olympics-former-lnp-premier-greens-radical-same-side",
    "image": "https://media.guim.co.uk/ae5d8e01aef019afbfcd6d45033cf5bc03340670/126_0_3740_2992/500.jpg",
    "summary": "The Queensland government's proposal to construct the main stadium for the 2032 Games at Victoria Park has sparked a coalition of diverse protesters. Various community members and environmental advocates are opposing the plan, citing concerns over development and green space. Their united front highlights the contentious nature of the project and its potential impact on the local environment.",
    "published": "2025-10-11T23:00:36Z"
  }
]