[
  {
    "title": "Socceroos get lucky with place in second highest pot for World Cup draw ",
    "url": "https://www.theguardian.com/football/2025/nov/26/australia-socceroos-pot-2-world-cup-draw",
    "image": "https://media.guim.co.uk/d4f1eebb6a840bd998b4814003c821f3a321eb0c/293_0_2668_2136/500.jpg",
    "summary": "Australia's chances of advancing from the group stage at next year's World Cup appear to have improved, although there is still a possibility of being placed in a challenging \"Group of Death.\" The team's performance will be crucial in determining their fate. Fans remain hopeful as they anticipate the final draw.",
    "published": "2025-11-25T22:17:33Z"
  },
  {
    "title": "Marseille 2-1 Newcastle, Manchester City 0-2 Bayer Leverkusen, and more: Champions League – as it happened",
    "url": "https://www.theguardian.com/football/live/2025/nov/25/marseille-v-newcastle-manchester-city-v-bayer-leverkusen-and-more-champions-league-live",
    "image": "https://media.guim.co.uk/fda71bcc31d1c2dbf9f462c64abdeec5244ca18e/148_0_3661_2930/500.jpg",
    "summary": "Pierre-Emerick Aubameyang netted two goals to lead his team to a victory over Newcastle. Meanwhile, Bayer Leverkusen caused an upset by defeating a significantly altered Manchester City. Both matches showcased impressive performances from the winning sides.",
    "published": "2025-11-25T22:10:49Z"
  },
  {
    "title": "Aubameyang fires Marseille to win as Newcastle fail to heed Howe’s warning",
    "url": "https://www.theguardian.com/football/2025/nov/25/marseille-newcastle-champions-league-match-report",
    "image": "https://media.guim.co.uk/c03eeb894271e71c16461f614baab5b0655dcf80/300_0_2044_1635/500.jpg",
    "summary": "Newcastle took an early lead in the Champions League match, but Pierre-Emerick Aubameyang scored two goals for Marseille. These goals secured a 2-1 victory for Marseille. The match showcased Aubameyang's impactful performance.",
    "published": "2025-11-25T22:10:03Z"
  },
  {
    "title": "Officials find source of leak in Olympic Pipeline two weeks after first report",
    "url": "https://www.theguardian.com/us-news/2025/nov/25/olympic-pipeline-leak-washington-oregon",
    "image": "https://media.guim.co.uk/645e620541fa7beed0c75b627ec5d6a67ec9aa69/272_0_2728_2182/500.jpg",
    "summary": "Fuel was discovered in a ditch near a blueberry farm in Everett, Washington, linked to a pipeline operated by BP. The incident raised concerns about potential environmental impact. Investigations are underway to assess the situation and address any possible contamination.",
    "published": "2025-11-25T22:09:20Z"
  },
  {
    "title": "Chelsea 3-0 Barcelona: Champions League – live reaction",
    "url": "https://www.theguardian.com/football/live/2025/nov/25/chelsea-v-barcelona-champions-league-live",
    "image": "https://media.guim.co.uk/b03418b7309986894c0db8235d1e144ff63ed156/953_798_2977_2381/500.jpg",
    "summary": "Estêvão shone brightly in a commanding performance as Chelsea triumphed over a depleted Barcelona, who played with ten men. The match was marked by Chelsea's dominance throughout. Scott Murray provided a minute-by-minute report on the action.",
    "published": "2025-11-25T22:05:44Z"
  }
]