[
  {
    "title": "House speaker says emergency Snap food aid funding not easy to do as millions lose benefit while shutdown drags on – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/nov/03/us-government-shutdown-donald-trump-latest-politics-news",
    "image": "https://media.guim.co.uk/ea942d13c47b91ed6f2485b6f0310cc2c7334b79/484_0_6345_5076/500.jpg",
    "summary": "Mike Johnson defended the inaction on using contingency funds to pay Snap recipients following judges' orders. As the US government shutdown approaches a record length, pressure mounts on lawmakers to find a resolution. The stalemate continues to affect vital assistance programs.",
    "published": "2025-11-03T17:17:47Z"
  },
  {
    "title": "WTA Finals tennis: Anisimova v Keys; Rybakina beats Swiatek – live",
    "url": "https://www.theguardian.com/sport/live/2025/nov/03/wta-finals-swiatek-v-rybakina-anisimova-v-keys-live",
    "image": "https://media.guim.co.uk/08ea28cc7a64d7e4517e0430aee71a4b99c6b0ca/1631_0_6871_5500/500.jpg",
    "summary": "Daniel Harris will provide updates from the season-ending tournament taking place in Saudi Arabia. Stay tuned for the latest developments and highlights. Don't miss out on the exciting conclusion of the season.",
    "published": "2025-11-03T17:16:01Z"
  },
  {
    "title": "MPs spar over response to Cambridgeshire train attack – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/nov/03/nigel-farage-reform-speech-labour-conservatives-politics-live-latest-updates",
    "image": "https://media.guim.co.uk/018391f1c2b6997a312c38ad9e549b7cf79a2bdd/97_0_1682_1346/500.jpg",
    "summary": "A Lib Dem spokesperson has accused Reform of attempting to exploit a recent incident for political advantage. They described the remarks made by the shadow home secretary as \"beneath contempt.\" The statement reflects a firm disapproval of the political maneuvers surrounding the incident.",
    "published": "2025-11-03T17:14:14Z"
  },
  {
    "title": "Telegraph bidder reported for potential breach of editorial independence rules",
    "url": "https://www.theguardian.com/media/2025/nov/03/telegraph-bidder-reported-potential-breach-editorial-independence-rules",
    "image": "https://media.guim.co.uk/54fcea3122e67569346ff1a589386e18b0e276d0/728_435_3236_2589/500.jpg",
    "summary": "The UK government has been notified following claims that RedBird Capital's CEO threatened to \"go to war\" with the newsroom of a prominent title. This incident raises concerns about media freedom and corporate influence. The fallout from such statements may lead to investigations and potential policy discussions.",
    "published": "2025-11-03T17:06:22Z"
  },
  {
    "title": "Liz Barnard obituary",
    "url": "https://www.theguardian.com/education/2025/nov/03/liz-barnard-obituary",
    "image": "https://media.guim.co.uk/86935ff1fd4d4ed0c268063d4621d6a93b8a9200/27_126_682_545/500.jpg",
    "summary": "A renowned interior designer, recognized as a 'house doctor,' has passed away, leaving behind a legacy of transforming homes and interiors. Known for her unique style and expert advice, she gained significant recognition in the design community. Her contributions to the industry made a lasting impact on homeowners seeking inspiration and guidance.",
    "published": "2025-11-03T17:00:40Z"
  }
]