[
  {
    "title": "Suspected smuggling boat struck twice by military was reportedly moving drugs to South American country, not US – live",
    "url": "https://www.theguardian.com/us-news/live/2025/dec/05/trump-pete-hegseth-signal-politics-updates",
    "image": "https://media.guim.co.uk/4665e3169400d6beac0d92a65967133d1496f625/490_0_2635_2110/500.jpg",
    "summary": "New information challenges Donald Trump's claim that a boat involved in an attack was \"heading to the United States.\" The details contradict his narrative surrounding the incident. This inconsistency raises questions about the accuracy of his statements regarding the attack.",
    "published": "2025-12-06T01:23:32Z"
  },
  {
    "title": "Zootopia 2 bucks trend for Hollywood releases in China as it breaks records for foreign animation",
    "url": "https://www.theguardian.com/world/2025/dec/06/zootopia-2-china-highest-grossing-foreign-animation-zootropolis",
    "image": "https://media.guim.co.uk/6353a04afb1313acea4171e694dda61fcf182fc9/0_0_3721_2977/500.jpg",
    "summary": "The film, known as \"Zootropolis\" in some regions, has unexpectedly succeeded in China despite a growing trend of local audiences favoring domestic films over Hollywood productions. This success highlights a shift in consumer preferences and suggests a potential acceptance of international content. The film's popularity may signal an evolving landscape for foreign films in the Chinese market.",
    "published": "2025-12-06T01:00:38Z"
  },
  {
    "title": "‘No mistrust’ between Europe and US over Ukraine, Macron says",
    "url": "https://www.theguardian.com/world/2025/dec/05/no-mistrust-between-europe-and-us-over-ukraine-macron-says",
    "image": "https://media.guim.co.uk/17ed87370a7f7a8356acf0be553d91b5967b300c/1295_340_3602_2882/500.jpg",
    "summary": "French President Emmanuel Macron expressed concerns about the reliability of U.S. support for Ukraine, following a report suggesting he had warned that Washington might \"betray\" Kyiv. His comments highlight the ongoing uncertainties in international alliances amid the Ukraine conflict. This statement underscores the need for European nations to prepare for potential shifts in U.S. foreign policy.",
    "published": "2025-12-06T00:43:37Z"
  },
  {
    "title": "Mauricio Pochettino urges USMNT to treat every World Cup game ‘like a final’",
    "url": "https://www.theguardian.com/football/2025/dec/05/pochettino-usmnt-world-cup-2026-group-friendlies",
    "image": "https://media.guim.co.uk/eb4c98544ae8ee931288dbf8b65186fdd433841b/415_0_2672_2139/500.jpg",
    "summary": "The US coach emphasized a focus on the group stage rather than the knockout round. The team is placed in Group D alongside Paraguay, Australia, and a European play-off winner. His statement reflects a commitment to concentrating on immediate matches.",
    "published": "2025-12-06T00:14:10Z"
  },
  {
    "title": "Frank Gehry obituary",
    "url": "https://www.theguardian.com/artanddesign/2025/dec/06/frank-gehry-obituary",
    "image": "https://media.guim.co.uk/b1f02739d804713bb32d2f8c6fe823b6c2f31c11/338_202_1483_1186/500.jpg",
    "summary": "A Canadian-American architect known for innovative designs has passed away. He gained fame for his exploration of crumpling and fish curves in architecture, most notably in the Guggenheim Museum in Bilbao. His work left a significant mark on contemporary architecture.",
    "published": "2025-12-06T00:13:06Z"
  }
]