[
  {
    "title": "Democrat Zohran Mamdani sweeps to victory in New York City mayoral election and lays down challenge to Trump - live",
    "url": "https://www.theguardian.com/us-news/live/2025/nov/05/zohran-mamdani-new-york-nyc-donald-trump-mayor-election-california-new-jersey-virginia-latest-news-results",
    "image": "https://media.guim.co.uk/9617db453cbd1ef5e4a2edd8d8545ed087da9418/665_0_5000_4000/500.jpg",
    "summary": "A 34-year-old democratic socialist has won the election, achieving over 50% of the vote. This victory indicates a strong support for progressive policies among voters. The win is seen as a significant shift in the political landscape.",
    "published": "2025-11-05T12:41:32Z"
  },
  {
    "title": "Lammy says ‘racist’ comments from Reform UK Sarah Pochin last week belong in ‘dark ages’ – PMQs live",
    "url": "https://www.theguardian.com/politics/live/2025/nov/05/david-lammy-pmqs-rachel-reeves-tax-system-news-updates-uk-politics-live",
    "image": "https://media.guim.co.uk/fdddec341bf1868c4f613e50d0d23524f159030b/197_0_969_775/500.jpg",
    "summary": "Deputies of UK Labour leader Keir Starmer stepped in to fulfill his duties while he attends the COP climate conference. The conference is a significant event focusing on global climate action and policy discussions. Starmer's absence highlights the importance of the climate agenda for political leaders.",
    "published": "2025-11-05T12:38:27Z"
  },
  {
    "title": "European markets down and Asian chipmakers tumble in global stock sell-off amid worries over AI bubble – business live",
    "url": "https://www.theguardian.com/business/live/2025/nov/05/china-ends-tariffs-us-imports-soy-bean-levies-ms-profits-cyber-attack-business-live",
    "image": "https://media.guim.co.uk/ef313969412c0efbaaf739ff575ab84507d5bf13/407_0_4400_3521/500.jpg",
    "summary": "Deutsche Bank analysts express concerns about a potential equity market correction as uncertainty grows. Meanwhile, China has ended tariffs on certain US imports, including farm goods, although soybean tariffs remain in place. The developments highlight ongoing trade tensions and market volatility.",
    "published": "2025-11-05T12:36:54Z"
  },
  {
    "title": "Fifa heats up battle with players’ union Fifpro by sidelining it from welfare talks",
    "url": "https://www.theguardian.com/football/2025/nov/05/fifa-battle-players-union-fifpro-welfare-talks",
    "image": "https://media.guim.co.uk/002227ace471c9691fa90aa89bb78493584baf93/405_0_4691_3753/500.jpg",
    "summary": "FIFA plans to proceed with developing new proposals for player welfare without consulting the international trade union FIFPro. This decision is expected to escalate an ongoing conflict between FIFA and the union. The move highlights the contentious relationship regarding player rights and protections.",
    "published": "2025-11-05T12:35:13Z"
  },
  {
    "title": "Crystal Palace charged by FA over fans’ banner of Forest owner Marinakis",
    "url": "https://www.theguardian.com/football/2025/nov/05/crystal-palace-charged-by-fa-over-fan-banner-nottingham-forest-owner-evangelos-marinakis",
    "image": "https://media.guim.co.uk/810b95239cef05d5ee328e0a82521e576259b8bd/0_747_2647_2117/500.jpg",
    "summary": "The Football Association (FA) has charged Crystal Palace with misconduct due to a graphic banner displayed by fans regarding Nottingham Forest's owner, Evangelos Marinakis, during an August match. The incident highlights ongoing concerns about fan behavior and the regulatory response from football authorities. Crystal Palace now faces potential repercussions as part of the FA's disciplinary process.",
    "published": "2025-11-05T12:31:28Z"
  }
]