[
  {
    "title": "Trump gives Hamas ‘three or four days’ to respond to Gaza peace plan or face ‘a very sad end’ – live",
    "url": "https://www.theguardian.com/world/live/2025/sep/30/netanyahu-israel-gaza-hamas-trump-peace-plan-latest-news-middle-east-crisis-live",
    "image": "https://media.guim.co.uk/a549ba4b3abdde8e5d80a3703172ee1a1845aad8/33_51_4917_3934/500.jpg",
    "summary": "Israeli Prime Minister Netanyahu rejected the idea of a Palestinian state in the context of Trump's Gaza plan, asserting that the IDF will maintain a presence in most of the territory. This stance comes amidst escalating tensions and an ultimatum regarding the situation. Netanyahu's comments indicate a firm position against statehood for Palestinians in the region.",
    "published": "2025-09-30T16:22:59Z"
  },
  {
    "title": "Nigel Farage ‘doesn’t like Britain’, Starmer tells Labour conference – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/30/labour-conference-starmer-speech-streeting-nhs-reform",
    "image": "https://media.guim.co.uk/a533235f15b2adce2c55c64678e3737f52da87c6/836_95_3626_2901/500.jpg",
    "summary": "The Prime Minister criticizes Reform’s migration plan, labeling it as an \"enemy of national renewal.\" Meanwhile, Nigel Farage charges that Labour's rhetoric threatens the safety of his party's politicians and activists. Tensions rise as both sides confront each other's positions on immigration and political discourse.",
    "published": "2025-09-30T16:19:25Z"
  },
  {
    "title": "Labour won’t fend off Reform UK by just diluting Farage’s poison | Letters",
    "url": "https://www.theguardian.com/politics/2025/sep/30/labour-wont-fend-off-reform-uk-by-just-diluting-farages-poison",
    "image": "https://media.guim.co.uk/a0b6d8fe8fc30845e1e200965b16dd747a00a582/159_0_2624_2099/500.jpg",
    "summary": "In a recent letter, Guy Fassler argues that the party should avoid diluting Reform's policies and instead be honest about immigration issues. Other letters from Doug Maughan, Sunil Bhopal, and Dr. Roger Hancock contribute to the discussion. This highlights a call for transparency and integrity in political messaging.",
    "published": "2025-09-30T16:18:48Z"
  },
  {
    "title": "When shopping delivers a moral dilemma | Letters",
    "url": "https://www.theguardian.com/lifeandstyle/2025/sep/30/when-shopping-delivers-a-moral-dilemma",
    "image": "https://media.guim.co.uk/db9f8c0e1b3f7eeb0642f987c5b2f9de75210157/501_0_4980_3985/500.jpg",
    "summary": "Readers share their thoughts on an article by Polly Hudson discussing the ethics of keeping goods delivered by mistake. Responses reveal a range of opinions, from those who believe in returning items to the rightful owner to others who feel it's acceptable to keep accidental deliveries. The discussion highlights differing views on honesty and moral responsibility in such situations.",
    "published": "2025-09-30T16:18:43Z"
  },
  {
    "title": "NHS 10-year plan will embed privatisation and hollow out the health service | Letter",
    "url": "https://www.theguardian.com/society/2025/sep/30/nhs-10-year-plan-will-embed-privatisation-and-hollow-out-the-health-service",
    "image": "https://media.guim.co.uk/9ae4cc23e3bbaecbd9ad40965e575c5d6c4b378f/614_0_6144_4915/500.jpg",
    "summary": "Margaret Greenwood warns that proposed government reforms may jeopardize the NHS, similar to the declining state of social care. She expresses concern that the government could become unable or unwilling to provide essential healthcare services. The implications of these reforms could lead to a significant decline in public health support.",
    "published": "2025-09-30T16:18:37Z"
  }
]