[
  {
    "title": "Pound on track for worst week since January as UK wage growth falls to four-year low – business live",
    "url": "https://www.theguardian.com/business/live/2025/oct/10/uk-wage-growth-slows-worker-demand-argentina-rescue-bessent-stock-markets-business-live-news",
    "image": "https://media.guim.co.uk/729b4c2759befb3fba1963b30f451a0770012732/1034_949_5150_4118/500.jpg",
    "summary": "Stay updated with the latest developments in the economy and financial markets through continuous coverage. Key highlights include shifts in market trends, economic indicators, and expert analyses. Follow for real-time updates on significant events affecting global finance.",
    "published": "2025-10-10T12:37:56Z"
  },
  {
    "title": "Letitia James accuses Donald Trump of ‘weaponizing’ US justice system after her indictment – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/10/letitia-james-donald-trump-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/4d0114ef50ca1dfd8805fb7ab4f3879c1e64ba3f/303_0_3026_2420/500.jpg",
    "summary": "The prosecutor who headed the civil fraud investigation into Donald Trump in 2023 has described the charges being brought against her as unfounded. She asserts that the accusations lack merit and are politically motivated. The case is part of a broader legal scrutiny involving the former president.",
    "published": "2025-10-10T12:37:30Z"
  },
  {
    "title": "Yvette Cooper defends children as young as 13 needing digital ID – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/oct/10/uk-politics-latest-live-news-labour-reform-plaid-cymru-snp-conservatives",
    "image": "https://media.guim.co.uk/b89470e423fed5c8dcd44a6d00b035bc70b45338/1004_279_1890_1512/500.jpg",
    "summary": "The Foreign Secretary supports the introduction of digital ID for young teenagers, describing it as a positive step. This initiative aims to enhance security and streamline access to online services for minors. The proposal has sparked discussions about privacy and the implications of digital identification for youth.",
    "published": "2025-10-10T12:36:58Z"
  },
  {
    "title": "Letitia James criminally charged in Trump’s latest effort to punish rivals",
    "url": "https://www.theguardian.com/us-news/2025/oct/09/criminal-charges-letitia-james-new-york-attorney-general",
    "image": "https://media.guim.co.uk/46945c38a3d217e26a1d470a6ce8814f19c31d06/1049_194_4020_3215/500.jpg",
    "summary": "A prosecutor who aimed to file charges was appointed in response to former President Trump's dissatisfaction with the slow progress of investigations targeting his political opponents. This move reflects Trump's increasing impatience with the legal processes surrounding him and his rivals. The situation highlights ongoing tensions between Trump's political strategies and judicial proceedings.",
    "published": "2025-10-10T12:35:15Z"
  },
  {
    "title": "Tuchel criticises England fans, World Cup qualifying news, referee Taylor on abuse: football – live",
    "url": "https://www.theguardian.com/football/live/2025/oct/10/tuchel-criticises-silent-england-fans-world-cup-qualifying-news-and-more-football-live",
    "image": "https://media.guim.co.uk/c6d3ed7dc2cb30c8d0ec6be759c0bc0acfc58299/1261_0_5838_4671/500.jpg",
    "summary": "A rolling report provides live reactions to the England vs. Wales match alongside updates on World Cup qualifying events. Writers will offer insights and analysis as the game and related news unfold. Stay tuned for real-time commentary and reactions throughout the coverage.",
    "published": "2025-10-10T12:31:07Z"
  }
]