[
  {
    "title": "England set Sri Lanka 254 to win after Nat Sciver-Brunt century: Women’s Cricket World Cup – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/11/england-v-sri-lanka-womens-cricket-world-cup-live",
    "image": "https://media.guim.co.uk/b34ac0447764756426e83927588881f20b3dc1a7/394_92_2317_1853/500.jpg",
    "summary": "Nat Sciver-Brunt's team is competing against Sri Lanka in a cricket match. The report offers real-time updates on the progress of the game. Writers provide insights and commentary on key moments throughout the match.",
    "published": "2025-10-11T14:11:27Z"
  },
  {
    "title": "Steve Clarke sets Scotland record and urges team to avoid complacency",
    "url": "https://www.theguardian.com/football/2025/oct/11/steve-clarke-scotland-manager-belarus-world-cup-qualifying",
    "image": "https://media.guim.co.uk/02c499f551ab8fc5e907c9cecc5245f91ac02a47/925_100_5545_4436/500.jpg",
    "summary": "Steve Clarke aims for World Cup qualification as Scotland prepares to host Belarus. This match marks a personal milestone for the Scotland manager. Clarke's focus remains on achieving success for the national team.",
    "published": "2025-10-11T14:06:36Z"
  },
  {
    "title": "Thousands gather in London in march for ‘lasting peace’ in Gaza",
    "url": "https://www.theguardian.com/world/2025/oct/11/thousands-gather-london-march-lasting-peace-gaza",
    "image": "https://media.guim.co.uk/9f40d1fc7ddf52d38d21eecb09aa91595deb21cc/535_0_5000_4000/500.jpg",
    "summary": "The Director of the Palestine Solidarity Campaign has criticized a recent ceasefire agreement, stating it fails to address the ongoing \"system of apartheid\" in Palestine. He emphasized that the agreement overlooks critical issues related to human rights and justice. The statement highlights concerns about the adequacy of the ceasefire in achieving lasting peace.",
    "published": "2025-10-11T14:04:15Z"
  },
  {
    "title": "Israel moves prisoners ahead of Gaza deal exchange – live",
    "url": "https://www.theguardian.com/world/live/2025/oct/11/israel-gaza-ceasefire-hamas-hostages-netanyahu-trump-middle-east-latest-news-updates",
    "image": "https://media.guim.co.uk/373bb91e694a157d575f69e59bb39001116b511f/704_0_6250_5000/500.jpg",
    "summary": "Under a truce deal, Israel is set to release 250 prisoners, including individuals serving life sentences for serious offenses. This decision is part of ongoing negotiations and efforts to stabilize the region. The agreement highlights the complexities of the Israeli-Palestinian conflict and the contentious nature of prisoner releases.",
    "published": "2025-10-11T14:03:56Z"
  },
  {
    "title": "Joe Biden receiving radiation therapy for prostate cancer",
    "url": "https://www.theguardian.com/us-news/2025/oct/11/joe-biden-radiation-therapy-prostate-cancer",
    "image": "https://media.guim.co.uk/5992b310a36c7a54c14164388df2fccd92e1f90c/8_0_2635_2109/500.jpg",
    "summary": "The former president was diagnosed in May with an aggressive form of cancer and has been undergoing treatment with hormone medication. His health condition has raised concerns among supporters and the public. Further updates on his treatment and prognosis are awaited.",
    "published": "2025-10-11T14:01:35Z"
  }
]