[
  {
    "title": "Australia v Argentina: Rugby Championship 2025 – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/13/rugby-championship-australia-wallabies-v-argentina-pumas-live",
    "image": "https://media.guim.co.uk/25ce00aabe3f3d14be5f3a972445f9f7268880ff/294_289_4546_3637/500.jpg",
    "summary": "The Wallabies are seeking a second victory against the Pumas in Sydney, where the Argentinian team is eager for revenge. Jonathan Howcroft will provide minute-by-minute updates on the match. Fans can stay tuned for all the action as the game unfolds.",
    "published": "2025-09-13T04:35:25Z"
  },
  {
    "title": "Country diary: Searching for sanctuary, we find something else entirely | Eben Muse",
    "url": "https://www.theguardian.com/environment/2025/sep/13/country-diary-searching-for-sanctuary-we-find-something-else-entirely",
    "image": "https://media.guim.co.uk/1c338606fd7a0fe7765052881d46557149ec150a/509_0_5040_4032/500.jpg",
    "summary": "In Drakes Broughton, Worcestershire, rural litter has united various community members, including a farmer and campers. Their shared concern highlights the impact of littering on the environment. The situation exemplifies how local issues can foster unexpected collaborations.",
    "published": "2025-09-13T04:30:54Z"
  },
  {
    "title": "‘No idea what you’ve unleashed’: Erika Kirk, Charlie Kirk’s widow, gives statement after husband’s shooting – follow live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/12/charlie-kirk-shooter-suspect-latest-news-updates-donald-trump-utah",
    "image": "https://media.guim.co.uk/5ee7d8e9869b8a0948450a4c2b516b301baa8e06/310_0_1190_952/500.jpg",
    "summary": "Tyler Robinson, 22, is anticipated to be charged following a reported shooting of a right-wing activist. A family friend informed authorities about the incident. The charges are expected to be filed on Tuesday.",
    "published": "2025-09-13T04:24:53Z"
  },
  {
    "title": "British ice dancer and same-sex skating partner to compete in Finland after rule change",
    "url": "https://www.theguardian.com/uk-news/2025/sep/13/british-ice-dancer-same-sex-skating-partner-mille-colling-emma-aalto-compete-finland-rule-change",
    "image": "https://media.guim.co.uk/add16b212b824e0d75b33c9030010861e6abcc93/683_0_5641_4513/500.jpg",
    "summary": "Mille Colling and Emma Aalto have been authorized to participate in the qualifying round for the upcoming national championships. Their approval comes as they prepare for the event next month. This marks a significant opportunity for both athletes.",
    "published": "2025-09-13T04:00:54Z"
  },
  {
    "title": "Charlie Kirk killing invoked to bolster UK’s largest far-right rally in decades",
    "url": "https://www.theguardian.com/uk-news/2025/sep/13/charlie-kirk-killing-invoked-bolster-uk-largest-far-right-rally-decades",
    "image": "https://media.guim.co.uk/e8792f755ede401dbccd7fa3761461b5ac728890/398_0_4873_3898/500.jpg",
    "summary": "Tommy Robinson, Steve Bannon, Ant Middleton, and Joey Mannarino are set to speak at an upcoming event in London. The gathering has attracted attention due to the controversial figures involved. Details about the event's purpose and audience have yet to be fully disclosed.",
    "published": "2025-09-13T04:00:54Z"
  }
]