[
  {
    "title": "Australia news live: Pocock says Labor’s emissions target not ambitious enough after Ley lashes government’s ‘trifecta’ of energy failures",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/18/australia-news-live-santos-takeover-2035-emissions-target-chris-bowen-anthony-albanese-sussan-ley-environment-climate-crisis-ntwnfb",
    "image": "https://media.guim.co.uk/9cde0d95be2f4e1ab7d3de9ddb7f2adf6f06add1/987_284_5946_4759/500.jpg",
    "summary": "I'm sorry, but I need more information about the news you'd like me to summarize. Please provide the details or the text you'd like summarized.",
    "published": "2025-09-18T05:28:19Z"
  },
  {
    "title": "Jimmy Kimmel suspension: Trump celebrates as some networks replace show with Charlie Kirk tribute – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/18/jimmy-kimmel-charlie-kirk-comments-show-cancelled-suspended-monologue-trump-us-politics-live",
    "image": "https://media.guim.co.uk/a0ec82d4c0a9a9af63cf1322209564376de0853a/972_405_3154_2522/500.jpg",
    "summary": "The indefinite removal of \"Jimmy Kimmel Live!\" has sparked public outrage, coinciding with a broader crackdown on commentary during the Trump administration. This decision follows the controversial killing of conservative commentator Charlie Kirk. Critics of the move argue it poses a threat to free speech and satirical commentary.",
    "published": "2025-09-18T05:26:57Z"
  },
  {
    "title": "TV tonight: Mawaan Rizwan’s zany comedy Juice returns",
    "url": "https://www.theguardian.com/tv-and-radio/2025/sep/18/tv-tonight-mawaan-rizwan-russell-tovey-juice-sky-atomic",
    "image": "https://media.guim.co.uk/8c2cfc80f3347dea0f84f288419acc251fbaf3b2/450_0_3012_2410/500.jpg",
    "summary": "Russell Tovey makes a guest appearance in a surreal-themed show tonight. Additionally, Sky's thriller \"Atomic,\" centered around loose uranium, wraps up its intriguing storyline. Viewers have a diverse selection of shows to enjoy this evening.",
    "published": "2025-09-18T05:20:33Z"
  },
  {
    "title": "Democrats to introduce a No Political Enemies (Nope) act, to protect government critics – as it happened",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/17/donald-trump-charlie-kirk-free-speech-nyt-cdc-rfk-epstein-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/49340d7958babe8c7288ef55c7c7f392608eb4b8/0_0_4187_3351/500.jpg",
    "summary": "The live blog has been closed, marking the end of the ongoing updates. Readers can no longer access new information or commentary. For further news, viewers are encouraged to check other sources.",
    "published": "2025-09-18T05:07:36Z"
  },
  {
    "title": "Privatisation of UK industries is driving cost of living crisis, says Greens’ leader",
    "url": "https://www.theguardian.com/politics/2025/sep/18/privatisation-of-uk-industries-is-driving-cost-of-living-crisis-says-greens-leader",
    "image": "https://media.guim.co.uk/11da47ac546c91af96f538773d089db39abedd11/0_0_4547_3640/500.jpg",
    "summary": "Zack Polanski has labeled mass privatization in the UK a \"failed experiment,\" following a report indicating it has increased annual costs for households by £250. The analysis highlights the negative impact of privatization on everyday expenses. Critics argue for a reevaluation of privatization policies in light of these findings.",
    "published": "2025-09-18T05:00:35Z"
  }
]