[
  {
    "title": "New Zealand chasing 237 to beat England: second men’s T20 international – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/20/new-zealand-v-england-second-mens-t20-international-live",
    "image": "https://media.guim.co.uk/8788b33cd8241811ec355853675713678500828b/525_0_5253_4203/500.jpg",
    "summary": "Rob Smyth is providing live updates as England faces New Zealand in the second T20I match at Hagley Oval. Fans can follow the action with over-by-over commentary. The match promises an exciting showdown between the two teams.",
    "published": "2025-10-20T08:30:51Z"
  },
  {
    "title": "Major internet outage hits websites after issue at Amazon Web Services – business live",
    "url": "https://www.theguardian.com/business/live/2025/oct/20/china-economic-growth-gdp-low-house-prices-fall-stock-markets-ftse-business-live-news",
    "image": "https://media.guim.co.uk/c243af906d58094cf7e7337e109f67c64d00da26/492_0_4240_3393/500.jpg",
    "summary": "The latest economic and financial news highlights significant developments affecting global markets, including shifts in interest rates and inflation trends. Key indicators and reports are influencing investor sentiment and market volatility. Ongoing geopolitical tensions further complicate the economic landscape, prompting close monitoring by analysts.",
    "published": "2025-10-20T08:29:43Z"
  },
  {
    "title": "Millions exploited by ‘menopause gold rush’ amid lack of reliable information, say UK experts",
    "url": "https://www.theguardian.com/society/2025/oct/20/millions-exploited-by-menopause-gold-rush-amid-lack-of-reliable-information-say-experts",
    "image": "https://media.guim.co.uk/123a913f5e6f72881c4396e4a6b2fdb2e0476bcc/683_0_6827_5464/500.jpg",
    "summary": "Women’s health experts at UCL are advocating for a nationwide educational initiative to address misinformation and unregulated advice related to women's health. They emphasize the need for reliable information to empower women in making informed health decisions. The campaign aims to enhance public understanding and combat the spread of false information in this critical area.",
    "published": "2025-10-20T08:27:42Z"
  },
  {
    "title": "‘Stark displays of sexism’ driving women out of architecture, report finds",
    "url": "https://www.theguardian.com/artanddesign/2025/oct/20/stark-displays-of-sexism-driving-women-out-of-architecture-report-finds",
    "image": "https://media.guim.co.uk/37a478a31d6e81cf4b9e2d2fca34126c9db98f44/468_0_4680_3744/500.jpg",
    "summary": "A survey by the RIBA and Fawcett Society reveals that many individuals in the architecture profession hesitate to report incidents of bullying, sexual harassment, and unequal pay due to fear of repercussions. The findings highlight ongoing concerns regarding workplace culture and the lack of support for victims. This underscores the need for systemic changes to ensure a safer and more equitable work environment.",
    "published": "2025-10-20T08:25:57Z"
  },
  {
    "title": "Truce resumes after Israeli airstrikes on Gaza amid scramble to shore up ceasefire – Middle East crisis live",
    "url": "https://www.theguardian.com/world/live/2025/oct/20/gaza-ceasefire-israel-hamas-palestine-hostages-middle-east-crisis-live-news-updates",
    "image": "https://media.guim.co.uk/4d421cd7593d209915c3d8bfb3af4dffd31e91bc/602_0_4560_3648/500.jpg",
    "summary": "US envoy Steve Witkoff and Jared Kushner, former President Trump's son-in-law, are expected to travel to Israel on Monday. Their visit aims to address regional issues as tensions remain high in the area. Further details on the purpose of their trip have not been disclosed.",
    "published": "2025-10-20T08:22:17Z"
  }
]