[
  {
    "title": "Sudan’s latest massacre has been exposed from satellite images – how much longer can the world look away?",
    "url": "https://www.theguardian.com/world/2025/oct/31/sudans-latest-massacre-has-been-exposed-from-satellite-images-how-much-longer-can-the-world-look-away",
    "image": "https://media.guim.co.uk/fb2813cc1e69efdfa07620c32c246946cb542f4a/373_0_3360_2688/500.jpg",
    "summary": "Analysts have discovered evidence of mass killings in El Fasher, raising concerns about potential involvement from the UAE. The findings were revealed through aerial investigations. This situation highlights ongoing issues of violence and international scrutiny in the region.",
    "published": "2025-10-31T06:28:58Z"
  },
  {
    "title": "TV tonight: murder and romance in Death in Paradise spin-off ",
    "url": "https://www.theguardian.com/tv-and-radio/2025/oct/31/tv-tonight-and-romance-in-death-in-paradise-spin-off",
    "image": "https://media.guim.co.uk/21b786c9c436a007aaaec30c901eecf163dd35c9/387_0_3570_2856/500.jpg",
    "summary": "The Aussie series features Detective Mackenzie investigating in her hometown of Dolphin Cove. Additionally, Alan Partridge makes an appearance to engage viewers. This lineup offers unique entertainment options for this evening.",
    "published": "2025-10-31T06:20:18Z"
  },
  {
    "title": "Greg Lynn appeal: judge criticises prosecutor’s conduct as former pilot seeks to overturn high country murder conviction",
    "url": "https://www.theguardian.com/australia-news/2025/oct/31/greg-lynn-appeal-seeks-overturn-murder-conviction-court-high-country-ntwnfb",
    "image": "https://media.guim.co.uk/25109c922cc5673857e977137645197aa5d95a68/205_0_1179_943/500.jpg",
    "summary": "A former Jetstar pilot has claimed a significant miscarriage of justice in his conviction for the murder of Carol Clay. He is seeking to have his case re-evaluated, asserting that new evidence undermines the original verdict. The case has drawn attention due to questions about the integrity of the judicial process.",
    "published": "2025-10-31T06:12:05Z"
  },
  {
    "title": "BoM to revert to former rain radar colour scheme after backlash – as it happened",
    "url": "https://www.theguardian.com/australia-news/live/2025/oct/31/australia-news-live-politics-parliament-coalition-labor-net-zero-anthony-albanese-sussan-ley-epbc-nature-laws-ntwnfb",
    "image": "https://media.guim.co.uk/82eecb81e4f531d1628cc547a97835444b81e97a/0_0_2319_1856/500.jpg",
    "summary": "The blog has officially ceased operations and is no longer active. Readers are informed that no new content will be published. Thank you for your support during its run.",
    "published": "2025-10-31T06:05:58Z"
  },
  {
    "title": "Charities and stars call on UK government to set child poverty reduction targets",
    "url": "https://www.theguardian.com/society/2025/oct/31/celebrities-mps-charities-government-child-poverty-targets-emilia-clarke",
    "image": "https://media.guim.co.uk/109eb7a96d6f361dee5f0a39dbcbf96c58823967/0_0_11811_9449/500.jpg",
    "summary": "An open letter signed by organizations like the National Children’s Bureau and Barnardo's, along with celebrities including Emilia Clarke, highlights urgent issues affecting children's welfare. The letter calls for immediate action to address these challenges. This collective effort aims to raise awareness and generate support for the cause.",
    "published": "2025-10-31T06:00:19Z"
  }
]