[
  {
    "title": "Pauline Hanson joins crowds in Canberra as anti-immigration protests heat up across country – as it happened",
    "url": "https://www.theguardian.com/australia-news/live/2025/aug/31/australia-news-live-victoria-premier-anti-immigrant-protests-sydney-marathon-porepunkah-shooting-sunday-ntwnfb",
    "image": "https://media.guim.co.uk/8252ca3786a97d15d1feedc9cc42f5452d2cb8f7/428_0_5000_4000/500.jpg",
    "summary": "The blog has officially reached its conclusion and will no longer be updated. Readers are informed that this marks the end of the blog's activity. Thank you for your support during its operation.",
    "published": "2025-08-31T06:03:30Z"
  },
  {
    "title": "UK chasing £90m in taxes from temp staffing firm rescued from insolvency ",
    "url": "https://www.theguardian.com/politics/2025/aug/31/uk-chasing-90m-in-taxes-from-temp-staffing-firm-rescued-from-insolvency",
    "image": "https://media.guim.co.uk/efdfa446297572ea4a197dfb26dfd7d0b7a7c05f/354_0_4292_3434/500.jpg",
    "summary": "The £18 million acquisition of Challenge Recruitment Group's assets from administration successfully repaid all private funders in full. This deal indicates a positive outcome for those who had invested in the firm. The acquisition marks a significant step in revitalizing the business post-administration.",
    "published": "2025-08-31T06:00:23Z"
  },
  {
    "title": "The best mattress toppers for a more comfortable night’s sleep, tested",
    "url": "https://www.theguardian.com/thefilter/2025/aug/31/best-mattress-toppers-uk",
    "image": "https://media.guim.co.uk/55b51848b96d9bc125510cd4f1b7e1ceca2d936a/0_0_2181_1745/500.jpg",
    "summary": "The article reviews various mattress toppers, including options like memory foam, wool, and cooling varieties. It evaluates their effectiveness in enhancing comfort and support for those with unsatisfactory mattresses. Recommendations are provided based on performance and value.",
    "published": "2025-08-31T06:00:23Z"
  },
  {
    "title": "The good news is, you’re owed a tax refund. The bad news? It’s a scam",
    "url": "https://www.theguardian.com/money/2025/aug/31/the-good-news-is-youre-owed-a-tax-refund-the-bad-news-its-a-scam",
    "image": "https://media.guim.co.uk/b99c21a7c21ad90ef6a44a7babb1e0e206ec1751/726_0_3750_3000/500.jpg",
    "summary": "Up to July, HMRC received reports of 170,000 fraudulent phone calls, texts, or messages. These scams either offered refunds or threatened legal action regarding money owed. The increase in such communications highlights ongoing concerns about fraud targeting individuals.",
    "published": "2025-08-31T06:00:22Z"
  },
  {
    "title": "‘An idyllic escape from the world’: Slovenia’s Jezersko valley",
    "url": "https://www.theguardian.com/travel/2025/aug/31/an-idyllic-escape-from-the-world-slovenias-jezersko-valley",
    "image": "https://media.guim.co.uk/f5591be50976d07e8230ac543c17d6c05ecd5f0b/776_77_3476_2782/500.jpg",
    "summary": "An eco farm located an hour from Ljubljana offers a perfect getaway for nature enthusiasts. Visitors can enjoy mountain forest hikes, lake swimming, and homemade organic cuisine. The unspoilt valley setting enhances the overall experience of relaxation and outdoor adventure.",
    "published": "2025-08-31T06:00:22Z"
  }
]