[
  {
    "title": "Country diary: Barn owlets that feel like miracles | Nicola Chester",
    "url": "https://www.theguardian.com/environment/2025/aug/30/country-diary-barn-owlets-that-feel-like-miracles",
    "image": "https://media.guim.co.uk/7300f40e2209be6041b9e4aa3f32955818d620a0/358_0_3558_2848/500.jpg",
    "summary": "In Inkpen, Berkshire, despite a troubling year for local breeding numbers, residents are delighted to spot two young adult birds at their back garden gate. This moment brings joy and a sense of connection to the community. The sighting offers a glimmer of hope amid the challenges faced in wildlife conservation.",
    "published": "2025-08-30T04:30:51Z"
  },
  {
    "title": "Melbourne Symphony Orchestra performance in London interrupted by pro-Palestine protestors",
    "url": "https://www.theguardian.com/australia-news/2025/aug/30/melbourne-symphony-orchestra-performance-london-interrupted-pro-palestine-protestors-bbc-proms-ntwnfb",
    "image": "https://media.guim.co.uk/c05ff3cc3dd63a90c008f4e9d3d4c33857369fdc/0_0_4680_3744/500.jpg",
    "summary": "Jewish Artists for Palestine disrupted a BBC Proms concert at the Royal Albert Hall, expressing that the Melbourne Symphony Orchestra (MSO) had suppressed artistic expression and protest. The interruption aimed to highlight their grievances regarding the treatment of artists and the ongoing situation in Palestine. The protest drew attention to the larger issues of artistic freedom and political expression.",
    "published": "2025-08-30T04:26:36Z"
  },
  {
    "title": "‘It’s bigger than me’: Taylor Townsend topples No 5 Andreeva in US Open shock",
    "url": "https://www.theguardian.com/sport/2025/aug/30/taylor-townsend-us-open-mirra-andreeva-upset",
    "image": "https://media.guim.co.uk/171203080c03663241e7bc2eeed535905db30899/425_0_3850_3080/500.jpg",
    "summary": "Taylor Townsend defeated fifth seed Mirra Andreeva 7-5, 6-2 at the US Open. This victory highlighted Townsend's rise as an unexpected star during the tournament. Her performance has captured the attention of fans and the tennis community alike.",
    "published": "2025-08-30T04:24:44Z"
  },
  {
    "title": "‘La tapisserie, c’est moi’: Macron accused of putting politics first in Bayeux tapestry loan",
    "url": "https://www.theguardian.com/world/2025/aug/30/emmanuel-macron-bayeux-tapestry-loan-british-museum-petition",
    "image": "https://media.guim.co.uk/431b9c7b0db4a83c2eac860642a803a70d235cba/1537_0_3585_2870/500.jpg",
    "summary": "The organizer of a petition claims that the French president is disregarding expert recommendations regarding an artefact's fragility. Experts warn that transporting it to the UK could cause significant damage. The petition seeks to halt the planned move of the delicate item.",
    "published": "2025-08-30T04:00:52Z"
  },
  {
    "title": "Putin embarks on China visit with Ukraine war top of agenda",
    "url": "https://www.theguardian.com/world/2025/aug/30/vladimir-putin-china-visit-xi-jinping-ukraine",
    "image": "https://media.guim.co.uk/415f60bbbe9e3fcf701e895713d92b809d578008/432_0_6880_5504/500.jpg",
    "summary": "Analysts suggest that during his extended visit, Putin and Xi will focus on synchronizing their political stances. This meeting reflects the strengthening ties between Russia and China amidst global tensions. Their alignment may have implications for international relations and geopolitical dynamics moving forward.",
    "published": "2025-08-30T04:00:52Z"
  }
]