[
  {
    "title": "Australia news live: Wong says Trump deserves ‘enormous congratulations’ as Israeli hostages released; Keating’s influence on super backdown revealed",
    "url": "https://www.theguardian.com/australia-news/live/2025/oct/14/australia-news-live-jim-chalmers-superannuation-concession-tax-cybercrime-anthony-albanese-sussan-ley-coalition-penny-wong-israel-gaza-ntwnfb",
    "image": "https://media.guim.co.uk/67b6c5f4be37f0448926d394e8aceabc3d0fe98d/657_493_5966_4773/500.jpg",
    "summary": "I'm sorry, but I need more information to summarize the news. Please provide the content or the main points you would like me to summarize.",
    "published": "2025-10-13T21:17:07Z"
  },
  {
    "title": "Majority of family court cases in England and Wales feature domestic abuse, watchdog says",
    "url": "https://www.theguardian.com/society/2025/oct/10/majority-of-family-court-cases-in-england-and-wales-feature-domestic-abuse-watchdog-says",
    "image": "https://media.guim.co.uk/24c670afd29fa8c38385e44649e2b2ea1b834c49/764_0_4853_3883/500.jpg",
    "summary": "A recent review by the commissioner revealed that 87% of cases involved incidents of physical, psychological, or sexual abuse within families. The findings highlight significant concerns regarding family safety and wellbeing. This report underscores the urgent need for intervention and support systems to address these issues.",
    "published": "2025-10-13T21:16:23Z"
  },
  {
    "title": "Wales 2-4 Belgium: World Cup 2026 qualifying – as it happened",
    "url": "https://www.theguardian.com/football/live/2025/oct/13/wales-v-belgium-world-cup-2026-qualifying-live",
    "image": "https://media.guim.co.uk/15b815c876f9bdbfc2749b00aad9ef39fb7ed90f/664_0_6643_5314/500.jpg",
    "summary": "Kevin De Bruyne scored two penalties to secure a vital win for Belgium against Wales in Cardiff. The match proved to be a frustrating experience for the Welsh team. Belgium's victory contributes significantly to their standing in international competition.",
    "published": "2025-10-13T21:13:50Z"
  },
  {
    "title": "‘One of the best in the world’: Tuchel urges Rashford to fulfil potential",
    "url": "https://www.theguardian.com/football/2025/oct/13/thomas-tuchel-marcus-rashford-bellingham-england",
    "image": "https://media.guim.co.uk/5b585c16bfb5b87d336e3edce0706edfb83e5f7e/431_0_4175_3340/500.jpg",
    "summary": "Thomas Tuchel believes Marcus Rashford should challenge himself to reach greater heights. He emphasized that Rashford has \"no limits\" on his potential as a player. Tuchel is optimistic about Rashford's ability to improve and succeed.",
    "published": "2025-10-13T21:08:40Z"
  },
  {
    "title": "De Bruyne double in Belgium win deals huge blow to Wales’ World Cup hopes",
    "url": "https://www.theguardian.com/football/2025/oct/13/wales-belgium-world-cup-2026-qualifiers-match-report",
    "image": "https://media.guim.co.uk/15b815c876f9bdbfc2749b00aad9ef39fb7ed90f/664_0_6643_5314/500.jpg",
    "summary": "Wales initially took the lead in the match, but Belgium responded with two penalties for handball and a standout performance from Jérémy Doku. This strong effort led Belgium to secure a 4-2 victory over Wales. The win highlights Belgium's resilience and attacking capabilities in the game.",
    "published": "2025-10-13T20:54:53Z"
  }
]