[
  {
    "title": "US treasury secretary accuses Beijing of trying to damage global economy, as US and China roll out tit-for-tat port fees – business live",
    "url": "https://www.theguardian.com/business/live/2025/oct/14/us-treasury-secretary-beijing-rare-earths-us-china-port-fees-imf-tariffs-business-live-news",
    "image": "https://media.guim.co.uk/cff322cf52c19005da82b58a1d3f3740392f6326/301_0_2500_2000/500.jpg",
    "summary": "The latest economic and financial news highlights significant market movements, emerging trends, and key indicators influencing global economies. Analysts focus on inflation rates, interest rate changes, and geopolitical factors impacting financial stability. Investors are keenly watching for policy announcements that could shape economic outlooks.",
    "published": "2025-10-14T06:26:49Z"
  },
  {
    "title": "Gaza ceasefire live: Israelis and Palestinians celebrate hostage and detainee releases as key truce issues remain ",
    "url": "https://www.theguardian.com/world/live/2025/oct/14/gaza-ceasefire-israel-hamas-palestine-hostages-detainees-truce-live-news-updates",
    "image": "https://media.guim.co.uk/5be2911711c669d7c6572cd223f0d8a43cf44200/961_0_6977_5582/500.jpg",
    "summary": "Ongoing discussions around the disarmament of Hamas and the future governance of Gaza underscore the delicate nature of the current truce. These unresolved issues raise concerns about the sustainability of peace in the region. The situation remains precarious as stakeholders navigate these critical challenges.",
    "published": "2025-10-14T06:26:39Z"
  },
  {
    "title": "UK labour market shows signs of stabilising after job losses",
    "url": "https://www.theguardian.com/business/2025/oct/14/uk-labour-market-job-losses-unemployment-ons",
    "image": "https://media.guim.co.uk/a9bffe8bef91b21d1d86163af6931647c8071436/7_0_4800_3840/500.jpg",
    "summary": "The unemployment rate has increased slightly to 4.8%, according to the Office for National Statistics (ONS). Despite this uptick, there are indications that payroll numbers and job vacancies are stabilizing. The overall labor market appears to be leveling off amid these shifts.",
    "published": "2025-10-14T06:25:13Z"
  },
  {
    "title": "Two Affinity Education executives resign after childcare scandals",
    "url": "https://www.theguardian.com/australia-news/2025/oct/14/two-affinity-education-executives-resign-childcare-scandals-ntwnfb",
    "image": "https://media.guim.co.uk/63ea8bcb45a820a93aa2a13edd21c8645a020d5e/998_0_6578_5265/500.jpg",
    "summary": "CEO Tim Hickey and COO Nishad Alani have resigned from their positions at the childcare group. The organization emphasized its ongoing commitment to providing safe care for children. Leadership changes come as part of efforts to strengthen operations and maintain trust.",
    "published": "2025-10-14T06:23:24Z"
  },
  {
    "title": "Police expand search for missing boy Gus in outback SA after advice from ‘survival specialists’",
    "url": "https://www.theguardian.com/australia-news/2025/oct/14/four-year-old-missing-boy-gus-police-expand-search-sa-outback",
    "image": "https://media.guim.co.uk/15978ffebf6d420326646ba916485e1a7a9ac898/0_250_1200_960/500.jpg",
    "summary": "South Australian authorities are intensifying their efforts to locate the body of a four-year-old boy who has been missing since late September. The police commissioner stated they are thoroughly investigating all avenues in the search. The community remains hopeful for a resolution as the search continues.",
    "published": "2025-10-14T06:21:11Z"
  }
]