[
  {
    "title": "Australia politics live: Aly says Nazis exploited protests to prey on ‘legitimate concerns’; arrest after car rams Russian consulate",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/01/australia-politics-live-labor-coalition-housing-net-zero-anthony-albanese-sussan-ley-question-time-ntwnfb",
    "image": "https://media.guim.co.uk/8cec79328375f0c02e5d8e4ddcfb47a4536ac09f/739_209_5668_4535/500.jpg",
    "summary": "Please provide the news article or details you'd like summarized, and I'd be happy to help!",
    "published": "2025-08-31T23:28:15Z"
  },
  {
    "title": "Tap-in, tap-out rail ticket trial to streamline fares using GPS tracking",
    "url": "https://www.theguardian.com/business/2025/sep/01/tap-in-tap-out-rail-ticket-trial-to-streamline-fares-using-gps-tracking",
    "image": "https://media.guim.co.uk/caf6b707b245d7d97f5043833c585ea73e417826/500_0_6030_4824/500.jpg",
    "summary": "East Midlands passengers will soon trial a new digital ticketing system that automatically calculates the best fares at the end of each day. This initiative aims to simplify the fare process and offer savings to travelers. The test reflects ongoing advancements in ticketing technology in the rail industry.",
    "published": "2025-08-31T23:01:43Z"
  },
  {
    "title": "Companies face prosecution risk as new fraud law comes into force",
    "url": "https://www.theguardian.com/business/2025/sep/01/companies-face-prosecution-risk-as-new-law-comes-into-force",
    "image": "https://media.guim.co.uk/590cc3d107a6853a0958d335253b367bca9d6a3b/527_119_2938_2350/500.jpg",
    "summary": "CPS has announced a significant advancement in crime prevention, allowing for the possibility of imposing unlimited fines on companies found guilty of serious offenses. This measure aims to hold corporations accountable and deter future criminal activity. The initiative is seen as a critical tool in enhancing public safety and justice.",
    "published": "2025-08-31T23:01:42Z"
  },
  {
    "title": "UK to make it harder for refugees to bring family members to country",
    "url": "https://www.theguardian.com/uk-news/2025/sep/01/uk-to-make-it-harder-for-refugees-to-bring-family-members-to-country",
    "image": "https://media.guim.co.uk/d976e3999130010d0ffd5e15badb22a6beda1d3c/370_774_3291_2634/500.jpg",
    "summary": "The Home Secretary is set to announce significant changes to the family reunion policy as part of efforts to address the ongoing contentious immigration debate. This overhaul aims to streamline processes and improve conditions for families seeking to reunite in the UK. The initiative reflects the government's response to growing public and political pressure regarding immigration issues.",
    "published": "2025-08-31T23:01:42Z"
  },
  {
    "title": "Australia well served by RBA inflation band but monetary policy impact may now be ‘exhausted’, ex-governors say",
    "url": "https://www.theguardian.com/australia-news/2025/sep/01/australia-well-served-by-rba-inflation-band-but-monetary-policy-impact-may-now-be-exhausted-ex-governors-say",
    "image": "https://media.guim.co.uk/b0a8a48fefd23a3f2845c59984f84233dcb3475d/291_0_2969_2376/500.jpg",
    "summary": "Former RBA governor Glenn Stevens revealed that concerns about soaring asset prices in the 2010s impacted the decision to avoid reducing the cash rate to zero. He discussed this topic in an interview with the bank's historian. The insights emphasize the balancing act central banks face between interest rates and asset market stability.",
    "published": "2025-08-31T23:00:42Z"
  }
]