[
  {
    "title": "Australia politics live: Queensland education minister ‘very unhappy’ about history exam blunder; Labor votes against Pocock’s climate duty of care bill",
    "url": "https://www.theguardian.com/australia-news/live/2025/oct/29/federal-politics-parliament-victoria-queensland-bom-labor-coalition-anthony-albanese-sussan-ley-abs-inflation-apec-summit-afp-press-club-ntwnfb",
    "image": "https://media.guim.co.uk/f978656574cbc94ef62ab3e707bf198617833ddd/320_0_4378_3504/500.jpg",
    "summary": "I'm unable to access live updates or current news articles. However, if you provide me with specific details or text from the news you want summarized, I'd be happy to help!",
    "published": "2025-10-29T01:38:54Z"
  },
  {
    "title": "New Zealand v England: second men’s cricket one-day international – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/29/new-zealand-v-england-second-cricket-one-day-international-live",
    "summary": "New Zealand and England are facing off in the second one-day international in Hamilton. An over-by-over report is being provided by the writers for live updates. Fans can follow the action as it unfolds.",
    "published": "2025-10-29T01:38:34Z"
  },
  {
    "title": "Court to reconsider ruling that allowed Trump to send troops to Portland",
    "url": "https://www.theguardian.com/us-news/2025/oct/28/us-appeals-court-trump-portland-troops",
    "image": "https://media.guim.co.uk/a4b421f00e92c739a5060a0daa8b90f5c44e3ab7/1118_73_3637_2910/500.jpg",
    "summary": "An appeals court has agreed to hold an \"en banc\" hearing regarding the deployment of the National Guard during Trump's presidency. This will involve a new panel of judges to review the case. The decision could lead to significant implications for presidential authority and military deployment practices.",
    "published": "2025-10-29T01:38:21Z"
  },
  {
    "title": "Hurricane Melissa latest updates: extensive damage reported in Jamaica’s St Elizabeth parish; Cuba braces for landfall ",
    "url": "https://www.theguardian.com/world/live/2025/oct/28/hurricane-melissa-live-updates-category-5-storm-jamaica-landfall-latest-news",
    "image": "https://media.guim.co.uk/8effd8ff437b97e0732e8a18ab7c894ae435c07e/520_0_4348_3478/500.jpg",
    "summary": "A powerful hurricane struck Jamaica as a category 5 storm, causing significant property damage and uprooting trees. After making landfall, it weakened to a category 4 cyclone but remained dangerous. Authorities are assessing the extent of the destruction and preparing for ongoing impacts.",
    "published": "2025-10-29T01:36:50Z"
  },
  {
    "title": "Border patrol leader told to go to court every weekday to report on Chicago enforcement",
    "url": "https://www.theguardian.com/us-news/2025/oct/28/chicago-immigration-crackdown-gregory-bovino",
    "image": "https://media.guim.co.uk/3c226c496927eb9f56121b016685695a3e8fb177/398_0_3333_2667/500.jpg",
    "summary": "A federal judge has issued orders to Gregory Bovino, implementing oversight concerning the actions of Trump officials during raids in the city. This decision is considered exceptional and aims to ensure accountability. The ruling reflects ongoing concerns regarding the conduct of officials during such operations.",
    "published": "2025-10-29T01:26:12Z"
  }
]