[
  {
    "title": "AFL grand final 2025: Geelong Cats v Brisbane Lions – live build-up",
    "url": "https://www.theguardian.com/sport/live/2025/sep/27/afl-grand-final-2025-live-updates-geelong-vs-lions-blog-scores-results-start-time-cats-v-lions-mcg",
    "image": "https://media.guim.co.uk/1ca02dd86504d30bce2509c01853ee5c3974ad81/580_0_6331_5067/500.jpg",
    "summary": "In an upcoming match, the Cats aim for a third championship under coach Chris Scott's leadership, while the Lions seek to defend their title. Writers will provide a goal-by-goal report during the game. Anticipation builds for this exciting showdown between the two teams.",
    "published": "2025-09-27T03:24:38Z"
  },
  {
    "title": "Cradle Mountain tourist dies after walking group overwhelmed by extreme weather at national park",
    "url": "https://www.theguardian.com/australia-news/2025/sep/27/cradle-mountain-tourist-dies-after-walking-group-overwhelmed-by-extreme-weather-at-national-park",
    "image": "https://media.guim.co.uk/449be68b7c73e311c756852c71a2466ca0393084/48_0_960_768/500.jpg",
    "summary": "Tasmania police reported that four Chinese nationals were discovered by fellow hikers on Friday. Unfortunately, one woman from the group lost her life. The incident is currently under investigation.",
    "published": "2025-09-27T02:27:18Z"
  },
  {
    "title": "Trump urges Microsoft to fire lawyer who ran investigation into attempt to overturn 2020 US election – as it happened",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/26/james-comey-fbi-indictment-donald-trump-executive-orders-tariffs-us-politics-live",
    "image": "https://media.guim.co.uk/ea30745b7e0352485176734657642900fd15ae4f/186_0_2153_1724/500.jpg",
    "summary": "The President has expressed frustration with a former deputy attorney general who is now employed at a tech company, amid growing controversy over the targeting of ex-FBI chief James Comey. The situation has sparked significant public and media scrutiny. This escalation highlights ongoing tensions surrounding investigations involving high-profile figures.",
    "published": "2025-09-27T02:05:55Z"
  },
  {
    "title": "US Ryder Cup captain Keegan Bradley vows to stick to plan despite opening day struggles",
    "url": "https://www.theguardian.com/sport/2025/sep/27/ryder-cup-us-captain-keegan-bradley-v-europe-day-one-reaction",
    "image": "https://media.guim.co.uk/d04fe51b3a128e3a708abd32e29b91e7dcab4277/725_0_3625_2900/500.jpg",
    "summary": "Keegan Bradley is under scrutiny for his player management after making unusual pairings for the Saturday morning foursomes. His choices have raised questions about his flexibility and decision-making as captain. This has sparked discussions regarding the balance of power between players and leadership in team dynamics.",
    "published": "2025-09-27T01:58:56Z"
  },
  {
    "title": "Trump fires US attorney who told border agents to follow law on immigration raids",
    "url": "https://www.theguardian.com/us-news/2025/sep/26/trump-fires-prosecutor-sacramento",
    "image": "https://media.guim.co.uk/becd7ce534af34df18c1470bc18e1d560300f472/418_0_4178_3342/500.jpg",
    "summary": "Michele Beckwith was fired from her position after she urged Border Patrol agents to adhere to court orders. Her dismissal has raised concerns about accountability and compliance within the agency. The New York Times highlighted the implications of her firing on the enforcement of legal directives.",
    "published": "2025-09-27T01:48:42Z"
  }
]