[
  {
    "title": "Australia news live: government lends Arnott’s $45m for global Tim Tams push; Ashton Hurn confirmed as new SA Liberals leader",
    "url": "https://www.theguardian.com/australia-news/live/2025/dec/08/australia-news-live-politics-coalition-housing-policy-liberal-labor-vic-nsw-qld-tasmania-weather-bushfires-economy-education-health-social-media-cost-of-living",
    "image": "https://media.guim.co.uk/ea5d587d120272d7fbc752e7ac032bb10df33b0f/1995_697_2714_2171/500.jpg",
    "summary": "Please provide the news article or content you would like summarized, and I'll be happy to help!",
    "published": "2025-12-08T01:43:41Z"
  },
  {
    "title": "Notorious childcare paedophile Ashley Paul Griffith ‘could have been stopped’ five times during decades of offending",
    "url": "https://www.theguardian.com/australia-news/2025/dec/08/queensland-childcare-paedophile-could-have-been-stopped-five-times",
    "image": "https://media.guim.co.uk/fe9c34958098b88035e7cc30e26bdd71b37fa74e/238_0_3282_2626/500.jpg",
    "summary": "A Queensland report highlights numerous \"missed opportunities\" spanning two decades where measures could have been implemented to identify or prevent cases of abuse. The findings suggest systemic failures in responding to warning signs and protecting vulnerable individuals. The report calls for improved procedures and accountability to address these issues.",
    "published": "2025-12-08T00:57:12Z"
  },
  {
    "title": "Trump news at a glance: Key Republican backs release of video of strike on alleged drug boat",
    "url": "https://www.theguardian.com/us-news/2025/dec/08/trump-administration-news-update-today-latest",
    "image": "https://media.guim.co.uk/3b78d00a623ef2c921f68a1092f8b504c362a923/175_0_1750_1400/500.jpg",
    "summary": "Democrats are urging the Trump administration to make public the video of a second assault on a drug boat that had already been disabled in the Caribbean. This call for transparency highlights ongoing tensions between political parties regarding drug enforcement actions. The demand for the video's release is part of broader discussions around US drug policy and accountability.",
    "published": "2025-12-08T00:48:26Z"
  },
  {
    "title": "Social media ban: when does it start in Australia, how will it work and what apps are getting banned for under-16s?",
    "url": "https://www.theguardian.com/media/2025/dec/08/social-media-ban-or-delay-australia-list-under-16-explainer-guide-when-what-apps-included-getting-banned",
    "image": "https://media.guim.co.uk/205ebdfcd9e147a641953a99f3784f8a54f48ce6/0_26_5000_4001/500.jpg",
    "summary": "The news discusses uncertainties surrounding the potential delay or postponement of a ban, likely related to online regulations. It outlines the mechanics of age verification systems intended to ensure compliance. Further details on the timeline and implications are provided for stakeholders.",
    "published": "2025-12-08T00:30:26Z"
  },
  {
    "title": "Packers edge Bears and Bills topple Bengals in thriller: NFL week 14 as it happened",
    "url": "https://www.theguardian.com/sport/live/2025/dec/07/ravens-v-steelers-jaguars-v-colts-and-bills-v-bengals-nfl-week-14-live",
    "image": "https://media.guim.co.uk/cf48dbb6edc9958a3a363cd692ccd2fef4a3d91f/495_246_4063_3251/500.jpg",
    "summary": "Green Bay secured the NFC North lead with a 28-21 victory over Chicago. Meanwhile, Pittsburgh climbed past Baltimore in the AFC North with a hard-fought 27-22 win. Both teams demonstrated strong performances in pivotal divisional matchups.",
    "published": "2025-12-08T00:27:16Z"
  }
]