[
  {
    "title": "Australia news live: Ley lays down law to frontbenchers; union hits back after Optus blames triple-zero outage on staff",
    "url": "https://www.theguardian.com/australia-news/live/2025/oct/01/australia-news-live-nicole-kidman-divorce-keith-urban-sussan-ley-coalition-andrew-hastie-anthony-albanese-housing-ntwnfb",
    "image": "https://media.guim.co.uk/3a1ca450f274d6939dfe83aa3f17478fe4257f40/0_0_5000_4000/500.jpg",
    "summary": "I’m sorry, but I need more context or details about the news you want summarized. Please provide the specific content or topic you'd like summarized.",
    "published": "2025-09-30T22:16:44Z"
  },
  {
    "title": "Trump says ‘no choice’ but to cut federal workers if government shuts down as midnight deadline looms – live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/30/us-government-shutdown-funding-trump-vance-portland-hegseth-latest-updates",
    "image": "https://media.guim.co.uk/3a7fa41ff81c50527e6b747b3ef56a5b8670e32d/263_0_3333_2667/500.jpg",
    "summary": "As Congress approaches a critical deadline, Democrats and Republicans are engaged in a fierce blame game over their inability to reach a deal. Both parties are struggling to find common ground on key issues, heightening tensions. The lack of progress raises concerns about potential government shutdowns and their impact.",
    "published": "2025-09-30T22:13:08Z"
  },
  {
    "title": "Trump says $500m deal reached with Harvard to settle dispute",
    "url": "https://www.theguardian.com/us-news/2025/sep/30/trump-harvard-settle-deal",
    "image": "https://media.guim.co.uk/4ebb849bdc33b51db208e524748d741a14f54ae0/446_0_4446_3559/500.jpg",
    "summary": "The US president mentioned that \"Linda is finishing up the details\" regarding an unspecified agreement, but it's unclear if the university is prepared to make an official announcement. Further information on the nature of the agreement remains undisclosed. The situation has generated anticipation but lacks clarity.",
    "published": "2025-09-30T22:01:25Z"
  },
  {
    "title": "Why healthcare spending is at the center of the US government shutdown battle",
    "url": "https://www.theguardian.com/us-news/2025/sep/30/government-shutdown-healthcare-medicaid",
    "image": "https://media.guim.co.uk/3e70835fa06e401d56b3c65af71db817bb97b92f/671_0_4560_3648/500.jpg",
    "summary": "Democrats have stated that they will not support the proposed legislation unless Republicans agree to reverse the cuts to Medicaid and extend subsidies. This stance highlights increasing partisan tensions over healthcare funding. The outcome may significantly impact ongoing negotiations and the broader legislative agenda.",
    "published": "2025-09-30T21:46:02Z"
  },
  {
    "title": "Galatasaray 1-0 Liverpool: Champions League – as it happened",
    "url": "https://www.theguardian.com/football/live/2025/sep/30/galatasaray-v-liverpool-champions-league-live",
    "image": "https://media.guim.co.uk/7a50295abeb5d6c08f167ddaacda1f6d44275d67/537_0_3907_3126/500.jpg",
    "summary": "Victor Osimhen scored a penalty in the first half, leading to Liverpool's defeat. A late VAR review confirmed the decision, sealing Liverpool's loss. Scott Murray provided a minute-by-minute report of the match.",
    "published": "2025-09-30T21:27:35Z"
  }
]