[
  {
    "title": "Australia news live: PM takes aim at Ley over climate target comment; NSW Greens push for laws to keep cats inside",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/19/australia-news-live-cheaper-energy-chris-bowen-climate-bush-search-crashed-plane-pilot-julie-bishop-ntwnfb",
    "image": "https://media.guim.co.uk/48a04baa16f023c83da76ad54494c4539f55b8bb/1612_200_4281_3427/500.jpg",
    "summary": "Sorry, I need more information about the news you'd like to have summarized. Please provide the details or the content you have in mind.",
    "published": "2025-09-19T07:22:14Z"
  },
  {
    "title": "Sydney commuters face more disruption as metro workers to vote on industrial action",
    "url": "https://www.theguardian.com/australia-news/2025/sep/19/metro-industrial-action-more-disruption-looms-sydney-commuters",
    "image": "https://media.guim.co.uk/427259d1ff9d407698c01dc31e567ff189710a70/639_0_5893_4715/500.jpg",
    "summary": "Sydney Metro trains operate without drivers, relying on advanced automation. Customer service attendants are present inside the trains and at station platforms to assist passengers. This combination enhances safety and service quality for commuters.",
    "published": "2025-09-19T07:13:08Z"
  },
  {
    "title": "Afternoon Update: seven charged after fatal Melbourne stabbings; late night hosts rally behind Kimmel; and an owl’s crime scene",
    "url": "https://www.theguardian.com/australia-news/2025/sep/19/afternoon-update-friday-ntwnfb",
    "image": "https://media.guim.co.uk/da1c41a5aaaa12b02c4b1897de6f0128d0778b24/0_0_5000_4000/500.jpg",
    "summary": "Seven teenagers have been charged with murder following the stabbing deaths of 15-year-old Dau Akueng and 12-year-old Chol Achiek in Melbourne. The tragic incident has drawn significant attention, highlighting issues of youth violence in the community. Authorities are continuing their investigation into the events surrounding the stabbings.",
    "published": "2025-09-19T07:09:25Z"
  },
  {
    "title": "Seven teenagers charged with murder after stabbing deaths of two boys in Melbourne",
    "url": "https://www.theguardian.com/australia-news/2025/sep/19/seven-teenagers-arrested-over-stabbing-deaths-of-two-teenagers-in-melbourne-ntwnfb",
    "image": "https://media.guim.co.uk/da1c41a5aaaa12b02c4b1897de6f0128d0778b24/0_0_5000_4000/500.jpg",
    "summary": "Two individuals have been charged in connection with the deaths of Dau Akueng, 15, and Chol Achiek, 12, resulting from incidents that occurred in Cobblebank on September 6. The charges follow a police investigation into the tragic events. Authorities are seeking justice for the young victims.",
    "published": "2025-09-19T07:06:23Z"
  },
  {
    "title": "‘Mourinho is more than a man – he’s a global brand’: coach returns to Benfica with plenty to prove",
    "url": "https://www.theguardian.com/football/2025/sep/19/jose-mourinho-benfica-portugal-football-rui-costa",
    "image": "https://media.guim.co.uk/ee7c30d120ddc9390130508c8c2a6e8a3ef18da0/132_0_2872_2298/500.jpg",
    "summary": "Jose Mourinho, known as the 'Special One', has returned to work in Portugal after over 20 years. His homecoming has sparked mixed reactions among fans and analysts. The move marks a significant chapter in his storied career.",
    "published": "2025-09-19T07:00:38Z"
  }
]