[
  {
    "title": "West Ham v Tottenham: Premier League – live",
    "url": "https://www.theguardian.com/football/live/2025/sep/13/west-ham-v-tottenham-premier-league-live",
    "image": "https://media.guim.co.uk/411d61e9e9933a6e734060201e50427ee0277c61/1218_205_3294_2634/500.jpg",
    "summary": "Tottenham faces West Ham at the London Stadium, marking the potential start of a new era following Daniel Levy's departure. Fans are eager to see if the team can secure a win in this crucial match. Emillia Hawkins will provide updates on the game.",
    "published": "2025-09-13T18:37:24Z"
  },
  {
    "title": "Brentford v Chelsea: Premier League – live",
    "url": "https://www.theguardian.com/football/live/2025/sep/13/brentford-v-chelsea-premier-league-live",
    "image": "https://media.guim.co.uk/e3552d9039c3d61f22793837f5ff6eccfd94ba62/1528_2033_4172_3338/500.jpg",
    "summary": "Chelsea is set to face Brentford in a west London derby at the Gtech Community Stadium. The match features Xaymaca Awoyungbo covering the event. Fans can expect an exciting local rivalry clash.",
    "published": "2025-09-13T18:29:19Z"
  },
  {
    "title": "Bottles thrown at police as 100 officers clash with ‘unite the kingdom’ marchers – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/13/uk-politics-latest-news-unite-the-kingdom-march-far-right-rally-london-labour-keir-starmer",
    "image": "https://media.guim.co.uk/42917aaac388a66b0457a04458b3f2bc3a1a04ac/1037_202_4023_3218/500.jpg",
    "summary": "The Metropolitan Police reported that approximately 110,000 people attended a recent rally, while a smaller group of counter-protesters were also in attendance. The event drew significant public interest and participation. Tensions between the two groups were noted during the event.",
    "published": "2025-09-13T18:20:55Z"
  },
  {
    "title": "Questions linger about alleged shooter’s motivation for killing Charlie Kirk",
    "url": "https://www.theguardian.com/us-news/2025/sep/13/charlie-kirk-killing-alleged-shooter-motivation",
    "image": "https://media.guim.co.uk/f06a1614b64328d1c4c910def1df62c1a5fdf9ed/0_0_4916_3933/500.jpg",
    "summary": "Following the retraction of a link to \"trans ideology,\" scrutiny of the suspect's background and political beliefs is intensifying. Investigators and the media are analyzing the suspect's history for potential influences on their actions. The case has sparked discussions on the intersection of ideology and violence.",
    "published": "2025-09-13T18:08:17Z"
  },
  {
    "title": "Hatton warms up for Ryder Cup by surging into contention at PGA Championship",
    "url": "https://www.theguardian.com/sport/2025/sep/13/tyrell-hatton-warms-up-for-ryder-cup-by-surging-into-wentworth-contention",
    "image": "https://media.guim.co.uk/2ca0c3e9e2d8e9bdc114325a8bca85a0c9361a82/331_149_3854_3083/500.jpg",
    "summary": "An English golfer fired a 64 in the third round of the PGA Championship, positioning him just two strokes behind leaders Adrien Saddier and Alex Norén. This strong performance boosts his chances as the tournament progresses. The competition remains tight as players vie for the top spot.",
    "published": "2025-09-13T17:48:14Z"
  }
]