[
  {
    "title": "The best Black Friday TV deals in the UK – and how to avoid a bad one",
    "url": "https://www.theguardian.com/thefilter/2025/nov/20/best-black-friday-tv-deals-uk-2025",
    "image": "https://media.guim.co.uk/0636a7e66869cb7c8c5949ffad030127d701c1f8/0_0_5000_4000/500.jpg",
    "summary": "Early Black Friday TV deals feature a variety of options, including 50-inch OLEDs and compact smart TVs. Top brands such as Samsung and LG are highlighted among the selections. This roundup provides shoppers with great opportunities to save on high-quality televisions.",
    "published": "2025-11-25T14:16:59Z"
  },
  {
    "title": "Starmer reiterates call for Reform UK to investigate any pro-Russia links after Gill case – UK politics live ",
    "url": "https://www.theguardian.com/politics/live/2025/nov/25/nigel-farage-nathan-gill-labour-reform-uk-russia-keir-starmer-uk-politics-live-news",
    "image": "https://media.guim.co.uk/d912e8e3eedb121d57edfd38dc8665be4a52e49d/0_134_4000_3201/500.jpg",
    "summary": "The Prime Minister urged the party's leadership to demonstrate bravery by initiating an investigation. This call for action suggests a need for accountability within the party. The statement emphasizes transparency and integrity in addressing potential issues.",
    "published": "2025-11-25T14:07:49Z"
  },
  {
    "title": "US attorney general vows to appeal dismissal of criminal cases against James Comey and Letitia James – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/nov/25/us-politics-pam-bondi-appeal-james-comey-letitia-james-cases-donald-trump-venezuela-latest-updates",
    "image": "https://media.guim.co.uk/58bf2e759190890689ccc3c2494627bb7e0d4de0/1039_26_3292_2634/500.jpg",
    "summary": "Former President Trump intends to have a direct conversation with Venezuelan President Nicolás Maduro, according to Axios. This plan comes despite the U.S. government's designation of Maduro as the leader of a foreign terrorist organization. Trump's outreach raises questions about U.S. foreign policy towards Venezuela.",
    "published": "2025-11-25T14:03:48Z"
  },
  {
    "title": "My Bloody Valentine review – shoegaze pioneers find prettiness in pulverising noise",
    "url": "https://www.theguardian.com/music/2025/nov/25/my-bloody-valentine-review-shoegaze-pioneers-find-prettiness-in-pulverising-noise",
    "image": "https://media.guim.co.uk/07cec52f26af6e2900442e17ada29461621ef5bb/0_1249_3906_3124/500.jpg",
    "summary": "The band delivered a two-hour performance featuring their signature blend of dreamlike and apocalyptic sounds. Earplugs were distributed to ensure audience safety during the raucous show. The event emphasized their unique musical style and captivating stage presence.",
    "published": "2025-11-25T14:03:30Z"
  },
  {
    "title": "Republican Jim Justice to pay more than $5m in back taxes following lawsuit",
    "url": "https://www.theguardian.com/us-news/2025/nov/25/jim-justice-west-virginia-back-taxes",
    "image": "https://media.guim.co.uk/74b2e8cf66eeb5a740c494e017df36d601ad9b18/500_0_5000_4000/500.jpg",
    "summary": "A lawsuit in West Virginia alleges that Governor Jim Justice and his wife were aware of owed funds since 2009 but failed to make payments. The case highlights ongoing financial issues linked to the couple. Legal proceedings are now underway to address the allegations.",
    "published": "2025-11-25T14:02:40Z"
  }
]