[
  {
    "title": "News live: Alex Hawke says Liberals must prioritise ‘being honest with each other’; Israel intercepts another Gaza-bound flotilla with Australian onboard",
    "url": "https://www.theguardian.com/australia-news/live/2025/oct/08/australia-politics-live-gaza-rally-parliament-anthony-albanese-sussan-ley-question-time-andrew-hastie-ntwnfb",
    "image": "https://media.guim.co.uk/b9f5660518ee564230686c0af4db47a4cedd7527/606_0_6240_4992/500.jpg",
    "summary": "I'm sorry, but I can't summarize the news without specific details or content. Please provide the text or main points you would like summarized!",
    "published": "2025-10-08T06:29:12Z"
  },
  {
    "title": "News Corp Australia chair says social media platforms are ‘true monsters’ and ‘torment our children’",
    "url": "https://www.theguardian.com/media/2025/oct/08/news-corp-australia-chair-michael-miller-says-social-media-platforms-monsters-torment-our-children",
    "image": "https://media.guim.co.uk/acd52c080d50dc625530136b7fbe122f8bff3aba/627_0_6247_5000/500.jpg",
    "summary": "Michael Miller emphasizes the need for media organizations to unite against a potential \"second big steal\" by tech companies aiming to change copyright laws to gain free access to content. He warns that these changes could undermine the value of original media work. The call to action urges the industry to protect its rights and revenue streams.",
    "published": "2025-10-08T06:03:32Z"
  },
  {
    "title": "Death of three-year-old boy in social housing fire could have been caused by faulty electrical wiring, inquest hears",
    "url": "https://www.theguardian.com/australia-news/2025/oct/08/three-year-old-boy-death-larapinta-social-housing-fire-inquest-could-have-been-caused-by-faulty-electrical-wiring-ntwnfb",
    "image": "https://media.guim.co.uk/f592703ce51e51ba91e507130bb76bcfea2a3be8/383_0_1739_1392/500.jpg",
    "summary": "An inquest is currently examining the circumstances surrounding the 2023 death of Mitchell Thomas in Larapinta, Alice Springs. Evidence is being presented to determine the details and causes of his death. The proceedings aim to shed light on this incident and provide clarity for the family and community.",
    "published": "2025-10-08T06:01:51Z"
  },
  {
    "title": "The Future of Truth by Werner Herzog review – profound, or just a prank? ",
    "url": "https://www.theguardian.com/books/2025/oct/08/the-future-of-truth-by-werner-herzog-review-profound-or-just-a-prank",
    "image": "https://media.guim.co.uk/58c2a7ed2242952f4ca7147b0b22c501af3e3347/216_0_3100_2481/500.jpg",
    "summary": "The director's seventh book explores unconventional themes such as toupees, AI, and a pig in a sewer. Its provocative content raises questions about the seriousness of the subject matter. Critics and readers are left pondering the deeper meaning behind the eclectic mix of ideas.",
    "published": "2025-10-08T06:00:19Z"
  },
  {
    "title": "Badenoch unveils ‘golden rule’ to use half of spending cuts to reduce deficit",
    "url": "https://www.theguardian.com/uk-news/2025/oct/08/badenoch-unveils-golden-rule-to-use-half-of-spending-cuts-to-reduce-deficit",
    "image": "https://media.guim.co.uk/2ec8aaa888c6521b7c2b82c54ed57a80a987706a/1297_0_6990_5592/500.jpg",
    "summary": "The conservative leader is focused on restoring the party's economic credibility, which has been severely damaged by previous leadership. She plans to implement new strategies to regain public trust in their fiscal policies. The effort marks a significant shift in direction for the party.",
    "published": "2025-10-08T06:00:18Z"
  }
]