[
  {
    "title": "Australia news live: Marles welcomes Trump’s Gaza plan; Pentagon review to back Aukus, report says",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/30/australia-news-live-albanese-supermarket-united-arab-emirates-uae-coalition-sussan-ley-andrew-hastie-reserve-bank-rba-chalmers-interest-rates-decision-ntwnfb",
    "image": "https://media.guim.co.uk/988044578c38167b2429b1547204b628614c2015/152_0_1840_1472/500.jpg",
    "summary": "I can't access live news feeds, but if you provide specific details or content, I'd be happy to help summarize!",
    "published": "2025-09-30T01:24:27Z"
  },
  {
    "title": "‘I think we’re headed to a shutdown,’ says JD Vance as Mike Johnson calls for more time for negotiations – live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/29/donald-trump-benjamin-netanyahu-gaza-white-house-us-politics-live",
    "image": "https://media.guim.co.uk/5bc5eabe43ed2cd3d8a36d9d12291101b773ef0a/0_0_4757_3806/500.jpg",
    "summary": "Congressional leaders held a meeting with Trump to discuss strategies to prevent a government shutdown. During this meeting, the Vice President allegedly claimed that Democrats \"won't do\" what is necessary to resolve the issue. Tensions remain high as negotiations continue amidst the looming deadline.",
    "published": "2025-09-30T01:24:00Z"
  },
  {
    "title": "California police stumped after trying to ticket driverless car for illegal U-turn",
    "url": "https://www.theguardian.com/technology/2025/sep/29/waymo-illegal-u-turn-driverless-car",
    "image": "https://media.guim.co.uk/bc4628983fd8fdb4643457c9ebe03e748155e00f/5_0_1790_1432/500.jpg",
    "summary": "San Bruno police stopped a Waymo autonomous vehicle but did not issue a ticket, noting that their citation books lack an option for \"robot.\" The officers remarked humorously on the unusual nature of the encounter. This highlights the ongoing legal and regulatory challenges posed by self-driving technology.",
    "published": "2025-09-30T01:12:02Z"
  },
  {
    "title": "Release date set as The Simpsons movie returns for sequel after two decades",
    "url": "https://www.theguardian.com/tv-and-radio/2025/sep/30/the-simpsons-movie-2-sequel-release-date-returns-2027",
    "image": "https://media.guim.co.uk/bb7c3b34d7b12868106969be5a1f41b1e381251b/1545_0_9905_7926/500.jpg",
    "summary": "A sequel film is set to be released in 2027, two decades after the original movie. The first film was inspired by a beloved cartoon series. Fans can look forward to a continuation of the story in the much-anticipated sequel.",
    "published": "2025-09-30T00:52:05Z"
  },
  {
    "title": "Trump news at a glance: UK and French leaders back president’s peace plan for Gaza",
    "url": "https://www.theguardian.com/us-news/2025/sep/30/president-trump-administration-news-updates-today",
    "image": "https://media.guim.co.uk/d613268fd5453c6d2dd5b3d04fd839cf18145467/624_0_6827_5464/500.jpg",
    "summary": "Trump and Israeli Prime Minister discuss a 20-point plan during their meeting at the White House. The plan focuses on enhancing cooperation and strategic interests between the US and Israel. Key moments in US politics from September 29 include this significant diplomatic engagement.",
    "published": "2025-09-30T00:30:42Z"
  }
]