[
  {
    "title": "MPs urge minister to adopt definition of Islamophobia amid rise in hate crime",
    "url": "https://www.theguardian.com/news/2025/nov/02/mps-urge-minister-to-adopt-definition-of-islamophobia-amid-rise-in-hate",
    "image": "https://media.guim.co.uk/8884b6880b06512e9408752b74a8a528ded6479b/732_40_2404_1923/500.jpg",
    "summary": "Forty Labour and independent MPs are urging Steve Reed to take significant action by clearly defining anti-Muslim hatred. They believe this step is crucial for effectively addressing and combating such discrimination. The call reflects growing concerns about rising anti-Muslim sentiment.",
    "published": "2025-11-02T07:00:03Z"
  },
  {
    "title": "Weight loss jab warning: fraudsters’ fake products ‘could cause real harm’",
    "url": "https://www.theguardian.com/money/2025/nov/02/weight-loss-jabs-scam-ads-fake-products-fraud",
    "image": "https://media.guim.co.uk/a32b508dc2e54f89a324872b8b025ede44510b55/0_0_4374_3499/500.jpg",
    "summary": "Amid the prevalence of cheap options on texts and social media, purchasing from unverified sellers poses significant health risks. Consumers are cautioned about the dangers of counterfeit or unsafe products. It's crucial to verify the credibility of sellers before making purchases to ensure safety.",
    "published": "2025-11-02T07:00:03Z"
  },
  {
    "title": "Dutch voters have been seduced by positivity – liberals elsewhere, take note | Simon van Teutem",
    "url": "https://www.theguardian.com/commentisfree/2025/nov/02/dutch-voters-positivity-liberals-patriotism-d66-netherlands-election",
    "image": "https://media.guim.co.uk/95c71a3b8e6b852f7296c3c5bb559bde06d614b6/215_0_5785_4627/500.jpg",
    "summary": "The centrist D66 party in the Netherlands successfully broadened its appeal by combining hope and progressive patriotism. This strategy enabled them to secure a victory over far-right opponents in recent elections. Dutch journalist Simon van Teutem highlights the effectiveness of this approach in the political landscape.",
    "published": "2025-11-02T07:00:02Z"
  },
  {
    "title": "Sleigh rides, spas and snowshoeing: 10 of the best winter holidays in Europe",
    "url": "https://www.theguardian.com/travel/2025/nov/02/10-best-winter-holidays-in-europe-skiing-sleigh-rides-spas-snowshoeing-",
    "image": "https://media.guim.co.uk/5d6a87f89f5e0870d2919bfed5ece356520114f3/433_0_4284_3427/500.jpg",
    "summary": "This winter, explore breathtaking mountain landscapes with a focus on cozy accommodations and enjoyable activities rather than skiing. Embrace the beauty of winter retreats that offer diverse experiences. Enjoy a refreshing break in the serene, wintry countryside.",
    "published": "2025-11-02T07:00:02Z"
  },
  {
    "title": "Victims robbed of £4bn in ‘insulting’ car loan redress scheme, say claims firms",
    "url": "https://www.theguardian.com/business/2025/nov/02/car-finance-redress-scheme-rob-victims-4bn-fca",
    "image": "https://media.guim.co.uk/b3d98be06d0a500fd9056511a706878468f7fb66/431_0_3548_2838/500.jpg",
    "summary": "The Financial Conduct Authority (FCA) is standing by its interest rate of 2.09%, despite facing criticism over its proposals. Critics have labeled the FCA's stance as \"hypocritical,\" questioning the rationale behind the rate. The ongoing debate highlights tensions between regulatory bodies and market expectations.",
    "published": "2025-11-02T07:00:01Z"
  }
]