[
  {
    "title": "Hong Kong fire latest: rescue crews search for survivors after 55 killed and hundreds reported missing",
    "url": "https://www.theguardian.com/world/live/2025/nov/27/hong-kong-fire-arrests-dead-killed-hundreds-missing-housing-complex-blaze",
    "image": "https://media.guim.co.uk/cfe6885eb8e18815f333c6e53cc6426c77efff4b/620_0_5000_4000/500.jpg",
    "summary": "Three men have been arrested in connection with an incident at the Wang Fuk Court residential complex in the Tai Po district. There are currently 26 rescue teams on-site responding to the situation. Details about the nature of the incident are still emerging.",
    "published": "2025-11-27T12:41:40Z"
  },
  {
    "title": "Reeves should have included more tax reform in budget to help growth, IFS thinktank says – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/nov/27/rachel-reeves-budget-2025-mansion-tax-labour-keir-starmer-conservatives-uk-politics-latest-news-updates",
    "image": "https://media.guim.co.uk/1a4a0c0f2ee12029ccba6022b9aef418619448c1/1282_374_3649_2919/500.jpg",
    "summary": "The director of the Institute for Fiscal Studies has criticized chancellors for avoiding significant tax reforms. He emphasized the need for bold changes that could make a substantial impact on the economy. The reluctance to embrace meaningful reform continues to be a concern for fiscal policy.",
    "published": "2025-11-27T12:38:19Z"
  },
  {
    "title": "Economists warn budget built on ‘shaky foundations’; December UK interest rate cut looks more likely – business live",
    "url": "https://www.theguardian.com/business/live/2025/nov/27/uk-fiscal-repair-budget-bond-markets-fiscal-headroom-gambling-companies-rachel-reeves-business-live-updates",
    "image": "https://media.guim.co.uk/a9b684ebd5ab312eea74d213d18cc5cfc9e7b0f1/1_0_2500_2000/500.jpg",
    "summary": "Experts are skeptical about the implementation of back-loaded tax increases mentioned in Wednesday's budget. They raise concerns about the feasibility and likelihood of these proposed measures. The uncertainty casts doubt on the government's fiscal plans moving forward.",
    "published": "2025-11-27T12:36:45Z"
  },
  {
    "title": "The US government ruins Thanksgiving: it’s a South Park holiday special",
    "url": "https://www.theguardian.com/tv-and-radio/2025/nov/27/the-us-government-ruins-thanksgiving-its-a-south-park-holiday-special",
    "image": "https://media.guim.co.uk/4077b2c29a8d96e9141073b4c5c67987c005d9dc/502_0_1350_1080/500.jpg",
    "summary": "US Secretary of War Pete Hegseth expresses frustration by criticizing a turkey-themed celebration, stemming from his struggles against an inept police detective. This conflict intensifies the drama leading into a wild season finale. The situation highlights the absurdity and chaos surrounding the characters involved.",
    "published": "2025-11-27T12:31:43Z"
  },
  {
    "title": "Europe scrambles to join Ukraine talks as EU nations attempt to bolster militaries – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/nov/27/russia-ukraine-war-peace-deal-eu-europe-latest-news-updates",
    "image": "https://media.guim.co.uk/562448be5b4cb6c2f4eaba964dfdd1302eee3c80/916_0_4584_3666/500.jpg",
    "summary": "President Macron is set to announce a new voluntary military service aimed at enhancing France's defense capabilities. This initiative seeks to strengthen the military without reinstating regular conscription. The proposals are part of broader efforts to address national security concerns.",
    "published": "2025-11-27T12:25:56Z"
  }
]