[
  {
    "title": "Australia news live: PM says PNG defence treaty will be an ‘upgrade’ to security relationship; Liberal party’s poll woes extend to NSW",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/15/australia-news-live-updates-albanese-png-climate-crisis-defence-rooftop-solar-power-energy-politics-ntwnfb",
    "image": "https://media.guim.co.uk/0b179dba95e3b7c6335ac577af226e90bcb408a2/220_0_5921_4737/500.jpg",
    "summary": "I'm sorry, but I need more information or context about the news you'd like summarized. Please provide the details, and I'll be happy to help!",
    "published": "2025-09-15T06:52:01Z"
  },
  {
    "title": "First annual drop in UK house asking prices since January 2024",
    "url": "https://www.theguardian.com/business/live/2025/sep/15/uk-house-prices-drop-tax-budget-rents-financial-markets-business-live-news-updates",
    "image": "https://media.guim.co.uk/7e293b77e2e84fc6f159a41a8f27fa6d25fa86f7/404_0_3941_3152/500.jpg",
    "summary": "Economic and financial news highlights ongoing trends and developments in global markets. Key indicators and analyses reflect shifts in economic policies and investment strategies. The coverage offers insights into how these changes may impact various sectors and consumer behavior.",
    "published": "2025-09-15T06:48:10Z"
  },
  {
    "title": "Afternoon Update: Australia’s climate breakdown risks laid bare; ANZ slapped with record fine; and Adolescence wins big at Emmys",
    "url": "https://www.theguardian.com/australia-news/2025/sep/15/afternoon-update-monday-ntwnfb",
    "image": "https://media.guim.co.uk/54210835b311581104062afa75153099b262f8db/472_0_4721_3777/500.jpg",
    "summary": "A landmark report reveals that no Australian community is shielded from the increasing threats posed by climate change, which include cascading, compounding, and concurrent risks. The findings highlight the urgent need for comprehensive strategies to address these escalating challenges. The report underscores the pervasive impacts of climate change on various aspects of life in Australia.",
    "published": "2025-09-15T06:40:54Z"
  },
  {
    "title": "Fly, Wild Swans by Jung Chang review – a daughter of China speaks again",
    "url": "https://www.theguardian.com/books/2025/sep/15/fly-wild-swans-by-jung-chang-review-a-daughter-of-china-speaks-again",
    "image": "https://media.guim.co.uk/f47878a25af8c928c2844887f0dbe13b7860a93c/503_0_3540_2832/500.jpg",
    "summary": "The bestselling author explores the transformations in her homeland and reflects on the personal toll of her fame. Her latest work delves into the interplay between her identity and the evolving landscape she once knew. Through this narrative, she captures the complexities of success and its impact on her life.",
    "published": "2025-09-15T06:00:58Z"
  },
  {
    "title": "Donald Trump’s UK state visit arrives at awkward moment after Mandelson exit",
    "url": "https://www.theguardian.com/politics/2025/sep/15/donald-trump-uk-state-visit-keir-starmer-peter-mandelson",
    "image": "https://media.guim.co.uk/5232a8e0053edd183ed606377122b485e7c010be/405_263_2586_2068/500.jpg",
    "summary": "Peter Mandelson's dismissal due to his association with Jeffrey Epstein is creating controversy that may overshadow the excitement surrounding the US president's upcoming two-day visit. The news raises concerns about the implications of Mandelson's ties and its impact on the political landscape. The president's trip, initially expected to garner significant attention, now faces scrutiny against the backdrop of this scandal.",
    "published": "2025-09-15T06:00:58Z"
  }
]