[
  {
    "title": "TV tonight: a French psychological thriller about a ‘perfect’ nanny ",
    "url": "https://www.theguardian.com/tv-and-radio/2025/oct/11/tv-tonight-a-french-psychological-thriller-about-a-perfect-nanny",
    "image": "https://media.guim.co.uk/75b70946645a2458fc46ca453b652806424573c9/720_0_2400_1920/500.jpg",
    "summary": "\"The Intruder\" features an au pair whose charm may hide darker intentions. Additionally, Amanda Holden hosts a challenging new gameshow, while \"Strictly\" celebrates movie week with exciting performances. Tune in for an evening filled with suspense and entertainment!",
    "published": "2025-10-11T05:15:14Z"
  },
  {
    "title": "‘Gateway to hell’: young reporter’s harrowing two years in besieged Gaza",
    "url": "https://www.theguardian.com/world/2025/oct/11/gateway-to-hell-young-reporters-harrowing-two-years-in-besieged-gaza",
    "image": "https://media.guim.co.uk/98b3069c9324dee446acff087ad9153d3476a066/97_0_1500_1200/500.jpg",
    "summary": "Malak A Tantesh describes her harrowing experience of living in constant fear and uncertainty following the 2023 Hamas attack in Israel. The ongoing war has profoundly impacted her daily life, leading to heightened anxiety and distress. Her story highlights the profound human toll of the conflict on civilians.",
    "published": "2025-10-11T05:00:19Z"
  },
  {
    "title": "Why should you be Labour’s next deputy leader? Guardian readers quiz the candidates",
    "url": "https://www.theguardian.com/commentisfree/2025/oct/11/labour-next-deputy-leader-guardian-readers-debate-candidates",
    "image": "https://media.guim.co.uk/f18fb58e2c2ef78ea0b9d13f50db22de3c0ab58b/0_0_5000_4000/500.jpg",
    "summary": "Party members are set to vote between Bridget Phillipson and Lucy Powell as their new leaders. Both candidates have shared their perspectives on key issues such as wealth taxes, Brexit, the climate crisis, and the rise of the far right. The election will determine the direction of the party in addressing these significant challenges.",
    "published": "2025-10-11T05:00:18Z"
  },
  {
    "title": "TikTok influencers fuelling parallel market for unlicensed weight-loss drug",
    "url": "https://www.theguardian.com/money/2025/oct/11/tiktok-influencers-telegram-whatsapp-parallel-market-unlicensed-weight-loss-drug-retatrutide-uk",
    "image": "https://media.guim.co.uk/4d7e1a5d26f2332ff6910d3a1df510a5e1309894/0_0_2881_2304/500.jpg",
    "summary": "The Guardian reports on a burgeoning illegal trade for retatrutide, a drug currently in clinical trials, conducted through Telegram. Despite its experimental status, the substance is being sold online, raising concerns about safety and legality. The findings highlight the challenges posed by unregulated drug distribution on social media platforms.",
    "published": "2025-10-11T05:00:18Z"
  },
  {
    "title": "Will UK taxpayers get their £122m back from PPE Medpro?",
    "url": "https://www.theguardian.com/news/ng-interactive/2025/oct/11/michelle-mone-doug-barrowman-ppe-medpro-vip-lane-ppe-contracts-dhsc",
    "image": "https://media.guim.co.uk/b3e00debd45eb3906b161add6af4367f7fde8863/1_0_4998_4000/500.jpg",
    "summary": "The high court has ordered a company associated with Michelle Mone to pay for supplying defective gowns. However, there is currently no established method for recovering the funds. Concerns about the financial implications and accountability remain.",
    "published": "2025-10-11T05:00:18Z"
  }
]