[
  {
    "title": "Ireland v South Africa: Autumn Nations Series rugby union – live",
    "url": "https://www.theguardian.com/sport/live/2025/nov/22/ireland-v-south-africa-autumn-nations-series-rugby-union-live",
    "image": "https://media.guim.co.uk/83e0f4b9bde44af8cd60bccabe9a8a6ca1599570/97_0_2445_1956/500.jpg",
    "summary": "Andy Farrell's team faces off against South Africa in a highly anticipated match in Dublin. Daniel Gallan provides a minute-by-minute report on the game. Fans are eager to see how Ireland performs against these formidable opponents.",
    "published": "2025-11-22T18:27:03Z"
  },
  {
    "title": "Strictly Come Dancing: Blackpool special – live",
    "url": "https://www.theguardian.com/tv-and-radio/live/2025/nov/22/strictly-come-dancing-blackpool-special-live",
    "image": "https://media.guim.co.uk/f3df7174f29e3aaddf8ecb18b355f30035ba4e06/382_0_3818_3055/500.jpg",
    "summary": "The annual Tower Ballroom event features performances of popular songs by Arctic Monkeys and S Club 7. Participants will showcase their dance moves, aiming to impress viewers. Speculation surrounds who will excel and who may struggle to make an impact on the dancefloor.",
    "published": "2025-11-22T18:25:26Z"
  },
  {
    "title": "Newcastle United v Manchester City: Premier League – live",
    "url": "https://www.theguardian.com/football/live/2025/nov/22/newcastle-united-v-manchester-city-premier-league-live",
    "image": "https://media.guim.co.uk/3511e0296059848d6a60300d258c26d051c1b3b4/205_61_2055_1644/500.jpg",
    "summary": "Manchester City's match against Newcastle at St James’ Park promises to be a crucial one as they aim to reduce the points gap at the top of the table. The game will be covered with minute-by-minute updates by Scott Murray. Fans are eager to see if Guardiola's team can secure a vital win.",
    "published": "2025-11-22T18:24:43Z"
  },
  {
    "title": "Stepbrother investigated in death of Florida high schooler on cruise ship",
    "url": "https://www.theguardian.com/us-news/2025/nov/22/stepbrother-investigated-cruise-anna-kepner",
    "image": "https://media.guim.co.uk/1c2f3c20514203a5dd1aa1ca8149d31d2d2faaca/0_0_4464_3573/500.jpg",
    "summary": "Anna Kepner, an 18-year-old from Titusville, was discovered dead from asphyxiation underneath a bed on a Carnival cruise ship. Authorities are investigating the circumstances surrounding her death. The incident has drawn significant attention due to the tragic nature of the incident.",
    "published": "2025-11-22T18:04:03Z"
  },
  {
    "title": "Cop30 live: Deal agreed at Cop after long negotiations",
    "url": "https://www.theguardian.com/environment/live/2025/nov/22/cop30-climate-talks-deal-overtime-live-news",
    "image": "https://media.guim.co.uk/410e6c1216e81f2d331e156e15d1703df652b560/346_0_3449_2761/500.jpg",
    "summary": "At Cop30, after intense all-night negotiations and concerns about the summit's potential failure, a crucial agreement was successfully reached. The deal aims to address key issues related to climate change. Delegates expressed relief at the outcome, marking a significant step forward in international climate action.",
    "published": "2025-11-22T18:01:38Z"
  }
]