[
  {
    "title": "‘We’re fighting for you!’ Podcaster Ben Meiselas on taking on the Maga media – and winning the ratings battle",
    "url": "https://www.theguardian.com/tv-and-radio/2025/oct/11/podcaster-ben-meiselas-on-taking-on-the-maga-media-and-winning-the-ratings-battle",
    "image": "https://media.guim.co.uk/009a9d494e2ac56ce5b74481ddfc468b65090acf/134_0_4219_3375/500.jpg",
    "summary": "MeidasTouch, a channel producing 15 daily videos highlighting Republican shortcomings, is gaining larger audiences than Joe Rogan. This rise in viewership has sparked discussions about whether the channel represents a significant voice for the American left. Its growing popularity suggests it may be becoming a key player in political discourse.",
    "published": "2025-10-11T04:00:12Z"
  },
  {
    "title": "Three people dead after light plane crashes on take-off near Wollongong",
    "url": "https://www.theguardian.com/australia-news/2025/oct/11/three-people-dead-after-light-plane-crashes-on-take-off-near-wollongong",
    "image": "https://media.guim.co.uk/052754f211716fa6517d8c98812256d468820772/0_0_2447_1957/500.jpg",
    "summary": "An aircraft caught fire shortly after departing from Shellharbour airport around 10am on Saturday. Fire crews responded swiftly to the incident. Fortunately, there were no reported injuries.",
    "published": "2025-10-11T03:41:25Z"
  },
  {
    "title": "Folarin Balogun scores again and US improvement continues in 1-1 draw with Ecuador",
    "url": "https://www.theguardian.com/football/2025/oct/10/usmnt-ecuador-folarin-balogun-mauricio-pochettino",
    "image": "https://media.guim.co.uk/6244b4020e501517357acf26dca28720c6481eff/405_0_3333_2667/500.jpg",
    "summary": "The US has faced challenges in translating strong performances into results, yet there are growing reasons for optimism about future outcomes. Analysts highlight improvements in strategy and player development as contributing factors. Positive trends may lead to better results in upcoming competitions.",
    "published": "2025-10-11T03:13:10Z"
  },
  {
    "title": "Unease at slow pace of change in Nepal one month on from gen Z protests",
    "url": "https://www.theguardian.com/world/2025/oct/11/nepal-gen-z-protests-one-month-on-slow-change",
    "image": "https://media.guim.co.uk/2924f08f0c7cd571f34519bbfb86c37d15cfea4f/914_0_4548_3640/500.jpg",
    "summary": "Public dissatisfaction grows as promised anti-corruption measures by the government are perceived as slow and insufficient. Many citizens, who witnessed the government's rapid fall following protests, express frustration with the lack of swift action. Calls for urgent reforms intensify as expectations remain unmet.",
    "published": "2025-10-11T03:00:11Z"
  },
  {
    "title": " Rampant Las Vegas Aces complete sweep of Mercury to win third WNBA in four years",
    "url": "https://www.theguardian.com/sport/2025/oct/10/aces-win-third-wnba-title-sweep-phoenix-mercury",
    "image": "https://media.guim.co.uk/b5729f89980e942ca08e4e805208974a5f913a37/284_0_2825_2261/500.jpg",
    "summary": "A'ja Wilson led the Las Vegas Aces to a 97-86 victory over the Phoenix Mercury, scoring 31 points. This win completed a four-game sweep in the WNBA Finals. With this victory, the Aces secured their third championship in four years.",
    "published": "2025-10-11T02:41:22Z"
  }
]