[
  {
    "title": "US government shutdown: Donald Trump promises firings and cuts to ‘Democrats’ favorite projects’ if shutdown continues – live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/02/government-shutdown-trump-democrats-latest-updates",
    "image": "https://media.guim.co.uk/c3e5ae42cde3fc08bf667034b821b3fbbb11cc0d/384_0_4252_3402/500.jpg",
    "summary": "During an interview with OAN, the President stated, \"I am allowed to cut things that should have never been approved.\" This remark emphasizes his authority to reassess previously sanctioned decisions. The statement reflects his ongoing agenda to streamline government actions.",
    "published": "2025-10-02T22:12:19Z"
  },
  {
    "title": "Trump says drug cartels operating in the Caribbean are ‘unlawful combatants’",
    "url": "https://www.theguardian.com/us-news/2025/oct/02/trump-administration-caribbean-drug-cartels",
    "image": "https://media.guim.co.uk/b6e16c1c91aa3f917c815100914be1bb254c6530/418_0_4164_3333/500.jpg",
    "summary": "The President announced that the United States is currently engaged in a \"non-international conflict,\" as stated in a White House memo. This designation may imply a shift in how the U.S. characterizes its military engagements. Further details on the implications of this classification have not been disclosed.",
    "published": "2025-10-02T22:07:03Z"
  },
  {
    "title": "Australia news live: Albanese condemns ‘heinous attack’ on Manchester synagogue; hopes fade of finding four-year-old boy missing in SA",
    "url": "https://www.theguardian.com/australia-news/live/2025/oct/03/png-agreement-aukus-submarines-pact-anthony-albanese-richard-marles-retired-admiral-slams-aukus-deal-gaza-flotilla-intercepted-ntwnfb",
    "image": "https://media.guim.co.uk/3ebd7ba91872a26fd6f19dda7abbe1bbe915a73a/568_0_5652_4525/500.jpg",
    "summary": "The news coverage features real-time updates on current events across various topics. Readers are encouraged to stay informed with continuous live reporting. Key developments are highlighted as they unfold.",
    "published": "2025-10-02T22:03:38Z"
  },
  {
    "title": "Manchester synagogue attack suspect named by police after two people killed and three injured – as it happened",
    "url": "https://www.theguardian.com/uk-news/live/2025/oct/02/police-reports-stabbing-synagogue-greater-manchester-live",
    "image": "https://media.guim.co.uk/6da09441c7555ac45dc38234f002d0884a6a8a15/216_0_5000_4000/500.jpg",
    "summary": "Greater Manchester police have identified Jihad Al-Shamie, 35, a British citizen, in connection with terrorism-related activities. Authorities have arrested three individuals on charges of preparing acts of terrorism. The investigation is ongoing as law enforcement continues to address the situation.",
    "published": "2025-10-02T21:54:15Z"
  },
  {
    "title": "Israel stops 41 boats in aid flotilla with one ‘still sailing strong’",
    "url": "https://www.theguardian.com/world/2025/oct/02/israel-intercepts-aid-flotilla-but-one-ship-reported-to-have-got-through-blockade",
    "image": "https://media.guim.co.uk/5c0ec8acd5679debb7d0deb279e59ed8121d6139/285_0_1338_1071/500.jpg",
    "summary": "Activists from the Global Sumud flotilla, including Greta Thunberg, were arrested as their final boat was presumed intercepted in Palestinian waters. The flotilla aimed to raise awareness about the Israeli blockade of Gaza. The incident highlights ongoing tensions and humanitarian concerns in the region.",
    "published": "2025-10-02T21:27:29Z"
  }
]