[
  {
    "title": "Israel says it has opened ‘temporary’ route for residents to flee Gaza City after launching ground offensive – Middle East crisis live",
    "url": "https://www.theguardian.com/world/live/2025/sep/17/israel-gaza-offensive-middle-east-latest-news-updates",
    "image": "https://media.guim.co.uk/dad4acce2be5806245ac17c34832dac741e21c76/866_0_4800_3840/500.jpg",
    "summary": "The Israeli military announced that Salah al-Din street will be accessible for a limited period of 48 hours. This temporary opening is part of ongoing conflict-related measures in the region. Details about the purpose of this access have not been specified.",
    "published": "2025-09-17T08:44:23Z"
  },
  {
    "title": "Donald Trump to meet the King as protesters gather in London and Windsor – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/17/donald-trump-uk-state-visit-king-charles-windsor-politics-latest-news-updates-labour-keir-starmer",
    "image": "https://media.guim.co.uk/99d3aae4de5caec6f0614497fe2ebdf12abb486a/293_0_3867_3093/500.jpg",
    "summary": "On the first day of his state visit to the UK, the US president will participate in several events in Windsor. The day will culminate in a state banquet. This visit highlights the diplomatic ties between the two countries.",
    "published": "2025-09-17T08:43:46Z"
  },
  {
    "title": "UK overall inflation remains at 3.8% in August, but food price growth climbs for fifth month in a row - business live",
    "url": "https://www.theguardian.com/business/live/2025/sep/17/uk-inflation-steady-38-in-july-official-figures-federal-reserve-interest-rates-donald-trump-state-visit-business-live",
    "image": "https://media.guim.co.uk/8b6880f735730e03a3aeb86b794481b78d364fca/323_0_3682_2945/500.jpg",
    "summary": "Food prices have increased at their fastest rate since January 2024, driven by rising costs for vegetables, milk, cheese, and fish. The Bank of England is anticipated to maintain its current interest rates during the upcoming Thursday meeting. This inflation trend reflects ongoing economic challenges.",
    "published": "2025-09-17T08:42:53Z"
  },
  {
    "title": "German freedom ‘under threat’ says Merz as he warns against ‘dictated peace’ in Ukraine – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/sep/17/germany-friedrich-merz-bundestag-afd-ukraine-russia-finland-latvia-europe-news-live-updates",
    "image": "https://media.guim.co.uk/d77f9098011f63f5ef83342ef23e29e0f633ee4a/496_0_4958_3968/500.jpg",
    "summary": "The Bundestag engaged in a general debate on current affairs amid rising political tensions in Germany. A YouGov poll indicated that the far-right AfD party has surged to 27% support, overtaking the governing CDU, which stands at 26%. This shift reflects shifting dynamics in German politics as parties prepare for upcoming electoral challenges.",
    "published": "2025-09-17T08:29:37Z"
  },
  {
    "title": "Everything Will Swallow You by Tom Cox review – a cosy state-of-the-nation yarn",
    "url": "https://www.theguardian.com/books/2025/sep/17/everything-will-swallow-you-by-tom-cox-review-a-cosy-state-of-the-nation-yarn",
    "image": "https://media.guim.co.uk/ce05b1b9e50497ce35a5e1ded9c39ac28d9cd42a/580_938_1750_1400/500.jpg",
    "summary": "This heartwarming story weaves together themes of record collecting and magical creatures as it unfolds across England. It highlights the comfort and nostalgia found in music and personal treasures. The narrative is further enriched by the charm of a lovingly knitted cardigan, symbolizing warmth and connection.",
    "published": "2025-09-17T08:00:30Z"
  }
]