[
  {
    "title": "Nottinghamshire v Warwickshire, tributes paid to Dickie Bird, and more: county cricket – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/24/nottinghamshire-v-warwickshire-hampshire-v-surrey-and-more-county-cricket-live",
    "image": "https://media.guim.co.uk/f7c819d4564a071a70a2cdc4eb76f9843b27575e/282_0_4767_3814/500.jpg",
    "summary": "Notts is vying for the County Championship title against Surrey in the season's final round. Tanya Aldred will provide updates as the match unfolds on day one. The outcome could determine the championship winner.",
    "published": "2025-09-24T10:36:34Z"
  },
  {
    "title": "Trump says he ‘can’t believe’ Kimmel back on ABC as he hints at action against network – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/24/donald-trump-jimmy-kimmel-freedom-of-speech-immigration-government-shutdown-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/56fb6b189f6b91d884a847478837039262927599/260_0_3240_2593/500.jpg",
    "summary": "The president accuses a comedian's show of being an \"arm of the DNC\" and highlights that ABC has previously compensated the comedian millions for defamation claims. This statement reflects ongoing tensions between the administration and the entertainment industry. The remarks underline the blending of politics and media in contemporary discourse.",
    "published": "2025-09-24T10:33:22Z"
  },
  {
    "title": "Typhoon Ragasa live: deadly cyclone makes landfall in China after devastating Hong Kong, Taiwan and Philippines",
    "url": "https://www.theguardian.com/world/live/2025/sep/24/typhoon-ragasa-live-china-hong-kong-taiwan-philippines-latest-storm-news-updates",
    "image": "https://media.guim.co.uk/08e97b9bdc83bc743cba156fd6a74772f9b88251/295_0_2700_2160/500.jpg",
    "summary": "Nearly 2 million residents in Guangdong, a major industrial region in southern China, are being evacuated in anticipation of an approaching storm. Authorities are implementing safety measures to protect the population from potential impacts. The evacuation highlights the region's preparedness for severe weather events.",
    "published": "2025-09-24T10:30:39Z"
  },
  {
    "title": "‘No alternative’ to continuing invasion, claims Russia, as Trump says Ukraine could regain all land lost – latest updates",
    "url": "https://www.theguardian.com/world/live/2025/sep/24/russia-ukraine-trump-zelenskyy-unga-drones-europe-latest-news-updates",
    "image": "https://media.guim.co.uk/4e0f9c2bbeea7042b22425c5285121f37c6eac71/403_0_5000_4000/500.jpg",
    "summary": "The Kremlin reacted to President Biden's backing of Ukraine at the UN General Assembly, emphasizing that such support will not deter Russia's actions. They characterized the U.S. stance as a continuation of its anti-Russian agenda. Additionally, the Kremlin reiterated its commitment to its objectives in Ukraine despite international pressure.",
    "published": "2025-09-24T10:25:55Z"
  },
  {
    "title": "UK’s YouTube and TikTok content creators deserve more rights, say MPs",
    "url": "https://www.theguardian.com/media/2025/sep/24/uks-youtube-and-tiktok-content-creators-deserve-more-rights-say-mps",
    "image": "https://media.guim.co.uk/d8fdc8eda100db278ff4eeefc783777c579bc41f/640_0_6402_5121/500.jpg",
    "summary": "A cross-party group is working to eliminate obstacles hindering talent in various sectors, addressing issues such as challenges in obtaining mortgages and complications with filming permits. The initiative aims to create a more supportive environment for individuals and businesses. By collaborating across political lines, the group hopes to foster growth and opportunities.",
    "published": "2025-09-24T10:21:44Z"
  }
]