[
  {
    "title": "Australian politics live: Tony Abbott suggests UK put migrants in English channel ‘mothership’; free summer weekend transport in Victoria",
    "url": "https://www.theguardian.com/australia-news/live/2025/oct/08/australia-politics-live-gaza-rally-parliament-anthony-albanese-sussan-ley-question-time-andrew-hastie-ntwnfb",
    "image": "https://media.guim.co.uk/72e7e451768536ebd93cb031499e369acbe1498e/167_0_3333_2667/500.jpg",
    "summary": "The news article provides live updates on a developing story, highlighting key events and changes as they unfold. It covers various aspects of the situation, including responses from authorities and community reactions. Viewers are encouraged to stay tuned for real-time information and updates.",
    "published": "2025-10-07T22:06:34Z"
  },
  {
    "title": "Trump threat to withhold back pay from federal workers ‘deliberately violates’ law, says congressman – live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/07/donald-trump-national-guard-pam-bondi-mark-carney-government-shutdown-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/a6ab464d0f79a5f1e9fd9788ad65fa72a736bddb/649_0_6500_5203/500.jpg",
    "summary": "Maryland Congressman Jamie Raskin criticized the White House for reportedly refusing to guarantee back pay for federal workers affected by a potential government shutdown. He deemed this action illegal, emphasizing its impact on employees in his district. Raskin's stance highlights growing concerns over the rights and compensation of federal workers during fiscal uncertainties.",
    "published": "2025-10-07T22:03:26Z"
  },
  {
    "title": "A British Ice and more stop and search: Badenoch’s Tories set out new policies",
    "url": "https://www.theguardian.com/politics/2025/oct/07/badenoch-tories-new-policies-british-ice-stop-and-search",
    "image": "https://media.guim.co.uk/eabccc6d8bfaf92445c1efcc3229f0411ed62cbd/0_0_7200_5760/500.jpg",
    "summary": "Shadow ministers have unveiled a series of significant and often radical proposals aimed at addressing key issues. These initiatives encompass various sectors, including health, education, and social justice. The announcements highlight a commitment to transformative change in policy and governance.",
    "published": "2025-10-07T21:46:21Z"
  },
  {
    "title": "US delegation led by Steve Witkoff due to arrive in Egypt for Gaza talks",
    "url": "https://www.theguardian.com/us-news/2025/oct/07/us-steve-witkoff-to-arrive-egypt-gaza-talks",
    "image": "https://media.guim.co.uk/7e3c18da5046e86629959526bca561943cd1ac04/418_93_3784_3027/500.jpg",
    "summary": "The White House emphasizes the urgency of reaching a resolution as indirect negotiations resume in Sharm el-Sheikh. Officials stress the importance of quick progress in the discussions. The talks aim to address ongoing issues and enhance diplomatic relations.",
    "published": "2025-10-07T21:34:24Z"
  },
  {
    "title": "Jordan Henderson rejects ‘cheerleader’ criticism as new England chapter calls",
    "url": "https://www.theguardian.com/football/2025/oct/07/jordan-henderson-england-world-cup-qualifers-brentford",
    "image": "https://media.guim.co.uk/fc9e5b95b086b6b3f587ac891988ecc3f6b38453/325_132_2102_1681/500.jpg",
    "summary": "The midfielder reflected on his challenges following a difficult departure from Liverpool. He highlighted his leadership abilities and strong performances with Brentford as reasons for his recall by manager Thomas Tuchel. This recognition marks a new chapter in his career after overcoming past struggles.",
    "published": "2025-10-07T21:30:06Z"
  }
]