[
  {
    "title": "Starmer to face MPs amid continued pressure over collapse of China spying trial – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/oct/14/keir-starmer-china-national-security-spying-gaza-nigel-farage-uk-politics-live-news-updates",
    "image": "https://media.guim.co.uk/3bda16ed9dbaf811bc4ead66be92caa2c54670eb/683_71_3010_2408/500.jpg",
    "summary": "The Prime Minister is expected to address the Middle East situation and his recent trip to India. However, opposition MPs are anticipated to raise questions regarding allegations of government interference in the China case. This could potentially overshadow the intended focus of the statement.",
    "published": "2025-10-14T10:06:36Z"
  },
  {
    "title": "Gaza ceasefire live: Israel identifies dead hostages and says troops have fired at suspects as key truce issues remain",
    "url": "https://www.theguardian.com/world/live/2025/oct/14/gaza-ceasefire-israel-hamas-palestine-hostages-detainees-truce-live-news-updates",
    "image": "https://media.guim.co.uk/1d2326d63e69c5de35052cc318590f5fced43a6c/675_0_5000_4000/500.jpg",
    "summary": "The Defence Minister warns that delaying the return of additional bodies from northern Gaza would violate the ceasefire. This statement comes as military forces have opened fire on individuals approaching their troops in the region. Tensions remain high as the situation continues to escalate.",
    "published": "2025-10-14T10:03:43Z"
  },
  {
    "title": "Zelenskyy to meet Trump in US this week – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/oct/14/france-lecornu-macron-ukraine-russia-zelenskyy-europe-latest-news-updates",
    "image": "https://media.guim.co.uk/c9ebb1393c4c89711f762cd8429170b4f5847fc6/44_0_4733_3786/500.jpg",
    "summary": "The Ukrainian leader expressed optimism about potential advancements in peace efforts due to Trump's Gaza deal. He believes it may foster hope for resolving conflicts in other regions. This reflects a broader desire for international stability amidst ongoing challenges.",
    "published": "2025-10-14T10:03:11Z"
  },
  {
    "title": "US treasury secretary accuses Beijing of trying to damage global economy; silver hits record high – business live",
    "url": "https://www.theguardian.com/business/live/2025/oct/14/us-treasury-secretary-beijing-rare-earths-us-china-port-fees-imf-tariffs-business-live-news",
    "image": "https://media.guim.co.uk/cff322cf52c19005da82b58a1d3f3740392f6326/301_0_2500_2000/500.jpg",
    "summary": "Rolling coverage encompasses ongoing updates and analysis of the latest developments in the economic and financial sectors. It provides real-time insights into market trends, investment opportunities, and the impact of various events on the global economy. The coverage includes expert opinions, statistical reports, and reactions from key financial institutions.",
    "published": "2025-10-14T09:52:35Z"
  },
  {
    "title": "The Breakdown | South American rugby success stories propel men's World Cup qualifying",
    "url": "https://www.theguardian.com/sport/2025/oct/14/south-american-rugby-success-stories-propel-world-cup-qualifying-the-breakdown",
    "image": "https://media.guim.co.uk/c276f531dc586ef4ef72af2f4a6cfbd479097497/888_0_5000_4000/500.jpg",
    "summary": "Los Condores have reached the finals once more, generating significant interest due to various subplots leading up to the Dubai qualification tournament next month. This anticipation has created excitement around their team dynamics and challenges. Fans and analysts are eager to see how these factors will impact their performance.",
    "published": "2025-10-14T09:24:16Z"
  }
]