[
  {
    "title": "Rutte calls Russian drones incursion into Poland ‘largest concentration of violations into Nato airspace’ – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/sep/12/poland-russia-drones-ukraine-war-latest-news-europe-live",
    "image": "https://media.guim.co.uk/2bfaa88f8859cb90b156ce2f72ebab120bda5c00/197_0_2380_1904/500.jpg",
    "summary": "Dutch Prime Minister Rutte expressed strong confidence in the unwavering commitment of the United States to NATO. He conveyed satisfaction with the American response regarding NATO's security assurances. Rutte emphasized the significance of this alliance in the current global context.",
    "published": "2025-09-12T15:29:26Z"
  },
  {
    "title": "Amorim says United are ‘a better team’; Wissa, Ramsey and Delap face injury layoffs – live",
    "url": "https://www.theguardian.com/football/live/2025/sep/12/premier-league-buildup-press-conferences-team-news-live",
    "image": "https://media.guim.co.uk/0250b89bfc3530fb3d3da9dea2d24590792d753b/184_0_1373_1098/500.jpg",
    "summary": "Barry Glendenning brings you the latest updates as the Premier League resumes action after the international break. Tune in for insights and analysis on the returning matches. Stay informed on team news and player performances in the league's comeback.",
    "published": "2025-09-12T15:28:03Z"
  },
  {
    "title": "Charlie Kirk shooting latest: Utah governor confirms identity of suspect and says family friend turned him in",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/12/charlie-kirk-shooter-suspect-latest-news-updates-donald-trump-utah",
    "image": "https://media.guim.co.uk/d3bcae58f48d5dd6644ccaafc869078d83a2e10a/500_0_6590_5275/500.jpg",
    "summary": "Spencer Cox reported that Tyler Robinson, 22, informed a family friend he had shot Kirk. The FBI director confirmed that the suspect was apprehended on Thursday evening. This incident has raised significant concern in the community.",
    "published": "2025-09-12T15:26:22Z"
  },
  {
    "title": "BBC weather presenter Jay Wynne dies aged 56 after long illness",
    "url": "https://www.theguardian.com/media/2025/sep/12/bbc-weather-presenter-jay-wynne-dies-aged-56-after-long-illness",
    "image": "https://media.guim.co.uk/05ae4b79d203f774365814f0bc93663a65418ba2/99_0_686_549/500.jpg",
    "summary": "Fellow forecasters have honored Wynne, praising his talent as a musician and passion for golf. They celebrated his contributions to the forecasting community. Wynne's legacy is remembered fondly by those who knew him professionally and personally.",
    "published": "2025-09-12T15:22:18Z"
  },
  {
    "title": "Downing Street says Starmer still has ‘confidence in his top team’ after Rayner and Mandelson departures – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/12/uk-politics-latest-news-peter-mandelson-labour-keir-starmer-angela-rayner",
    "image": "https://media.guim.co.uk/3d9e657df2b5d8643a71e1a40ab54a800a554b19/0_0_5000_4000/500.jpg",
    "summary": "Scotland Secretary Douglas Alexander expressed that Members of Parliament are deeply feeling the loss of Rayner's departure. He emphasized the emotional impact this change has had on the political landscape. The sentiment reflects a broader sense of appreciation for Rayner's contributions.",
    "published": "2025-09-12T15:17:45Z"
  }
]