[
  {
    "title": "Starmer urged to apologise as MP says rioting by Maccabi Tel Aviv fans justifies their ban from Aston Villa game – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/oct/20/uk-politics-latest-news-updates-prince-andrew-covid-starmer-labour-reform-education",
    "image": "https://media.guim.co.uk/e82c26268e851cd523310fffe7cb476642b4ba3e/0_0_5000_4000/500.jpg",
    "summary": "Independent MP Ayoub Khan commented on the cancellation of the Tel Aviv football derby between Hapoel and Maccabi due to rioting. He condemned the violence, emphasizing the need for peace and unity in sports. Khan urged for measures to ensure the safety of fans and promote a calmer sporting environment.",
    "published": "2025-10-20T12:34:42Z"
  },
  {
    "title": "Zelenskyy says he would join Trump-Putin summit in Hungary if invited – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/oct/20/zelenskyy-trump-putin-russia-ukraine-war-eu-france-latest-news-updates",
    "image": "https://media.guim.co.uk/7f50f8118db3cfa760d016680c884cb41e67cac3/661_0_3373_2699/500.jpg",
    "summary": "Ukrainian President Volodymyr Zelensky criticized Budapest as the venue for a crucial meeting amid ongoing tensions. His remarks come after former President Donald Trump suggested Ukraine should relinquish territory to achieve peace with Russia. The comments have sparked further debate on the complexities of the conflict and potential solutions.",
    "published": "2025-10-20T12:33:50Z"
  },
  {
    "title": "Scramble to shore up ceasefire as Israel hits Gaza with deadly strikes | First Thing",
    "url": "https://www.theguardian.com/us-news/2025/oct/20/first-thing-scramble-to-shore-up-ceasefire-as-israel-hits-gaza-with-deadly-strikes",
    "image": "https://media.guim.co.uk/b198308420febc1a936f813e41ce168bdbb75a0a/0_518_3913_3130/500.jpg",
    "summary": "The IDF reported that an attack occurred after the killing of two soldiers, although both Israel and Hamas claim to uphold a ceasefire. Meanwhile, No Kings protesters are expressing optimism about the potential for a resistance movement against Trump. The situation remains tense, as conflicting narratives emerge from both sides.",
    "published": "2025-10-20T12:32:50Z"
  },
  {
    "title": "‘Signs of recovery’ claims Amazon Web Services after internet outage hits many websites and apps – business live",
    "url": "https://www.theguardian.com/business/live/2025/oct/20/china-economic-growth-gdp-low-house-prices-fall-stock-markets-ftse-business-live-news",
    "image": "https://media.guim.co.uk/c243af906d58094cf7e7337e109f67c64d00da26/492_0_4240_3393/500.jpg",
    "summary": "Several popular online services, including Fortnite, Roblox, Snapchat, Lloyds Bank, and Ring doorbells, experienced disruptions due to an online outage. Users reported difficulties accessing these platforms, leading to widespread frustration. The cause of the outage has not been specified yet, and service providers are working to resolve the issues.",
    "published": "2025-10-20T12:20:49Z"
  },
  {
    "title": "James Comey faces deadline to file motion to dismiss charges against him – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/20/james-comey-donald-trump-charges-shutdown-albanese-politics-live-updates",
    "image": "https://media.guim.co.uk/9dc9bfb55e918ef790a96789e954dd53a9b0e10a/352_0_3382_2707/500.jpg",
    "summary": "The former FBI director, charged with lying to Congress, is anticipated to argue that his prosecution is driven by vindictive motives. He aims to portray the legal actions against him as unjust and retaliatory. This defense strategy highlights the contentious relationship between him and certain political factions.",
    "published": "2025-10-20T12:17:25Z"
  }
]