[
  {
    "title": "Sunderland v Everton: Premier League – live",
    "url": "https://www.theguardian.com/football/live/2025/nov/03/sunderland-v-everton-premier-league-live",
    "image": "https://media.guim.co.uk/40f43a93aa0e785057c00f3cfac6ca048eca36e3/688_0_6880_5504/500.jpg",
    "summary": "Rob Smyth provides a minute-by-minute update as David Moyes makes his return to Wearside. The report includes insights and commentary on the events unfolding during the match. Stay tuned for live reactions and key moments throughout the game.",
    "published": "2025-11-03T20:22:40Z"
  },
  {
    "title": "Alonso tells Alexander-Arnold to ‘enjoy’ Liverpool return no matter how fans react",
    "url": "https://www.theguardian.com/football/2025/nov/03/xabi-alonso-trent-alexander-arnold-real-madrid-liverpool",
    "image": "https://media.guim.co.uk/e9c097f570bed92ede700b616c342d5bc2dbb05c/109_0_3020_2416/500.jpg",
    "summary": "Xabi Alonso advised Trent Alexander-Arnold to relish his upcoming match against Liverpool, marking the defender's first game against his boyhood club since leaving this summer. Alonso, the former Liverpool player, emphasized the emotional significance of the occasion. Alexander-Arnold is gearing up for a memorable return as he faces the team where he began his career.",
    "published": "2025-11-03T20:17:48Z"
  },
  {
    "title": "Australia politics live: Keating says he gave ‘fighting points’ to PM for Trump meeting in case president turned nasty",
    "url": "https://www.theguardian.com/australia-news/live/2025/nov/04/australia-politics-live-keating-trump-anthony-albanese-sussan-ley-david-littleproud-net-zero-policy-coalition-question-time-energy-policy-ntwnfb",
    "image": "https://media.guim.co.uk/ce740bc9b96a81b10f690dcec941048e3eb80a37/768_3_2791_2234/500.jpg",
    "summary": "I'm sorry, but I need more information to provide a summary. Please share the news article or its main points, and I'll be happy to help.",
    "published": "2025-11-03T20:16:10Z"
  },
  {
    "title": "Trump administration says it will partially fund Snap food aid benefits– live",
    "url": "https://www.theguardian.com/us-news/live/2025/nov/03/us-government-shutdown-donald-trump-latest-politics-news",
    "image": "https://media.guim.co.uk/c77959f8bedd35ba713f13cb326bde041092e86f/461_0_3901_3122/500.jpg",
    "summary": "The Trump administration announced in a court filing that it intends to utilize emergency funds to help cover November SNAP benefits for millions of Americans. This decision aims to address food assistance needs as the pandemic continues to impact many households. The move reflects ongoing efforts to support vulnerable populations during challenging economic times.",
    "published": "2025-11-03T20:11:30Z"
  },
  {
    "title": "Activists could be jailed for six months for protesting outside MPs’ homes",
    "url": "https://www.theguardian.com/world/2025/nov/03/activists-could-be-jailed-for-six-months-for-protesting-outside-mps-homes",
    "image": "https://media.guim.co.uk/00680f9486d15cea4e5ac1937d8ae6b3afe00398/1000_0_5000_4000/500.jpg",
    "summary": "A new law in England and Wales is set to criminalize protests outside the homes of Members of Parliament (MPs) as part of measures to address rising harassment complaints. This legislation aims to enhance the protection of lawmakers from disruptive demonstrations. The move reflects growing concerns over the safety and wellbeing of MPs amid increased public discourse and protests.",
    "published": "2025-11-03T20:10:11Z"
  }
]