[
  {
    "title": "Streeting praises health staff from overseas and says Reform UK would be ‘disaster’ for NHS – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/30/labour-conference-starmer-speech-streeting-nhs-reform",
    "image": "https://media.guim.co.uk/96b001866a425c7abb4c236f375cf9e5b819962b/307_0_6776_5421/500.jpg",
    "summary": "The Health Secretary is set to address the Labour conference, unveiling plans for an \"online hospital\" designed to reduce patient waiting times. This initiative aims to improve access to healthcare services through digital means. The proposal highlights the government's focus on modernizing and streamlining the healthcare system.",
    "published": "2025-09-30T11:15:15Z"
  },
  {
    "title": "The revolution will be in VistaVision: what are the politics of One Battle After Another?",
    "url": "https://www.theguardian.com/film/2025/sep/30/one-battle-after-another-paul-thomas-anderson",
    "image": "https://media.guim.co.uk/6096c475e9ca8d28955c3e7e2b7371ef0e9854dc/872_385_3412_2732/500.jpg",
    "summary": "Paul Thomas Anderson's latest film has sparked controversy, drawing criticism from the right while energizing the left. Its political themes are nuanced and not as straightforward as they first appear. The film invites deeper discussions about its representations and underlying messages.",
    "published": "2025-09-30T11:12:06Z"
  },
  {
    "title": "US government to shut down within hours if no funding deal agreed – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/30/us-government-shutdown-funding-trump-vance-portland-hegseth-latest-updates",
    "image": "https://media.guim.co.uk/bf2bb008bedc4d1fb7f36e8c4a2eba524b694a6e/1584_0_7920_6336/500.jpg",
    "summary": "Crunch meetings between Donald Trump and Congressional leaders did not yield any solutions, indicating a potential government shutdown. Senator JD Vance expressed concern, stating, \"I think we’re headed into a shutdown.\" The lack of agreement raises uncertainty about federal operations.",
    "published": "2025-09-30T11:01:02Z"
  },
  {
    "title": "Trump gutting protected status for immigrants will strain US healthcare, Democrats warn",
    "url": "https://www.theguardian.com/us-news/2025/sep/30/trump-temporary-protected-status-healthcare-democrats",
    "image": "https://media.guim.co.uk/2fda2ea0ec031180f17c947f590f1ef879d2e0e2/269_0_4885_3908/500.jpg",
    "summary": "Over 100 members of Congress have expressed concern that the cancellation of Temporary Protected Status (TPS) will lead to substantial staff shortages in U.S. healthcare facilities. They warn that these losses could be difficult to replace, exacerbating existing staffing challenges. The lawmakers are urging the administration to reconsider the decision to ensure adequate healthcare workforce levels.",
    "published": "2025-09-30T11:00:07Z"
  },
  {
    "title": "Sock it to the shoes: why more offices are going footwear-free",
    "url": "https://www.theguardian.com/money/2025/sep/30/sock-it-to-the-shoes-why-more-offices-are-going-footwear-free",
    "image": "https://media.guim.co.uk/638f3bc96b79b6fe53fde6c0313625734e9042c7/0_1521_4284_3427/500.jpg",
    "summary": "British companies are experimenting with no-shoes policies to enhance employee focus, comfort, and morale. However, there is skepticism among some regarding the practicality and overall effectiveness of such an initiative. The trend reflects a growing interest in alternative workplace environments.",
    "published": "2025-09-30T11:00:06Z"
  }
]