[
  {
    "title": "Premier League buildup and WSL action, Earps book revelations, Vieira sacked – matchday live ",
    "url": "https://www.theguardian.com/football/live/2025/nov/01/premier-league-buildup-earps-book-revelations-and-more-matchday-live",
    "image": "https://media.guim.co.uk/efbcbf8bf48856e53ce27b78da44149846d50fe6/421_109_2948_2358/500.jpg",
    "summary": "Join our team of writers for updates, previews, and engaging discussions as we gear up for an exciting day of events. Stay informed and connected with the latest happenings. Don't miss out on the action!",
    "published": "2025-11-01T12:30:42Z"
  },
  {
    "title": "More than 50 child asylum seekers still missing after disappearing from Kent care",
    "url": "https://www.theguardian.com/uk-news/2025/nov/01/more-than-50-child-asylum-seekers-still-missing-after-disappearing-from-kent-care",
    "image": "https://media.guim.co.uk/dd681644d19cdd4ae1f6b46ea5cd1a318d077db3/443_0_3557_2847/500.jpg",
    "summary": "Data obtained by the Guardian reveals that 345 children have gone missing in recent years, raising concerns over possible trafficking. Authorities speculate that many of these cases are linked to organized criminal activities. The findings highlight the urgent need for improved protection and monitoring measures for vulnerable children.",
    "published": "2025-11-01T12:00:35Z"
  },
  {
    "title": "West Ham are a shambles – and Nuno shows little sign of being able to fix it | Jacob Steinberg",
    "url": "https://www.theguardian.com/football/2025/nov/01/west-ham-shambles-nuno-shows-little-sign-able-to-fix-it",
    "image": "https://media.guim.co.uk/d72026cfbcc341fe724c9468dd2004c69a751a4b/235_22_1138_911/500.jpg",
    "summary": "The Hammers have secured just one point in their last four matches, raising concerns about their performance. Unusual team selections have been criticized as contributing to their struggles. Without significant improvement, the team risks being relegated to the Championship.",
    "published": "2025-11-01T12:00:34Z"
  },
  {
    "title": "DeSantis accused of playing politics as Florida shatters executions record",
    "url": "https://www.theguardian.com/us-news/2025/nov/01/florida-death-penalty-ron-desantis",
    "image": "https://media.guim.co.uk/e042fc66f30971973cd9d5da4084b9973b24b5bc/313_0_3127_2502/500.jpg",
    "summary": "The state has executed 15 individuals this year, with two more executions planned for this month. This occurs amid a broader trend of declining death penalty usage across the United States. The increasing abolition of capital punishment reflects changing attitudes and legal challenges nationwide.",
    "published": "2025-11-01T12:00:34Z"
  },
  {
    "title": "Even when unthinkable things were happening to me, my first instinct was to work. Am I addicted?",
    "url": "https://www.theguardian.com/money/2025/nov/01/workaholic-signs-am-i-addicted-to-work",
    "image": "https://media.guim.co.uk/aabcfeb16590c39b65769e948af4121486e6bf2e/270_2070_5387_4310/500.jpg",
    "summary": "After hearing the term \"workaholic\" used seriously years later, I began to reflect on my own relationship with work and questioned whether I had a problem. This realization prompted a deeper consideration of my work habits. Ultimately, it led me to reevaluate the balance between work and personal life.",
    "published": "2025-11-01T12:00:33Z"
  }
]