[
  {
    "title": "Real Betis v Nottingham Forest, Red Star Belgrade v Celtic: Europa League – live",
    "url": "https://www.theguardian.com/football/live/2025/sep/24/lincoln-chelsea-liverpool-southampton-clockwatch-carabao-cup-live",
    "image": "https://media.guim.co.uk/851a022ed33a92d80150408a629ea32973e04b0f/330_0_2931_2344/500.jpg",
    "summary": "Rob Smyth will provide updates and the latest news from the opening round of Europa League matches. Stay tuned for comprehensive coverage of the games. Get insights and highlights as the tournament kicks off.",
    "published": "2025-09-24T19:24:19Z"
  },
  {
    "title": "Officials reportedly identify Dallas Ice facility shooter after two detainees killed – live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/24/donald-trump-jimmy-kimmel-freedom-of-speech-immigration-government-shutdown-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/2a31ae3af7399a58e942cf59ad12d39e233d5ff4/575_0_4583_3667/500.jpg",
    "summary": "Joshua Jahn tragically killed two detainees and seriously injured a third before committing suicide, according to NBC News. In the wake of the incident, JD Vance has attributed the rise in political violence to Democrats. The situation underscores growing concerns over safety and political tensions.",
    "published": "2025-09-24T19:23:27Z"
  },
  {
    "title": "Port Vale v Arsenal, Huddersfield v Manchester City, and more: Carabao Cup – live",
    "url": "https://www.theguardian.com/football/live/2025/sep/24/port-vale-v-arsenal-huddersfield-v-manchester-city-and-more-carabao-cup-live",
    "image": "https://media.guim.co.uk/50b431438a08ff9bafffb24475c8720195a54947/70_0_2290_1833/500.jpg",
    "summary": "Scott Murray will provide updates on the League Cup third round action taking place on Wednesday. The coverage will include highlights and key moments from the matches. Fans can tune in for the latest developments in the tournament.",
    "published": "2025-09-24T19:22:32Z"
  },
  {
    "title": "Israeli attempt to annex West Bank would be ‘red line’ for US, says Macron",
    "url": "https://www.theguardian.com/world/2025/sep/24/israeli-attempt-to-annex-west-bank-would-be-red-line-for-us-says-macron",
    "image": "https://media.guim.co.uk/246060233506d90eba1d507e89482c070c7ad4b5/0_0_6556_5245/500.jpg",
    "summary": "French President Macron stated that former President Trump assured him that a change in U.S. leadership could lead to the end of the Abraham Accords, which normalized relations between Israel and several Arab nations. Macron expressed concern about the potential impact on Arab-Israeli relations. This highlights ongoing international apprehensions regarding future U.S. foreign policy decisions.",
    "published": "2025-09-24T19:10:27Z"
  },
  {
    "title": "Tributes to Dickie Bird as Nottinghamshire edge towards County Championship title",
    "url": "https://www.theguardian.com/sport/live/2025/sep/24/nottinghamshire-v-warwickshire-hampshire-v-surrey-and-more-county-cricket-live",
    "image": "https://media.guim.co.uk/f7c819d4564a071a70a2cdc4eb76f9843b27575e/282_0_4767_3814/500.jpg",
    "summary": "A minute’s applause took place at Headingley, honoring Bird during the first day of the final round of fixtures for the season. The tribute recognized Bird's contributions and legacy in the sport. Attendees united in remembrance, reflecting the impact he had on the community.",
    "published": "2025-09-24T19:02:48Z"
  }
]