[
  {
    "title": "Australia v New Zealand: women’s international football friendly – live",
    "url": "https://www.theguardian.com/football/live/2025/nov/28/matildas-game-australia-new-zealand-womens-international-football-friendly-live",
    "image": "https://media.guim.co.uk/51cdaa720d18aa74746e3cb90e4d41e1855f0e1c/377_0_3753_3003/500.jpg",
    "summary": "The Matildas face off against the Football Ferns in Gosford as they prepare for the upcoming Asian Cup. Jo Khan will provide minute-by-minute updates on the match. Fans can expect live coverage of this exciting encounter.",
    "published": "2025-11-28T09:20:07Z"
  },
  {
    "title": "Starmer facing Labour backlash over ‘sellout’ U-turn on employment rights bill – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/nov/28/workers-rights-bill-unfair-dismissal-uk-politics-latest-news-updates-labour-budget-keir-starmer",
    "image": "https://media.guim.co.uk/7cf9f9477f5872d5ec30b3e682d99e6c0616ad90/314_0_3858_3086/500.jpg",
    "summary": "The minister has denied claims that the reversal of the unfair dismissal policy constitutes a breach of the government's manifesto commitment. However, the decision has drawn criticism from trade unions and Labour MPs. They argue that it undermines workers' rights and contradicts prior promises.",
    "published": "2025-11-28T09:19:22Z"
  },
  {
    "title": "Ukraine’s anti-corruption authorities search properties linked to Zelenskyy’s chief of staff – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/nov/28/europe-latest-news-andriy-yermak-anti-corruption-zelenskyy-ukraine-russia-war-peace-talks-putin",
    "image": "https://media.guim.co.uk/597879bd9c804269eb6fdfb97ccc50ef89b4fafe/126_0_1621_1297/500.jpg",
    "summary": "Andriy Yermak stated that authorities have been granted full access to his apartment. He is cooperating with the officers who are present, along with his lawyers. The situation appears to be part of an official inquiry or investigation.",
    "published": "2025-11-28T09:18:12Z"
  },
  {
    "title": " ‘We have to be able to ask difficult questions’: who really took the iconic Napalm Girl photo?",
    "url": "https://www.theguardian.com/film/2025/nov/28/stringer-documentary-napalm-girl-photo",
    "image": "https://media.guim.co.uk/9985723c1be670d5667533138c1d503c1e1bdc7b/61_0_1441_1154/500.jpg",
    "summary": "A new Netflix documentary delves into the investigation surrounding the authenticity of a pivotal wartime photograph. The film highlights the controversies and debates regarding its historical significance. It aims to uncover the truth behind an image that has shaped public perception of the war.",
    "published": "2025-11-28T09:03:00Z"
  },
  {
    "title": "Labour MPs attack Starmer U-turn over workers’ rights as ‘complete betrayal’",
    "url": "https://www.theguardian.com/politics/2025/nov/28/labour-mps-attack-starmer-u-turn-over-workers-rights-as-complete-betrayal",
    "image": "https://media.guim.co.uk/b38a7fa3bd204ae1f0dc2ea89223e3fbeee14f36/156_0_3606_2885/500.jpg",
    "summary": "A former minister has criticized the government's decision to abandon plans for day-one protection against unfair dismissal, labeling it a clear violation of their manifesto commitments. The move has sparked concerns over workers' rights and job security. Critics argue that the change undermines the government's credibility.",
    "published": "2025-11-28T09:00:38Z"
  }
]