[
  {
    "title": "Keir Starmer set to announce UK recognition of Palestine later today - UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/21/keir-starmer-palestine-recognition-announcement-gaza-uk-politics-live",
    "image": "https://media.guim.co.uk/5d53a7a61bf6806de877b79414bd2b432f38b9e7/1113_89_4416_3535/500.jpg",
    "summary": "An announcement from the prime minister is anticipated later today, even as there remains significant opposition from Israeli factions. The situation highlights ongoing tensions surrounding the planned declaration. Stakeholders are keenly watching for the implications of this potential announcement.",
    "published": "2025-09-21T13:03:17Z"
  },
  {
    "title": "Bournemouth v Newcastle United: Premier League – live",
    "url": "https://www.theguardian.com/football/live/2025/sep/21/bournemouth-v-newcastle-united-premier-league-live",
    "image": "https://media.guim.co.uk/1558354b7721b9774cc4ebcd5ea4bbb0f71377cd/0_234_2757_2206/500.jpg",
    "summary": "Simon Burnton provides a live update as Newcastle United embarks on their journey to the south coast. Follow along for minute-by-minute coverage of the Magpies' developments during the trip. Stay tuned for the latest news and insights.",
    "published": "2025-09-21T13:02:04Z"
  },
  {
    "title": "What would happen if politicians actually answered the question?",
    "url": "https://www.theguardian.com/lifeandstyle/2025/sep/21/what-would-happen-if-politicians-actually-answered-the-question",
    "image": "https://media.guim.co.uk/7efa1c8645ee130588e7c7028c277585eab63ca5/3_0_4800_3840/500.jpg",
    "summary": "A popular series invites readers to respond to questions from fellow readers, covering a wide array of topics. The inquiries range from lighthearted curiosities to deep scientific and philosophical discussions. This collaborative exchange fosters a community of knowledge-sharing and diverse perspectives.",
    "published": "2025-09-21T13:01:43Z"
  },
  {
    "title": "Manchester United v Arsenal: Women’s Super League – live",
    "url": "https://www.theguardian.com/football/live/2025/sep/21/manchester-united-v-arsenal-womens-super-league-live",
    "image": "https://media.guim.co.uk/b2c1a0a2c944df1c629339d36268ace9f754c338/1153_850_5367_4294/500.jpg",
    "summary": "Emillia Hawkins is providing a minute-by-minute report on a thrilling event in Leigh, where two 100% WSL records are set to be challenged. Stay tuned for live updates as the action unfolds. Don't miss out on the excitement and potential record-breaking moments!",
    "published": "2025-09-21T13:01:06Z"
  },
  {
    "title": "Ralf Little and Will Mellor look back: ‘In our 20s, we acted like everything was a joke. Now there are fewer knob gags’",
    "url": "https://www.theguardian.com/lifeandstyle/2025/sep/21/ralf-little-and-will-mellor-look-back-actors-two-pints-lager-packet-crisps",
    "image": "https://media.guim.co.uk/3d1e0990339f97ab30d83403e4cef7a4f496b8d9/163_0_1894_1515/500.jpg",
    "summary": "The actors from \"Two Pints\" discuss the strong bond they developed during the show, emphasizing that having disagreements is essential for growth. They also share their feelings about aging and its impact on their careers. Overall, they reflect on the significance of their experiences together.",
    "published": "2025-09-21T13:00:45Z"
  }
]