[
  {
    "title": "Buildup to Chelsea v Fulham, Bayern agree Jackson loan, Newcastle sign Woltemade – matchday live",
    "url": "https://www.theguardian.com/football/live/2025/aug/30/buildup-to-chelsea-v-fulham-in-the-premier-league-transfer-latest-and-more-matchday-live",
    "image": "https://media.guim.co.uk/36ff84da35fa7135de5e4fa0c389b73ce973f8b6/0_0_5000_4000/500.jpg",
    "summary": "Emillia Hawkins is providing a rolling report with updates on a bustling afternoon of Premier League action and other news. Fans can stay tuned for the latest developments and insights. Expect continuous coverage and timely information as events unfold.",
    "published": "2025-08-30T11:22:02Z"
  },
  {
    "title": "Chelsea v Fulham: Premier League – live",
    "url": "https://www.theguardian.com/football/live/2025/aug/30/chelsea-v-fulham-premier-league-live",
    "image": "https://media.guim.co.uk/966fc296f98651205aef642159d37459c69cbee7/195_0_5000_4000/500.jpg",
    "summary": "Rob Smyth provides live updates from the west London derby taking place at Stamford Bridge. Fans can follow the match's progress minute-by-minute. Stay tuned for real-time insights and developments throughout the game.",
    "published": "2025-08-30T11:16:27Z"
  },
  {
    "title": "Ish review – Luton-set urban pastoral in which racial profiling pushes teen friends apart",
    "url": "https://www.theguardian.com/film/2025/aug/30/ish-review-luton-racial-profiling",
    "image": "https://media.guim.co.uk/d6a77b598bca1f36a854c1442ad3815e66ea7978/402_0_4027_3221/500.jpg",
    "summary": "Police scrutiny disrupts the delicate bond between two young men navigating their formative years in a Bedfordshire town. The tension highlights the challenges they face as they strive for personal growth amidst external pressures. This situation presents a poignant exploration of friendship and identity in a complex environment.",
    "published": "2025-08-30T11:16:02Z"
  },
  {
    "title": "Ukrainian lawmaker shot dead in Lviv as Zelenskyy says hunt for killer is under way – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/aug/30/russia-ukraine-war-live-news-updates-zaporizhzhia",
    "image": "https://media.guim.co.uk/898e74f9f27d48ac7290921e709fe30bcfa69078/464_554_3948_3158/500.jpg",
    "summary": "Ukrainian President announced that all available resources are being utilized in the investigation and search for the perpetrator of a recent crime. He emphasized the commitment to finding the killer. The statement reflects ongoing efforts to ensure justice and safety in Ukraine.",
    "published": "2025-08-30T11:05:52Z"
  },
  {
    "title": "Car rams into crowd outside bar in northern France, killing one",
    "url": "https://www.theguardian.com/world/2025/aug/30/car-rams-crowd-outside-bar-evreux-northern-france-death-normandy",
    "image": "https://media.guim.co.uk/3e8e60c32d539762be6e8df51d61e90136fa1061/1046_0_3733_2989/500.jpg",
    "summary": "Police in Évreux, Normandy, are investigating a violent incident at a bar involving a dispute that escalated, resulting in injuries to five people. The circumstances surrounding the altercation are currently unclear, and authorities are gathering information. The investigation aims to clarify the events and ensure community safety in the area.",
    "published": "2025-08-30T11:01:25Z"
  }
]