[
  {
    "title": "Australia politics live: Sarah Hanson-Young says Senate question time has become ‘an absolute farce’",
    "url": "https://www.theguardian.com/australia-news/live/2025/nov/03/australia-politics-live-nationals-net-zero-liberals-labor-bulk-billing-optus-sussan-ley-anthony-albanese-question-time",
    "image": "https://media.guim.co.uk/164e0486c509b83fe197cf1d8972f38d9d372427/644_0_6435_5148/500.jpg",
    "summary": "Could you please provide the news article or details you would like summarized?",
    "published": "2025-11-03T05:20:21Z"
  },
  {
    "title": "Top 10 US billionaires’ collective wealth grew by $698bn in past year – report",
    "url": "https://www.theguardian.com/us-news/2025/nov/03/wealth-billionaires-increase-trump",
    "image": "https://media.guim.co.uk/a99ef2fc663b75aec51490bafc87d1ea69e65fa1/593_0_5925_4740/500.jpg",
    "summary": "Oxfam warns that Trump's policies could significantly increase economic inequality in the U.S. The organization also criticizes Democrats for their role in exacerbating the wealth gap. Overall, Oxfam emphasizes the need for systemic changes to address rising inequality.",
    "published": "2025-11-03T05:01:22Z"
  },
  {
    "title": "UK university halted human rights research after pressure from China",
    "url": "https://www.theguardian.com/education/2025/nov/03/uk-university-halted-human-rights-research-after-pressure-from-china",
    "image": "https://media.guim.co.uk/5a8b89b4ccafa9a1ff461d353376454acfdfc45e/750_0_7200_5760/500.jpg",
    "summary": "A leading professor at Sheffield Hallam University has been instructed to stop research on supply chains and forced labor in China following pressure from authorities. The decision raises concerns about academic freedom and transparency in research. This incident highlights the challenges faced by scholars investigating sensitive topics related to human rights.",
    "published": "2025-11-03T05:00:25Z"
  },
  {
    "title": "UK’s unregulated pregnancy scan clinics putting lives in danger, say experts",
    "url": "https://www.theguardian.com/society/2025/nov/03/uks-unregulated-pregnancy-scan-clinics-putting-lives-in-danger-say-experts",
    "image": "https://media.guim.co.uk/2dac396aee8e0260690a7b534e9d305a10d4abac/98_0_4806_3845/500.jpg",
    "summary": "Hospital specialists have reported instances of overlooked health issues, incorrect diagnoses, and cases where women were mistakenly informed of their babies' deaths. These errors highlight serious gaps in patient care and communication. The revelations raise concerns about the safety and quality of healthcare services.",
    "published": "2025-11-03T05:00:25Z"
  },
  {
    "title": "Ukrainian computer game-style drone attack system goes ‘viral’",
    "url": "https://www.theguardian.com/world/2025/nov/03/ukrainian-computer-game-style-drone-attack-system-goes-viral",
    "image": "https://media.guim.co.uk/ca1301dc757f0117d2940dd3e1958b250b0ee64f/251_0_2493_1994/500.jpg",
    "summary": "A new military system awards soldiers points for successful strikes, which they can use to purchase weapons in an online store. This initiative aims to enhance performance and incentivize combat effectiveness among troops. The program has sparked discussions about the implications of gamifying warfare.",
    "published": "2025-11-03T05:00:25Z"
  }
]