[
  {
    "title": "Australia news live: two executives resign from Affinity Education Group; RBA board did not discuss future rate cuts at last meeting",
    "url": "https://www.theguardian.com/australia-news/live/2025/oct/14/australia-news-live-jim-chalmers-superannuation-concession-tax-cybercrime-anthony-albanese-sussan-ley-coalition-penny-wong-israel-gaza-ntwnfb",
    "image": "https://media.guim.co.uk/4165bf0a6c9c29d74cfeeae8f133de6c33b7914d/669_0_6689_5351/500.jpg",
    "summary": "I apologize, but I need more context or specific information about the news you would like summarized. Please provide the details or text you'd like me to summarize.",
    "published": "2025-10-14T05:16:18Z"
  },
  {
    "title": "Creative Australia awards Khaled Sabsabi $100,000 grant months after dumping from Venice Biennale",
    "url": "https://www.theguardian.com/culture/2025/oct/14/khaled-sabsabi-creative-australia-grant-venice-biennale-dumping",
    "image": "https://media.guim.co.uk/bd8ce529cd044940236e0873930e6cc685af8b71/347_0_3473_2778/500.jpg",
    "summary": "The Lebanese-Australian artist from western Sydney has found a positive aspect in a challenging year, as they secured funding for their work. This financial support offers a glimmer of hope amidst the turmoil. The funding could aid in furthering their artistic endeavors and reaching new heights.",
    "published": "2025-10-14T05:04:13Z"
  },
  {
    "title": "Parenting advice on social media is often poor quality, says Phillipson",
    "url": "https://www.theguardian.com/society/2025/oct/14/parenting-advice-on-social-media-is-often-poor-quality-says-phillipson",
    "image": "https://media.guim.co.uk/5d840dee076eb07ded975fc6b8eb4cbfc94c2f38/0_480_1810_1446/500.jpg",
    "summary": "The Education Secretary has cautioned against misinformation circulating online as the 'Best Start in Life' campaign launches. This initiative aims to promote children's early development and welfare. The secretary emphasizes the importance of accurate information to support families and communities.",
    "published": "2025-10-14T05:00:12Z"
  },
  {
    "title": "‘Your basis to live is checked at each and every step’: India’s ID system divides opinion ",
    "url": "https://www.theguardian.com/world/2025/oct/14/india-id-system-divide-opinion",
    "image": "https://media.guim.co.uk/a61baa70fbaba34c9d7eace6350b9e04c49f33f1/375_0_2883_2306/500.jpg",
    "summary": "Keir Starmer is exploring the use of India's Aadhaar system as a potential model for the UK's identification framework. Critics are concerned about the risks of \"digital coercion\" and potential security breaches associated with such a system. The proposal has sparked a debate about balancing innovation with privacy and security.",
    "published": "2025-10-14T05:00:12Z"
  },
  {
    "title": "‘Did two Brits spy for China?’ is one question. ‘Can any UK PM really stand up to China?’ is an even bigger one | Gaby Hinsliff",
    "url": "https://www.theguardian.com/commentisfree/2025/oct/14/two-brits-spy-china-keir-starmer-cash-poor-nation-superpower",
    "image": "https://media.guim.co.uk/843b6d55d7e89af1de445fe512c14674fd688cf3/250_0_2500_2000/500.jpg",
    "summary": "Keir Starmer faces the challenge of navigating economic constraints while addressing diplomatic relations with a major superpower. The article by Gaby Hinsliff highlights the dilemma of balancing national interests with international obligations. Starmer must find solutions where previous leaders have struggled.",
    "published": "2025-10-14T05:00:11Z"
  }
]