[
  {
    "title": "Australia news live: Optus CEO says ‘compulsory escalation process’ for reports of triple zero failures to be introduced",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/21/australia-news-live-anthony-albanese-donald-trump-new-york-sunday-ntwnfb",
    "image": "https://media.guim.co.uk/2a5c2347f73c4b19e0c95baad5148b8497b27ab7/768_0_5003_4003/500.jpg",
    "summary": "I apologize, but I cannot access or summarize current news as I do not have real-time capabilities. However, if you provide me with specific news content or details, I can help summarize that!",
    "published": "2025-09-21T05:32:23Z"
  },
  {
    "title": "TV tonight: an essential record of the Covid contracts scandal ",
    "url": "https://www.theguardian.com/tv-and-radio/2025/sep/21/tv-tonight-an-essential-record-of-the-covid-contracts-scandal",
    "image": "https://media.guim.co.uk/a28deb8ced9ae10381d0127e95934ca216666dc6/285_0_1350_1080/500.jpg",
    "summary": "An investigation reveals significant greed and deception in the provision of personal protective equipment (PPE). Additionally, the drama series \"Coldwater\" has taken an unexpected turn, straying from its original storyline. For those looking for evening entertainment, these are key highlights to consider.",
    "published": "2025-09-21T05:15:34Z"
  },
  {
    "title": "I moved abroad to live with my wife, but I’ve come to hate her country | Ask Annalisa Barbieri",
    "url": "https://www.theguardian.com/lifeandstyle/2025/sep/21/i-moved-abroad-to-live-with-my-wife-but-ive-come-to-hate-her-country",
    "image": "https://media.guim.co.uk/d327ed8e8b77182a31d36c5902792ef3c9e3ae07/0_0_5000_4000/500.jpg",
    "summary": "The article addresses feelings of depression stemming from enduring unhappiness. It emphasizes the importance of identifying personal desires as a means to improve one's mental state. Taking proactive steps towards achieving those desires can lead to positive change.",
    "published": "2025-09-21T05:00:35Z"
  },
  {
    "title": "‘I was terrified of dying’: how one man survived 40 hours adrift in the sea",
    "url": "https://www.theguardian.com/world/2025/sep/21/rafie-nadi-survived-40-hours-adrift-in-the-mediterranean",
    "image": "https://media.guim.co.uk/2d2e77456a13e06b0ee0d456100bae9ff4b8929c/0_136_1200_959/500.jpg",
    "summary": "Rafie Nadi, a 23-year-old, was rescued off the coast of Spain after spending nearly two days adrift with only an inflatable ring and flippers. His survival was attributed to his resourcefulness in the challenging situation. The incident highlights the dangers faced by individuals at sea.",
    "published": "2025-09-21T05:00:35Z"
  },
  {
    "title": "The US right claimed free speech was sacred – until the Charlie Kirk killing",
    "url": "https://www.theguardian.com/news/ng-interactive/2025/sep/21/us-right-free-speech-charlie-kirk",
    "image": "https://media.guim.co.uk/12ab94836ef35c89548982434a577e9fbcd20666/982_884_3022_2418/500.jpg",
    "summary": "Rightwingers who previously criticized leftwing \"cancel culture\" are now embracing the term \"consequence culture.\" This shift reflects their acknowledgment of accountability for actions and speech. The change highlights a broader cultural debate on freedom of expression and social responsibility.",
    "published": "2025-09-21T05:00:34Z"
  }
]