[
  {
    "title": "US to send envoy to Moscow to discuss proposals to end Ukraine war",
    "url": "https://www.theguardian.com/world/2025/nov/25/us-kyiv-and-moscow-officials-continue-talks-on-trump-plan-to-end-ukraine-war",
    "image": "https://media.guim.co.uk/43d37233c0645c165154f5791652e2859be54f92/358_0_4164_3333/500.jpg",
    "summary": "Recent negotiations, despite optimism from the White House and ongoing efforts, have not achieved a breakthrough on essential issues. This lack of progress raises concerns about future discussions. The situation underscores the complex dynamics at play in the negotiations.",
    "published": "2025-11-26T09:23:47Z"
  },
  {
    "title": "Ukraine war briefing: peace plan ‘fine-tuned’, Trump says, as president backs away from Thursday deadline",
    "url": "https://www.theguardian.com/world/2025/nov/26/ukraine-war-briefing-peace-plan-fine-tuned-trump-says-as-president-backs-away-from-thursday-deadline",
    "image": "https://media.guim.co.uk/0d49a02af919122aa33e47288d65d676149d8042/352_0_3391_2713/500.jpg",
    "summary": "Donald Trump announced that his strategy to end the war has been refined and he is sending envoy Steve Witkoff, potentially accompanied by Jared Kushner, to engage with Vladimir Putin. This move suggests Trump's intention to play an active role in diplomatic efforts. The development highlights ongoing efforts to address the conflict through negotiation.",
    "published": "2025-11-26T09:21:12Z"
  },
  {
    "title": "Budget 2025 live: Rachel Reeves says tax and spending changes based on ‘fair and necessary’ choices",
    "url": "https://www.theguardian.com/uk-news/live/2025/nov/26/budget-2025-rachel-reeves-tax-cash-isa-minimum-wage-latest-news-updates",
    "image": "https://media.guim.co.uk/1c1516e8a19ca7d1774b3543886c2610b76e66fa/821_269_6036_4829/500.jpg",
    "summary": "The Chancellor is set to deliver a crucial fiscal statement today at 12:30 PM, which is being characterized as a pivotal moment for the future of Keir Starmer's government. This announcement is anticipated to significantly impact the government's direction and policies. Observers are keenly awaiting the details and implications of the statement.",
    "published": "2025-11-26T09:17:16Z"
  },
  {
    "title": "Russia’s mindset has not changed since Yalta, says Von der Leyen, as EU discusses Ukraine peace plan – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/nov/26/russia-ukraine-war-peace-plan-europe-latest-news-updates",
    "image": "https://media.guim.co.uk/5e8cb749d8f50161a3d089c9b00ce1c7b01fc343/280_0_3065_2452/500.jpg",
    "summary": "The President of the European Commission stated that Russia continues to view Europe through a lens of 'spheres of influence,' reminiscent of post-World War II discussions about reorganizing the continent. This perspective highlights ongoing tensions between Russia and Europe. The comments underscore the enduring geopolitical challenges in the region.",
    "published": "2025-11-26T09:14:19Z"
  },
  {
    "title": "Pets at Home boss says ‘urgent and necessary’ action needed as profits dive",
    "url": "https://www.theguardian.com/business/2025/nov/26/pets-at-home-boss-says-urgent-and-necessary-action-needed-as-profits-dive",
    "image": "https://media.guim.co.uk/e885d8762af8966fce640e1331e5182b5e57329c/1067_0_4807_3849/500.jpg",
    "summary": "The interim chair of the group, currently in search of a new CEO, emphasizes the need for the chain to focus on its fundamental retailing principles. This strategic shift aims to revitalize the business's identity and operations. The company is actively seeking leadership to guide this transformation.",
    "published": "2025-11-26T09:01:11Z"
  }
]