[
  {
    "title": "England thrash South Africa by 10 wickets: Women’s Cricket World Cup – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/03/england-v-south-africa-womens-cricket-world-cup-live",
    "image": "https://media.guim.co.uk/7ea59400dc2fe6d4528ca3d04336555c36f6d88b/0_287_2210_1767/500.jpg",
    "summary": "Linsey Smith's outstanding performance with the new ball led to England dismissing South Africa for just 69 runs in their World Cup opener. This strong start showcased England's dominance in the match. The victory marked a confident beginning to their World Cup campaign.",
    "published": "2025-10-03T12:38:28Z"
  },
  {
    "title": "Stride dismisses suggestion Badenoch will be ousted as Tory leader next year but admits ‘it’s going to be bumpy’ – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/oct/03/greens-labour-reform-conservatives-immigration-uk-politics-live-news-updates",
    "image": "https://media.guim.co.uk/6d5fd45d6d5be18ebebed4f3238c1afcb439feba/35_37_4593_3674/500.jpg",
    "summary": "The shadow chancellor expressed support for the party leader but refrained from endorsing her assertion that Britain faces a risk of needing an IMF bailout. This indicates a division within the party regarding the severity of the economic situation. The chancellor's comments suggest a desire for unity while maintaining a more cautious stance on economic predictions.",
    "published": "2025-10-03T12:35:37Z"
  },
  {
    "title": "Forest have no plans to sack Postecoglou; Antony scathing about United treatment: football – live",
    "url": "https://www.theguardian.com/football/live/2025/oct/03/weekend-football-countdown-nottingham-forest-postecoglou-england-squad-premier-league-news-live",
    "image": "https://media.guim.co.uk/56a066237ba8e7062bfac1754f3bfa806544515b/17_0_3130_2504/500.jpg",
    "summary": "Join our writers for updates and insights on the upcoming weekend's football matches, keeping you informed on the latest developments. Stay tuned for important news and predictions as the action unfolds. Don't miss out on what's happening in the world of football!",
    "published": "2025-10-03T12:34:52Z"
  },
  {
    "title": "Mothers lose an average £65,618 in pay by the time their first child turns five",
    "url": "https://www.theguardian.com/money/2025/oct/03/mothers-lose-an-average-65618-in-pay-by-the-time-their-first-child-turns-five",
    "image": "https://media.guim.co.uk/67a56c3a775357e51268bb6b42f9e45984b072d5/520_0_5200_4160/500.jpg",
    "summary": "A study by the Office for National Statistics (ONS) reveals that women's average monthly earnings decline by 42% in the year leading up to childbirth. This significant drop highlights the financial challenges faced by women during pregnancy. The findings emphasize the need for supportive policies to address income disparities in motherhood.",
    "published": "2025-10-03T12:34:36Z"
  },
  {
    "title": "UK business growth hits five-month low amid budget uncertainty and weak demand – business live",
    "url": "https://www.theguardian.com/business/live/2025/oct/03/oil-price-weekly-fall-opec-fuel-services-sector-no-non-farm-business-live-news",
    "image": "https://media.guim.co.uk/2cf3ac9741f743b964dfd19bb7c0abebc5708749/661_0_6417_5132/500.jpg",
    "summary": "Rolling coverage provides real-time updates on the latest developments in the economy and financial markets. It includes analysis of market trends, economic indicators, and major events that impact global economies. Stay informed with continuous updates from various sectors affecting financial stability.",
    "published": "2025-10-03T12:33:33Z"
  }
]