[
  {
    "title": "Galatasaray v Liverpool: Champions League – live",
    "url": "https://www.theguardian.com/football/live/2025/sep/30/galatasaray-v-liverpool-champions-league-live",
    "image": "https://media.guim.co.uk/ef927c3d43bf9ba6a85ffcd75df0435d9ae48a26/0_0_3236_2589/500.jpg",
    "summary": "Scott Murray provides live updates from Istanbul as the Turkish champions face Arne Slot's team. The match promises excitement as both teams compete for victory. Stay tuned for minute-by-minute reports on the unfolding action.",
    "published": "2025-09-30T20:20:21Z"
  },
  {
    "title": "Trump says government shutdown likely as House Democrats call out Republicans for delaying votes before funding deadline – live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/30/us-government-shutdown-funding-trump-vance-portland-hegseth-latest-updates",
    "image": "https://media.guim.co.uk/3a7fa41ff81c50527e6b747b3ef56a5b8670e32d/263_0_3333_2667/500.jpg",
    "summary": "Government funding is set to expire at midnight ET. Republican Speaker Mike Johnson delayed the House's return to hinder further negotiations by Democrats. The move aims to maintain Republican leverage in budget discussions.",
    "published": "2025-09-30T20:19:21Z"
  },
  {
    "title": "Chelsea v Benfica, Bodø/Glimt v Tottenham, and more: Champions League – live",
    "url": "https://www.theguardian.com/football/live/2025/sep/30/chelsea-v-benfica-bodglimt-v-tottenham-and-more-champions-league-live",
    "image": "https://media.guim.co.uk/9900576bd4cd6e7022f0a196b57149656956e8b1/296_0_3137_2510/500.jpg",
    "summary": "Stay updated on a high-paced night of European and Football League matches with Yara El-Shaboury providing live coverage and insights. Follow along for the latest scores and highlights. Don't miss the excitement as the games unfold!",
    "published": "2025-09-30T20:18:33Z"
  },
  {
    "title": "Corrections and clarifications",
    "url": "https://www.theguardian.com/news/2025/sep/30/corrections-and-clarifications",
    "summary": "Menzies Campbell, a prominent Scottish politician, has recently announced his views on the future of Scottish constituencies. He emphasizes the importance of fair representation and potential changes needed to address the evolving political landscape in Scotland. Campbell's insights reflect ongoing discussions about constituency boundaries and electoral reform in the region.",
    "published": "2025-09-30T20:00:52Z"
  },
  {
    "title": "Deepti Sharma leads India rally to deny Sri Lanka in Cricket World Cup opener",
    "url": "https://www.theguardian.com/sport/2025/sep/30/womens-cricket-world-cup-india-sri-lanka-match-report",
    "image": "https://media.guim.co.uk/84fac486427755efb6b7da71a6c5cf15cc55b9ab/457_0_4504_3605/500.jpg",
    "summary": "Deepti Sharma shone with both bat and ball in India's rain-affected opening match against fellow co-hosts in Guwahati. Her performance helped secure a crucial win for the team. The match showcased India's resilience despite challenging weather conditions.",
    "published": "2025-09-30T19:44:54Z"
  }
]