[
  {
    "title": "Nobel prize in literature 2025 is announced – live",
    "url": "https://www.theguardian.com/books/live/2025/oct/09/nobel-prize-in-literature-2025-live",
    "image": "https://media.guim.co.uk/ec439e7586c80ad8f9bc949e54f45fb830aa52ee/841_0_6414_5131/500.jpg",
    "summary": "The announcement for the next winner of the Nobel Prize in Literature is taking place in Stockholm. This prestigious award recognizes outstanding contributions to the literary world. Stay tuned for updates on this significant event.",
    "published": "2025-10-09T10:19:13Z"
  },
  {
    "title": "Peter Doig: House of Music review – intoxicating paintings with a banging soundtrack",
    "url": "https://www.theguardian.com/artanddesign/2025/oct/09/peter-doig-house-of-music-review-intoxicating-paintings-with-a-banging-soundtrack",
    "image": "https://media.guim.co.uk/ea49747de21b6e59b57ec42aff9fb98832a44171/234_0_2499_2000/500.jpg",
    "summary": "The painter combines captivating landscapes with music played on vintage sound systems, creating an immersive experience. This unique blend challenges traditional distinctions between club culture and art galleries. The result is a powerful, sensory event that resonates deeply with audiences.",
    "published": "2025-10-09T10:18:42Z"
  },
  {
    "title": "Entry-level workers face ‘job-pocalypse’ as firms turn to AI; US opens investigation into Tesla FSD traffic violations – business live",
    "url": "https://www.theguardian.com/business/live/2025/oct/09/water-customers-bill-hike-winter-blackouts-risk-falls-stock-markets-pound-ftse-business-live-news",
    "image": "https://media.guim.co.uk/71e8f4e87476fe967048ac31ed7765cdc6f9a9cf/458_0_4583_3667/500.jpg",
    "summary": "A recent survey reveals that business leaders are increasingly focusing on automation via AI to address skills shortages instead of investing in training for junior employees. This shift indicates a preference for technological solutions over traditional workforce development. As a result, companies may rely more heavily on automated systems to maintain productivity and efficiency.",
    "published": "2025-10-09T10:18:20Z"
  },
  {
    "title": "Jennifer Aniston says social media ‘has taken down a huge portion of humanity’",
    "url": "https://www.theguardian.com/film/2025/oct/09/jennifer-aniston-social-media-the-morning-show",
    "image": "https://media.guim.co.uk/d73d0ddee91bcf68519a901698b0bd599f75873a/26_0_5000_4000/500.jpg",
    "summary": "The actor criticizes the increasing prevalence of unregulated slander, baseless accusations, and deepfakes that have targeted her in recent years. She highlights the damaging effects of this \"runaway train\" of misinformation. Her statement calls for more accountability and regulation to combat these issues.",
    "published": "2025-10-09T10:18:14Z"
  },
  {
    "title": "Russia attacks Ukraine’s energy and railway infrastructure in deadly overnight strikes – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/oct/09/russia-attacks-ukraine-energy-france-germany-europe-live-news-updates",
    "image": "https://media.guim.co.uk/5415c8af8b57b80fca0233089bf1980fb504252a/74_0_1918_1534/500.jpg",
    "summary": "Ukrainian President Zelenskyy has accused Russia of attempting to create chaos by repeating tactics that previously deprived millions of Ukrainians of energy and heating during winter. He highlighted the detrimental impact of these actions on the nation's stability. The situation raises concerns about the potential suffering of civilians as cold weather approaches.",
    "published": "2025-10-09T10:17:45Z"
  }
]