[
  {
    "title": "Buildup to Liverpool v Arsenal and Celtic v Rangers – matchday live",
    "url": "https://www.theguardian.com/football/live/2025/aug/31/buildup-to-liverpool-v-arsenal-and-celtic-v-rangers-matchday-live",
    "image": "https://media.guim.co.uk/b9e257357d79ff4b22c1fc79b1ce02d231f0bf38/0_0_5000_4000/500.jpg",
    "summary": "Join our writers for up-to-date news and insights as they prepare for an exciting afternoon of Premier League action. Stay tuned for reactions and analysis leading up to the matches. Don't miss out on the latest developments!",
    "published": "2025-08-31T08:33:42Z"
  },
  {
    "title": "Vladimir Putin arrives in China for security summit – Ukraine war live",
    "url": "https://www.theguardian.com/world/live/2025/aug/31/russia-ukraine-war-control-major-ukrainian-city-latest-updates-news-live",
    "image": "https://media.guim.co.uk/544de0f374aa00a9bf9f9df3cc80afaf27bdb9ee/438_0_3683_2946/500.jpg",
    "summary": "More than 20 world leaders, including Russian President Vladimir Putin and Indian Prime Minister Narendra Modi, are participating in the Shanghai Cooperation Organisation summit in Tianjin. The gathering aims to strengthen regional cooperation and address pressing global issues. Key discussions are expected to focus on security, economic collaboration, and cultural exchanges among member states.",
    "published": "2025-08-31T08:25:56Z"
  },
  {
    "title": "Neo-Nazis and politicians among protesters at anti-immigration March for Australia rallies",
    "url": "https://www.theguardian.com/australia-news/2025/aug/31/march-for-australia-neo-nazis-among-protesters-at-anti-immigration-rallies",
    "image": "https://media.guim.co.uk/a344a1e217f5a63156336dff2c2a329ac892e18d/219_0_1333_1067/500.jpg",
    "summary": "One Nation leader Pauline Hanson attended a gathering in Canberra, expressing her political views. Meanwhile, a far-right figure held a separate event outside the state parliament in Melbourne. Both events highlight ongoing tensions and discussions surrounding far-right ideologies in Australia.",
    "published": "2025-08-31T08:14:39Z"
  },
  {
    "title": "Weight loss drugs can halve heart patients’ risk of early death, study finds",
    "url": "https://www.theguardian.com/society/2025/aug/31/weight-loss-drugs-can-halve-heart-patients-risk-of-early-death-study-finds",
    "image": "https://media.guim.co.uk/35236eafafcfd1005b0ab50e95be715076b49d16/325_88_3656_2925/500.jpg",
    "summary": "GLP-1 agonists may soon be prescribed to millions of patients with heart conditions to reduce hospitalizations and enhance longevity. Research suggests these medications could significantly improve health outcomes for this population. The findings highlight the potential of GLP-1 agonists beyond diabetes management.",
    "published": "2025-08-31T08:01:19Z"
  },
  {
    "title": "‘Who would not want to dance to Boogie Wonderland?’: Alison Balsom’s honest playlist",
    "url": "https://www.theguardian.com/music/2025/aug/31/alison-balsom-honest-playlist-trumpeter-queen-dizzy-gillespie-slade",
    "image": "https://media.guim.co.uk/dfdd12a301ccf0f4a1bf0a0f29985d555fceb28b/0_186_5962_4766/500.jpg",
    "summary": "The English trumpet soloist and producer shares a light-hearted reflection on dancing to \"Boogie Wonderland\" and reveals that they are a karaoke virgin. They discuss their musical influences and experiences, highlighting a playful side to their artistic persona. Overall, the conversation blends humor with insights into their creative life.",
    "published": "2025-08-31T08:00:24Z"
  }
]