[
  {
    "title": "Australia news live: Chalmers flags terms for ‘contentious’ GST review as inflation data shows ‘we’ve got work to do’",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/24/australia-news-live-anthony-albanese-new-york-united-nations-donald-trump-climate-crisis-palestine-israel-gaza-ntwnfb",
    "image": "https://media.guim.co.uk/ce27c1330e80002af4b4cedb7b13e3f5f3b2aa56/704_0_6620_5299/500.jpg",
    "summary": "Sure, I can help with that! However, I need the content or details of the news you want summarized. Please provide the information, and I'll summarize it in three lines for you.",
    "published": "2025-09-24T02:58:18Z"
  },
  {
    "title": "Why do the children of elderly patients stay away? Loneliness makes them get sicker and stay sicker for longer | Ranjana Srivastava",
    "url": "https://www.theguardian.com/commentisfree/2025/sep/24/why-do-children-of-elderly-patients-stay-away-loneliness-makes-them-sicker-longer",
    "image": "https://media.guim.co.uk/7620272c07f7f7f989ec9efd01c109f769f6b994/456_0_4560_3648/500.jpg",
    "summary": "The essence of love is captured in the act of witnessing and supporting loved ones through the challenges of aging. This silent companionship highlights the importance of presence in navigating life's changes. Ultimately, it illustrates that true affection lies in understanding and embracing each other's journey.",
    "published": "2025-09-24T02:56:48Z"
  },
  {
    "title": "Trump’s UN speech makes it clear: the world can no longer look to the US for strong leadership",
    "url": "https://www.theguardian.com/world/2025/sep/24/trump-un-general-assembly-speech-analysis",
    "image": "https://media.guim.co.uk/04ce3d29075ea9d76e13e7a6dcd27b23befd67c6/688_0_6880_5504/500.jpg",
    "summary": "The US President's recent speech was criticized for undermining the core values of the United Nations. This has sparked discussions on the importance of forming robust alliances to counteract Trump-era policies. Many are calling for a united front among nations to uphold international standards and cooperation.",
    "published": "2025-09-24T02:30:12Z"
  },
  {
    "title": "New statue on National Mall celebrates ‘long-lasting bond’ between Trump and Epstein",
    "url": "https://www.theguardian.com/us-news/2025/sep/23/national-mall-trump-epstein-statue",
    "image": "https://media.guim.co.uk/682a27f716af0fdf995ac0881190d8c40f32e50f/578_0_5588_4472/500.jpg",
    "summary": "A bronze statue created by an anonymous artist depicts two men joyfully frolicking and holding hands, with one foot kicked back in exuberance. The artwork celebrates love and companionship. Its origin remains a mystery, adding to its intrigue.",
    "published": "2025-09-24T02:01:05Z"
  },
  {
    "title": "Zelenskyy tells UN Putin is ‘trying everything’ to prolong Ukraine war; Trump says Nato can shoot down Russian aircraft – as it happened",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/23/donald-trump-unga-autism-tylenol-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/5bb83f1c449680ff2671e68d0bc21104a4fd40f6/552_1747_4952_3960/500.jpg",
    "summary": "The live blog has concluded, wrapping up coverage on the topic at hand. Updates and real-time information provided throughout the event or issue are no longer being posted. Readers may refer to earlier entries for a summary of developments.",
    "published": "2025-09-24T01:59:42Z"
  }
]