[
  {
    "title": "Tory plans to scrap Climate Change Act condemned as ‘economic disaster’ – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/oct/02/reform-uk-zia-yusuf-keir-starmer-nigel-farage-immigration-asylum-labour-climate-change-uk-politics-live",
    "image": "https://media.guim.co.uk/8d5580732613185c2cf1a410494dc70d67c8f37f/70_0_4840_3872/500.jpg",
    "summary": "Labour, the Liberal Democrats, and the Green Party have criticized Kemi Badenoch's promise to repeal a key act if the Conservatives regain power. Ed Miliband described her statement as a \"betrayal of future generations.\" The opposition parties argue that such a move would hinder progress on crucial issues.",
    "published": "2025-10-02T10:18:49Z"
  },
  {
    "title": "Manchester synagogue attack latest: suspect shot after four people injured in vehicle and stabbing attack at synagogue, police say",
    "url": "https://www.theguardian.com/uk-news/live/2025/oct/02/police-reports-stabbing-synagogue-greater-manchester-live",
    "image": "https://media.guim.co.uk/40de6fd5fe5b752185ffd7fe1d6c669765e54205/626_0_4752_3802/500.jpg",
    "summary": "Andy Burnham, the mayor of Greater Manchester, has advised residents to steer clear of Crumpsall following a reported 'serious incident.' Details about the incident remain unclear, but authorities are urging caution. The situation is ongoing, and updates are expected as more information becomes available.",
    "published": "2025-10-02T10:18:26Z"
  },
  {
    "title": "Gaza aid flotilla: more than a dozen vessels intercepted by Israeli forces; Greta Thunberg arrested – live",
    "url": "https://www.theguardian.com/world/live/2025/oct/01/israel-gaza-aid-global-sumud-flotilla-middle-east-crisis-latest-updates",
    "image": "https://media.guim.co.uk/1dc8eff7cd550ab162294c9a1525393e9bf0e162/107_0_705_564/500.jpg",
    "summary": "The Israeli foreign ministry shared a video of Greta Thunberg's arrest while participating in a protest. Approximately 500 activists were intercepted by Israeli vessels around 75 miles off the coast of the conflict-affected region. The incident highlights ongoing tensions as activists seek to raise awareness.",
    "published": "2025-10-02T10:17:43Z"
  },
  {
    "title": "Ghost of Yōtei review – a brutal and stunningly beautiful samurai revenge quest",
    "url": "https://www.theguardian.com/games/2025/oct/02/ghost-of-yotei-review-deliciously-brutal-and-stunningly-beautiful-revenge-quest",
    "image": "https://media.guim.co.uk/325c231e6ed67e86abe077cbdea85ac0c09933d8/94_0_2700_2160/500.jpg",
    "summary": "The sequel to Ghost of Tsushima focuses on a young protagonist driven by a desire for revenge. It explores themes of violence and honor as the character embarks on a quest for retribution. Players can expect a deeper narrative and intense action in this follow-up.",
    "published": "2025-10-02T10:16:32Z"
  },
  {
    "title": "Tesco predicts price war before Christmas amid ‘pressure on household budgets’",
    "url": "https://www.theguardian.com/business/2025/oct/02/tesco-warns-price-battle-christmas-pressure-household-budgets",
    "image": "https://media.guim.co.uk/911a5d9131b4b260ebbcd3da3b653e721389a4f1/823_529_4034_3230/500.jpg",
    "summary": "A retailer has increased its full-year profit forecast by £100 million, thanks to successful summer promotions that attracted more shoppers. The strategy of implementing price cuts proved effective in boosting sales. This positive adjustment reflects strong market response and consumer spending trends.",
    "published": "2025-10-02T10:16:19Z"
  }
]