[
  {
    "title": "West Ham v Brentford: Premier League – live",
    "url": "https://www.theguardian.com/football/live/2025/oct/20/west-ham-v-brentford-premier-league-live",
    "image": "https://media.guim.co.uk/be4db298206d67cef06a5d02a8ab726e2748d936/1626_941_2740_2193/500.jpg",
    "summary": "In a minute-by-minute report, hosts are aiming for their first home points of the season in a derby match against an east London rival. Niall McVeigh provides coverage of the event. Fans are eager to see how the local teams perform in this highly anticipated matchup.",
    "published": "2025-10-20T20:21:58Z"
  },
  {
    "title": "Australia news live: Cash calls on PM to condemn Chinese jet incident; Barnaby Joyce quizzed on One Nation move",
    "url": "https://www.theguardian.com/australia-news/live/2025/oct/21/australia-news-live-michaelia-cash-china-jet-raaf-prime-minister-anthony-albanese-donald-trump-white-house-critical-minerals-deal-ntwnfb",
    "image": "https://media.guim.co.uk/b7c5ef1d2bf28c4bc03d7a0c3aa2077ef17b55e8/289_0_5922_4738/500.jpg",
    "summary": "Please provide the news you would like summarized, and I'll be happy to help!",
    "published": "2025-10-20T20:21:40Z"
  },
  {
    "title": "Comey asks judge to dismiss criminal charges claiming selective prosecution",
    "url": "https://www.theguardian.com/us-news/2025/oct/20/james-comey-charge-dismissal-request",
    "image": "https://media.guim.co.uk/d84331ed81a66d5b4481303820261c111634b412/115_0_4561_3648/500.jpg",
    "summary": "Former FBI Director claims he is being targeted by selective prosecution, suggesting that the charges against him were brought forth by an unlawfully appointed attorney. He asserts that the legal actions are politically motivated. The situation raises questions about the legitimacy of the charges and the attorney's appointment.",
    "published": "2025-10-20T20:17:47Z"
  },
  {
    "title": "Construction appears to start on Trump’s $250m White House ballroom",
    "url": "https://www.theguardian.com/us-news/2025/oct/20/trump-white-house-ballroom-construction",
    "image": "https://media.guim.co.uk/e5b6a6235ee4678aad234dfd7b14e4cea67aab08/697_0_6347_5076/500.jpg",
    "summary": "Demolition work has begun in the East Wing of the White House, marking one of the largest renovation projects in over a century. This extensive project aims to update and improve the historic structure. The renovations are part of ongoing efforts to modernize the White House while preserving its historical significance.",
    "published": "2025-10-20T20:15:45Z"
  },
  {
    "title": "Amazon says Web Services are recovering after outage hits millions of users – business live",
    "url": "https://www.theguardian.com/business/live/2025/oct/20/china-economic-growth-gdp-low-house-prices-fall-stock-markets-ftse-business-live-news",
    "image": "https://media.guim.co.uk/ad093e8329a29aecba6f1623b63fcffeb49c4113/368_0_3879_3106/500.jpg",
    "summary": "A widespread online outage affected several popular services, including Fortnite, Roblox, Snapchat, Lloyds Bank, Ring doorbells, and Amazon's shopping site. Users experienced disruptions and inaccessibility across these platforms. The cause of the outage has yet to be determined.",
    "published": "2025-10-20T20:12:25Z"
  }
]