[
  {
    "title": "Russian attack on Kyiv cuts power to half of city and leaves two dead",
    "url": "https://www.theguardian.com/world/2025/nov/29/deadly-russian-attack-on-kyiv-cuts-power-to-half-of-city",
    "image": "https://media.guim.co.uk/b0a0c69ecd7d852f2aec1c4fa73b11675f1abcab/458_0_4583_3667/500.jpg",
    "summary": "Moscow is intensifying its assaults on Ukraine with missile and drone strikes targeting the energy grid. These attacks aim to undermine Ukrainian civil resistance during the ongoing conflict. The strategy seeks to weaken morale and disrupt daily life in Ukraine.",
    "published": "2025-11-29T13:24:10Z"
  },
  {
    "title": "Israel has ‘de facto state policy’ of organised torture, says UN report",
    "url": "https://www.theguardian.com/world/2025/nov/29/israel-has-de-facto-state-policy-of-organised-torture-says-un-report",
    "image": "https://media.guim.co.uk/e0759345736aea73f9adfcec1a5c7405966d5b5a/0_0_6250_5000/500.jpg",
    "summary": "A committee has revealed serious allegations involving dog attacks and sexual violence, raising alarms about the lack of accountability for war crimes. These claims point to a troubling culture of impunity surrounding such violations. The report underscores the urgent need for justice and reform in addressing these issues.",
    "published": "2025-11-29T13:18:04Z"
  },
  {
    "title": "Manchester City v Leeds, Sunderland v Bournemouth, and more – Premier League live",
    "url": "https://www.theguardian.com/football/live/2025/nov/29/football-manchester-city-v-leeds-sunderland-v-bournemouth-and-more-premier-league-live",
    "image": "https://media.guim.co.uk/03f6899d83144909dda880c1c5f5b80359b8e4ca/313_0_4690_3751/500.jpg",
    "summary": "Barry Glendenning will provide live updates on Saturday's afternoon football matches. Fans can tune in for real-time scores and key moments. Stay informed about all the action as it unfolds.",
    "published": "2025-11-29T13:17:48Z"
  },
  {
    "title": "Manchester City look to bounce back, EFL updates – as it happened",
    "url": "https://www.theguardian.com/football/live/2025/nov/29/manchester-city-look-to-bounce-back-in-premier-league-lionesses-in-action-matchday-live",
    "image": "https://media.guim.co.uk/1e361a820adc107e1f7d636768c365202e00b00d/0_0_3757_3005/500.jpg",
    "summary": "Liverpool and Manchester City aimed to recover from recent setbacks in their respective matches. Meanwhile, Leicester City continued to struggle in the Championship, facing ongoing difficulties. These developments highlight the contrasting fortunes of the teams in the league.",
    "published": "2025-11-29T13:15:44Z"
  },
  {
    "title": "Impasse over EHRC single-sex spaces guidance ‘distracting from other issues’",
    "url": "https://www.theguardian.com/world/2025/nov/29/ehrc-guidance-single-sex-spaces",
    "image": "https://media.guim.co.uk/761ea077a76d633196bd419d2739b8c2d7660c2e/530_0_4560_3648/500.jpg",
    "summary": "Staff at a human rights organization have expressed frustration over the lack of action following a court's legal definition of a woman, leading to calls for \"regime change\" within the organization. They are reportedly feeling helpless and desperate for more proactive measures. The situation highlights ongoing tensions over the handling of gender issues and organizational response.",
    "published": "2025-11-29T13:00:39Z"
  }
]