[
  {
    "title": "UK private sector growth hits four-month low as JLR production shutdown hits manufacturing – business live",
    "url": "https://www.theguardian.com/business/live/2025/sep/23/gold-price-on-track-best-year-since-1979-record-high-global-economy-uk-growth-business-live-news",
    "image": "https://media.guim.co.uk/bfd843445e219422226741ab9c2f957671f7ef15/560_0_5600_4480/500.jpg",
    "summary": "Gold prices have soared to $3,759 per ounce amid economic uncertainty. Meanwhile, Jaguar Land Rover is still grappling with operational disruptions due to a recent cyber-attack. The dual situations reflect broader financial and cybersecurity challenges in the market.",
    "published": "2025-09-23T09:33:54Z"
  },
  {
    "title": "‘Don’t pay any attention to what Trump says about medicine’, Wes Streeting tells Britons – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/23/lib-dem-ed-davey-conference-donald-trump-keir-starmer-labour-reform-tory-latest-politics-live-news-updates",
    "image": "https://media.guim.co.uk/25e0913ad4c81562d1691a358106709674775546/246_0_3960_3168/500.jpg",
    "summary": "Medical experts express concern after the US president advised pregnant women to refrain from using Tylenol, a recommendation contradictory to existing research. The warning has raised alarms about potential confusion surrounding safe medication use during pregnancy. Experts argue that the established safety profile of acetaminophen (Tylenol) during pregnancy should not be undermined.",
    "published": "2025-09-23T09:33:07Z"
  },
  {
    "title": "Trump to address UN general assembly as Israeli attacks on Gaza City continue – Middle East crisis live",
    "url": "https://www.theguardian.com/world/live/2025/sep/23/gaza-israel-palestinian-state-recognition-donald-trump-un-unga-latest-news-live-updates",
    "image": "https://media.guim.co.uk/0a53750903b79f83688de3607e10debccbe459d7/211_0_4680_3744/500.jpg",
    "summary": "The US president is set to address the UN General Assembly in New York. This comes after several countries, including the UK, France, Belgium, Canada, Australia, and Portugal, officially recognized a Palestinian state. The speech is expected to address the evolving geopolitical landscape and the implications of this recognition.",
    "published": "2025-09-23T09:32:19Z"
  },
  {
    "title": "The Breakdown | No place for ‘old school’ rugby values as PREM rebrand aims to turn heads",
    "url": "https://www.theguardian.com/sport/2025/sep/23/prem-rugby-rebrand-rugby-union-the-breakdown",
    "image": "https://media.guim.co.uk/d8d2e547f52ab3fcabcf0a4e5849814faefa1ff8/805_0_2813_2250/500.jpg",
    "summary": "The English top flight is intensifying efforts to capture a younger audience, potentially reshaping the traditional football landscape. As part of this strategy, the concept of relegation may be reconsidered or eliminated. This shift suggests a transformative approach to maintaining viewer engagement and financial stability in the league.",
    "published": "2025-09-23T09:22:19Z"
  },
  {
    "title": "What does ‘Boriswave’ mean and what is its political significance?",
    "url": "https://www.theguardian.com/politics/2025/sep/23/what-does-boriswave-mean-nigel-farage-reform-uk-immigration",
    "image": "https://media.guim.co.uk/8903ec54d7200b8e282ac219071a1808844d93d9/510_270_2716_2173/500.jpg",
    "summary": "Nigel Farage's recent usage of terms popularized by the \"extremely online right\" highlights the growing influence of online discourse on mainstream politics. This trend reflects how language and ideas proliferating in digital spaces are shaping political narratives. As a result, traditional political dialogue is increasingly intertwined with internet culture.",
    "published": "2025-09-23T09:16:08Z"
  }
]