[
  {
    "title": "Pam Hogg obituary",
    "url": "https://www.theguardian.com/fashion/2025/nov/26/pam-hogg-fashion-designer-obituary",
    "image": "https://media.guim.co.uk/6f95b1766ca2c1c90f974325080beb2ac4bfc8f2/0_216_3712_2970/500.jpg",
    "summary": "Fashion designer known for her vibrant contributions to the 1980s London club scene has passed away. She was celebrated for her creative designs worn by stars like Rihanna, Björk, and Kylie Minogue. Along with her distinctive style, she was renowned as a vibrant personality in the fashion world, famously calling herself a \"100% party girl.\"",
    "published": "2025-11-26T19:15:54Z"
  },
  {
    "title": "Arsenal v Bayern Munich: Champions League – live",
    "url": "https://www.theguardian.com/football/live/2025/nov/26/arsenal-v-bayern-munich-champions-league-live",
    "image": "https://media.guim.co.uk/98bb497db48b9fb37d3802f346afbcb0a7419ac6/2_0_6276_5022/500.jpg",
    "summary": "The Premier League leaders face off against the Bundesliga leaders in a highly anticipated match. Michael Butler provides a minute-by-minute report on the game's developments. Fans can stay updated with the latest action and insights.",
    "published": "2025-11-26T19:13:19Z"
  },
  {
    "title": "The Guardian view on Labour’s budget: real gains for children and struggling families are a welcome shift | Editorial",
    "url": "https://www.theguardian.com/commentisfree/2025/nov/26/the-guardian-view-on-labours-budget-real-gains-for-children-and-struggling-families-are-a-welcome-shift",
    "image": "https://media.guim.co.uk/12215e4772b0f2b3f69ab70bac7f69ff91c4da9b/978_0_6880_5504/500.jpg",
    "summary": "Rachel Reeves's recent statements aim to alleviate the cost of living crisis while signaling a commitment to stimulate economic growth and safeguard public services. Her interventions reflect a proactive approach to addressing pressing financial challenges. This strategy emphasizes balancing immediate relief with long-term economic sustainability.",
    "published": "2025-11-26T19:12:55Z"
  },
  {
    "title": "Bamboo scaffolding may be to blame for spread of Hong Kong tower block fire",
    "url": "https://www.theguardian.com/world/2025/nov/26/bamboo-scaffolding-may-be-to-blame-for-spread-of-hong-kong-tower-block-fire",
    "image": "https://media.guim.co.uk/e128610f73710814a8fa1994933d2fe452d12571/1362_0_6830_5464/500.jpg",
    "summary": "Hong Kong remains one of the few places globally where bamboo is extensively utilized by construction workers. This traditional material is favored for its versatility and sustainability. As urban development continues, the use of bamboo in construction showcases a blend of cultural heritage and modern practices.",
    "published": "2025-11-26T19:12:03Z"
  },
  {
    "title": "The Guardian view on the peers lobbying scandal: Lords reform is a vital step for restoring trust in democracy | Editorial",
    "url": "https://www.theguardian.com/commentisfree/2025/nov/26/the-guardian-view-on-the-peers-lobbying-scandal-lords-reform-is-a-vital-step-for-restoring-trust-in-democracy",
    "image": "https://media.guim.co.uk/3ddfe7577a6647b25821d4f7b573a154bd1cb981/229_0_3729_2984/500.jpg",
    "summary": "The editorial highlights the mixed contributions of appointed members in the second chamber of parliament, but emphasizes the need for reform. It labels the current system as outdated and in need of modernization. Addressing these issues is crucial for improving the effectiveness of the parliamentary process.",
    "published": "2025-11-26T19:11:37Z"
  }
]