[
  {
    "title": "Ryder Cup 2025: USA 5-12 Europe as hosts rally in singles finale – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/28/ryder-cup-2025-usa-europe-golf-singles-matches-live",
    "image": "https://media.guim.co.uk/d06cd986ba77d5add5ba2f1d77eb9f0150ca75f2/0_0_7200_5760/500.jpg",
    "summary": "Scott Murray provides live updates on the ongoing singles matches, where the US team is making a strong push for a comeback. Follow along for hole-by-hole coverage as the competition unfolds. Stay tuned for the latest highlights and developments.",
    "published": "2025-09-28T19:09:29Z"
  },
  {
    "title": "‘They don’t want to get hammered’: how gen Z found a taste for wine",
    "url": "https://www.theguardian.com/food/2025/sep/28/gen-z-wine",
    "image": "https://media.guim.co.uk/b5ad649956bcdf40c99820d538fc91e969ee4873/680_0_4680_3744/500.jpg",
    "summary": "Young consumers are seeking beverage options that are enjoyable, casual, and suitable for social gatherings. They prefer bottles that enhance the fun of socializing rather than overly strong drinks. This trend reflects a shift towards lighter, more approachable alcoholic beverages.",
    "published": "2025-09-28T19:00:19Z"
  },
  {
    "title": "Andy Burnham says ‘climate of fear’ in Labour is shutting down debate",
    "url": "https://www.theguardian.com/politics/2025/sep/28/andy-burnham-climate-of-fear-labour-shutting-down-debate",
    "image": "https://media.guim.co.uk/73cb5e293c32f9acd002a13d7aa48c7072ed66a1/500_394_3652_2922/500.jpg",
    "summary": "The Greater Manchester mayor has urged for reforms within the Labour Party, expressing ongoing criticism of its leadership under Keir Starmer during a fringe event at the conference. He emphasized the need for a shift to better represent the interests of constituents. The remarks reflect a growing concern about the party's direction and effectiveness.",
    "published": "2025-09-28T18:50:45Z"
  },
  {
    "title": "Starmer decries Reform’s ‘racist’ plans as ministers escalate attacks on Farage",
    "url": "https://www.theguardian.com/politics/2025/sep/28/starmer-decries-reforms-racist-plans-as-ministers-escalate-attacks-on-farage",
    "image": "https://media.guim.co.uk/db09ccbcdc7513a1ea236ec7ec11fa6d93a867bd/500_0_4411_3531/500.jpg",
    "summary": "Prime Minister warns that proposed immigration policies could lead to division within the country. His remarks come as Labour delegates convene for the opening day of their party conference. The tension highlights ongoing debates surrounding immigration reform in the UK.",
    "published": "2025-09-28T18:49:41Z"
  },
  {
    "title": "‘We’ve won for women’s sport’: England sing in the rain to celebrate World Cup success",
    "url": "https://www.theguardian.com/sport/2025/sep/28/england-women-rugby-world-cup-final-celebrations",
    "image": "https://media.guim.co.uk/cc11fc6826286cc8963a3230f6c4db7f25518d84/194_0_2761_2208/500.jpg",
    "summary": "Thousands of England fans celebrated the Red Roses' victory at the Women's Rugby World Cup, showcasing the excitement and joy surrounding the event. The triumph highlighted the growing popularity and support for women's rugby. The euphoric atmosphere reflected the team's significant achievement on the international stage.",
    "published": "2025-09-28T18:37:43Z"
  }
]