[
  {
    "title": "Israel launches ground offensive in Gaza City with residents warned to evacuate - latest updates",
    "url": "https://www.theguardian.com/world/live/2025/sep/16/israel-gaza-war-israels-defence-minister-says-gaza-is-burning-amid-escalation-in-bombardment-latest-updates",
    "image": "https://media.guim.co.uk/f8ba7b6cdf02607277083877e1731416dd9768e6/724_0_6074_4859/500.jpg",
    "summary": "The IDF has announced the initiation of operations to dismantle Hamas's infrastructure in Gaza City. Residents have been warned that staying in the area poses a danger to their safety. The military efforts are part of a broader campaign against terrorist activities in the region.",
    "published": "2025-09-16T08:47:33Z"
  },
  {
    "title": "Starmer to chair cabinet meeting as tensions grow after resignation of top aide — UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/16/starmer-cabinet-resignation-paul-ovenden-news-updates-uk-politics-live",
    "image": "https://media.guim.co.uk/da3f1a3039dc966d042c79e27e7d450820603876/686_0_4917_3933/500.jpg",
    "summary": "Labour MPs are discussing the possibility of replacing Prime Minister as a recent poll reveals only 26% of Labour members view him favorably as party leader. This low approval rating has prompted internal conversations about potential leadership changes. The situation reflects growing concerns about the party's direction and future leadership stability.",
    "published": "2025-09-16T08:46:07Z"
  },
  {
    "title": "Zelenskyy says 3,500 drones launched at Ukraine this month as he calls for Trump to take ‘clear position’ on Russia — Europe live",
    "url": "https://www.theguardian.com/world/live/2025/sep/16/zelenskyy-trump-sanctions-russia-news-updates-europe-live",
    "image": "https://media.guim.co.uk/aa0799c01bbc1a4db48b445f52600b836fbb63fc/467_0_6194_4955/500.jpg",
    "summary": "Ukrainian President emphasized the need for sanctions and security guarantees as critical elements for achieving peace. This statement comes ahead of former President Trump's upcoming state visit to the UK. The call for these measures highlights the ongoing challenges faced in the Ukraine conflict.",
    "published": "2025-09-16T08:42:20Z"
  },
  {
    "title": "State pension on course for inflation-busting 4.7% rise under triple lock; JLR production shutdown extended until next week – business live",
    "url": "https://www.theguardian.com/business/live/2025/sep/16/uk-wage-growth-slows-jobs-market-cools-business-live-news-updates",
    "image": "https://media.guim.co.uk/574b4285f5b7bdd0171d4edd87c7307ebcfc5623/332_0_2336_1868/500.jpg",
    "summary": "Analysts predict that pensioners will celebrate a significant increase in the state pension starting in April next year. This adjustment is expected to outpace inflation, providing financial relief for retirees. The news comes as a welcome development for those relying on state benefits.",
    "published": "2025-09-16T08:31:13Z"
  },
  {
    "title": "Wong says Netanyahu government ‘more isolated than ever’ – as it happened",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/16/australia-news-live-sydney-airport-social-media-ban-anthony-albanese-chris-bowen-climate-crisis-carbon-emissions-png-treaty-ntwnfb",
    "image": "https://media.guim.co.uk/a846efa35aa33f8fa191d054c04f5089731c4ec5/531_0_5695_4556/500.jpg",
    "summary": "The blog has officially ceased operations and will no longer be updated. All previously published content is still accessible for readers. Thank you to all who engaged with the blog during its run.",
    "published": "2025-09-16T08:15:24Z"
  }
]