[
  {
    "title": "Starmer urged to apologise as MP says rioting by Maccabi Tel Aviv fans justifies their ban from Aston Villa game – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/oct/20/uk-politics-latest-news-updates-prince-andrew-covid-starmer-labour-reform-education",
    "image": "https://media.guim.co.uk/e82c26268e851cd523310fffe7cb476642b4ba3e/0_0_5000_4000/500.jpg",
    "summary": "Independent MP Ayoub Khan addressed the cancellation of the Tel Aviv football derby between Hapoel and Maccabi due to rioting. He emphasized the need for dialogue and understanding amidst rising tensions. Khan's remarks highlight the ongoing challenges in promoting peace in the region.",
    "published": "2025-10-20T10:24:54Z"
  },
  {
    "title": "James Comey faces deadline to file motion to dismiss charges against him – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/20/james-comey-donald-trump-charges-shutdown-albanese-politics-live-updates",
    "image": "https://media.guim.co.uk/9dc9bfb55e918ef790a96789e954dd53a9b0e10a/352_0_3382_2707/500.jpg",
    "summary": "Former FBI Director James Comey has been charged with lying to Congress and is expected to argue that the prosecution is driven by vindictiveness. His defense will likely assert that the charges stem from political motivation rather than genuine misconduct. The case highlights ongoing tensions surrounding allegations of misconduct within federal law enforcement.",
    "published": "2025-10-20T10:23:46Z"
  },
  {
    "title": "‘Signs of recovery’ claims Amazon Web Services after internet outage hits many websites and apps – business live",
    "url": "https://www.theguardian.com/business/live/2025/oct/20/china-economic-growth-gdp-low-house-prices-fall-stock-markets-ftse-business-live-news",
    "image": "https://media.guim.co.uk/c243af906d58094cf7e7337e109f67c64d00da26/492_0_4240_3393/500.jpg",
    "summary": "A widespread online outage affected several popular services, including Fortnite, Roblox, SnapChat, Lloyds Bank, and Ring doorbells. Users experienced disruptions and difficulties accessing these platforms. The cause of the outage has yet to be determined.",
    "published": "2025-10-20T10:23:46Z"
  },
  {
    "title": "Gaza ceasefire live: Trump’s envoys arrive in Israel amid scramble to shore up fragile truce – Middle East crisis live",
    "url": "https://www.theguardian.com/world/live/2025/oct/20/gaza-ceasefire-israel-hamas-palestine-hostages-middle-east-crisis-live-news-updates",
    "image": "https://media.guim.co.uk/4d421cd7593d209915c3d8bfb3af4dffd31e91bc/602_0_4560_3648/500.jpg",
    "summary": "US envoy Steve Witkoff and Jared Kushner, former President Trump's son-in-law, are set to meet with members of Israeli Prime Minister Benjamin Netanyahu's government. The meeting aims to discuss bilateral relations and regional developments. This engagement underscores the ongoing collaboration between the US and Israel.",
    "published": "2025-10-20T10:22:16Z"
  },
  {
    "title": "Rashid and Salt star as England thrash New Zealand in second men’s T20 – as it happened",
    "url": "https://www.theguardian.com/sport/live/2025/oct/20/new-zealand-v-england-second-mens-t20-international-live",
    "image": "https://media.guim.co.uk/07c628b1e2b4f6ccf317f0f13e124f229b5358f8/511_0_4164_3333/500.jpg",
    "summary": "In Christchurch, England dominated the match with a powerful batting performance, scoring 236 for 4. This strong total led to a convincing 65-run victory over their opponents. The match showcased England's offensive prowess and solidified their dominance.",
    "published": "2025-10-20T10:21:17Z"
  }
]