[
  {
    "title": "Australia politics live: David Littleproud criticises Barnaby Joyce’s defection saying Nationals supported him through ‘his darkest moments’",
    "url": "https://www.theguardian.com/australia-news/live/2025/nov/27/australia-politics-live-barnaby-joyce-one-nation-pauline-hanson-environment-nature-bill-deal-coalition-greens-murray-watt-question-time-anthony-albanese-sussan-ley-ntwnfb",
    "image": "https://media.guim.co.uk/3bd0e805608404c9b24944f004518ffd4b86e82f/649_0_6485_5188/500.jpg",
    "summary": "I'm sorry, but I need more context or details about the news you're referring to in order to provide an appropriate summary. Please provide the news content or key points you want summarized.",
    "published": "2025-11-27T05:20:18Z"
  },
  {
    "title": "National Guard shooting: Trump says US should ‘re-examine’ all Afghan refugees after suspect named",
    "url": "https://www.theguardian.com/us-news/2025/nov/26/washington-national-guard-shooting-suspect",
    "image": "https://media.guim.co.uk/2ce80957b600b5c5a72215bbd5454cafd2647c33/274_0_2732_2187/500.jpg",
    "summary": "President condemns the shooting in Washington as an \"act of terror,\" expressing concern over the incident. Authorities have identified Rahmanullah Lakanwal as the suspected shooter. The investigation is ongoing as officials assess the implications of the attack.",
    "published": "2025-11-27T05:12:48Z"
  },
  {
    "title": "Hong Kong fire live updates: rescue crews search apartment blocks for survivors; dozens killed and hundreds missing after blaze – latest",
    "url": "https://www.theguardian.com/world/live/2025/nov/27/hong-kong-fire-arrests-dead-killed-hundreds-missing-housing-complex-blaze",
    "image": "https://media.guim.co.uk/cfe6885eb8e18815f333c6e53cc6426c77efff4b/620_0_5000_4000/500.jpg",
    "summary": "Please provide the news content you'd like summarized.",
    "published": "2025-11-27T05:07:32Z"
  },
  {
    "title": "Seven ways Australia’s nature laws are changing after Labor’s deal with the Greens",
    "url": "https://www.theguardian.com/australia-news/2025/nov/27/australia-nature-laws-labor-greens-deal-environment-protection-biodiversity-conservation-act",
    "image": "https://media.guim.co.uk/4ad052a7f6e89f5a34bbc003465595b32bc601ef/1054_176_5697_4556/500.jpg",
    "summary": "The proposed legislation to reform the Environment Protection and Biodiversity Conservation (EPBC) Act includes significant changes aimed at improving environmental protection and streamlining processes. Key alterations focus on enhancing the assessment of environmental impacts and increasing Indigenous engagement in decision-making. These reforms are part of a broader effort to address ongoing environmental concerns and promote sustainability.",
    "published": "2025-11-27T05:01:16Z"
  },
  {
    "title": "St Vincent prime minister seeks record sixth term in tight election",
    "url": "https://www.theguardian.com/world/2025/nov/27/st-vincent-prime-minister-seeks-record-sixth-term-in-tight-election",
    "image": "https://media.guim.co.uk/c33a800f9398b7636edc1a41f6c56f331fd710e5/251_0_2510_2008/500.jpg",
    "summary": "Ralph Gonsalves is campaigning to retain his position as Prime Minister of St. Vincent and the Grenadines, a role he has held since 2001. He is focusing on his economic record as a key aspect of his campaign. Gonsalves aims to highlight his achievements to secure voter support in the upcoming election.",
    "published": "2025-11-27T05:00:19Z"
  }
]