[
  {
    "title": "Japan and Switzerland’s economies contract as exports are hit by US tariffs; Alphabet shares jump after Warren Buffett reveals stake – business live",
    "url": "https://www.theguardian.com/business/live/2025/nov/17/japan-economy-contracts-exports-us-tariffs-trade-war-ftse-stock-markets-business-live-news",
    "image": "https://media.guim.co.uk/110fa6852c2e76d690e4f0fad2c2c02b9c473381/142_0_4200_3360/500.jpg",
    "summary": "The latest economic and financial news features ongoing updates on market trends, interest rates, and inflation impacts. Analysts are evaluating shifts in consumer confidence and corporate earnings reports. Overall, there's a focus on navigating economic uncertainty amid global developments.",
    "published": "2025-11-17T15:21:36Z"
  },
  {
    "title": "Labour accused of ‘performative cruelty’ over asylum plans – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/nov/17/immigration-asylum-keir-starmer-labour-shabana-mahmood-uk-politics-live-news-updates",
    "image": "https://media.guim.co.uk/bf1f5f4be931e6f1dce483b9823ac4886b334795/461_0_1350_1080/500.jpg",
    "summary": "The SNP and Plaid Cymru criticize the UK government for advancing proposals that they believe support Nigel Farage's agenda by significantly tightening regulations. They argue that these measures threaten democratic values and undermine political discourse. The parties assert that the government's actions prioritize Farage's interests over the needs of the public.",
    "published": "2025-11-17T15:19:50Z"
  },
  {
    "title": "Share a tip on a favourite European travel discovery of 2025",
    "url": "https://www.theguardian.com/travel/2025/nov/17/share-a-tip-on-a-favourite-european-travel-discovery-of-2025",
    "image": "https://media.guim.co.uk/75650edab24afef670fd8c362895248d1abfd1ae/610_0_6141_4912/500.jpg",
    "summary": "A contest is inviting individuals to share their favorite discoveries of the year, with the chance to win a £200 voucher for a Coolstays getaway. Participants are encouraged to submit their tips, highlighting unique experiences or hidden gems. The best submission will be awarded the prize, promoting exploration and adventure.",
    "published": "2025-11-17T15:18:58Z"
  },
  {
    "title": "Foreign state services behind Polish rail sabotage, says minister – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/nov/17/ukraine-russia-france-poland-zelenskyy-macron-eu-europe-news-latest-updates",
    "image": "https://media.guim.co.uk/9e22fdcf80e2da35fccff603abae2e7409f7e7a8/142_0_1066_853/500.jpg",
    "summary": "Security services minister Tomasz Siemoniak has stated that a recent explosion was not caused by criminals engaged in metal theft. He emphasized that the investigation is ongoing to uncover the true nature of the incident. Authorities continue to assess the situation and ensure public safety.",
    "published": "2025-11-17T15:17:42Z"
  },
  {
    "title": "Cop30: calls for new urgency to talks as studies show global warming may reach 2.5C – latest updates",
    "url": "https://www.theguardian.com/environment/live/2025/nov/17/cop30-belem-brazil-global-warming-latest-news-updates",
    "image": "https://media.guim.co.uk/327e6fba7b2548a2ca7bdb3f0dfa1f1eb50f4236/427_0_4272_3417/500.jpg",
    "summary": "As the summit enters its second week, participants face ongoing complex issues that have yet to be resolved. There is increasing anxiety about the potential outcomes of the conference. Stakeholders are eager for significant progress to be made.",
    "published": "2025-11-17T15:16:19Z"
  }
]