[
  {
    "title": "England v Sri Lanka: Women’s Cricket World Cup – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/11/england-v-sri-lanka-womens-cricket-world-cup-live",
    "image": "https://media.guim.co.uk/e4766ee7de94d6314404609bb2649532160638c2/210_0_6127_4902/500.jpg",
    "summary": "Nat Sciver-Brunt's team is currently competing against Sri Lanka in a live match. Writers are providing an ongoing over-by-over report for fans following the game. Stay tuned for updates on the match's progress.",
    "published": "2025-10-11T09:12:42Z"
  },
  {
    "title": "Trump says ‘for the most part, there is consensus’ on next stages of Gaza ceasefire plan – live",
    "url": "https://www.theguardian.com/world/live/2025/oct/11/israel-gaza-ceasefire-hamas-hostages-netanyahu-trump-middle-east-latest-news-updates",
    "image": "https://media.guim.co.uk/427d10da50f878783a74c19da746f351f08fe8e7/834_0_4416_3535/500.jpg",
    "summary": "The US President stated that Hamas is currently gathering hostages amid the ongoing conflict. Meanwhile, displaced Palestinians are returning to northern Gaza as the situation evolves. These developments highlight the complex humanitarian and security challenges in the region.",
    "published": "2025-10-11T09:02:36Z"
  },
  {
    "title": "‘Verging on unwatchable’: Guardian writers on their most stressful movies",
    "url": "https://www.theguardian.com/film/2025/oct/11/most-stressful-movies",
    "image": "https://media.guim.co.uk/c1a906c75cc8842c5b92daea7af38817d0f7bb85/372_0_3543_2835/500.jpg",
    "summary": "The US release of Rose Byrne's film \"If I Had Legs I’d Kick You\" explores the anxieties of motherhood. In response, writers share their experiences of the most unsettling movies they've watched. The film aims to evoke relatable discomfort through its portrayal of maternal struggles.",
    "published": "2025-10-11T09:01:18Z"
  },
  {
    "title": "Don’t fall for the authoritarian hype – Reform and the hard right can be stopped in their tracks | Gordon Brown",
    "url": "https://www.theguardian.com/commentisfree/2025/oct/11/reform-nigel-farage-hard-right-politics-gordon-brown-labour",
    "image": "https://media.guim.co.uk/47f88d36ac4c240f8bd0bb64e9786d1fd1839191/1122_0_6436_5151/500.jpg",
    "summary": "Former Prime Minister Gordon Brown warns that grievances are being manipulated for political gain across the US, Europe, and Asia. He emphasizes that despite this trend, moderate voices continue to resonate with the majority of people. Brown advocates for unity and a focus on collaboration to counteract divisive politics.",
    "published": "2025-10-11T09:00:20Z"
  },
  {
    "title": "From getting kids to eat veg to curbing screen time: the parenting hacks that actually work",
    "url": "https://www.theguardian.com/lifeandstyle/ng-interactive/2025/oct/11/getting-kids-eat-veg-curbing-screen-time-parenting-hacks-that-actually-work",
    "image": "https://media.guim.co.uk/d02d1b4d3dcc0059968f13479d1cd096d1204dc9/0_1390_6758_5407/500.jpg",
    "summary": "Parents face common challenges like toddlers refusing to brush their teeth, teenagers not responding to messages, and recurring sibling disputes. In response, readers and experts offer practical solutions and strategies to tackle these parenting dilemmas. The shared advice aims to help families manage everyday frustrations effectively.",
    "published": "2025-10-11T09:00:18Z"
  }
]