[
  {
    "title": "Transfer deadline day: Isak, Guéhi, Jackson and Wissa deals agreed, and more – live",
    "url": "https://www.theguardian.com/football/live/2025/sep/01/transfer-deadline-day-guehi-wissa-martinez-ederson-latest-and-more-live",
    "image": "https://media.guim.co.uk/9132e30aed156f2798142751fdb02989f6435a1c/1393_54_3870_3096/500.jpg",
    "summary": "Will Magee will provide ongoing updates and analysis on the significant trades and developments expected on this busy deadline day. Stay tuned for real-time coverage of key moves in the sports world. Don't miss any exciting news as it unfolds!",
    "published": "2025-09-01T15:31:37Z"
  },
  {
    "title": "Downing Street shake-up: who’s in and who’s out at No 10",
    "url": "https://www.theguardian.com/politics/2025/sep/01/downing-street-shake-up-whos-in-and-whos-out-at-no-10",
    "image": "https://media.guim.co.uk/b7d50e0f2219c0df606316d13afa34f1dcc2bd43/364_0_3638_2910/500.jpg",
    "summary": "The Prime Minister is making personnel changes with anticipated departures and new hires, aiming for enhanced direct control over the implementation of essential government priorities. This strategic move is designed to streamline operations and improve accountability. Ultimately, the PM seeks to ensure more effective delivery of key initiatives.",
    "published": "2025-09-01T15:31:14Z"
  },
  {
    "title": "Home secretary suspends refugee family reunion applications until new, tighter rules are put in place – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/01/women-children-home-office-refugee-family-reunions-uk-politics-live-latest-updates-news",
    "image": "https://media.guim.co.uk/3ee18b90e03550120005d83bf16f70a29e34f1f2/214_0_3452_2761/500.jpg",
    "summary": "Yvette Cooper highlights that existing rules intended to assist families separated by war are now being misapplied. She emphasizes the need to address this change in usage to better support those affected. The comments raise concerns about how policies evolve and may impact families in crisis.",
    "published": "2025-09-01T15:30:22Z"
  },
  {
    "title": "‘Coalition of willing’ to discuss security guarantees for Ukraine in meeting on Thursday – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/sep/01/volodymyr-zelenskyy-ukraine-donald-trump-semi-deadline-war-end-europe-latest-updates-news-live",
    "image": "https://media.guim.co.uk/6f57d86e1fc76dcc5cd4b710aa3d3889da4b0246/1331_0_6656_5325/500.jpg",
    "summary": "A meeting co-chaired by French President Emmanuel Macron and UK leader Keir Starmer is set to address Russia's ongoing refusal to end its war. The discussions aim to formulate strategies to respond to Russia's actions. This gathering highlights the continued commitment of European leaders to seek resolution and support for affected regions.",
    "published": "2025-09-01T15:30:13Z"
  },
  {
    "title": "Boy, 11, shot dead after playing doorbell-ringing prank in Houston, police say",
    "url": "https://www.theguardian.com/us-news/2025/sep/01/houston-boy-shot-doorbell-ringing-prank",
    "image": "https://media.guim.co.uk/cefaf5df99536726fc111c329dd6cf6d627806bc/720_0_7200_5760/500.jpg",
    "summary": "A boy was attacked multiple times while playing \"ding-dong ditch,\" a game where participants ring doorbells and flee. The incident highlights concerns about safety and the potential dangers associated with such pranks. Authorities are investigating the situation to ensure the well-being of those involved.",
    "published": "2025-09-01T15:28:00Z"
  }
]