[
  {
    "title": "Australia news live: two Sydney hospital employees critical after car mounts footpath and strikes them outside entrance",
    "url": "https://www.theguardian.com/australia-news/live/2025/nov/05/australia-politics-live-nauru-deportations-labor-greens-coalition-anthony-albanese-sussan-ley-nationals-leadership-net-zero-question-time-ntwnfb",
    "image": "https://media.guim.co.uk/ba410198753b8cd8bfdda5d5ca56ad82605b57fb/0_182_6555_5247/500.jpg",
    "summary": "I apologize, but I cannot access live news or specific articles. If you provide me with the details or main points of the news, I can help summarize it for you!",
    "published": "2025-11-05T06:25:35Z"
  },
  {
    "title": "Return of Chinese astronauts delayed after spacecraft struck by debris",
    "url": "https://www.theguardian.com/world/2025/nov/05/chinese-astronauts-delayed-spacecraft-struck-by-debris-tiangong-space-station-shenzhou-20",
    "image": "https://media.guim.co.uk/8b45be74e14cb99a1198e7a2e6d9e4834d21cb25/192_0_3686_2948/500.jpg",
    "summary": "The three astronauts from the Shenzhou-20 mission, who flew to the Tiangong space station in April, are scheduled to return on Wednesday. Their mission is part of China's ongoing efforts in space exploration. The return marks another step in the development of the Tiangong space station.",
    "published": "2025-11-05T06:25:17Z"
  },
  {
    "title": "TV tonight: Ashley Jensen is back solving murders in Shetland ",
    "url": "https://www.theguardian.com/tv-and-radio/2025/nov/05/tv-tonight-ashley-jensen-is-back-solving-murders-in-shetland",
    "image": "https://media.guim.co.uk/32e2518f8eb4df0fac097da03880e964be094252/90_0_3818_3055/500.jpg",
    "summary": "DI Ruth Calder is on the case of a murdered retired social worker. Additionally, viewers can tune in to the series finale of the scandal drama \"The Hack.\" Check out the evening's highlights for a mix of crime and drama.",
    "published": "2025-11-05T06:20:17Z"
  },
  {
    "title": "‘Time for a new era’: hope swells at Mamdani party as New Yorkers celebrate",
    "url": "https://www.theguardian.com/us-news/2025/nov/05/zohran-mamdani-election-night-party",
    "image": "https://media.guim.co.uk/c6a579908e0432614ef7eb79d6e9e6fb17043cc7/539_0_5602_4480/500.jpg",
    "summary": "Supporters and prominent New York Democrats celebrated in Brooklyn the election of the city's first Muslim mayor. The event marked a historic milestone for the city and its diverse community. The atmosphere was filled with excitement and pride as attendees acknowledged this significant achievement.",
    "published": "2025-11-05T06:16:20Z"
  },
  {
    "title": "New York mayor-elect Zohran Mamdani challenges Donald Trump in victory speech as Democrats win key US election races – live",
    "url": "https://www.theguardian.com/us-news/live/2025/nov/04/nyc-mayor-election-zohran-mamdani-andrew-cuomo-results-latest",
    "image": "https://media.guim.co.uk/a8a175efb88ab9a3e3fab71c8a0ee2e6bf4486ed/349_0_2972_2379/500.jpg",
    "summary": "Mamdani criticized \"oligarchy and authoritarianism\" in a speech that directly addressed Trump, highlighting concerns over political power dynamics. The comments came as Democrats celebrated victories in California's redistricting vote and the gubernatorial elections in New Jersey and Virginia. These wins are seen as significant for the party's efforts to strengthen their political influence.",
    "published": "2025-11-05T06:15:37Z"
  }
]