[
  {
    "title": "Arsenal v Manchester City buildup, Rome derby and WSL action – matchday live",
    "url": "https://www.theguardian.com/football/live/2025/sep/21/arsenal-v-manchester-city-buildup-rome-derby-and-wsl-action-matchday-live",
    "image": "https://media.guim.co.uk/6ed0e6c3245ac8d0e3151f2e5bf90bc39b7743ad/0_0_5000_4000/500.jpg",
    "summary": "Writers are gearing up for an exciting day of football, anticipating thrilling matches. They will provide insights and coverage of the day’s events. Fans can expect engaging commentary and analysis as the action unfolds.",
    "published": "2025-09-21T07:18:57Z"
  },
  {
    "title": "Mouldy plates, burning pans, clouds of vape smoke: how to survive the horrors of the shared kitchen",
    "url": "https://www.theguardian.com/lifeandstyle/2025/sep/21/mouldy-plates-burning-pans-vape-smoke-how-to-survive-horrors-shared-kitchen",
    "image": "https://media.guim.co.uk/eb24786b7d53dc501d7d612daf4aabcb0bad07d6/0_0_5000_4000/500.jpg",
    "summary": "Navigating communal kitchens can be unpredictable for university students, regardless of their experience. Tips are provided for maintaining cleanliness and safety while cooking and eating. The focus is on achieving a balance between convenience and hygiene in shared living spaces.",
    "published": "2025-09-21T07:15:35Z"
  },
  {
    "title": "Chris Wilder finds out Sheffield United’s chaos has no quick fix",
    "url": "https://www.theguardian.com/football/2025/sep/21/chris-wilder-sheffield-united-charlton-championship",
    "image": "https://media.guim.co.uk/f8f5d6fd254c65aad173a068d0db1814e28745ba/343_0_3678_2943/500.jpg",
    "summary": "The manager makes a comeback three months after being dismissed, coinciding with a gloomy atmosphere. Charlton secures a victory, leaving with three points. The weather reflects the somber mood surrounding the manager's return.",
    "published": "2025-09-21T07:00:37Z"
  },
  {
    "title": "From disco to Slayer, a DJ set by Optimo’s JD Twitch made life feel full of wild possibility",
    "url": "https://www.theguardian.com/music/2025/sep/21/from-disco-to-slayer-a-dj-set-by-optimos-jd-twitch-made-life-feel-full-of-wild-possibility",
    "image": "https://media.guim.co.uk/10f73f937aa999a2475db55090e101f5aa8fc396/0_0_4187_3349/500.jpg",
    "summary": "Scottish DJ, who recently passed away at 57, was known for blending genres like techno, punk, and funk. His innovative approach helped bridge gaps between various underground music factions. He left a lasting impact on the music scene through his fearless unification of diverse styles.",
    "published": "2025-09-21T07:00:37Z"
  },
  {
    "title": "Let’s stop asking why women aren’t having children and ask, for once: why aren’t men? | Rhiannon Lucy Coslett",
    "url": "https://www.theguardian.com/commentisfree/2025/sep/21/women-children-men-housing-mental-health",
    "image": "https://media.guim.co.uk/7a808175d9bea3e0e870a119e4964a6b2894e5cd/314_0_3748_3000/500.jpg",
    "summary": "Many men, like women, desire to have children. However, various challenges such as housing affordability and mental health concerns are hindering their ability to start families. Rhiannon Lucy Cosslett discusses these barriers in her commentary.",
    "published": "2025-09-21T07:00:36Z"
  }
]