[
  {
    "title": "Australia news live: Albanese heads to Vanuatu to sign $500m deal aimed at countering Chinese influence",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/09/australia-news-live-anthony-albanese-vanuatu-china-pacific-forum-murray-watt-nature-protection-laws-ntwnfb",
    "image": "https://media.guim.co.uk/65ea352c0bb4266fd492c0f443aad6d53032bf96/688_0_6880_5504/500.jpg",
    "summary": "I'm sorry, but I need more context or content to provide a summary. Could you please provide the details of the news you want summarized?",
    "published": "2025-09-08T21:28:53Z"
  },
  {
    "title": "House Democrats share alleged Trump ‘birthday note’ to Jeffrey Epstein – live updates",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/08/donald-trump-immigration-hyundai-tariffs-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/e4821a6fe4cda117c0d83c16e8ec877227f429fc/386_1736_1801_1441/500.jpg",
    "summary": "Democrats on the House Oversight Committee have released a scanned copy of a note from an album celebrating Jeffrey Epstein's 50th birthday. The note was part of a compilation of messages from various individuals. This release sheds light on Epstein's connections leading up to the controversial figure’s downfall.",
    "published": "2025-09-08T21:21:08Z"
  },
  {
    "title": "Task review – Mark Ruffalo’s druggy kidnap drama is so bleak it’s downright manipulative",
    "url": "https://www.theguardian.com/tv-and-radio/2025/sep/08/task-review-mark-ruffalo-druggy-kidnap-drama-is-so-bleak-its-downright-manipulative",
    "image": "https://media.guim.co.uk/973a2f41f6be6d6d679fcde51ec1dacc338bb7fc/500_0_5000_4000/500.jpg",
    "summary": "The latest production from the creators of Mare of Easttown includes intense elements like bloody shootouts and fentanyl, initially promising excitement. However, it quickly devolves into monotony and fails to maintain viewer engagement. Overall, it is critiqued as a lackluster attempt at storytelling.",
    "published": "2025-09-08T21:15:05Z"
  },
  {
    "title": "Unprecedented strike shows racing unified to send pre-budget message to Labour over betting duty crisis",
    "url": "https://www.theguardian.com/sport/2025/sep/08/unprecedented-strike-shows-racing-unified-to-send-pre-budget-message-to-labour-over-betting-duty-crisis",
    "image": "https://media.guim.co.uk/373f443b86158205c8d5d353f4c3a07fd1413e28/742_0_3429_2744/500.jpg",
    "summary": "A rare blank day in the racing calendar has underscored concerns over the potential impact of standardized betting and gaming taxes. Industry experts warn that harmonization could threaten the financial viability of horse racing. The absence of racing events on this day serves as a stark reminder of these challenges.",
    "published": "2025-09-08T21:09:44Z"
  },
  {
    "title": "Belarus 0-2 Scotland: World Cup 2026 qualifying Group C – live reaction",
    "url": "https://www.theguardian.com/football/live/2025/sep/08/belarus-v-scotland-world-cup-2026-qualifying-group-c-live",
    "image": "https://media.guim.co.uk/67f004b52f92c4bca8b8b67352a1892906487bc1/565_391_4012_3211/500.jpg",
    "summary": "Scotland secured their first win in the qualification stage with a match that featured an opening goal from Che Adams. The victory was further solidified by an own goal from the opposing team. Steve Clarke's side showcased a strong performance in this crucial match.",
    "published": "2025-09-08T21:02:36Z"
  }
]