[
  {
    "title": "Bondi Junction stabbings: ‘10 seconds warning’ from security could have saved lives, inquest hears",
    "url": "https://www.theguardian.com/australia-news/2025/nov/28/bondi-junction-stabbings-joel-cauchi-inquest-drug-use",
    "image": "https://media.guim.co.uk/b025ffd01554aaa377dd576a2d149e5d26b91074/0_0_5000_4000/500.jpg",
    "summary": "Families of victims expressed anger towards Scentre Group and Glad security for not acknowledging that the control room operator lacked the competence required for her role on that day. They believe this failure contributed to the tragic events. The families demand accountability for the situation.",
    "published": "2025-11-28T06:25:44Z"
  },
  {
    "title": "TV tonight: abandoned dogs seek loving homes in a heartwarming festive special ",
    "url": "https://www.theguardian.com/tv-and-radio/2025/nov/28/tv-tonight-abandoned-dogs-seek-loving-homes-in-a-heartwarming-festive-special",
    "image": "https://media.guim.co.uk/537bbfe18fbd4ce2d196cde6846c342a6362db59/364_0_5160_4128/500.jpg",
    "summary": "Luna the labradoodle and Chico the bulldog are looking for permanent homes and not just temporary placements. Additionally, there's a brewing controversy surrounding trippy tea in the show \"Return to Paradise.\" Don’t miss these highlights in your evening watchlist.",
    "published": "2025-11-28T06:20:00Z"
  },
  {
    "title": "Barnaby Joyce’s exit from the Nationals ‘almost a Greek tragedy’, Michael McCormack says – as it happened",
    "url": "https://www.theguardian.com/australia-news/live/2025/nov/28/australia-news-live-storms-hail-queensland-environment-laws-anthony-albanese-labor-greens-sussan-ley-coalition-ntwnfb",
    "image": "https://media.guim.co.uk/55f16543879b238a301feba730b9971db2395894/1113_561_6033_4827/500.jpg",
    "summary": "The blog has officially ceased operations and is no longer active. All content and updates will no longer be published. Readers are thanked for their support during its run.",
    "published": "2025-11-28T06:13:53Z"
  },
  {
    "title": "Rescue operations at Hong Kong apartment complex ‘almost complete’, as death toll reaches 94",
    "url": "https://www.theguardian.com/news/2025/nov/28/hong-kong-apartment-fire-response-rescue-operations-death-toll",
    "image": "https://media.guim.co.uk/520b8905279ac27d743c239461d00a769a9b7c9c/681_0_3747_2999/500.jpg",
    "summary": "Officials announced that the fires, which burned for over 24 hours, were mostly contained by Friday morning. The response teams worked diligently to manage the situation. No major damage reports were provided at the time of the announcement.",
    "published": "2025-11-28T06:06:43Z"
  },
  {
    "title": "Afternoon Update: police sergeant found guilty of causing Indigenous teen’s death; an interview with Sussan Ley; and a Peruvian mystery solved",
    "url": "https://www.theguardian.com/australia-news/2025/nov/28/afternoon-update-friday-ntwnfb",
    "image": "https://media.guim.co.uk/72a9b044d1b26fba70c92f95edcef5876f33ca49/184_0_3586_2869/500.jpg",
    "summary": "A boy's father expresses optimism that the upcoming verdict will improve relations between police and First Nations communities. Meanwhile, authorities are investigating a daylight shooting in suburban Sydney that resulted in one man's death. The incidents highlight ongoing issues surrounding community safety and police interactions.",
    "published": "2025-11-28T06:01:39Z"
  }
]