[
  {
    "title": "KFC’s bánh mì has its name but not its nature. Who is this sandwich for?",
    "url": "https://www.theguardian.com/food/2025/nov/29/kfc-banh-mi-fried-chicken-sandwich-review-crunch-taste",
    "image": "https://media.guim.co.uk/19ee4a4c2835ad186337c450e47d1e0a6b710ecd/0_1273_2268_1813/500.jpg",
    "summary": "The author reflects on their deep appreciation for bánh mì, having enjoyed it in various meaningful settings. However, their experience with the sandwich from a multinational food chain has left them disappointed. Consequently, they express that this will likely be their first and last bánh mì from such a chain.",
    "published": "2025-11-28T23:00:22Z"
  },
  {
    "title": "Don’t want waste this Christmas? How to give green and sustainable gifts",
    "url": "https://www.theguardian.com/australia-news/2025/nov/29/sustainable-christmas-green-gift-guide-giving-tips-less-waste",
    "image": "https://media.guim.co.uk/693af0f6a05da2086fed992068553f47b8c979a9/0_0_2500_2000/500.jpg",
    "summary": "Experts suggest creative ways to give and receive environmentally friendly gifts this holiday season, emphasizing sustainability over consumerism. They recommend experiences or homemade gifts that reduce waste while still bringing joy. By focusing on meaningful presents, individuals can enjoy the spirit of giving without excess clutter.",
    "published": "2025-11-28T23:00:21Z"
  },
  {
    "title": "After landmark climate win, lawyer hopes for a ‘new legal order’ to protect Indigenous rights",
    "url": "https://www.theguardian.com/world/2025/nov/29/after-landmark-climate-win-lawyer-hopes-for-a-new-legal-order-to-protect-indigenous-rights",
    "image": "https://media.guim.co.uk/360927cebb0ecbe955ca265e6c93f8316deae959/2431_0_3772_3018/500.jpg",
    "summary": "Pacific lawyer Julian Aguon has been awarded the Right Livelihood Award for his pivotal role in advancing legal efforts regarding climate harm, culminating in a significant ruling by the International Court of Justice (ICJ). His work highlights the impact of climate change on vulnerable communities. Aguon's recognition underscores the importance of legal advocacy in addressing global environmental challenges.",
    "published": "2025-11-28T23:00:21Z"
  },
  {
    "title": "Police liken it to random breath tests, but warrantless pat-down powers across Melbourne’s CBD are creating racial profiling fears",
    "url": "https://www.theguardian.com/australia-news/2025/nov/29/police-warrantless-search-powers-melbourne-racial-profiling-fears",
    "image": "https://media.guim.co.uk/0193b8c5b3537d98f18f5d7aa6d95997bf081988/1091_690_3747_2999/500.jpg",
    "summary": "The city is preparing for a significant increase in search powers amid growing concerns from advocates. New research has emerged backing these worries, highlighting potential risks associated with the expanded authorities. Critics fear this expansion could lead to abuses and violations of civil liberties.",
    "published": "2025-11-28T23:00:20Z"
  },
  {
    "title": "Stranded passengers and drivers at breaking point: readers weigh in on short cab trips from Sydney airport",
    "url": "https://www.theguardian.com/australia-news/2025/nov/29/taxi-drivers-sydney-airport-passengers-stranded",
    "image": "https://media.guim.co.uk/fa4a8185db5ed5ab11e080ca44665c6806537db3/445_263_2898_2320/500.jpg",
    "summary": "Disgruntled travelers and various former and current taxi drivers have shared their experiences regarding recent service issues. Their feedback highlights dissatisfaction with taxi services and the challenges faced by drivers. This situation sheds light on ongoing tensions between passengers and the taxi industry.",
    "published": "2025-11-28T23:00:20Z"
  }
]