[
  {
    "title": "Premier League buildup, FA Cup second round updates, and more – live",
    "url": "https://www.theguardian.com/football/live/2025/dec/07/premier-league-buildup-fa-cup-second-round-updates-and-more-live",
    "image": "https://media.guim.co.uk/9b6a91e516d60b8e80c79f7e65ac248e188ca955/0_0_5000_4000/500.jpg",
    "summary": "Writers will cover the upcoming FA Cup matches featuring Brighton versus West Ham and Fulham against Crystal Palace. They will also provide updates from Scottish and European football leagues. Stay tuned for insights and analysis leading up to the games.",
    "published": "2025-12-07T10:18:53Z"
  },
  {
    "title": "Margaret Atwood: The Handmaid’s Tale has become ‘more and more plausible’",
    "url": "https://www.theguardian.com/books/2025/dec/07/margaret-atwood-the-handmaids-tale-has-become-more-and-more-plausible",
    "image": "https://media.guim.co.uk/457df876619699e4e6040733ed54f5a0423992a8/0_641_8283_6627/500.jpg",
    "summary": "A Canadian author reflects on the similarities between the United States under Donald Trump's presidency and the dystopian setting of her novel. She notes that current political climate has made her narrative feel increasingly relevant. The discussion highlights concerns about democracy and societal values in the contemporary context.",
    "published": "2025-12-07T10:13:04Z"
  },
  {
    "title": "Young people ‘haven’t had attention they deserve’ admits minister as work funding package announced – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/dec/07/keir-starmer-labour-reform-conservatives-your-party-uk-politics-latest-news-updates",
    "image": "https://media.guim.co.uk/dcac875d615a76c11338a3d2407d6cbc0fd53516/1071_0_7200_5760/500.jpg",
    "summary": "The government has announced funding for 350,000 training and work experience placements. These opportunities will be available in various sectors, including construction and social care. The initiative aims to enhance workforce skills and address labor shortages.",
    "published": "2025-12-07T10:10:48Z"
  },
  {
    "title": "Ashes second Test, day four: Australia ease to commanding 2-0 series lead over England – live report",
    "url": "https://www.theguardian.com/sport/live/2025/dec/07/australia-vs-england-live-ashes-second-2nd-test-day-four-aus-v-eng-cricket-scores-updates-gabba-brisbane",
    "image": "https://media.guim.co.uk/aa66d39ea275f95e4b18df217a197ecd7438bbed/322_332_3903_3123/500.jpg",
    "summary": "Australia secured an eight-wicket victory against England in the second Test, with Steve Smith hitting the winning runs. The team displayed a strong performance throughout the match. This win further solidifies Australia's dominance in the series.",
    "published": "2025-12-07T10:10:47Z"
  },
  {
    "title": "The ultimate unsung superfood: 17 delicious ways with cabbage – from kimchi to pasta to peanut butter noodles",
    "url": "https://www.theguardian.com/food/2025/dec/07/the-ultimate-unsung-superfood-17-delicious-ways-with-cabbage-from-kimchi-to-pasta-to-peanut-butter-noodles",
    "image": "https://media.guim.co.uk/162f255e7139c9680995916d5840801b2ce5f01e/0_0_3497_2797/500.jpg",
    "summary": "Cabbage consumption in Britain has dropped by 80% over the past 50 years, despite its versatility and health benefits. The vegetable is nutritious and ideal for winter dishes. The article offers tips on how to fully utilize cabbage in cooking.",
    "published": "2025-12-07T10:00:19Z"
  }
]