[
  {
    "title": "The ‘relentless years’: ABC has shaken off culture of fear created by external pressure, Hugh Marks tells supporters | Weekly Beast",
    "url": "https://www.theguardian.com/media/2025/oct/03/abc-has-shaken-culture-fear-created-by-external-pressure-hugh-marks-weekly-beast",
    "image": "https://media.guim.co.uk/aa94359b9bfa4d1e5edffb8a77ce1271743ac2c8/760_375_2865_2293/500.jpg",
    "summary": "The managing director forecasts that the broadcaster will thrive and grow stronger over the next 50 years. In a separate development, the chief of Private Media has sparked frustration among business travelers globally. These statements reflect contrasting perspectives on the future of media and travel industries.",
    "published": "2025-10-03T02:46:53Z"
  },
  {
    "title": "Australia news live: planned pro-Palestine protest at Opera House could be tested in the supreme court, police say",
    "url": "https://www.theguardian.com/australia-news/live/2025/oct/03/png-agreement-aukus-submarines-pact-anthony-albanese-richard-marles-retired-admiral-slams-aukus-deal-gaza-flotilla-intercepted-ntwnfb",
    "image": "https://media.guim.co.uk/5d6d20e881eed1e6de67dca503c9df21d1201ab0/418_77_2418_1935/500.jpg",
    "summary": "I currently do not have access to live news updates. If you provide specific details or a text about the news you'd like summarized, I can help with that!",
    "published": "2025-10-03T02:43:07Z"
  },
  {
    "title": "Back to the Future: The Musical review – faithful adaptation for the diehard fans",
    "url": "https://www.theguardian.com/stage/2025/oct/03/back-to-the-future-musical-review-faithful-adaptation-for-diehard-fans",
    "image": "https://media.guim.co.uk/27e7f4d46e68b45a708f0eb38130a6f66ec29c97/467_0_6013_4808/500.jpg",
    "summary": "The new DeLorean show captures the excitement and style of the original 1985 comedy. However, it may be overly faithful to its predecessor, potentially limiting its own creative expression. Overall, it delivers a thrilling experience for fans of the classic film.",
    "published": "2025-10-03T02:35:40Z"
  },
  {
    "title": "US government shutdown: Donald Trump promises firings and cuts to ‘Democrats’ favorite projects’ if shutdown continues – as it happened",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/02/government-shutdown-trump-democrats-latest-updates",
    "image": "https://media.guim.co.uk/c3e5ae42cde3fc08bf667034b821b3fbbb11cc0d/384_0_4252_3402/500.jpg",
    "summary": "In an interview with OAN, the President expressed his desire to \"survive\" when questioned about his plans for the 2026 elections. His response suggests uncertainty regarding his political future. The statement has sparked further speculation about his intentions.",
    "published": "2025-10-03T02:13:26Z"
  },
  {
    "title": "SA Ambulance received no alerts from service meant to notify authorities during Optus triple zero outage last month",
    "url": "https://www.theguardian.com/business/2025/oct/03/optus-triple-zero-outage-south-australia-ambulance-received-no-alerts-from-service-meant-to-notify-authorities",
    "image": "https://media.guim.co.uk/3b9cc49d723f8e92daf5cd6cb7f7a3952a693f12/614_0_6827_5464/500.jpg",
    "summary": "South Australia's emergency service was not alerted during September's triple zero outage, despite being enrolled in a new alert system. This oversight raises concerns about the reliability of emergency notifications. The incident highlights potential flaws in the communication protocols for emergency responses.",
    "published": "2025-10-03T02:06:14Z"
  }
]