[
  {
    "title": "Brisbane’s Will Ashcroft cements star status with successive Norm Smith medals",
    "url": "https://www.theguardian.com/sport/2025/sep/27/afl-grand-final-norm-smith-medal-winner-will-ashcroft-brisbane-lions",
    "image": "https://media.guim.co.uk/7a8bdd51ba9e4f72cbb7774e4948e451034d7307/287_0_2874_2300/500.jpg",
    "summary": "Brisbane midfielder Will Ashcroft has achieved a remarkable milestone by winning his second consecutive Norm Smith Medal. This accolade underscores his rapid ascent in the AFL. His performance continues to make a significant impact on the league.",
    "published": "2025-09-27T08:11:10Z"
  },
  {
    "title": "More than 1.6m sign petition opposing Starmer’s plan for digital ID cards",
    "url": "https://www.theguardian.com/politics/2025/sep/27/petition-opposing-starmer-plan-digital-id-cards",
    "image": "https://media.guim.co.uk/4b2cece2ef09979d13232a3884a2506137d47844/1176_0_4290_3432/500.jpg",
    "summary": "Opponents have criticized a new scheme for UK workers, labeling it a move toward mass surveillance and increased digital control over individuals. They express concerns about privacy violations and the potential for government overreach. The controversy highlights the ongoing debate over balancing security measures with personal freedoms.",
    "published": "2025-09-27T08:08:25Z"
  },
  {
    "title": "AFL grand final 2025: Brisbane Lions crush Geelong Cats to win back-to-back premierships – as it happened",
    "url": "https://www.theguardian.com/sport/live/2025/sep/27/afl-grand-final-2025-live-updates-geelong-vs-lions-blog-scores-results-start-time-cats-v-lions-mcg",
    "image": "https://media.guim.co.uk/254c10b6cc223afeb54f49fd659dff3c8a831aca/275_0_4165_3332/500.jpg",
    "summary": "The Lions triumphed over the Cats by 47 points in the grand final at the MCG. Will Ashcroft earned the Norm Smith medal for the second year in a row. The victory secured a significant win for the Lions in the championship.",
    "published": "2025-09-27T08:01:25Z"
  },
  {
    "title": "‘Affordable luxuries’: British shoppers spread their love for flavoured butter",
    "url": "https://www.theguardian.com/food/2025/sep/27/britain-butter-food-cooking-retail-social-media",
    "image": "https://media.guim.co.uk/42279d6e324d6b5629b09b1b439bd7021d64dc5f/0_324_1212_969/500.jpg",
    "summary": "Experts attribute the increasing consumer preference for chocolate and truffle flavors to the influence of social media trends and the growing 'foodie' culture. This shift highlights how digital platforms shape culinary choices and flavor popularity. As a result, brands are adjusting their offerings to cater to these emerging tastes.",
    "published": "2025-09-27T08:01:22Z"
  },
  {
    "title": "Moldovan diaspora critical in elections as country battles Russian vote-buying, says former minister",
    "url": "https://www.theguardian.com/world/2025/sep/27/moldova-diaspora-critical-in-elections-as-country-battles-russian-vote-buying-says-former-minister",
    "image": "https://media.guim.co.uk/01317112b1b84d9d92354c554d5d4dc2d2053d2d/323_0_3333_2667/500.jpg",
    "summary": "Russian watchdogs allege that the government is incentivizing overseas voters with cash rewards to provide evidence of voter fraud. This move is perceived as a strategy to potentially declare the upcoming elections rigged. The actions have raised concerns about the integrity of the voting process.",
    "published": "2025-09-27T08:00:37Z"
  }
]