[
  {
    "title": "Former Met police officer accused of using sex workers while on duty",
    "url": "https://www.theguardian.com/uk-news/2025/nov/08/former-met-police-officer-accused-of-using-sex-workers-while-on-duty",
    "image": "https://media.guim.co.uk/337b10d3e0e4d8dc50735ac751ed709045445392/331_0_4283_3427/500.jpg",
    "summary": "Imran Patel, who resigned from his position last year following allegations regarding his conduct, is now under investigation by the Independent Office for Police Conduct (IOPC). The inquiry examines the circumstances surrounding his resignation and any potential misconduct. Details of the investigation have not been disclosed yet.",
    "published": "2025-11-08T07:09:47Z"
  },
  {
    "title": "How many trees a day do we cut down for paper? The kids’ quiz",
    "url": "https://www.theguardian.com/lifeandstyle/2025/nov/08/how-many-trees-a-day-do-we-cut-down-for-paper-the-kids-quiz",
    "image": "https://media.guim.co.uk/8a19ba804fdd07a68b82c3da5c3cdd199afeedd7/0_0_1577_1262/500.jpg",
    "summary": "Children have created five multiple-choice questions to challenge your knowledge in a fun quiz format. Participants can also submit their own brainteasers for future quizzes. This initiative encourages creativity and engagement among young minds.",
    "published": "2025-11-08T07:00:05Z"
  },
  {
    "title": "A rats to riches story: Larry the Downing Street cat finds place in TV spotlight",
    "url": "https://www.theguardian.com/politics/2025/nov/08/a-rats-to-riches-story-larry-the-downing-street-cat-finds-place-in-tv-spotlight",
    "image": "https://media.guim.co.uk/28ff3c33d1faf7d19b87ed71ba475ccbe4e0acd6/685_0_3540_2832/500.jpg",
    "summary": "A documentary series will highlight the rising popularity of Britain’s Chief Mouser, a cat known for residing at 10 Downing Street. The feline has become a charming figure in British politics, attracting attention and affection from the public. The series aims to explore the cat's role and significance in the heart of the UK government.",
    "published": "2025-11-08T07:00:05Z"
  },
  {
    "title": "‘There is bounty almost everywhere’: why you’ll always find me in the flea market on my travels",
    "url": "https://www.theguardian.com/travel/2025/nov/08/flea-market-vintage-thrift-souvenir-shopping",
    "image": "https://media.guim.co.uk/5fc6c74bf51ddd364bbcf01b5367e2ceb0677320/1235_864_3504_2803/500.jpg",
    "summary": "Secondhand shopping has emerged as a popular attraction for tourists seeking unique experiences beyond traditional sightseeing. A seasoned bargain-hunter offers expert tips for finding the best vintage items while traveling. This trend reflects a growing interest in sustainable fashion and local culture.",
    "published": "2025-11-08T07:00:04Z"
  },
  {
    "title": "Trespasses: ​Gillian Anderson steals every scene in this miraculous TV heartbreaker ",
    "url": "https://www.theguardian.com/tv-and-radio/2025/nov/08/trespasses-gillian-anderson-steals-every-scene-in-this-miraculous-tv-heartbreaker",
    "image": "https://media.guim.co.uk/c4a9a43c54102ab09e780f225603910e9965c7e3/1000_0_5000_4000/500.jpg",
    "summary": "Lola Petticrew and Tom Cullen deliver stunning chemistry in a story of hidden romance set during the Troubles. However, it's Anderson's portrayal of a bitter, alcoholic character that truly captivates audiences. The film powerfully explores themes of love and personal struggle in a turbulent time.",
    "published": "2025-11-08T07:00:04Z"
  }
]