[
  {
    "title": "‘Huge number of Russian drones’ violated Poland’s airspace, says PM – follow live",
    "url": "https://www.theguardian.com/world/live/2025/sep/10/poland-pm-condemns-repeated-violation-of-airspace-amid-russian-attack-on-ukraine-follow-live",
    "image": "https://media.guim.co.uk/360b3ad8d55e8b5a97690e31b6bdfdcad58e5388/45_0_4348_3478/500.jpg",
    "summary": "Donald Tusk stated that threats were neutralized by shooting them down, while Ukrainian President Volodymyr Zelenskyy warned that the recent incursion establishes a perilous precedent for Europe. Zelenskyy's comments highlight rising tensions and security concerns in the region. The situation underscores the need for vigilance and cooperation among European nations.",
    "published": "2025-09-10T06:46:00Z"
  },
  {
    "title": "Australia news live: Nampijinpa Price declines to back Ley’s leadership or apologise over Indian migrants comments",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/10/australia-news-live-nampijinpa-price-littleproud-pacific-albanese-indian-immigration-sussan-ley-coalition-liberal-labor-koala-park-nsw-ntwnfb",
    "image": "https://media.guim.co.uk/a0118e9647bacc5bd7b94174ca8e1fff634682db/267_0_4525_3620/500.jpg",
    "summary": "I'm sorry, but I need more context or specific details about the news article you want summarized. Could you please provide more information?",
    "published": "2025-09-10T06:40:04Z"
  },
  {
    "title": "Vodafone launches fourth inquiry into franchising division amid £120m lawsuit",
    "url": "https://www.theguardian.com/business/2025/sep/10/vodafone-inquiry-franchising-division-lawsuit-francisees",
    "image": "https://media.guim.co.uk/3b1a08a894d52beb69e451301a9356ce53ed518d/285_0_5039_4033/500.jpg",
    "summary": "A telecoms firm is reportedly offering settlements to certain franchisees amid ongoing legal disputes outside a high court claim. This development comes as a new investigation is initiated into the company's practices. The situation highlights mounting scrutiny of the firm's operations and relationships with its franchisees.",
    "published": "2025-09-10T06:01:03Z"
  },
  {
    "title": "How to Save the Internet by Nick Clegg review – spinning Silicon Valley",
    "url": "https://www.theguardian.com/technology/2025/sep/10/how-to-save-the-internet-by-nick-clegg-review-spinning-silicon-valley",
    "image": "https://media.guim.co.uk/9854355df5b2cfe5eadf55bce29e46bcf8048470/165_850_5107_4087/500.jpg",
    "summary": "The former deputy Prime Minister and Meta executive downplays the negative impact of social media on mental health and democracy. Instead of acknowledging these issues, he reinforces the company's messaging. Critics argue this perspective overlooks serious societal concerns related to social media use.",
    "published": "2025-09-10T06:01:03Z"
  },
  {
    "title": "Deaf review – a young mother’s struggles to be heard",
    "url": "https://www.theguardian.com/film/2025/sep/10/deaf-review-a-young-mothers-struggles-to-be-heard",
    "image": "https://media.guim.co.uk/aff52663443373e4f6dc8def77476eba077f255c/235_0_1350_1080/500.jpg",
    "summary": "Angela's seemingly perfect family life starts to unravel following her unexpected pregnancy. This new development brings to light lingering prejudices from the hearing world. As a result, Angela confronts challenges that test her relationships and perceptions of motherhood.",
    "published": "2025-09-10T06:00:05Z"
  }
]