[
  {
    "title": "Terence Crawford’s greatest asset solves biggest problem for career-defining win",
    "url": "https://www.theguardian.com/sport/2025/sep/14/terence-crawford-canelo-alvarez-boxing-las-vegas",
    "image": "https://media.guim.co.uk/b03cb409d968a94bf0f66c40058d3118ebaad923/59_0_5254_4204/500.jpg",
    "summary": "The Omaha native, who endured a near-fatal gunshot wound to the head, has gained significant attention after years of operating in the shadows of fame. His remarkable story of survival and resilience has pushed him into the spotlight. As a result, he can no longer be overlooked in the entertainment industry.",
    "published": "2025-09-14T20:19:19Z"
  },
  {
    "title": "Corrections and clarifications ",
    "url": "https://www.theguardian.com/news/2025/sep/14/corrections-and-clarifications1",
    "summary": "The government announced an increase in child benefit payments to support families facing rising living costs. In related news, the traditional King Cake has become a popular treat during the festive season, symbolizing celebration and community. These developments highlight ongoing efforts to balance economic support with cultural traditions.",
    "published": "2025-09-14T20:00:42Z"
  },
  {
    "title": "Shooting suspect had ‘very different ideology’ than conservative family, Utah governor says",
    "url": "https://www.theguardian.com/us-news/2025/sep/14/charlie-kirk-shooting-suspect-roommate",
    "image": "https://media.guim.co.uk/7a7d1536f4c2fde9f02bd3903cce794a0ff6742d/267_0_2667_2134/500.jpg",
    "summary": "Utah Governor Spencer Cox stated that a suspect in a recent incident had been \"radicalized.\" He also revealed that the suspect was in a relationship with an individual undergoing gender transition from male to female. Details regarding the context and implications of these statements remain limited.",
    "published": "2025-09-14T19:53:00Z"
  },
  {
    "title": "Manchester United will keep my style, insists Amorim, despite heavy derby defeat",
    "url": "https://www.theguardian.com/football/2025/sep/14/manchester-united-will-keep-playing-my-way-says-ruben-amorim",
    "image": "https://media.guim.co.uk/4894dc4e6d7eec1d21f59a601eeae5a2b8b1f953/275_0_3151_2521/500.jpg",
    "summary": "Ruben Amorim expressed his commitment to maintaining his tactical approach despite Manchester United's heavy defeat against Manchester City in the derby. He emphasized the importance of consistency in their style of play. Amorim remains focused on improving the team's performances moving forward.",
    "published": "2025-09-14T19:34:55Z"
  },
  {
    "title": "Dame Annette Brooke obituary",
    "url": "https://www.theguardian.com/politics/2025/sep/14/dame-annette-brooke-obituary",
    "image": "https://media.guim.co.uk/caac1b72348005123ac8a43a4b093ec25032142c/58_0_3960_3168/500.jpg",
    "summary": "The longest-serving female Liberal Democrat MP, known for her popularity and effectiveness, has chaired the parliamentary party. Her leadership and contributions have made a significant impact within the party and beyond. This milestone highlights her dedication and influence over the years.",
    "published": "2025-09-14T19:33:30Z"
  }
]