[
  {
    "title": "England v South Africa: Women’s Cricket World Cup – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/03/england-v-south-africa-womens-cricket-world-cup-live",
    "image": "https://media.guim.co.uk/1015d86dfeea6b886806e6c624c2c636cb729585/412_0_3992_3193/500.jpg",
    "summary": "Nat Sciver's team begins their campaign against South Africa in Guwahati, with live updates provided by our writers throughout the match. The report offers an over-by-over analysis of the game. Stay tuned for ongoing commentary and insights.",
    "published": "2025-10-03T11:15:13Z"
  },
  {
    "title": "Manchester synagogue victim died after being shot by police, as attacker’s father expresses ‘sorrow’ at killings – latest",
    "url": "https://www.theguardian.com/uk-news/live/2025/oct/03/manchester-synagogue-attack-victims-adrian-daulby-melvin-cravitz-attacker-jihad-al-shamie-latest-news-updates",
    "image": "https://media.guim.co.uk/ce45dceedfb76fd383fca00ea149ceb9771a8b02/1236_0_4013_3210/500.jpg",
    "summary": "Faraj al-Shamie publicly denounced his son's actions, expressing disapproval on behalf of the family. The statement indicates a clear separation between the family’s values and the son's behavior. This condemnation highlights internal family conflict and disassociation from the son's choices.",
    "published": "2025-10-03T11:15:11Z"
  },
  {
    "title": "Stride dismisses suggestion Badenoch will be ousted as Tory leader next year but admits ‘it’s going to be bumpy’ – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/oct/03/greens-labour-reform-conservatives-immigration-uk-politics-live-news-updates",
    "image": "https://media.guim.co.uk/6d5fd45d6d5be18ebebed4f3238c1afcb439feba/35_37_4593_3674/500.jpg",
    "summary": "The shadow chancellor expresses support for the party leader while refraining from endorsing her assertion that Britain is at risk of an IMF bailout. This indicates a division in the party's stance on economic concerns. The statement reflects ongoing tensions regarding the country's financial stability.",
    "published": "2025-10-03T11:13:55Z"
  },
  {
    "title": "Calls for police to shoot down drones after Munich airport disruption – latest updates",
    "url": "https://www.theguardian.com/world/live/2025/oct/03/munich-drones-security-europe-russia-ukraine-latest-news-updates",
    "image": "https://media.guim.co.uk/4e3d9395750e2e4c825c31bfb3e72c65408e1c3a/195_0_4832_3866/500.jpg",
    "summary": "The Bavarian Prime Minister is advocating for enhanced air defenses in Germany following a recent incident. This call comes amidst growing concerns about national security. Officials emphasize the need for improved measures to protect the country's airspace.",
    "published": "2025-10-03T11:13:15Z"
  },
  {
    "title": "Brentford rise above snobbery to remain awkward, all-action opponents",
    "url": "https://www.theguardian.com/football/2025/oct/03/brentford-rise-above-snobbery-awkward-all-action-opponents-keith-andrews",
    "image": "https://media.guim.co.uk/1db161029dc60ff099bddaa0505eea6a6e424a80/117_64_1908_1526/500.jpg",
    "summary": "Keith Andrews' team has experienced mixed results, yet their proficiency in set-pieces is aiding them in navigating recent challenges. This strategic focus is aligning with the club's broader framework. Overall, the approach reflects a positive adaptation to pressure situations.",
    "published": "2025-10-03T11:13:15Z"
  }
]