[
  {
    "title": "Synagogue attacker who killed two was a ‘terrorist targeting Jews because they are Jews’, says Starmer – latest updates",
    "url": "https://www.theguardian.com/uk-news/live/2025/oct/02/police-reports-stabbing-synagogue-greater-manchester-live",
    "image": "https://media.guim.co.uk/09f20100fbf2630c0e0352f448c48247471f5999/386_0_3289_2632/500.jpg",
    "summary": "UK Prime Minister emphasizes the urgent need to combat rising antisemitism following an attack in Manchester during Yom Kippur. He highlights the importance of safeguarding Jewish communities and condemns hate-fueled violence. The call for unity against discrimination comes amid growing concerns over antisemitic incidents in the country.",
    "published": "2025-10-02T18:26:46Z"
  },
  {
    "title": "Nottingham Forest v Midtjylland, Feyenoord v Aston Villa, and more: Europa League – live",
    "url": "https://www.theguardian.com/football/live/2025/oct/02/nottingham-forest-v-midtjylland-feyenoord-v-aston-villa-and-more-europa-league-live",
    "image": "https://media.guim.co.uk/7c8cc2a62d6e74871062d937f01ef4ef650ee600/360_0_2938_2351/500.jpg",
    "summary": "Niall McVeigh will provide updates on Thursday's matches featuring Aston Villa, Nottingham Forest, Celtic, and Rangers. Fans can expect insights and commentary on the performances of these teams. Stay tuned for the latest developments in these key games.",
    "published": "2025-10-02T18:24:43Z"
  },
  {
    "title": "Trump declares that drug cartels operating in the Caribbean are ‘unlawful combatants’",
    "url": "https://www.theguardian.com/us-news/2025/oct/02/trump-administration-caribbean-drug-cartels",
    "image": "https://media.guim.co.uk/b6e16c1c91aa3f917c815100914be1bb254c6530/418_0_4164_3333/500.jpg",
    "summary": "The President stated that the U.S. is currently engaged in a \"non-international conflict,\" as revealed in a White House memo. This designation may impact how the U.S. approaches military and diplomatic actions. The characterization signifies a shift in the understanding of the conflict's nature and scope.",
    "published": "2025-10-02T18:22:21Z"
  },
  {
    "title": "Police ask for protest against Palestine Action ban to be postponed after Manchester attack",
    "url": "https://www.theguardian.com/uk-news/2025/oct/02/police-ask-for-palestine-action-protest-to-be-postponed-to-free-up-officers-in-wake-of-terror-attack",
    "image": "https://media.guim.co.uk/a6bb4f7fcd24a906763f3a993cdc454e29193799/1670_244_6522_5220/500.jpg",
    "summary": "Organizers confirmed that a planned protest will proceed as scheduled. They emphasized that it is the Metropolitan Police's decision on whether to focus on making arrests during the event. The situation reflects a potential clash between demonstrators and law enforcement priorities.",
    "published": "2025-10-02T18:20:50Z"
  },
  {
    "title": "US government shutdown: federal layoffs ‘likely to be in the thousands’, says White House – live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/02/government-shutdown-trump-democrats-latest-updates",
    "image": "https://media.guim.co.uk/67f0cf364ead08501750764e4c7d8c49cf1252d5/200_0_6588_5271/500.jpg",
    "summary": "Karoline Leavitt attributes impending job losses to Democratic policies, claiming that the Trump administration anticipates thousands of furloughs. She emphasizes the negative impact of current leadership on employment. Leavitt's comments highlight ongoing political tensions regarding economic management.",
    "published": "2025-10-02T18:09:32Z"
  }
]