[
  {
    "title": "Australia news live: Coalition opposes Trump’s ‘shocking but unsurprising’ 100% tariffs on pharmaceuticals",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/26/australia-news-live-afl-grand-final-could-spread-queensland-measles-outbreak-albanese-heads-for-uk-talks-ntwnfb",
    "image": "https://media.guim.co.uk/68a7831a6a95a6b2c979b70560785717ee312f13/688_0_6880_5504/500.jpg",
    "summary": "I'm sorry, but I need specific details about the news you'd like summarized. Please provide the content or key points, and I'll be happy to help!",
    "published": "2025-09-26T03:34:39Z"
  },
  {
    "title": "‘Cloudy but dry’: weather bureau predicts near-perfect conditions for AFL grand final",
    "url": "https://www.theguardian.com/australia-news/2025/sep/26/afl-grand-final-2025-weather-forecast-melbourne",
    "image": "https://media.guim.co.uk/97e5ebdb82be26ed504ff2f81ba4cc0ec7a02d80/93_0_4780_3824/500.jpg",
    "summary": "The Bureau of Meteorology forecasts that the weather will mostly stay dry throughout the entire match. There are no significant rain predictions expected during play. Fans can look forward to favorable conditions from start to finish.",
    "published": "2025-09-26T03:29:24Z"
  },
  {
    "title": "Party animals, kick-to-kick and Zeus: AFL grand final parade adds splash of colour under grey skies",
    "url": "https://www.theguardian.com/sport/2025/sep/26/afl-grand-final-parade-adds-splash-colour-under-grey-skies",
    "image": "https://media.guim.co.uk/9bdf5adcfb7344f370d121fee97697cb5470b8e6/392_0_3915_3132/500.jpg",
    "summary": "Despite the absence of a Melbourne team in Saturday's finals match, fans from all backgrounds gathered to watch the event and support their favorite players. The atmosphere highlighted the passionate community around the sport. Enthusiasts celebrated the game, underscoring the event's significance beyond local rivalries.",
    "published": "2025-09-26T03:10:47Z"
  },
  {
    "title": "The Crunch: Australia’s horrifying climate future; finding clothes that fit; and charting the perfect coffee",
    "url": "https://www.theguardian.com/news/2025/sep/26/the-crunch-australias-horrifying-climate-future-finding-clothes-that-fit-and-charting-the-perfect-coffee",
    "image": "https://media.guim.co.uk/ea7958d7e108f7ace1b0f6cc566afe37035991c6/0_0_1440_1152/500.jpg",
    "summary": "Recent maps based on Australia’s climate risk report highlight the severe potential impacts of heatwaves, droughts, and coastal flooding. These visuals illustrate the increasing frequency and intensity of climate-related events across the country. The findings emphasize the urgent need for climate action and adaptation strategies.",
    "published": "2025-09-26T02:35:18Z"
  },
  {
    "title": "Influencers make the AFR Power List for the first time as Coalition left out in the cold | Weekly Beast",
    "url": "https://www.theguardian.com/media/commentisfree/2025/sep/26/social-media-influencers-make-afr-power-list-first-time-abbie-chatfield-konrad-benjamin-betoota-advocate",
    "image": "https://media.guim.co.uk/bc038195ea0cbf027abc0e9a8890de2891de49fc/1459_1587_2134_1707/500.jpg",
    "summary": "The inclusion of Abbie Chatfield, Konrad Benjamin, and Betoota Advocate in media discussions has frustrated a veteran journalist from the Financial Review. Meanwhile, Nine Network is exploring options to sell its talkback radio stations. This move signals a shift in the media landscape and raises questions about content diversification.",
    "published": "2025-09-26T02:26:20Z"
  }
]