[
  {
    "title": "Australia v England: Ashes second Test, day four – live",
    "url": "https://www.theguardian.com/sport/live/2025/dec/07/australia-vs-england-live-ashes-second-2nd-test-day-four-aus-v-eng-cricket-scores-updates-gabba-brisbane",
    "image": "https://media.guim.co.uk/90f693080ae98ae6bd6a74fac5a7db05dba8bcd9/206_0_2311_1848/500.jpg",
    "summary": "England faces an uphill battle in Brisbane as they require a miraculous performance to turn the tide of the match. Follow our writers for live updates from the Gabba. Stay tuned for all the action as the situation unfolds.",
    "published": "2025-12-07T06:06:36Z"
  },
  {
    "title": "‘No one knows where it came from’: first wild beaver spotted in Norfolk for 400 years",
    "url": "https://www.theguardian.com/environment/2025/dec/07/no-one-knows-where-it-came-from-first-wild-beaver-spotted-in-norfolk-for-400-years",
    "image": "https://media.guim.co.uk/3f670938e904e2248c0aba1d226835f9f9474953/285_0_1350_1080/500.jpg",
    "summary": "A solitary creature was spotted gathering materials for its lodge in a riverside nature reserve. Cameras installed in the area captured this intriguing behavior. The footage highlights the unique wildlife and ecological activities within the reserve.",
    "published": "2025-12-07T06:00:15Z"
  },
  {
    "title": "Christmas dinner in a restaurant or kitchen carnage at home?",
    "url": "https://www.theguardian.com/food/2025/dec/07/grace-dent-christmas-dinner-lunch-in-or-out-at-pub",
    "image": "https://media.guim.co.uk/7f2cf325c0c3162836973f875b707eaeb51854ac/0_0_2452_1961/500.jpg",
    "summary": "The author reflects on their experiences dining at restaurants, indicating a mix of enjoyment and hesitation. Despite multiple outings, they remain uncertain about fully embracing the dining-out experience. The piece captures the complexity of navigating social eating in the current climate.",
    "published": "2025-12-07T06:00:15Z"
  },
  {
    "title": "‘What’s my life like away from rugby? Chaos’: Red Rose superstar Ellie Kildunne on confidence, cowboy dances and why it’s cool to be different",
    "url": "https://www.theguardian.com/sport/2025/dec/07/rugby-red-rose-full-back-ellie-kildunne-interview",
    "image": "https://media.guim.co.uk/95be5be07e9537c3a9622e4af564a1624b2aa497/0_1841_6000_4800/500.jpg",
    "summary": "Kildunne is celebrated not only for her remarkable speed and impressive tries in rugby but also for her diverse interests outside of the sport. Alongside her athletic prowess, she has a passion for photography and has ventured into DIY tattooing. This multifaceted talent showcases her creativity beyond the rugby field.",
    "published": "2025-12-07T06:00:14Z"
  },
  {
    "title": "‘What choice do we have?’: no end in sight for Ukraine’s war-weary frontline troops",
    "url": "https://www.theguardian.com/news/ng-interactive/2025/dec/07/what-choice-do-we-have-no-end-in-sight-for-ukraines-war-weary-frontline-troops",
    "image": "https://media.guim.co.uk/ca54bf31e7e105558d6e39d3002f3e365c953efa/172_0_5156_4125/500.jpg",
    "summary": "As peace negotiations stall, infantry soldiers are enduring extended deployments, increasing their exposure to life-threatening situations amid ongoing Russian offensives. The situation highlights the escalating risks faced by troops on the frontlines. Prospects for resolving the conflict remain bleak.",
    "published": "2025-12-07T06:00:14Z"
  }
]