[
  {
    "title": "World Cup 2026 draw updates: England to meet Croatia, Brazil await Scotland, USA will face Australia – live",
    "url": "https://www.theguardian.com/football/live/2025/dec/05/world-cup-2026-draw-updates-usa-mexico-canada",
    "image": "https://media.guim.co.uk/17a0a93bc42c4d7471d00cce4a57025a229e46cb/796_0_4281_3427/500.jpg",
    "summary": "Writers are providing live updates from the Washington DC draw for the upcoming 48-team tournament scheduled for next summer. Follow along for the latest news and developments regarding team placements and matchups. Stay informed about this highly anticipated event!",
    "published": "2025-12-05T19:15:41Z"
  },
  {
    "title": "Supreme court to decide legality of Trump’s order to restrict birthright citizenship – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/dec/05/trump-pete-hegseth-signal-politics-updates",
    "image": "https://media.guim.co.uk/c55cb65a49483a4c16aed7253602e734516d69ec/456_0_4560_3648/500.jpg",
    "summary": "The court has not specified a date for oral arguments, but they are expected to take place in the coming months. This announcement indicates ongoing legal proceedings. Further updates will be provided as the date approaches.",
    "published": "2025-12-05T19:07:57Z"
  },
  {
    "title": "World Cup 2026 draw: USA to face Australia and Paraguay in group stage",
    "url": "https://www.theguardian.com/football/2025/dec/05/world-cup-2026-draw-usa-australia-paraguay",
    "image": "https://media.guim.co.uk/c2b608a1aa48df3048e579cda8eaa9844484a101/578_0_4164_3331/500.jpg",
    "summary": "The United States men's national soccer team is set to face their next opponent, marking 1,098 days since their exit from the 2022 World Cup after a loss to the Netherlands. This announcement brings excitement as they prepare for their upcoming match. The team's journey continues as they look to improve and advance in international competition.",
    "published": "2025-12-05T19:07:14Z"
  },
  {
    "title": "Cloudflare apologises after latest outage takes down LinkedIn and Zoom",
    "url": "https://www.theguardian.com/technology/2025/dec/05/another-cloudflare-outage-takes-down-websites-linkedin-zoom",
    "image": "https://media.guim.co.uk/6bdf9c4f284a6f0bcae64cbd3a36c4385a56c866/380_0_4640_3712/500.jpg",
    "summary": "A web infrastructure provider reported a half-hour service disruption that was not due to an attack. This incident follows a larger outage that occurred weeks earlier. The company is reassuring users that this recent issue was contained and not malicious.",
    "published": "2025-12-05T18:55:03Z"
  },
  {
    "title": "AI deepfakes of real doctors spreading health misinformation on social media",
    "url": "https://www.theguardian.com/society/2025/dec/05/ai-deepfakes-of-real-doctors-spreading-health-misinformation-on-social-media",
    "image": "https://media.guim.co.uk/53cc24d57b561a7e7ce23d333cb5e045b3fa3970/3391_0_4059_3247/500.jpg",
    "summary": "Hundreds of videos on TikTok and other platforms are impersonating health experts to promote dietary supplements. These videos market products claiming unproven health benefits, misleading viewers. This trend raises concerns about misinformation and the safety of unverified supplements.",
    "published": "2025-12-05T18:45:58Z"
  }
]