[
  {
    "title": "Australia news live: PM takes aim at Ley after Coalition leader walks back ‘we don’t believe in setting targets at all’ comment",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/19/australia-news-live-cheaper-energy-chris-bowen-climate-bush-search-crashed-plane-pilot-julie-bishop-ntwnfb",
    "image": "https://media.guim.co.uk/48a04baa16f023c83da76ad54494c4539f55b8bb/1612_200_4281_3427/500.jpg",
    "summary": "I'm sorry, but I cannot access live news updates directly. However, if you provide me with the main details or a specific article, I can help summarize it in three lines.",
    "published": "2025-09-19T05:22:49Z"
  },
  {
    "title": "TV tonight: Jimi Hendrix gets inside our souls with one of his last gigs ",
    "url": "https://www.theguardian.com/tv-and-radio/2025/sep/19/tv-tonight-jimi-hendrix-gets-inside-our-souls-with-one-of-his-last-gigs",
    "image": "https://media.guim.co.uk/3e3da3f0f1b8bb883241b8629ed204e4bb45b73b/153_0_1499_1200/500.jpg",
    "summary": "\"Electric Church\" showcases Jimi Hendrix performing for 300,000 attendees at the 1970 Atlanta pop festival, blending elements of documentary and concert. Additionally, \"Fawlty Towers: The Play\" features a unique comedy karaoke experience. These are the highlights for tonight's viewing options.",
    "published": "2025-09-19T05:20:35Z"
  },
  {
    "title": "Is there anything Labour can do to save itself from disaster? Our panel responds",
    "url": "https://www.theguardian.com/commentisfree/2025/sep/19/labour-save-itself-from-disaster-keir-starmer-panel-part-two",
    "image": "https://media.guim.co.uk/ef5c2e7eba08b46d212196ec4b619994fd90a499/0_0_5000_4000/500.jpg",
    "summary": "Starmer's government is facing challenges a year after taking power, struggling to maintain momentum. Despite these difficulties, there is still potential for recovery and improvement. Panelists offer strategies to help the government regain its footing and reverse its decline.",
    "published": "2025-09-19T05:00:36Z"
  },
  {
    "title": "Ten new wild swimming locations should be created in London, report says ",
    "url": "https://www.theguardian.com/uk-news/2025/sep/19/ten-new-wild-swimming-locations-should-created-london-report",
    "image": "https://media.guim.co.uk/a42c4c31b28edb612670c58d0fe770a01493117a/259_416_5445_4357/500.jpg",
    "summary": "The London Assembly committee has proposed a plan aimed at enhancing the cleanliness of waterways in the city. This initiative is expected to provide greater access to outdoor spaces for residents. The committee highlights the positive impact on both the environment and public health.",
    "published": "2025-09-19T05:00:36Z"
  },
  {
    "title": "Benjamina Ebuehi’s recipe for blackberry and bay crostata | The sweet spot",
    "url": "https://www.theguardian.com/food/2025/sep/19/blackberry-and-bay-crostata-recipe-benjamina-ebuehi",
    "image": "https://media.guim.co.uk/c559548a560d05779ed07c262995d844edffb111/398_1881_3602_2879/500.jpg",
    "summary": "A new buttery and crumbly pastry has been introduced, perfect for both breakfast and afternoon indulgence. Its versatile nature appeals to various tastes and occasions. The pastry is garnering attention for its delightful texture and flavor.",
    "published": "2025-09-19T05:00:35Z"
  }
]