[
  {
    "title": "Northern Ireland 2-0 Slovakia, Sweden 0-2 Switzerland: World Cup qualifying clockwatch – live",
    "url": "https://www.theguardian.com/football/live/2025/oct/10/tuchel-criticises-silent-england-fans-world-cup-qualifying-news-and-more-football-live",
    "image": "https://media.guim.co.uk/bb47db6a5ef7edeb426acf0517b43bc1cd429554/540_0_4765_3813/500.jpg",
    "summary": "France, Germany, and Sweden are currently competing in World Cup qualifying matches. A live report is being provided by writers covering the latest updates and developments. Keep an eye on their performances as they strive for a spot in the tournament.",
    "published": "2025-10-10T21:12:29Z"
  },
  {
    "title": "Trump threatens 100% China tariffs as Beijing restricts rare-earth exports",
    "url": "https://www.theguardian.com/us-news/2025/oct/10/trump-china-tariffs",
    "image": "https://media.guim.co.uk/8e482f0db7c72148b29a33d4261daad28a938ca0/340_0_3407_2725/500.jpg",
    "summary": "The President has labeled China's recent actions as \"very hostile\" and suggested the possibility of implementing additional tariffs. He indicated that these tariffs could take effect on November 1 or even sooner. This statement reflects rising tensions between the U.S. and China over trade relations.",
    "published": "2025-10-10T21:11:36Z"
  },
  {
    "title": "‘Substantial’ federal layoffs begin as Congress remains deadlocked over funding to end shutdown – live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/10/letitia-james-donald-trump-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/84c7b03bccaa2922d85ef889e5129dcd2e773dba/475_0_5000_4000/500.jpg",
    "summary": "Several U.S. federal agencies, including the Treasury, Health and Human Services (HHS), Department of Homeland Security (DHS), and the Department of Education, have confirmed budget cuts. While no official figures have been released, the agencies are acknowledging reductions to their funding. These cuts may impact various programs and services supported by these departments.",
    "published": "2025-10-10T21:07:41Z"
  },
  {
    "title": "Tom Roebuck hat-trick sets up demolition as Sale pile further misery on Newcastle ",
    "url": "https://www.theguardian.com/sport/2025/oct/10/sale-newcastle-prem-rugby-union-match-report",
    "image": "https://media.guim.co.uk/84a0666278008b1ed16660b6d5cb35bff033c592/925_0_4507_3605/500.jpg",
    "summary": "Tom Roebuck scored a hat-trick to lead Sale to a decisive victory over Newcastle. This defeat marked Newcastle's third consecutive loss. Sale's performance highlighted their strong form in the match.",
    "published": "2025-10-10T21:07:13Z"
  },
  {
    "title": "A grand book heist, being outed as an IRA guy, and the desperate mishandling of the Israel-Gaza conflict",
    "url": "https://www.theguardian.com/australia-news/2025/oct/11/five-great-reads-israel-gaza-conflict-book-heist-ira-secret",
    "image": "https://media.guim.co.uk/088ce31a0278229e9b60d659f731bc81397f00f9/18_90_3037_2430/500.jpg",
    "summary": "Guardian Australia has released its weekend wrap, curated by Imogen Dewey, highlighting key news articles from the past week. The roundup covers various essential topics and events. It aims to inform readers of the most significant happenings in Australia and beyond.",
    "published": "2025-10-10T21:00:04Z"
  }
]