[
  {
    "title": "Australia politics live: Turnbull says Coalition energy policy dictated by ‘ideology and idiocy’ as Ley attacks Labor-Greens environment deal",
    "url": "https://www.theguardian.com/australia-news/live/2025/nov/27/australia-politics-live-barnaby-joyce-one-nation-pauline-hanson-environment-nature-bill-deal-coalition-greens-murray-watt-question-time-anthony-albanese-sussan-ley-ntwnfb",
    "image": "https://media.guim.co.uk/20697276e731af4de1661763372104394f672045/207_0_5627_4501/500.jpg",
    "summary": "Please provide the news article or details you want summarized, and I'll be happy to help!",
    "published": "2025-11-27T01:38:42Z"
  },
  {
    "title": "Washington DC shooting: suspect in attack on national guard members identified as Afghan national – latest updates",
    "url": "https://www.theguardian.com/us-news/live/2025/nov/26/us-politics-latest-news-pete-hegseth-donald-trump-marjorie-taylor-greene-mark-kelly",
    "image": "https://media.guim.co.uk/42c30be2f1ff5d700903ab87760336b46cd6514d/853_0_7200_5760/500.jpg",
    "summary": "A gunman ambushed troops in Washington, D.C., resulting in both guardsmen sustaining gunshot wounds. The assistant chief of the Metropolitan Police Department confirmed the incident. Both guardsmen are currently receiving medical treatment for their injuries.",
    "published": "2025-11-27T01:36:38Z"
  },
  {
    "title": "Temperatures to stay up to 8C above average for Queensland and northern NSW into next week after storms wreak havoc",
    "url": "https://www.theguardian.com/australia-news/2025/nov/27/heatwave-queensland-nsw-temperatures-above-8c-average-after-storms",
    "image": "https://media.guim.co.uk/5be8107b36ce0d1a3705ed55ebc789959ccfde7b/265_0_6716_5371/500.jpg",
    "summary": "The Bureau of Meteorology is urging people to remain indoors due to extreme heat conditions in Australia. Meanwhile, Sydney is still recovering from severe storms that resulted in thousands of calls to the State Emergency Service. Residents are advised to prioritize safety amid these challenging weather events.",
    "published": "2025-11-27T01:36:02Z"
  },
  {
    "title": "Tom Phillips case: New Zealand to hold public inquiry into disappearance of fugitive father and children",
    "url": "https://www.theguardian.com/world/2025/nov/27/tom-phillips-case-nz-new-zealand-public-inquiry-fugitive-father-ntwnfb",
    "image": "https://media.guim.co.uk/a5fe5a1fe9f2d82c3febda57c696640c22c892ba/209_0_1567_1253/500.jpg",
    "summary": "Private hearings will review if government agencies adequately ensured the safety and welfare of the Phillips children, as stated by the attorney general. The focus will be on evaluating the actions taken by these agencies. Outcomes from these hearings may influence future child protection policies.",
    "published": "2025-11-27T01:29:38Z"
  },
  {
    "title": "Perth pitch not the problem for England in first Ashes Test as it receives highest ICC rating",
    "url": "https://www.theguardian.com/sport/2025/nov/27/england-ashes-first-test-perth-pitch-not-the-problem",
    "image": "https://media.guim.co.uk/2c56c6ddc0c0feb519955ceae7f3ff1ad202fe39/81_0_3851_3081/500.jpg",
    "summary": "Optus Stadium's pitch has been praised for providing a balanced playing field for both batters and bowlers. Cricket Australia noted that effective bowling contributed to a dynamic and exciting match, resulting in an early outcome. The conditions fostered a competitive atmosphere, enhancing the overall viewing experience.",
    "published": "2025-11-27T01:27:07Z"
  }
]