[
  {
    "title": "Zelenskyy tells UN Putin is ‘trying everything’ to prolong Ukraine war; Trump says Nato can shoot down Russian aircraft – live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/23/donald-trump-unga-autism-tylenol-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/5bb83f1c449680ff2671e68d0bc21104a4fd40f6/552_1747_4952_3960/500.jpg",
    "summary": "Ukraine's president has urged China to reconsider its position regarding Russia amid ongoing tensions. Meanwhile, the US president has endorsed NATO members taking action against Russian aircraft that violate their airspace. This reflects growing international support for Ukraine in its conflict with Russia.",
    "published": "2025-09-23T23:25:29Z"
  },
  {
    "title": "Australia news live: Albanese meets world leaders at UN; new NSW police commissioner named",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/24/australia-news-live-anthony-albanese-new-york-united-nations-donald-trump-climate-crisis-palestine-israel-gaza-ntwnfb",
    "image": "https://media.guim.co.uk/9cbc16f6f681c618d15764d70a04cb253fd43ea3/893_0_4796_3837/500.jpg",
    "summary": "I'm sorry, but I need more specific information about the news you would like me to summarize since \"Follow live\" doesn't provide enough context. Please provide additional details or the main points of the news article.",
    "published": "2025-09-23T23:20:48Z"
  },
  {
    "title": "Dirty Looks review – room after room of utterly filthy fashion",
    "url": "https://www.theguardian.com/culture/2025/sep/24/dirty-looks-review-desire-and-decay-in-fashion-barbican-london",
    "image": "https://media.guim.co.uk/b59fc4b52adfe9cde2d618ceeca5dbd3e73d1d3f/0_1278_4639_3712/500.jpg",
    "summary": "Fashion designers are increasingly showcasing \"grimy\" styles, such as Balenciaga's £1,400 faux-filthy trainers and JordanLuca's urine-stained jeans. This trend embraces a raw and edgy aesthetic, celebrating imperfection on the catwalk. The overall effect is a provocative and enjoyable exploration of dirt and disarray in high fashion.",
    "published": "2025-09-23T23:02:07Z"
  },
  {
    "title": "Cold case solved? Dismembered female body parts reportedly ID’d after 80 years",
    "url": "https://www.theguardian.com/us-news/2025/sep/23/oregon-cold-case-oak-grove-jane-doe",
    "image": "https://media.guim.co.uk/e687635ed95c4b551680d2df65052761889bcc20/643_0_4320_3456/500.jpg",
    "summary": "Oregon state police announced that remains discovered along the Willamette River in April 1946 are believed to belong to a woman known as Oak Grove Jane Doe. The identification offers potential closure on a long-unsolved case. Authorities continue to investigate the details surrounding her death.",
    "published": "2025-09-23T22:48:30Z"
  },
  {
    "title": "Trump says he believes Ukraine can regain all land lost to Russia since 2022 invasion",
    "url": "https://www.theguardian.com/us-news/2025/sep/23/trump-ukraine-land-lost-russia-nato-oil-imports-un-speech",
    "image": "https://media.guim.co.uk/6be17520014401fdadcc16e6fe766cb94ba6246e/636_0_5000_4000/500.jpg",
    "summary": "US President asserts that Russia is facing significant economic challenges and urges NATO allies to cease imports of Russian oil. This call is part of a broader strategy to penalize Russia amid ongoing geopolitical tensions. The move aims to further isolate Russia economically in response to its actions.",
    "published": "2025-09-23T22:33:44Z"
  }
]