[
  {
    "title": "Australia politics live: Malarndirri McCarthy claims people behind ‘reprehensible’ Camp Sovereignty attack did not care if they were seen",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/02/australia-politics-live-labor-coalition-anthony-albanese-sussan-ley-question-time-cosmetic-surgery-tobacco-excise-ntwnfb",
    "image": "https://media.guim.co.uk/9df7ce6bc0221aef414c9af3597bbb13e6eb1d1e/611_0_6568_5255/500.jpg",
    "summary": "I'm sorry, but I need more specific details or content related to the news you'd like summarized. Please provide the information you'd like to see summarized.",
    "published": "2025-09-02T05:38:43Z"
  },
  {
    "title": "TV tonight: a former Liverpool player lifts the lid on a financial scandal",
    "url": "https://www.theguardian.com/tv-and-radio/2025/sep/02/tv-tonight-a-former-liverpool-player-lifts-the-lid-on-a-financial-scandal",
    "image": "https://media.guim.co.uk/5e4f055efd38e7776ca2b3a59d3b68dddee8f025/0_0_1350_1080/500.jpg",
    "summary": "Former Premier League players have uncovered stories about questionable dealings that resulted in significant financial losses. Additionally, a new season of \"The Great British Bake Off\" is set to premiere. Tune in this evening for both revelations and entertainment.",
    "published": "2025-09-02T05:20:28Z"
  },
  {
    "title": "‘Cosmic’ bioluminescent algae lights up Melbourne’s St Kilda beach",
    "url": "https://www.theguardian.com/environment/2025/sep/02/bioluminescent-algae-lights-up-melbourne-st-kilda-beach",
    "image": "https://media.guim.co.uk/e5fa29e331b5d9b41c7f9b61e3fc796dd7db700e/235_0_1707_1366/500.jpg",
    "summary": "First observed in Sydney in 1860, a unique marine phenomenon has gained prominence in Australia as ocean temperatures rise. Since the 1990s, this 'magical' occurrence has become increasingly frequent in the region's warming waters. Environmental changes are believed to be contributing to this growing phenomenon.",
    "published": "2025-09-02T05:16:19Z"
  },
  {
    "title": "Motorcyclist on shopping trip arrested amid Labour’s crackdown on undocumented migrants",
    "url": "https://www.theguardian.com/uk-news/2025/sep/02/motorcyclist-on-shopping-trip-arrested-london-amid-labours-crackdown-on-undocumented-migrants",
    "image": "https://media.guim.co.uk/ab15dd91d1cdec6ba469394a913fdb08dfce135a/0_0_5000_4000/500.jpg",
    "summary": "Fernando Fontoura, who relocated to the UK at the age of 12, has been detained during a crackdown aimed at identifying individuals working illegally as delivery drivers. Authorities are focusing on enforcing immigration laws in this sector. The operation reflects ongoing efforts to regulate the gig economy and prevent unlawful employment practices.",
    "published": "2025-09-02T05:00:29Z"
  },
  {
    "title": "Non-profit music collective launches festival in ‘rescue plan’ for UK gig circuit ",
    "url": "https://www.theguardian.com/culture/2025/sep/02/non-profit-collective-launches-festival-save-uk-live-music-scene",
    "image": "https://media.guim.co.uk/7f478150e601626492d28e72f025dfa551440458/628_0_4303_3442/500.jpg",
    "summary": "Organizers announced a collaborative event aimed at reducing costs by up to 40% for festival members. This initiative comes in response to the closure of 78 independent festivals last year. The co-ownership model seeks to enhance sustainability and support within the festival community.",
    "published": "2025-09-02T05:00:28Z"
  }
]