[
  {
    "title": "WTA Finals tennis: Elena Rybakina v Ekaterina Alexandrova, Iga Swiatek v Amanda Anisimova – live",
    "url": "https://www.theguardian.com/sport/live/2025/nov/05/wta-finals-tennis-elena-rybakina-v-ekaterina-alexandrova-iga-swiatek-v-amanda-anisimova-live",
    "image": "https://media.guim.co.uk/dd68764ae775cd7d20c8ffaa2eb169598fca3ee7/231_0_3642_2914/500.jpg",
    "summary": "Taha Hashim will be hosting coverage of the latest group-stage matches in the season-ending tournament. Fans can expect insightful commentary and updates. Don't miss out on the excitement as teams compete for a chance to advance.",
    "published": "2025-11-05T15:19:56Z"
  },
  {
    "title": "‘Not sure it was good for anybody’: Trump reacts to Democrats’ sweep of key races on election night – live",
    "url": "https://www.theguardian.com/us-news/live/2025/nov/05/zohran-mamdani-new-york-nyc-donald-trump-mayor-election-california-new-jersey-virginia-latest-news-results",
    "image": "https://media.guim.co.uk/abafc254af7a1f1d7132a44a085113c86ebe6c32/500_0_5000_4000/500.jpg",
    "summary": "The US president met with Republican leaders following significant electoral victories by Democrats in key races, including the New York City mayoral election and gubernatorial contests in Virginia and New Jersey. These wins indicate a shift in voter sentiment and may impact future political strategies. The discussions may focus on responses and adjustments in the wake of these electoral results.",
    "published": "2025-11-05T15:17:31Z"
  },
  {
    "title": "Second accidental release of prisoner ‘utterly unacceptable’, No 10 says, as Lammy blames system left by Tories – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/nov/05/david-lammy-pmqs-rachel-reeves-tax-system-news-updates-uk-politics-live",
    "image": "https://media.guim.co.uk/fdddec341bf1868c4f613e50d0d23524f159030b/197_0_969_775/500.jpg",
    "summary": "During Prime Minister's Questions, David Lammy, representing Keir Starmer, refrained from addressing inquiries regarding a recent wrongful release incident. His silence on the matter drew attention amidst ongoing scrutiny. The situation highlights the growing concerns over accountability within the government.",
    "published": "2025-11-05T15:16:26Z"
  },
  {
    "title": "Two people seriously injured and attacker arrested after car driven into pedestrians and cyclists on French island – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/nov/05/latest-europe-live-news-updates-brussels-drones-eu",
    "image": "https://media.guim.co.uk/67bcf4a3700d291558213aee26194cba3eb31808/365_0_4873_3898/500.jpg",
    "summary": "A car deliberately rammed into pedestrians and cyclists on Île d’Oléron, resulting in five injuries, including an aide to a far-right National Rally MP. Authorities are investigating the incident, which has raised concerns about public safety. The motives behind the attack remain unclear.",
    "published": "2025-11-05T15:15:33Z"
  },
  {
    "title": "Why the anger with Billie Eilish? You’re not allowed to say what we all know about billionaires … | Zoe Williams",
    "url": "https://www.theguardian.com/commentisfree/2025/nov/05/billie-eilish-billionaires-super-rich",
    "image": "https://media.guim.co.uk/530d018e874f28e570f52b7eecd02cd767743e32/262_0_2618_2094/500.jpg",
    "summary": "In her column, Zoe Williams argues that while the singer is generously donating millions, the standards for criticizing wealthy individuals are exceptionally restrictive. Consequently, very few people meet the criteria to express such criticism. This highlights a complex debate about wealth and philanthropy.",
    "published": "2025-11-05T15:12:46Z"
  }
]