[
  {
    "title": "Ryder Cup 2025: Europe look to extend lead over USA on day one – live updates",
    "url": "https://www.theguardian.com/sport/live/2025/sep/26/ryder-cup-2025-day-one-golf-europe-usa-bethpage-black-live",
    "image": "https://media.guim.co.uk/edc0a159ccb5b64ef5eb29bd87ecd3426d12560a/2300_63_4979_3983/500.jpg",
    "summary": "Europe begins their title defense at Bethpage Black with a strong performance, showcasing impressive play. Live updates provide hole-by-hole coverage of the action. Stay tuned for the latest developments from our writers.",
    "published": "2025-09-26T21:15:18Z"
  },
  {
    "title": "Owen Farrell ensures Saracens make it a flat start to Newcastle’s new Red Bull era",
    "url": "https://www.theguardian.com/sport/2025/sep/26/owen-farrell-ensures-saracens-make-it-a-flat-start-to-newcastles-new-red-bull-era",
    "image": "https://media.guim.co.uk/4793a5a92ba891d335775e67ea1e2716dce9c69c/630_38_3137_2510/500.jpg",
    "summary": "Owen Farrell scored 12 points in his second debut for Saracens, leading his team to a convincing 39-17 victory in the opening match of the Premiership. This win came despite Saracens facing a red card just two minutes into the game. The team showcased resilience in overcoming the early setback to secure the win.",
    "published": "2025-09-26T21:07:02Z"
  },
  {
    "title": "Democrats release tranche of Jeffrey Epstein records, including diaries and flight logs – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/26/james-comey-fbi-indictment-donald-trump-executive-orders-tariffs-us-politics-live",
    "image": "https://media.guim.co.uk/20f07dd53b3392c858bee1649b5d229fd1e34f8b/420_0_4774_3817/500.jpg",
    "summary": "Partially redacted documents have surfaced, naming prominent figures such as Steve Bannon, Peter Thiel, Elon Musk, and Prince Andrew. The context of these mentions remains unclear, raising questions about the implications for those involved. Further investigation into the contents and significance of the documents is anticipated.",
    "published": "2025-09-26T21:02:37Z"
  },
  {
    "title": "LA car wash owner sues for $50m after being slammed and detained in Ice raid",
    "url": "https://www.theguardian.com/us-news/2025/sep/26/los-angeles-car-wash-owner-ice-raid-lawsuit",
    "image": "https://media.guim.co.uk/cff1bae9021cd1e5a21b1fb2fe7c1fd3aaf9560c/0_158_844_675/500.jpg",
    "summary": "Rafie Ollah Shouhed, a 79-year-old US citizen, was detained for 12 hours after suffering from broken ribs and a traumatic brain injury. The incident has raised concerns about the conditions and treatment of individuals in custody. Details regarding the circumstances of his detention are still emerging.",
    "published": "2025-09-26T20:44:27Z"
  },
  {
    "title": "Meet the 75-year-old powerlifter headed to the world championships",
    "url": "https://www.theguardian.com/wellness/2025/sep/26/powerlifting-kate-evert-world-championships",
    "image": "https://media.guim.co.uk/798b5c4710a19921adfd261a185270e6e01b7b24/0_0_2500_2000/500.jpg",
    "summary": "Kate Evert began exercising to engage with her children, but has since discovered newfound confidence in her physical strength. Her fitness journey has transformed her self-image and empowerment. Now, she embraces her abilities both as a parent and individual.",
    "published": "2025-09-26T20:17:37Z"
  }
]