[
  {
    "title": "Canelo Álvarez v Terence Crawford: undisputed super middleweight championship – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/13/canelo-alvarez-v-terence-crawford-undisputed-super-middleweight-championship-live-buildup",
    "image": "https://media.guim.co.uk/8328f428cb509c6525b55953f3ad20294bbad89e/406_0_4064_3252/500.jpg",
    "summary": "Canelo Álvarez and Terence Crawford face off at Allegiant Stadium in a highly anticipated boxing match. This showdown is considered one of the biggest events in the sport in recent years. Follow Brian Graham's rolling report for live updates.",
    "published": "2025-09-14T05:28:42Z"
  },
  {
    "title": "TV tonight: Andrew Lincoln’s dark new drama will suck you in instantly",
    "url": "https://www.theguardian.com/tv-and-radio/2025/sep/14/tv-tonight-andrew-lincolns-dark-new-drama-will-suck-you-in-instantly",
    "image": "https://media.guim.co.uk/a3e3c596e30f12b608eb55ac8f139742ad57fc86/574_0_5000_4000/500.jpg",
    "summary": "A couple relocating to rural Scotland encounters unexpected challenges in the show \"Coldwater.\" Meanwhile, Rylan Clark and Rob Rinder embark on an adventurous exploration of India. Tune in this evening for these intriguing programs.",
    "published": "2025-09-14T05:20:24Z"
  },
  {
    "title": "What do the immigration figures for the UK really show?",
    "url": "https://www.theguardian.com/uk-news/2025/sep/14/what-do-the-immigration-figures-for-the-uk-really-show",
    "image": "https://media.guim.co.uk/db2fbf4219fa50c75eb772fbd16689cfff096e1d/500_0_5000_4000/500.jpg",
    "summary": "Despite official figures showing a decline in net migration, concern among British citizens about immigration is at a near-record high, according to polling data since 1974. Many people remain anxious about the impact of migration on jobs, public services, and social cohesion. This discrepancy highlights ongoing public sentiment that may not align with governmental statistics.",
    "published": "2025-09-14T05:00:27Z"
  },
  {
    "title": "‘I’m in my sod-it era’: Sophie Ellis-Bextor on speaking up, suing the tabloids and finding power in perimenopause",
    "url": "https://www.theguardian.com/music/2025/sep/14/sophie-ellis-bextor-interview-career-perimenopause-suing-tabloids-saltburn",
    "image": "https://media.guim.co.uk/6e656f5a5622231b3b3d548110ae86c9f545089e/754_402_3546_2837/500.jpg",
    "summary": "The singer's kitchen discos and a notable scene in *Saltburn* have propelled her career to new heights. She is embracing this resurgence by releasing an album focused on the theme of perimenopause. This creative direction highlights her personal experiences during this midlife phase.",
    "published": "2025-09-14T05:00:26Z"
  },
  {
    "title": "I’m ashamed of my daughter’s messy garden. Should I say something?",
    "url": "https://www.theguardian.com/lifeandstyle/2025/sep/14/im-ashamed-of-my-daughters-messy-garden-should-i-say-something",
    "image": "https://media.guim.co.uk/3c967e9db66946ed0bf7a09256ccfc1e371489a0/0_0_5000_4000/500.jpg",
    "summary": "The news highlights that parental concern for a daughter often stems from a place of care, but encourages parents to examine the underlying reasons for their feelings. Understanding these motivations can lead to healthier dynamics and support for the daughter. Self-reflection is emphasized as a key step for caregivers.",
    "published": "2025-09-14T05:00:26Z"
  }
]