[
  {
    "title": "Strictly Come Dancing: week three – live",
    "url": "https://www.theguardian.com/tv-and-radio/live/2025/oct/11/strictly-come-dancing-week-three-live",
    "image": "https://media.guim.co.uk/e7d7b8ea2c7a95b1c3b033a900717b99897e6079/382_0_3818_3055/500.jpg",
    "summary": "It's Movie Week, featuring music from films like Miss Congeniality, James Bond, K-Pop Demon Hunters, and Mary Poppins for the stars to dance to. The excitement raises the question of which performances will fail and which will shine. Anticipation builds around who will achieve box office success during this entertaining event.",
    "published": "2025-10-11T17:14:03Z"
  },
  {
    "title": "Hull KR v Wigan Warriors: Super League Grand Final – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/11/rugby-league-hull-kr-wigan-warriors-super-league-grand-final-live",
    "image": "https://media.guim.co.uk/674a7932d3ef4c95fec6a61d52553c4c2eb97fc7/43_0_2648_2118/500.jpg",
    "summary": "The league leaders face off against the reigning champions in a highly anticipated match, with both teams aiming to make history. Luke McLaughlin will provide live minute-by-minute coverage of the event. Fans can expect an intense showdown as the teams vie for supremacy.",
    "published": "2025-10-11T17:13:03Z"
  },
  {
    "title": "No survivors in Tennessee explosives factory blast, officials say",
    "url": "https://www.theguardian.com/us-news/2025/oct/11/no-survivors-tennessee-explosives-factory",
    "image": "https://media.guim.co.uk/9d7fec78caf9d9602bdddbfd8ade275c3c1aeb27/490_0_3883_3107/500.jpg",
    "summary": "The initial death toll from explosions at a plant near McEwen on Friday was reported as 19, but this figure has since been revised. Specific details about the adjusted toll or the cause of the explosions have not been provided. Emergency services continue to respond to the incident.",
    "published": "2025-10-11T17:08:45Z"
  },
  {
    "title": "Hamas official says disarmament ‘out of the question’; Israel prepares prisoners for exchange – live",
    "url": "https://www.theguardian.com/world/live/2025/oct/11/israel-gaza-ceasefire-hamas-hostages-netanyahu-trump-middle-east-latest-news-updates",
    "image": "https://media.guim.co.uk/373bb91e694a157d575f69e59bb39001116b511f/704_0_6250_5000/500.jpg",
    "summary": "Under the truce deal, Israel is set to release prisoners, some of whom are serving life sentences for lethal attacks, as part of an exchange for hostages. This agreement aims to ease tensions and facilitate negotiations between the involved parties. The deal marks a significant step in addressing the ongoing conflict and humanitarian concerns.",
    "published": "2025-10-11T17:07:17Z"
  },
  {
    "title": "England ease to 89-run win over Sri Lanka: Women’s Cricket World Cup – as it happened",
    "url": "https://www.theguardian.com/sport/live/2025/oct/11/england-v-sri-lanka-womens-cricket-world-cup-live",
    "image": "https://media.guim.co.uk/d91544b1b67b0b058af9a9bac5d2d421958d329b/488_0_3302_2641/500.jpg",
    "summary": "England secured their third consecutive win, driven by outstanding performances from Nat Sciver-Brunt and Sophie Ecclestone. Their impressive contributions were pivotal in the team's success. The win reflects England's strong form in the competition.",
    "published": "2025-10-11T17:04:50Z"
  }
]