[
  {
    "title": "Reform councillor defects to Tories after party’s policies left him ‘uncomfortable’",
    "url": "https://www.theguardian.com/politics/2025/nov/01/reform-councillor-defects-to-tories-after-partys-policies-left-him-uncomfortable",
    "image": "https://media.guim.co.uk/99f4d4a3c6a6ea30c798ddc3defacb4c8f34807c/389_157_6684_5347/500.jpg",
    "summary": "Dartford representative James Buchan expressed concerns over new immigration plans, describing them as \"devastating.\" He noted that these policies have generated significant fear and anxiety among the local community. Buchan's remarks highlight the broader impact of immigration policy changes on residents.",
    "published": "2025-11-01T10:13:35Z"
  },
  {
    "title": "Premier League buildup, Earps book revelations and more – matchday live ",
    "url": "https://www.theguardian.com/football/live/2025/nov/01/premier-league-buildup-earps-book-revelations-and-more-matchday-live",
    "image": "https://media.guim.co.uk/3fb7834f63dbb643b558df45f2d4daf3ae3be9fe/867_0_6010_4812/500.jpg",
    "summary": "Billy Munday will host a session featuring news, previews, and discussions. The focus will be on gearing up for an exciting day of events. Expect to engage with key insights and analyses in preparation for the day's action.",
    "published": "2025-11-01T10:06:19Z"
  },
  {
    "title": "Labor activist takes on Teamsters leader allying with Trump: ‘He doesn’t represent the workers’",
    "url": "https://www.theguardian.com/us-news/2025/nov/01/teamsters-union-leadership-trump",
    "image": "https://media.guim.co.uk/47b033bfdf29ca7990d586ec555344d9b335258a/0_0_3000_2400/500.jpg",
    "summary": "Richard Hooker Jr. is campaigning to succeed Sean O’Brien as president of the Teamsters International union, a position previously held by a Trump ally. His candidacy marks a significant shift in union leadership dynamics. The election will determine the future direction of the influential labor organization.",
    "published": "2025-11-01T10:00:34Z"
  },
  {
    "title": "Ex-Tory member sues party over suspension for criticising Israel",
    "url": "https://www.theguardian.com/politics/2025/nov/01/ex-tory-member-grandfather-archbishop-of-jerusalem-sues-party-bruce-macinnes",
    "image": "https://media.guim.co.uk/2c32f47141464feb553951a29a198981191b2466/307_0_3200_2560/500.jpg",
    "summary": "Bruce MacInnes, the grandson of a former archbishop of Jerusalem, faced allegations of antisemitism due to his comments regarding genocide. The remarks have sparked controversy and debate on their implications and historical context. MacInnes's statements have drawn attention to the sensitive nature of discussions surrounding historical events and their interpretations.",
    "published": "2025-11-01T10:00:33Z"
  },
  {
    "title": "Crispy chicken and pancetta with a nutty apple salad: Thomasina Miers’ Sunday best recipes",
    "url": "https://www.theguardian.com/food/2025/nov/01/crispy-chicken-pancetta-nutty-apple-salad-recipes-thomasina-miers",
    "image": "https://media.guim.co.uk/bb895f092feaaff56e26b3afd64764468119e93a/0_1466_3648_2918/500.jpg",
    "summary": "A delicious dish features crisp chicken paired with sweet onions, fragrant rosemary, and salty pancetta. It is complemented by a sweet-sour apple salad that includes pickled red onion and hazelnuts. The combination offers a delightful mix of flavors and textures.",
    "published": "2025-11-01T10:00:32Z"
  }
]