[
  {
    "title": "Australia v England: Ashes first Test, day two – live",
    "url": "https://www.theguardian.com/sport/live/2025/nov/22/australia-vs-england-live-ashes-first-1st-test-day-two-aus-v-eng-cricket-scores-updates-perth",
    "image": "https://media.guim.co.uk/264763da0913c0d83d8710c3505fca7d04f4822c/327_0_3063_2449/500.jpg",
    "summary": "The tourists hold a 40-run lead entering the second innings of the series opener in Perth. The match is progressing with updates provided by our writers. Stay tuned for more developments.",
    "published": "2025-11-22T05:18:20Z"
  },
  {
    "title": "Trump calls Marjorie Taylor Greene resignation ‘great news for the country’",
    "url": "https://www.theguardian.com/us-news/2025/nov/21/trump-marjorie-taylor-greene",
    "image": "https://media.guim.co.uk/04f685b836e070d800677718bac074a93fb6e44d/211_0_2094_1675/500.jpg",
    "summary": "President expressed support for a Democratic colleague, stating, \"I think she should be happy,\" in response to her stance on the Epstein files. The colleague received praise for her commitment to transparency regarding the controversial documents. This endorsement emphasizes the significance of the issue within the party.",
    "published": "2025-11-22T05:07:45Z"
  },
  {
    "title": "The ‘Danish model’ is the darling of centre-left parties like Labour. The problem is, it doesn’t even work in Denmark | Cas Mudde",
    "url": "https://www.theguardian.com/commentisfree/2025/nov/22/danish-model-centre-left-parties-labour-doesnt-work",
    "image": "https://media.guim.co.uk/46e105f6f86f3502b755d8be0e170c93637e45ab/173_0_4204_3365/500.jpg",
    "summary": "Cas Mudde emphasizes that the recent local elections highlight the pitfalls for social democrats when they shift towards more conservative positions. He argues that this strategic move is misguided and detrimental to their electoral success. The elections serve as a crucial reminder of the importance of staying true to progressive values.",
    "published": "2025-11-22T05:00:31Z"
  },
  {
    "title": "Sycamore Gap tree saplings to be planted across UK ",
    "url": "https://www.theguardian.com/environment/2025/nov/22/sycamore-gap-tree-saplings-planted-trees-of-hope",
    "image": "https://media.guim.co.uk/505fc4598e07049de4bea0dc35735f0e830c416b/418_167_2760_2207/500.jpg",
    "summary": "The National Trust has initiated the planting of 49 \"trees of hope\" to commemorate an illegally felled tree. This project aims to ensure the legacy of the fallen tree lives on in a positive manner. The initiative underscores a commitment to environmental restoration and community engagement.",
    "published": "2025-11-22T05:00:31Z"
  },
  {
    "title": "Control of HIV, TB and malaria at risk after global health fund donations fall",
    "url": "https://www.theguardian.com/global-development/2025/nov/22/control-of-hiv-tb-and-malaria-at-risk-after-global-health-fund-donations-fall",
    "image": "https://media.guim.co.uk/f8e53712f680ca837dab7d8d86b96e8ab473d16b/917_0_4583_3667/500.jpg",
    "summary": "At a recent pledging summit, major past donors such as France, Japan, and the European Commission did not contribute funds. Their absence raised concerns about financial support for ongoing initiatives. This lack of pledges may impact future projects reliant on international aid.",
    "published": "2025-11-22T05:00:30Z"
  }
]