[
  {
    "title": "New Zealand v Australia: men’s second T20 international cricket – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/03/new-zealand-v-australia-mens-second-t20-international-cricket-live",
    "image": "https://media.guim.co.uk/2fcad06313c3532f8b70043d56b2bd608b2ec03d/409_0_5000_4000/500.jpg",
    "summary": "Australia aims to secure the trans-Tasman series with a second match following their dominant victory in the first. Live updates and commentary are provided by Angus Fontaine. Fans are eager to see if Australia can maintain their strong performance.",
    "published": "2025-10-03T07:14:36Z"
  },
  {
    "title": "Manchester synagogue victims named as home secretary says attacker was not known to police – latest",
    "url": "https://www.theguardian.com/uk-news/live/2025/oct/03/manchester-synagogue-attack-victims-adrian-daulby-melvin-cravitz-attacker-jihad-al-shamie-latest-news-updates",
    "image": "https://media.guim.co.uk/4cd47656fac36049168224f7df125f4eba0d29ff/261_0_3289_2632/500.jpg",
    "summary": "An attacker used a car to smash into a synagogue in Crumpsall, leading to a brutal six-minute rampage where several worshippers were stabbed. The incident resulted in the deaths of two men. Authorities are investigating the attack, which has shocked the local community.",
    "published": "2025-10-03T07:12:02Z"
  },
  {
    "title": "Oil on track for biggest weekly fall since June, but fuel prices creep up – business live",
    "url": "https://www.theguardian.com/business/live/2025/oct/03/oil-price-weekly-fall-opec-fuel-services-sector-no-non-farm-business-live-news",
    "image": "https://media.guim.co.uk/4823c09ce35e910ea801f8e91f0c59d1322c4ef9/855_0_4275_3420/500.jpg",
    "summary": "Today's rolling coverage highlights significant updates in the economic and financial sectors, including market fluctuations, key economic indicators, and central bank decisions. Analysts discuss the implications of recent data on inflation and employment rates. Investors are closely monitoring these developments for potential impacts on global markets.",
    "published": "2025-10-03T07:11:56Z"
  },
  {
    "title": "Wetherspoon’s boss vows to keep price rises to a minimum as he criticises energy bills ",
    "url": "https://www.theguardian.com/business/2025/oct/03/wetherspoons-price-rises-energy-bills-packaging-tax-tim-martin",
    "image": "https://media.guim.co.uk/1e68f38639f087315d3185d18924b4c07d9f6618/0_299_4626_3701/500.jpg",
    "summary": "Tim Martin, the chairman of a pub chain, reports that a strengthened packaging tax will raise the company's costs from the levy to £2.4 million annually. He highlights the significant financial burden this increase will impose on the business. The announcement comes amid ongoing discussions about sustainability and environmental regulations in the industry.",
    "published": "2025-10-03T07:06:44Z"
  },
  {
    "title": "Taylor Swift’s Charli xcx hit job misses the point – and underscores her tedious obsession with conflict",
    "url": "https://www.theguardian.com/music/2025/oct/03/taylor-swifts-charli-xcx-hit-job-misses-the-point-and-underscores-her-tedious-obsession-with-conflict",
    "image": "https://media.guim.co.uk/e4ce3c098f8af9d0eb613e829455d46a03657fba/0_0_3000_2400/500.jpg",
    "summary": "Charli recently shared her anxieties regarding Swift on Brat, highlighting her feelings about the situation. Swift's clumsy reaction reveals a lack of personal growth and suggests a vengeful attitude. This missed opportunity for understanding underscores tensions between the two artists.",
    "published": "2025-10-03T07:00:29Z"
  }
]