[
  {
    "title": "Australia news live: two boys fatally stabbed in Melbourne in suspected targeted attacks; praise for NSW koala park and logging ban",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/07/australia-news-live-melbourne-stabbing-nsw-koala-national-park-logging-anthony-albanese-sussan-ley-immigration-ntwnfb",
    "image": "https://media.guim.co.uk/dfaeec39b6c3460bd13df5201b7631ba7daa9228/921_0_6438_5153/500.jpg",
    "summary": "I'm sorry, but I need more information about the news you want summarized. Please provide the details or text, and I'll be happy to help!",
    "published": "2025-09-06T23:23:06Z"
  },
  {
    "title": "West Point cancels ceremony to honor Tom Hanks as ‘outstanding US citizen’",
    "url": "https://www.theguardian.com/us-news/2025/sep/06/west-point-cancels-tom-hanks-ceremony",
    "image": "https://media.guim.co.uk/122bdcd8c9c949d660a95d97b6b51f4ef7258cea/603_0_5000_4000/500.jpg",
    "summary": "Tom Hanks, an advocate for military memorials, has made a recent decision that lacks clarity. Despite his support for the initiatives, he also cast his vote for Biden. The specifics of the decision remain undisclosed.",
    "published": "2025-09-06T22:48:16Z"
  },
  {
    "title": "US Open tennis 2025: Aryna Sabalenka beats Amanda Anisimova in women’s singles final – as it happened",
    "url": "https://www.theguardian.com/sport/live/2025/sep/06/us-open-tennis-2025-aryna-sabalenka-amanda-anisimova-womens-singles-final-live",
    "image": "https://media.guim.co.uk/4d8f09a93ed20b83dd6374ed93e8baf084130d90/700_0_4626_3703/500.jpg",
    "summary": "Aryna Sabalenka successfully defended her US Open title by defeating Amanda Anisimova, who struggled with consistency throughout the match. This victory marks Anisimova's second consecutive loss in a major final. Sabalenka's strong performance showcased her ability to remain composed under pressure.",
    "published": "2025-09-06T22:32:01Z"
  },
  {
    "title": "Aryna Sabalenka sweeps aside Amanda Anisimova to retain US Open title",
    "url": "https://www.theguardian.com/sport/2025/sep/06/aryna-sabalenka-sweeps-aside-amanda-anisimova-to-retain-us-open-title",
    "image": "https://media.guim.co.uk/d0bb7ecd7753cd9e4a8ae755facdffd136e9e6d0/821_0_4525_3620/500.jpg",
    "summary": "Aryna Sabalenka won her second consecutive US Open title by defeating Amanda Anisimova with a score of 6-3, 7-6 (3) in the final. The match showcased Sabalenka's strong performance, particularly in the tiebreak of the second set. This victory solidifies her position as a top contender in women's tennis.",
    "published": "2025-09-06T22:18:33Z"
  },
  {
    "title": "Fuze review – twisty London-set heist thriller should have stolen some personality",
    "url": "https://www.theguardian.com/film/2025/sep/06/fuze-review-london-heist-thriller",
    "image": "https://media.guim.co.uk/4defcbcf91126a25618ec2e11d1f21549d7e42d5/141_0_6942_5557/500.jpg",
    "summary": "Scottish director David Mackenzie has cast Aaron Taylor-Johnson and Theo James in a new film featuring a plot filled with double-crossing. Despite its intriguing premise, the movie lacks visual flair and stylistic depth. The film aims to deliver a thrilling narrative but may fall short in execution.",
    "published": "2025-09-06T21:38:00Z"
  }
]