[
  {
    "title": "Celtic v Rangers: Scottish League Cup semi-final – live",
    "url": "https://www.theguardian.com/football/live/2025/nov/02/celtic-v-rangers-scottish-league-cup-semi-final-live",
    "image": "https://media.guim.co.uk/9480d933dab3a7891fd9e7292a4d2ea97f00826a/164_79_2077_1661/500.jpg",
    "summary": "Billy Munday provides a minute-by-minute report on the anticipated clash between the struggling Old Firm sides, highlighting the stakes as they compete for a spot in the final. The tension builds as fans await to see which team will emerge victorious. Stay tuned for live updates on this exciting matchup.",
    "published": "2025-11-02T15:17:23Z"
  },
  {
    "title": "West Ham v Newcastle: Premier League – live",
    "url": "https://www.theguardian.com/football/live/2025/nov/02/west-ham-v-newcastle-premier-league-live-updates",
    "image": "https://media.guim.co.uk/8f5fb5d7ff626f4b7aca005db19a5dbd54ba2c9e/1908_613_1012_810/500.jpg",
    "summary": "West Ham faces off against Newcastle in a crucial match as they continue to struggle in the league. John Brewin provides minute-by-minute updates on the game. Fans hope for a turnaround in fortunes for the Hammers.",
    "published": "2025-11-02T15:16:42Z"
  },
  {
    "title": "Cambridgeshire train stabbing: suspects both British and ‘nothing to suggest’ attack was terrorism, say police – latest updates",
    "url": "https://www.theguardian.com/uk-news/live/2025/nov/02/cambridgeshire-train-stabbing-life-threatening-injuries-arrests-latest-updates",
    "image": "https://media.guim.co.uk/c64113b57144b27bf5bd5799829b195ed0b3600b/0_0_3471_2777/500.jpg",
    "summary": "Two men have been arrested on suspicion of attempted murder following an incident that left two individuals in life-threatening condition. Authorities are investigating the circumstances surrounding the event. The situation is ongoing as law enforcement gathers more information.",
    "published": "2025-11-02T15:13:15Z"
  },
  {
    "title": "India v South Africa: Women’s Cricket World Cup final – live",
    "url": "https://www.theguardian.com/sport/live/2025/nov/02/india-v-south-africa-womens-cricket-world-cup-final-live",
    "image": "https://media.guim.co.uk/b974cf3e4c050f576a34ca2464168124b628e8fc/186_103_1253_1001/500.jpg",
    "summary": "An over-by-over report is underway, focusing on the suspenseful competition as teams vie for the trophy. Writers are providing insights and updates on the match. Fans are eagerly awaiting the announcement of the new champion.",
    "published": "2025-11-02T15:09:29Z"
  },
  {
    "title": "Hiking with the wildlife author who studies Yosemite’s high peaks: ‘These animals are equal to us’ ",
    "url": "https://www.theguardian.com/us-news/2025/nov/02/beth-pratt-yosemite-author-wildlife",
    "image": "https://media.guim.co.uk/680dd167f9ea330dc2880351dadd50f26823a9e3/0_1293_3067_2453/500.jpg",
    "summary": "Beth Pratt draws inspiration from childhood encyclopedias and Jane Goodall to explore over 150 species in a national park. Her writing immerses readers in the unique and diverse ecosystem of the park. Through her work, she highlights the importance of wildlife and conservation.",
    "published": "2025-11-02T15:00:05Z"
  }
]