[
  {
    "title": "Joint committee on national security strategy to hold inquiry into collapse of China spy trial, MPs told – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/oct/16/china-spy-case-cps-keir-starmer-uk-politics-latest-news-updates",
    "image": "https://media.guim.co.uk/4d0b92f01b9c9c2d63c06628925c737334c455ab/311_0_1725_1380/500.jpg",
    "summary": "An inquiry will involve the chairs of the home affairs, foreign affairs, and justice committees. These leaders will play a significant role in overseeing the investigation. Their participation underscores the importance of the issues being examined.",
    "published": "2025-10-16T10:20:37Z"
  },
  {
    "title": "Women’s Cricket World Cup: Australia v Bangladesh – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/16/womens-cricket-world-cup-australia-v-bangladesh-live",
    "image": "https://media.guim.co.uk/722564bb2069558c8a009261fd1f3ca47a345bbd/706_0_4389_3512/500.jpg",
    "summary": "Australia has secured their spot in the finals during a 50-over match in Visakhapatnam. Updates were provided in an over-by-over format, detailing the game's progress. Megan Maurice was covering the match live as Australia showcased their dominance.",
    "published": "2025-10-16T10:19:10Z"
  },
  {
    "title": "Gaza ceasefire live: Hamas says it has returned all hostage bodies it can reach for now",
    "url": "https://www.theguardian.com/world/live/2025/oct/16/gaza-ceasefire-israel-hamas-palestine-rafah-hostages-live-news-updates",
    "image": "https://media.guim.co.uk/858fe899e1bcea685c54f64b3eef04136435f2e7/164_0_5558_4449/500.jpg",
    "summary": "A militant group has stated that it is unable to recover additional remains from the ruins in Gaza due to a lack of specialized equipment. They emphasized the need for proper tools to continue their efforts. This highlights the challenges faced in recovering bodies amid the ongoing conflict in the region.",
    "published": "2025-10-16T10:16:18Z"
  },
  {
    "title": "French PM survives no-confidence vote – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/oct/16/france-no-confidence-debate-lecornu-macron-europe-live-news-updates",
    "image": "https://media.guim.co.uk/a9b4c627977b39d4c3b184113dcd73cad1fd2ead/781_0_5000_4000/500.jpg",
    "summary": "Sébastien Lecornu and his government received limited support from lawmakers following their concessions on pension reforms. This approval comes amid ongoing debates about the country's pension system. The narrow backing suggests continued challenges for the government in gaining broader consensus.",
    "published": "2025-10-16T10:07:07Z"
  },
  {
    "title": "We are told the ‘war’ against Gaza is finally ‘over’. Is it? | Arwa Mahdawi",
    "url": "https://www.theguardian.com/commentisfree/2025/oct/16/is-gaza-war-over",
    "image": "https://media.guim.co.uk/16aee8474a644265bb74e1f68c3553c7691c07dc/929_0_5000_4000/500.jpg",
    "summary": "The speaker expresses that the situation should not be viewed as a conventional war, emphasizing that it's an ongoing conflict rather than a concluded one. They refrain from celebrating the current status, indicating a belief that many issues remain unresolved. The sentiment conveys a sense of caution and ongoing concern regarding the situation.",
    "published": "2025-10-16T10:00:05Z"
  }
]