[
  {
    "title": "Manchester United v Everton: Premier League – live",
    "url": "https://www.theguardian.com/football/live/2025/nov/24/manchester-united-v-everton-premier-league-live",
    "image": "https://media.guim.co.uk/64a7a54dfba287f12984055461aa6a9c561063da/334_0_3072_2457/500.jpg",
    "summary": "David Moyes returns to Old Trafford as Everton faces Manchester United in an anticipated match. The game is being reported minute-by-minute by Michael Butler. Fans are eager to see the outcome of this clash between the two teams.",
    "published": "2025-11-24T20:22:47Z"
  },
  {
    "title": "Australia politics live: boost for national domestic violence helpline after huge increase in calls for help",
    "url": "https://www.theguardian.com/australia-news/live/2025/nov/25/australia-politics-live-anthony-albanese-sussan-ley-tanya-plibersek-domestic-violence-helpline-pauline-hanson-burqa-net-zero-labor-coalition-greens-question-time-ntwnfb",
    "image": "https://media.guim.co.uk/64d26f8adbdee3de2fb6158e501eb65d544ac956/373_0_3728_2983/500.jpg",
    "summary": "Please provide the news article or information you'd like me to summarize!",
    "published": "2025-11-24T20:21:14Z"
  },
  {
    "title": "Former Phoenix news anchor sentenced to 10 years for $63m fraud in Covid relief scheme",
    "url": "https://www.theguardian.com/us-news/2025/nov/24/former-phoenix-news-anchor-covid-relief-fraud",
    "image": "https://media.guim.co.uk/0c5b8052648527bbcd99684513c54288d43deb45/492_591_2487_1990/500.jpg",
    "summary": "Stephanie Hockridge and her husband were charged with fraud for allegedly falsifying information to secure Paycheck Protection Program (PPP) loans backed by the U.S. Small Business Administration. The couple is accused of providing misleading details about their business finances to obtain the funds. Federal authorities are taking action to hold them accountable for the fraudulent activities.",
    "published": "2025-11-24T20:20:21Z"
  },
  {
    "title": "Judge rebukes Trump’s prosecutor over James Comey and Letitia James charges – live",
    "url": "https://www.theguardian.com/us-news/live/2025/nov/24/us-politics-trump-venezuela-marjorie-tayor-greene-latest-updates",
    "image": "https://media.guim.co.uk/439b90ba5c7b7795d593395e4951394d522673bf/229_0_4252_3401/500.jpg",
    "summary": "District Judge Cameron McGowan Currie ruled that Lindsey Halligan lacked the lawful authority to present indictments to former FBI Director James Comey and another individual. This decision highlights the legal limitations on Halligan's actions related to the indictments. The ruling has implications for the ongoing legal proceedings and Halligan's role in them.",
    "published": "2025-11-24T20:17:57Z"
  },
  {
    "title": "Gibb says speculation of BBC boardroom coup is ‘ridiculous charge’ and he will not resign – as it happened",
    "url": "https://www.theguardian.com/media/live/2025/nov/24/bbc-board-mps-select-committee-latest-updates",
    "image": "https://media.guim.co.uk/d80c0420c0820b76642573cb826306e1910205b7/487_0_2456_1965/500.jpg",
    "summary": "A BBC board member, previously a spin doctor for Theresa May, rejected suggestions made during questioning by MPs. The comments came amidst scrutiny of the BBC's governance and transparency. The board member stood firm in defending the organization's practices against the MPs' inquiries.",
    "published": "2025-11-24T20:17:02Z"
  }
]