[
  {
    "title": "WTA Finals tennis: Jessica Pegula v Elena Rybakina in semi-finals – live",
    "url": "https://www.theguardian.com/sport/live/2025/nov/07/wta-finals-tennis-rybakina-pegula-sabalenka-anisimova-live",
    "image": "https://media.guim.co.uk/9167f723b02a6f5c84fe619c0edc4a2bcb730df9/673_0_8100_6482/500.jpg",
    "summary": "Niall McVeigh will host the semi-finals of the season-ending tournament in Riyadh. The event showcases top competitors as they vie for a place in the finals. Fans can expect an exciting showdown at this prestigious tournament.",
    "published": "2025-11-07T16:18:19Z"
  },
  {
    "title": "Trump administration seeks emergency pause of court order to fully fund November food stamp benefits – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/nov/07/donald-trump-government-shutdown-air-traffic-flights-snap-viktor-orban-hungary-ukraine-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/eb12a26fde4ec35ca60e4974e737959eb4e2ba4d/837_0_5818_4654/500.jpg",
    "summary": "A judge has mandated the U.S. government to completely finance SNAP (Supplemental Nutrition Assistance Program) benefits by Friday. This decision aims to ensure low-income families have access to necessary food assistance. The government's compliance with the ruling follows concerns about potential disruptions in support.",
    "published": "2025-11-07T16:15:49Z"
  },
  {
    "title": "Trump loyalist Elise Stefanik announces run for New York governor",
    "url": "https://www.theguardian.com/us-news/2025/nov/07/elise-stefanik-new-york-governor",
    "image": "https://media.guim.co.uk/6de324dfb9c2da81689c478bdebe13446f3518d6/637_0_6392_5114/500.jpg",
    "summary": "A self-proclaimed 'ultra-Maga' Republican representative has intensified criticism of Democratic Governor Kathy Hochul. The representative's attacks focus on various policy issues and governance. This marks a significant point in the political landscape as upcoming elections approach.",
    "published": "2025-11-07T16:12:07Z"
  },
  {
    "title": "Stock markets drop amid jitters over US economy and tech valuations – business live",
    "url": "https://www.theguardian.com/business/live/2025/nov/07/itv-talks-sell-broadcasting-arm-sky-shares-bank-of-england-stock-markets-business-live",
    "image": "https://media.guim.co.uk/72e9e4c8988aad0fde0886031ed0f550a6315342/0_0_5953_4762/500.jpg",
    "summary": "The Nasdaq is set to experience its worst weekly performance since March, reflecting significant market declines. Factors contributing to this downturn include investor concerns and economic uncertainties. Analysts are closely monitoring the situation as it unfolds.",
    "published": "2025-11-07T16:11:11Z"
  },
  {
    "title": "Tuchel open to England extension; Spurs supporting Udogie after ‘terrible situation’: football news – live",
    "url": "https://www.theguardian.com/football/live/2025/nov/07/thomas-tuchel-england-squad-jude-bellingham-weekend-team-news-and-more-football-live",
    "image": "https://media.guim.co.uk/ebb76a84122a9c852e04c56d3cdf2cb839d2ada5/1915_62_5548_4437/500.jpg",
    "summary": "England manager Thomas Tuchel has announced his latest squad ahead of a busy weekend filled with Premier League matches. The squad selection is anticipated to impact team dynamics and performances. Fans are eager to see how the players will perform in the upcoming fixtures.",
    "published": "2025-11-07T16:10:30Z"
  }
]