[
  {
    "title": "Premier League top scorers 2025-26: who is leading race for golden boot?",
    "url": "https://www.theguardian.com/football/2025/sep/15/premier-league-top-scorers-2025-26-who-is-leading-race-for-golden-boot",
    "image": "https://media.guim.co.uk/7467a90a5a415f45959903d6d1b0c6942de5a2ce/1263_152_3876_3100/500.jpg",
    "summary": "This season, the English top flight's goalscoring charts are dominated by high-performing players showcasing their scoring prowess. These standout athletes are not only etching their names in the record books but also significantly impacting their teams' performances. Fans and analysts are closely monitoring this exciting race for the Golden Boot.",
    "published": "2025-11-09T23:12:38Z"
  },
  {
    "title": "The Mushroom Tapes review – Erin Patterson through the eyes of Helen Garner, Chloe Hooper and Sarah Krasnostein",
    "url": "https://www.theguardian.com/books/2025/nov/10/mushroom-tapes-book-review-erin-patterson-trial-helen-garner-chloe-hooper-sarah-krasnostein-ntwnfb",
    "image": "https://media.guim.co.uk/098039466bbaefdb8bbcf6ab72327172b2f7bdde/0_0_5000_4000/500.jpg",
    "summary": "The authors provide a vivid account of Patterson's triple murder trial, capturing the courtroom dynamics and key moments. Their narration, while reminiscent of a podcast transcript, remains highly accessible and engaging. Overall, it offers insightful observations on the trial proceedings.",
    "published": "2025-11-09T23:09:15Z"
  },
  {
    "title": "Australia news live: female NSW politicians threatened after condemning neo-Nazi rally as police minister calls event ‘deeply distressing’",
    "url": "https://www.theguardian.com/australia-news/live/2025/nov/10/australia-news-live-john-laws-radio-social-media-age-ban-reserve-bank-pauline-hanson-sussan-ley-anthony-albanese-net-zerontwnfb",
    "image": "https://media.guim.co.uk/9e1cf7edca57e0d5876fa1b0afc9f6e1d0a87186/644_0_6030_4824/500.jpg",
    "summary": "Please provide the news content you would like summarized, and I'll be happy to help!",
    "published": "2025-11-09T23:04:30Z"
  },
  {
    "title": "Climate disasters displaced 250 million people in past 10 years, UN report finds",
    "url": "https://www.theguardian.com/environment/2025/nov/09/climate-disasters-displaced-250-million-people-in-past-10-years-un-report-finds",
    "image": "https://media.guim.co.uk/ed58e0c05d9a25eb9588c9b8fd9e14a364ba8d5a/246_0_2813_2250/500.jpg",
    "summary": "Extreme weather events such as floods, storms, and droughts are displacing populations worldwide due to the effects of climate change. Rising temperatures are exacerbating conflicts and increasing hunger in vulnerable regions. The situation highlights the urgent need for global action to address climate-related challenges.",
    "published": "2025-11-09T23:01:44Z"
  },
  {
    "title": "Slim pickings: what explains the unusual apple shortage in this Blue Mountains orchard?",
    "url": "https://www.theguardian.com/environment/2025/nov/09/unusual-apple-shortage-blue-mountains-orchard-why",
    "image": "https://media.guim.co.uk/8b40a41cea6d9e207e9cb99fc5cb3d27a48effa2/88_0_2310_1848/500.jpg",
    "summary": "Apple growers are facing significant challenges this season, leading to reduced yields. This decline in apple production is impacting local tourism, which often relies on apple-related events and activities. The situation highlights the interconnectedness of agriculture and regional economies.",
    "published": "2025-11-09T23:00:44Z"
  }
]