[
  {
    "title": "Arsenal v OL Lyonnes: Women’s Champions League – live",
    "url": "https://www.theguardian.com/football/live/2025/oct/07/arsenal-v-ol-lyonnes-womens-champions-league-live",
    "image": "https://media.guim.co.uk/7defb65caa18714c1e117b902ea06ec9f0ee9076/415_0_5038_4030/500.jpg",
    "summary": "Defending champions are set to begin their title defense, and fans are eager to see if they can secure a victory. Luke McLaughlin will provide live updates throughout the event. Stay tuned for the latest developments.",
    "published": "2025-10-07T18:23:52Z"
  },
  {
    "title": "Kia Joorabchian’s £3.78m ‘early strike’ for colt shows big bloodstock ambition",
    "url": "https://www.theguardian.com/sport/2025/oct/07/kia-joorabchian-colt-tattersall-auction-horse-racing",
    "image": "https://media.guim.co.uk/8b8337808de13b92c29f7350d41dd8b03ebabe24/338_0_4245_3397/500.jpg",
    "summary": "Amo Racing's founder successfully acquired Lot 15, a horse by Frankel, outbidding Coolmore in the process. This move highlights the ambitions of the football super-agent to rival the wealthiest stud operations in the racing industry. With this strategic purchase, he aims to enhance his presence in the competitive world of horse racing.",
    "published": "2025-10-07T18:13:46Z"
  },
  {
    "title": "Palestine protests go ahead across UK on second anniversary of 7 October",
    "url": "https://www.theguardian.com/world/2025/oct/07/palestine-protests-go-ahead-across-uk-on-second-anniversary-of-7-october",
    "image": "https://media.guim.co.uk/34659356f0cf1d67ef09ab51ec7df7f95ba70d2b/293_0_5160_4128/500.jpg",
    "summary": "Protests, including a march in London and campus sit-ins in Glasgow and Edinburgh, continue despite appeals from the Prime Minister for them to cease. Demonstrators are expressing their demands and concerns, refusing to back down. The unrest highlights ongoing tensions between the government and activists.",
    "published": "2025-10-07T18:13:35Z"
  },
  {
    "title": "Furloughed government workers may not be entitled to back pay, reports say, as Trump claims some jobs ‘will never come back’ – live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/07/donald-trump-national-guard-pam-bondi-mark-carney-government-shutdown-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/a6ab464d0f79a5f1e9fd9788ad65fa72a736bddb/649_0_6500_5203/500.jpg",
    "summary": "A White House memo indicates that the Biden administration does not plan to guarantee back pay for federal workers during the government shutdown. This decision has been reported by multiple U.S. media outlets. Employees continuing to work during the shutdown may not receive pay retroactively once it ends.",
    "published": "2025-10-07T18:08:43Z"
  },
  {
    "title": "Up to 14m car loan scandal victims in line for average £700 payout, City regulator announces",
    "url": "https://www.theguardian.com/business/2025/oct/07/uk-car-loan-scandal-victims-in-line-for-payout-fca",
    "image": "https://media.guim.co.uk/5771d31988821aa876fea697284fc323ec82892a/804_40_2736_2190/500.jpg",
    "summary": "The city regulator has announced a compensation scheme for motorists who purchased vehicles through discretionary commission deals between 2007 and 2024. This initiative aims to address potential unfairness and provide financial restitution to affected consumers. Eligible motorists will be able to claim compensation for any discrepancies arising from these practices.",
    "published": "2025-10-07T18:08:33Z"
  }
]