[
  {
    "title": "Rachel Reeves says Gatwick second runway shows government is ‘backing builders, not blockers’ – business live",
    "url": "https://www.theguardian.com/business/live/2025/sep/22/rachel-reeves-gatwick-second-runway-growth-jobs-environmental-disaster-business-live-news",
    "image": "https://media.guim.co.uk/98d32f79f771396c5070d1197b355c9d7ee69fd2/421_0_4448_3558/500.jpg",
    "summary": "Green Party's Zack Polanski criticized the decision to approve a second runway at Gatwick Airport, calling it \"a disaster.\" The news has sparked ongoing discussions regarding economic impacts and environmental concerns. This reflects broader debates about infrastructure expansion versus sustainability.",
    "published": "2025-09-22T06:51:56Z"
  },
  {
    "title": "Trump tells Kirk memorial he hates opponents; Optus to face ‘significant consequences’ over outage; and a shark threesome",
    "url": "https://www.theguardian.com/australia-news/2025/sep/22/afternoon-update-monday-ntwnfb",
    "image": "https://media.guim.co.uk/4472579cf7c23a14bd5a859db3c222e5dc7be5c2/224_0_1800_1440/500.jpg",
    "summary": "During a memorial event in Arizona, the president addressed the crowd shortly after the widow of a rightwing influencer, who was fatally shot, expressed her forgiveness toward the accused shooter. The widow's statement of forgiveness drew attention in the context of the tragedy. The event underscored themes of loss, healing, and the complexities surrounding violence and forgiveness.",
    "published": "2025-09-22T06:44:25Z"
  },
  {
    "title": "Australia news live: Optus identifies seven more people unable to call triple zero; Meta to use AI to detect under-18s",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/22/australia-news-live-anthony-albanese-new-york-israel-palestine-donald-trump-optus-triple-zero-ntwnfb",
    "image": "https://media.guim.co.uk/04b112f4886c15bbe6ed126aec014d3f8513f3c1/401_0_3936_3149/500.jpg",
    "summary": "I’d be happy to help with that! However, I need the content or details of the news you're referring to in order to provide a summary. Could you please provide the information?",
    "published": "2025-09-22T06:36:09Z"
  },
  {
    "title": "AFL grand final 2025: ultimate guide to the flag decider between Geelong and Brisbane",
    "url": "https://www.theguardian.com/sport/2025/sep/22/afl-grand-final-2025-ultimate-guide-to-flag-decider-between-geelong-brisbane",
    "image": "https://media.guim.co.uk/8fd67fc3718925bb6a3e34b2d24bafcec5f9694a/230_0_2645_2117/500.jpg",
    "summary": "The news provides details on the start time for an upcoming game, options for live viewing, and information on the procedures if the match ends in a draw. It aims to inform fans about all necessary aspects of the event. Stay tuned for complete coverage.",
    "published": "2025-09-22T06:21:41Z"
  },
  {
    "title": "If Anyone Builds it, Everyone Dies review – how AI could kill us all",
    "url": "https://www.theguardian.com/books/2025/sep/22/if-anyone-builds-it-everyone-dies-review-how-ai-could-kill-us-all",
    "image": "https://media.guim.co.uk/705c57ca1e03dbc7922840dd954386b5679daafb/861_0_6250_5000/500.jpg",
    "summary": "Eliezer Yudkowsky and Nate Soares warn that the emergence of superintelligent machines could pose an existential threat to humanity. They argue that if such machines surpass human intelligence, the consequences could be dire. This raises the question of whether their concerns should be taken seriously by society.",
    "published": "2025-09-22T06:01:04Z"
  }
]