[
  {
    "title": "US supreme court ‘effectively legalized racial profiling’, immigration experts warn",
    "url": "https://www.theguardian.com/us-news/2025/sep/09/supreme-court-immigration-los-angeles-reaction",
    "image": "https://media.guim.co.uk/a7c2221079901e8ee7925f82bf12a04736470e6c/532_0_3600_2880/500.jpg",
    "summary": "A court has upheld the authority of federal agents in Los Angeles to stop individuals based on their race, language, occupation, or location. This decision comes during the Trump administration's increased enforcement actions. Critics argue this policy may lead to discrimination and civil rights violations.",
    "published": "2025-09-09T11:26:07Z"
  },
  {
    "title": "Asa Tribe scores 200 for Glamorgan, Leicestershire v Gloucestershire and more: county cricket – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/09/somerset-v-yorkshire-leicestershire-v-gloucestershire-and-more-county-cricket-day-two-live",
    "image": "https://media.guim.co.uk/30a67c3c28eb60df9ed6b6e7f19997ab9671df1a/1252_442_2948_2358/500.jpg",
    "summary": "Tanya Aldred provides updates on day two of the latest county fixtures. The report includes ongoing developments and highlights from the grounds. Stay tuned for live coverage and key moments in the matches.",
    "published": "2025-09-09T11:25:23Z"
  },
  {
    "title": "Anglo American agrees mining mega merger; Londoners face commuting struggles as tube strike enters second day – business live",
    "url": "https://www.theguardian.com/business/live/2025/sep/09/anglo-mining-mega-merger-londoners-commuting-struggles-tube-strike-second-day-business-live",
    "image": "https://media.guim.co.uk/0f9e2319cb4a332a06ce7286b1ad347dd702ad5a/291_0_3487_2790/500.jpg",
    "summary": "A merger deal creating a $53 billion mining giant has raised concerns about potential job cuts due to the relocation of the headquarters to Vancouver. The consolidation aims to enhance operational efficiency and market presence. Stakeholders are wary about the impact on employment amid the significant industry shift.",
    "published": "2025-09-09T11:23:46Z"
  },
  {
    "title": "Israel’s expanded assault on Gaza City will endanger lives of ‘countless civilians’, charity warns – Middle East crisis live",
    "url": "https://www.theguardian.com/world/live/2025/sep/09/israel-gaza-city-evacuation-order-idf-military-offensive-live-updates-middle-east-crisis-latest-news",
    "image": "https://media.guim.co.uk/bf3872a88e35a21aefc8c7b862a3164fd5434b46/0_0_5000_4000/500.jpg",
    "summary": "ActionAid has issued a warning regarding the humanitarian crisis in Gaza City following orders from Israeli Prime Minister Benjamin Netanyahu and the Israeli army for residents to evacuate. The organization highlights the potential dangers and worsening conditions for those displaced. They emphasize the urgent need for international support to address the escalating situation.",
    "published": "2025-09-09T11:23:09Z"
  },
  {
    "title": "Emily Thornberry joins deputy Labour leader race and says Gaza and wealth tax among her priorities – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/09/bridget-phillipson-labour-deputy-leader-uk-politics-latest-news-updates-keir-starmer",
    "image": "https://media.guim.co.uk/6efe5708d8219a9bd68da361c9ae671fde9a7c66/378_0_5600_4480/500.jpg",
    "summary": "Thornberry has announced her intention to run, joining Bridget Phillipson and Bell Ribeiro-Addy, who have also declared their candidacies. This marks a significant development in the political landscape as more candidates enter the race. Their participation reflects growing competition and diverse representation in upcoming elections.",
    "published": "2025-09-09T11:20:44Z"
  }
]