[
  {
    "title": "Top Senate Republican says he can ‘guarantee’ a vote on key healthcare provision amid shutdown standoff – live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/16/trump-latest-shutdown-vote-jd-vance-republicans-democrats",
    "image": "https://media.guim.co.uk/14b9f122f0d86ee69c264de3f18004600cf1dc11/667_0_6830_5464/500.jpg",
    "summary": "The Senate majority leader announced that a vote on Obamacare subsidies will take place in response to Democratic demands. However, he cautioned that he cannot guarantee the measure will pass. The development reflects ongoing tensions surrounding healthcare legislation.",
    "published": "2025-10-16T14:19:24Z"
  },
  {
    "title": "Women’s Cricket World Cup: Australia v Bangladesh – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/16/womens-cricket-world-cup-australia-v-bangladesh-live",
    "image": "https://media.guim.co.uk/704d17f0c575ee1ba97754c7e21261b130524dad/1084_238_2689_2151/500.jpg",
    "summary": "Australia secured their place in the finals during the 50-over match in Visakhapatnam. The over-by-over report provides live updates and insights into the game. Join the writers for detailed coverage and commentary.",
    "published": "2025-10-16T14:17:02Z"
  },
  {
    "title": "IMF chief reveals worries about private credit market keep her awake at night – business live",
    "url": "https://www.theguardian.com/business/live/2025/oct/16/uk-gdp-economy-growth-august-reeves-budget-imf-business-live-news",
    "image": "https://media.guim.co.uk/fbe0df09a525d0892573d1fa9ae8f132475b51fc/375_0_3748_2998/500.jpg",
    "summary": "IMF managing director Kristalina Georgieva emphasizes the need for increased focus on non-bank financial institutions. She warns that the global economy risks instability if these entities are overlooked. Georgieva's comments highlight concerns about maintaining financial stability amid evolving market dynamics.",
    "published": "2025-10-16T14:15:54Z"
  },
  {
    "title": "No 10 says Badenoch’s claim PM should have intervened to stop China spy trial collapsing ‘absurd’ – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/oct/16/china-spy-case-cps-keir-starmer-uk-politics-latest-news-updates",
    "image": "https://media.guim.co.uk/d531e71f36df851b9482ec86e79bd6053562df55/350_0_4118_3294/500.jpg",
    "summary": "Downing Street stated that if Keir Starmer had intervened, it would have constituted interference in a case linked to a prior government. This response comes amid discussions regarding governmental boundaries and judicial matters. The statement highlights the importance of maintaining clear distinctions between political actions and legal proceedings.",
    "published": "2025-10-16T14:15:36Z"
  },
  {
    "title": "Ministers begin charm offensive to win over Labour MPs sceptical of digital ID plans",
    "url": "https://www.theguardian.com/politics/2025/oct/16/ministers-begin-charm-offensive-to-win-over-labour-mps-sceptical-of-digital-id-plans",
    "image": "https://media.guim.co.uk/06d92341c681c5c3b23c3fa38a82cb200c4dfdc9/153_0_1930_1545/500.jpg",
    "summary": "The party is working to reassure MPs about the development and functionality of a new scheme. They are also seeking feedback and innovative ideas on how the initiative can enhance public services. This effort aims to foster confidence and collaboration among lawmakers.",
    "published": "2025-10-16T14:14:18Z"
  }
]