[
  {
    "title": "Bayern Munich v Chelsea: Champions League – live",
    "url": "https://www.theguardian.com/football/live/2025/sep/17/bayern-munich-v-chelsea-champions-league-live",
    "image": "https://media.guim.co.uk/cb4888f5d8035311198077753fa0b2352ae9312a/363_0_3304_2643/500.jpg",
    "summary": "A minute-by-minute report is underway as Club World Cup champions face off against Harry Kane and his team in Germany. Luke McLaughlin will provide live updates on the match. Stay tuned for insights and developments as the game unfolds.",
    "published": "2025-09-17T19:23:04Z"
  },
  {
    "title": "Thousands of anti-Trump protesters march in London as king and senior royals host US president in Windsor – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/17/donald-trump-uk-state-visit-king-charles-windsor-politics-latest-news-updates-labour-keir-starmer",
    "image": "https://media.guim.co.uk/e09defa9f7d50a364818bb58a72ec246ef7bb46b/340_0_6608_5286/500.jpg",
    "summary": "Anti-Trump protesters gathered in London as the U.S. president attended events in Windsor leading up to a state banquet. Demonstrators expressed their opposition to his policies and presidency. The protests highlighted ongoing tensions surrounding Trump's international visits.",
    "published": "2025-09-17T19:22:09Z"
  },
  {
    "title": "Liverpool v Atlético Madrid: Champions League – live",
    "url": "https://www.theguardian.com/football/live/2025/sep/17/liverpool-v-atletico-madrid-champions-league-live",
    "image": "https://media.guim.co.uk/5a0880a77c022e05d54c5ac8e374b564e4616c60/27_301_1984_1588/500.jpg",
    "summary": "Alexander Isak features in the starting lineup for Liverpool's challenging European opener against Diego Simeone's team. The match promises to be intense as both sides aim for a strong start in the competition. Join Simon Burnton for live updates on the game.",
    "published": "2025-09-17T19:22:07Z"
  },
  {
    "title": "Federal Reserve cuts interest rates by a quarter point, for first time in nearly a year – live updates",
    "url": "https://www.theguardian.com/business/live/2025/sep/17/federal-reserve-interest-rate-decision-jerome-powell-trump",
    "image": "https://media.guim.co.uk/8eb9a1b180569b37035d5c61969b9fd83aa9121e/131_0_3063_2450/500.jpg",
    "summary": "Interest rates are currently set between 4% and 4.25%, reflecting a recent reduction. This decision comes amid concerns regarding political pressure on the independent central bank, particularly from former President Trump. The rate change aims to navigate these pressures while managing economic stability.",
    "published": "2025-09-17T19:19:41Z"
  },
  {
    "title": "Surrey require 249 to beat Notts in title battle: county cricket, day three – as it happened",
    "url": "https://www.theguardian.com/sport/live/2025/sep/17/surrey-v-nottinghamshire-sussex-v-yorkshire-and-more-county-cricket-day-three-live",
    "image": "https://media.guim.co.uk/6209bd89ebd23d964ecb98159d5df173df9a1640/76_0_1242_994/500.jpg",
    "summary": "Surrey finished the day at 66-0, maintaining their position in the title race. Meanwhile, Worcestershire's relegation was officially confirmed. The match highlighted the contrasting fortunes of the two teams.",
    "published": "2025-09-17T19:09:43Z"
  }
]