[
  {
    "title": "Australia politics live: Gallagher taken by surprise as Pocock, Coalition and Greens team up to scrap defence honours bill debate",
    "url": "https://www.theguardian.com/australia-news/live/2025/nov/06/australia-politics-live-wfh-working-from-home-banks-net-zero-nationals-liberals-coalition-sussan-ley-anthony-albanese-labor-question-time-ntwnfb",
    "image": "https://media.guim.co.uk/d869c6d171acbb43d555422d5a2d71923c337253/476_0_4758_3806/500.jpg",
    "summary": "Please provide the news content you'd like me to summarize, and I'll be happy to help!",
    "published": "2025-11-06T03:12:19Z"
  },
  {
    "title": "US to cut airline traffic by 10% due to shutdown, Trump transport chief says",
    "url": "https://www.theguardian.com/us-news/2025/nov/05/government-shutdown-duffy-airspace-closures",
    "image": "https://media.guim.co.uk/9f0085b20564bf3f79ca0f38bf2c5fcb2f4899f6/436_0_2554_2043/500.jpg",
    "summary": "Sean Duffy announced that cuts at 40 air traffic control locations will begin on Friday to alleviate stress on controllers if a resolution is not reached. The potential cuts raise concerns about air travel disruptions. Duffy emphasized the urgency of finding a solution to avoid implementation.",
    "published": "2025-11-06T02:32:08Z"
  },
  {
    "title": "Prosecutors asked if manslaughter charge will be considered if Greg Lynn overturns high country murder conviction",
    "url": "https://www.theguardian.com/australia-news/2025/nov/06/will-manslaughter-charge-be-considered-if-greg-lynn-overturns-high-country-conviction-ntwnfb",
    "image": "https://media.guim.co.uk/4c65128647bbb782fa1ec34802a2a3e1709513a7/529_1_1733_1387/500.jpg",
    "summary": "Appeal judges are seeking guidance on whether the motive of a former Jetstar pilot should be considered in a potential retrial regarding the death of Carol Clay. This inquiry could influence the judicial process as the case unfolds. The focus remains on assessing the implications of the pilot's motive in relation to the charges.",
    "published": "2025-11-06T02:04:19Z"
  },
  {
    "title": "Trump news at a glance: supreme court examines president’s global tariffs",
    "url": "https://www.theguardian.com/us-news/2025/nov/05/trump-administration-news-updates-today",
    "image": "https://media.guim.co.uk/1e37076c4572f990bf6c36965a64af621f8f714a/651_276_4016_3213/500.jpg",
    "summary": "Conservative justices have shown doubts regarding the validity of the Trump administration's legal arguments. Their skepticism raises questions about the administration's ability to uphold its stance in ongoing cases. This development indicates potential challenges ahead for Trump's legal team.",
    "published": "2025-11-06T02:02:27Z"
  },
  {
    "title": "The good news is that boys believe in gender equality. The scary question is: will they forget when they become men? | Lucy Clark",
    "url": "https://www.theguardian.com/commentisfree/2025/nov/06/the-good-news-is-that-boys-believe-in-gender-equality-the-scary-question-is-will-they-forget-when-they-become-men",
    "image": "https://media.guim.co.uk/bb007d6e4a40005bde0cb3a89c9d7018e9c3120c/482_0_5600_4480/500.jpg",
    "summary": "Research indicates that online influencers such as Andrew Tate have less influence on young boys than previously believed. However, concerns remain about a significant number of boys internalizing toxic ideas about masculinity. This highlights the ongoing need for addressing harmful narratives and promoting healthier perspectives on masculinity among youth.",
    "published": "2025-11-06T02:00:41Z"
  }
]