[
  {
    "title": "Australia news live: Jay Weatherill named next high commissioner to UK; former radio host to lead ACT Liberals after leader and deputy step down",
    "url": "https://www.theguardian.com/australia-news/live/2025/nov/10/australia-news-live-john-laws-radio-social-media-age-ban-reserve-bank-pauline-hanson-sussan-ley-anthony-albanese-net-zerontwnfb",
    "image": "https://media.guim.co.uk/5cca75c774be7648da96510310e4e7923fce5062/268_0_4297_3437/500.jpg",
    "summary": "I'm sorry, but it seems you've provided an incomplete request. Could you please share the specific news article or details you would like me to summarize?",
    "published": "2025-11-10T04:17:54Z"
  },
  {
    "title": "Senate advances funding bill to end longest US government shutdown in history",
    "url": "https://www.theguardian.com/us-news/2025/nov/10/us-government-shutdown-update-senate-funding-bill",
    "image": "https://media.guim.co.uk/36fb7db3a947704dbcc805f4923136e50d34c3bd/201_0_2598_2079/500.jpg",
    "summary": "The amended package awaits approval from the House before being sent to Trump for his signature. This legislative process may take several days. The timeline for finalizing the package remains uncertain.",
    "published": "2025-11-10T03:52:09Z"
  },
  {
    "title": "Two dead and more than a million displaced after super typhoon Fung-wong slams the Philippines ",
    "url": "https://www.theguardian.com/world/2025/nov/10/super-typhoon-fung-wong-philippines",
    "image": "https://media.guim.co.uk/5e68e95a1ccc232294f1636e10fa0b39041f4669/119_0_1920_1536/500.jpg",
    "summary": "Over 1.4 million people were evacuated nationwide due to a storm that caused flash flooding, landslides, and strong winds. The severe weather prompted urgent safety measures and widespread disruption. Efforts are ongoing to address the damage and assist affected communities.",
    "published": "2025-11-10T03:44:28Z"
  },
  {
    "title": "US Senate vote marks step towards ending federal shutdown",
    "url": "https://www.theguardian.com/us-news/2025/nov/09/senate-moves-vote-federal-government-shutdown",
    "image": "https://media.guim.co.uk/0a4fb516e98952f4688c2cd23cb9bb52f6674c0f/333_0_3333_2667/500.jpg",
    "summary": "Senators are progressing a House-passed stopgap funding bill, indicating a possible resolution to the ongoing 40-day government shutdown. This legislative move aims to ensure continued federal operations and services. If successful, it would mark an end to the protracted standoff impacting various government functions.",
    "published": "2025-11-10T02:46:09Z"
  },
  {
    "title": "Female NSW MPs Allegra Spender and Kellie Sloane report death and rape threats after condemning neo-Nazi rally in Sydney",
    "url": "https://www.theguardian.com/australia-news/2025/nov/10/neo-nazi-rally-sydney-female-nsw-mps-allegra-spender-kellie-sloane-death-rape-threats",
    "image": "https://media.guim.co.uk/14390f74f0661aebdd752a130a2328c4a6b72cb9/0_0_5000_4000/500.jpg",
    "summary": "Allegra Spender and Kellie Sloane have reported receiving threats to the police. In response, the premier announced that the government is looking into the possibility of expanding the ban on Nazi symbols. This move follows growing concerns about hate symbols in the community.",
    "published": "2025-11-10T02:17:28Z"
  }
]