[
  {
    "title": "DC mayor says she ‘greatly appreciates’ Trump’s surge of federal officers but adds there is ‘break in trust’ with residents – live",
    "url": "https://www.theguardian.com/us-news/live/2025/aug/27/donald-trump-tariffs-india-us-politics-latest-updates-news",
    "image": "https://media.guim.co.uk/d177295067471293c059b67a1e36b203dcf55799/563_0_4513_3610/500.jpg",
    "summary": "Muriel Bowser stated that she and the president did not discuss his potential plan to extend federal oversight. Such an extension would require approval from Congress. The lack of dialogue on this topic suggests differing priorities or concerns.",
    "published": "2025-08-27T18:47:20Z"
  },
  {
    "title": "US Open tennis 2025: Injured Draper withdraws, Raducanu and Djokovic win on day four – live",
    "url": "https://www.theguardian.com/sport/live/2025/aug/27/us-open-tennis-2025-raducanu-djokovic-and-pegula-in-action-on-day-four-live",
    "image": "https://media.guim.co.uk/2594a80a2dfc6566ecbe4d909f5c916fa7144db5/703_0_3651_2921/500.jpg",
    "summary": "Daniel Harris is providing live updates on a hectic day of events at Flushing Meadows. The report highlights ongoing activities and key moments from the venue. Stay tuned for more information as the day progresses.",
    "published": "2025-08-27T18:46:22Z"
  },
  {
    "title": "Club Brugge v Rangers, Grimsby v Manchester United and more: Champions League and Carabao Cup – live",
    "url": "https://www.theguardian.com/football/live/2025/aug/27/club-brugge-v-rangers-grimsby-v-manchester-united-and-more-champions-league-and-carabao-cup-live",
    "image": "https://media.guim.co.uk/96c69451c7bd69845b2820be9e500a9b8732db58/690_0_4745_3796/500.jpg",
    "summary": "Simon Burnton will provide live updates on Wednesday's Champions League qualifiers and the Carabao Cup matches. Stay tuned for the latest scores, highlights, and key moments from the matches. Don't miss the action as teams vie for advancement in both tournaments.",
    "published": "2025-08-27T18:42:32Z"
  },
  {
    "title": "Fulton county commissioners risk jail time for not appointing Republicans to election board",
    "url": "https://www.theguardian.com/us-news/2025/aug/27/fulton-county-commissioners-jail-time-election-board-appointments",
    "image": "https://media.guim.co.uk/62ed57f13e14faf414eebd2cb238f7e124cb4b0d/1027_635_4154_3322/500.jpg",
    "summary": "Democrats opposed the appointment of two candidates who have a history of promoting election denialism and challenging voter registration processes. Their votes reflect concerns over the candidates' integrity and commitment to fair elections. This decision underscores ongoing tensions surrounding election-related issues within the political landscape.",
    "published": "2025-08-27T18:29:08Z"
  },
  {
    "title": "FDA approves new Covid-19 vaccines in US but limits who can get them",
    "url": "https://www.theguardian.com/us-news/2025/aug/27/fda-new-covid-19-vaccines-restrictions",
    "image": "https://media.guim.co.uk/49f849979962e400666b1244f5db2955f4053663/175_896_3127_2503/500.jpg",
    "summary": "The agency has approved COVID-19 vaccine shots for individuals aged 65 and older. Young people can also receive the vaccine if they have underlying medical conditions. This decision aims to enhance protection for vulnerable populations.",
    "published": "2025-08-27T18:18:25Z"
  }
]