[
  {
    "title": "World Series Game 6: Los Angeles Dodgers v Toronto Blue Jays – live buildup",
    "url": "https://www.theguardian.com/sport/live/2025/oct/31/world-series-game-6-los-angeles-dodgers-v-toronto-blue-jays-live-buildup",
    "image": "https://media.guim.co.uk/005dccf64f24a07223a47addf0c4252b0bf16f3b/312_0_2842_2273/500.jpg",
    "summary": "The Toronto Blue Jays are facing the Los Angeles Dodgers in Game 6 of the World Series. David Lengel is covering all the action as it unfolds. Fans can follow the live updates and developments of the important game.",
    "published": "2025-10-31T23:16:26Z"
  },
  {
    "title": "Breeders’ Cup 2025 horse racing: day one – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/31/breeders-cup-2025-horse-racing-day-one-live",
    "image": "https://media.guim.co.uk/4c04f144cc6ce068ac14ad93bf53e942b5574b1c/0_0_2147_1718/500.jpg",
    "summary": "Greg Wood provides updates on a major horse racing event in California, renowned for its prestige. The event promises excitement and anticipation for racing enthusiasts. Stay tuned for the latest developments and highlights.",
    "published": "2025-10-31T23:15:03Z"
  },
  {
    "title": "Trump administration blocked from suspending Snap benefits for millions of Americans",
    "url": "https://www.theguardian.com/us-news/2025/oct/31/judge-blocks-trump-snap-suspension",
    "image": "https://media.guim.co.uk/f9d2e6cdc61b8fdc2a7babec150550ec6eea7d7f/392_0_3900_3122/500.jpg",
    "summary": "A judge granted a temporary restraining order, while another determined that the government is required to continue funding a program that supports low-income households. This decision aims to ensure ongoing assistance for vulnerable families. The rulings underscore the ongoing legal disputes surrounding the program's funding.",
    "published": "2025-10-31T23:08:36Z"
  },
  {
    "title": "Pro-Israel activist suing Sydney restaurant claims he was shunned and vilified after News Corp stunt",
    "url": "https://www.theguardian.com/australia-news/2025/nov/01/pro-israel-activist-suing-sydney-restaurant-claims-he-was-shunned-and-vilified-after-news-corp-stunt",
    "image": "https://media.guim.co.uk/c89e7b4f1f2d1a923f40a0f4dc17f5e49f710a9f/262_0_4320_3456/500.jpg",
    "summary": "Ofir Birenbaum is filing a defamation lawsuit against Cairo Takeaway for social media posts that implied he visited their restaurant with reporters to create controversy. The posts have since been deleted and retracted. Birenbaum seeks to clear his name from these allegations.",
    "published": "2025-10-31T23:00:19Z"
  },
  {
    "title": "Australians are boozing less, getting fewer flu jabs and choosing home brands: five things we learned from AGM season",
    "url": "https://www.theguardian.com/australia-news/2025/nov/01/australia-boozing-less-getting-fewer-flu-jabs-choosing-home-brands-consumer-trends",
    "image": "https://media.guim.co.uk/72400d73e3fd9284473f96a5096505f6a8d227b2/671_0_6713_5373/500.jpg",
    "summary": "At annual shareholder meetings, various companies revealed unexpected insights into evolving consumer trends. They highlighted shifts in purchasing behaviors and preferences, reflecting broader economic conditions and societal changes. These insights are crucial for stakeholders to adapt strategies and meet changing customer demands.",
    "published": "2025-10-31T23:00:18Z"
  }
]