[
  {
    "title": "WTA Finals tennis: Jessica Pegula v Elena Rybakina in semi-finals – live",
    "url": "https://www.theguardian.com/sport/live/2025/nov/07/wta-finals-tennis-rybakina-pegula-sabalenka-anisimova-live",
    "image": "https://media.guim.co.uk/9167f723b02a6f5c84fe619c0edc4a2bcb730df9/673_0_8100_6482/500.jpg",
    "summary": "Niall McVeigh will host the semi-finals of the season-ending tournament in Riyadh. Fans can expect an exciting showdown as top competitors vie for a spot in the finals. Stay tuned for action-packed matches in this high-stakes event.",
    "published": "2025-11-07T17:17:02Z"
  },
  {
    "title": "Trump administration seeks emergency pause of court order to fully fund November food stamp benefits – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/nov/07/donald-trump-government-shutdown-air-traffic-flights-snap-viktor-orban-hungary-ukraine-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/eb12a26fde4ec35ca60e4974e737959eb4e2ba4d/837_0_5818_4654/500.jpg",
    "summary": "A judge has mandated that the U.S. government must fully finance SNAP (Supplemental Nutrition Assistance Program) benefits by this Friday. The ruling comes in response to concerns about funding shortages affecting low-income families. The government's compliance with the order aims to ensure continued assistance for those relying on food assistance programs.",
    "published": "2025-11-07T17:15:09Z"
  },
  {
    "title": "Grammys 2026: the nominations in all the major categories",
    "url": "https://www.theguardian.com/music/2025/nov/07/grammys-2026-nominations-major-categories",
    "image": "https://media.guim.co.uk/1f7724e22b8aab223a6b0d8a248ef6de93031237/290_0_4563_3652/500.jpg",
    "summary": "The nominations for this year's awards feature standout artists like Bad Bunny and Leon Thomas, among others. The list showcases a diverse range of musical talent recognized for their impressive contributions. Fans can look forward to celebrating these nominees in the upcoming event.",
    "published": "2025-11-07T17:14:09Z"
  },
  {
    "title": "Kendrick Lamar leads Grammy award nominations with nine nods",
    "url": "https://www.theguardian.com/music/2025/nov/07/kendrick-lamar-grammy-nominations",
    "image": "https://media.guim.co.uk/9318fee7f49ffed3dc76a599c3a5b6478eb64e21/668_0_6680_5344/500.jpg",
    "summary": "A prominent rapper has secured nominations in all major categories at an upcoming awards event. Other notable nominees include Lady Gaga, Bad Bunny, Sabrina Carpenter, and Leon Thomas. The nominations highlight a diverse range of talent across the music industry.",
    "published": "2025-11-07T17:12:43Z"
  },
  {
    "title": "How woman who found fame by claiming to be Madeleine McCann harassed missing girl’s family",
    "url": "https://www.theguardian.com/uk-news/2025/nov/07/how-woman-who-found-fame-by-claiming-to-be-madeleine-mccann-harassed-missing-girls-family",
    "image": "https://media.guim.co.uk/8dbd3f3706f1af8947530563a7825710b9044e0c/413_0_1440_1152/500.jpg",
    "summary": "Julia Wandelt repeatedly contacted the McCanns through calls, messages, and letters, and even confronted them at their residence. Her actions raised concerns and drew media attention. The McCanns, known for their search for their missing daughter, faced an unsettling intrusion into their lives.",
    "published": "2025-11-07T17:11:51Z"
  }
]