[
  {
    "title": "Aston Villa v Bologna, Rangers v Genk, and more: Europa League – live",
    "url": "https://www.theguardian.com/football/live/2025/sep/25/aston-villa-v-bologna-rangers-v-genk-and-more-europa-league-live",
    "image": "https://media.guim.co.uk/74373c6ca42d8cc889af41c2bca3a55a033f9a04/500_0_5955_4764/500.jpg",
    "summary": "Daniel Harris will provide updates on Thursday's Europa League matches, highlighting the start of Unai Emery's team's campaign. Fans can expect live coverage and insights as the games unfold. Stay tuned for the latest developments.",
    "published": "2025-09-25T19:14:30Z"
  },
  {
    "title": "Officials say Dallas immigration facility shooter ‘intended to kill Ice agents’ but was not part of ‘any specific group’ – live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/25/donald-trump-james-comey-fbi-ice-texas-latest-us-politics-news-updates-live",
    "image": "https://media.guim.co.uk/fdf134540f12f1c062a691cfbb13e8644ed35e92/181_0_2622_2099/500.jpg",
    "summary": "Officials reported that the shooter utilized tracking apps to monitor law enforcement agents. In response to the incident, Trump attributed the increase in political violence to the \"radical left\" rather than right-wing influences. This highlights ongoing tensions surrounding political motivations and violence in the current climate.",
    "published": "2025-09-25T19:10:46Z"
  },
  {
    "title": "Dallas Ice shooting suspect engaged in ‘high degree of planning’, FBI says",
    "url": "https://www.theguardian.com/us-news/2025/sep/25/dallas-texas-ice-shooting-suspect",
    "image": "https://media.guim.co.uk/b369f4038d75f9540247c89fec9458902c16e19d/718_0_6582_5264/500.jpg",
    "summary": "Kash Patel revealed that the alleged gunman reportedly downloaded a document detailing Dallas homeland security facilities. Additionally, the individual conducted searches related to ballistics. These findings raise concerns about potential motives and planning for the attack.",
    "published": "2025-09-25T19:04:59Z"
  },
  {
    "title": "Argyle Street ash in Glasgow wins tree of the year competition",
    "url": "https://www.theguardian.com/environment/2025/sep/25/argyle-street-ash-glasgow-wins-woodland-trust-tree-of-the-year-competition",
    "image": "https://media.guim.co.uk/9cb9cc776ed1e809fdd9d627beef74002172c099/594_0_2813_2250/500.jpg",
    "summary": "A cherished tree has won the Woodland Trust’s contest, defeating the famous ‘King of Limbs’ oak in Wiltshire. The competition celebrated the UK's favorite trees, highlighting the significance of local natural landmarks. The triumph reflects the strong connection communities have with their trees.",
    "published": "2025-09-25T19:00:45Z"
  },
  {
    "title": "George Soros foundation hits back at Trump after report that DoJ plans to target group",
    "url": "https://www.theguardian.com/business/2025/sep/25/george-soros-foundation-investigation-doj-trump",
    "image": "https://media.guim.co.uk/d2b6dffdd887c364f7eaa2db16a90bb7d65d97c3/666_0_3334_2667/500.jpg",
    "summary": "The New York Times reports that the Justice Department is urging attorneys to probe an organization as former President Trump intensifies his attacks on political rivals. This development raises concerns about potential political motivations behind the investigations. The situation reflects ongoing tensions in the political landscape ahead of upcoming elections.",
    "published": "2025-09-25T18:48:47Z"
  }
]