[
  {
    "title": "Ukraine war briefing: China providing Russia with intelligence on missile targets, Ukrainian official claims",
    "url": "https://www.theguardian.com/world/2025/oct/05/ukraine-war-briefing-china-providing-russia-with-intelligence-on-missile-targets-ukrainian-official-claims",
    "image": "https://media.guim.co.uk/7b110338254da95c7a937ef0fc75121789651391/417_0_4583_3667/500.jpg",
    "summary": "A Ukrainian intelligence official reports significant cooperation between Russia and China in satellite reconnaissance efforts. This development raises concerns about potential military and strategic implications. The announcement comes on the 1,320th day of the ongoing conflict in Ukraine.",
    "published": "2025-10-05T04:06:26Z"
  },
  {
    "title": "‘Cheating is encouraged’: nut crackers at Peckham’s Conker Championships go for the fun",
    "url": "https://www.theguardian.com/sport/2025/oct/05/cheating-is-encouraged-nut-crackers-at-peckhams-conker-championships-go-for-the-fun",
    "image": "https://media.guim.co.uk/ecc60185b13836e48cebf7b1839615b67acf404a/534_0_7920_6336/500.jpg",
    "summary": "A new contender from South London enters the scene with a lighter approach compared to the World Championships. Despite its fun demeanor, the venture still carries inherent risks. The juxtaposition highlights the balance between entertainment and competitiveness in sports.",
    "published": "2025-10-05T04:00:25Z"
  },
  {
    "title": "Street battles, invented languages and gigs in psychiatric hospitals: France’s lost rock revolution of 1968",
    "url": "https://www.theguardian.com/music/2025/oct/05/street-battles-invented-languages-and-gigs-in-psychiatric-hospitals-frances-lost-rock-revolution-of-1968",
    "image": "https://media.guim.co.uk/454a4517ecba2f174e3e5e311b488931aa81a29a/162_0_2676_2140/500.jpg",
    "summary": "A new book highlights the impact of bands like Magma and Art Zoyd as they provided a soundtrack for student protests in France. Their influence on the music scene is shown to have paved the way for the success of later acts like Air and Daft Punk. This historical context sheds light on the connection between music and social movements.",
    "published": "2025-10-05T04:00:24Z"
  },
  {
    "title": "Some people have a choice about whether or not to vote Labour. I wish I did too | Polly Hudson",
    "url": "https://www.theguardian.com/commentisfree/2025/oct/05/some-people-have-choice-about-whether-to-vote-labour-i-wish-i-did-too",
    "image": "https://media.guim.co.uk/bac74271e86cddfea5c778ac26ef0911d91d2230/230_0_2517_2014/500.jpg",
    "summary": "Polly Hudson expresses her disillusionment with Keir Starmer's government while grappling with her late father's strong support for his political career. This emotional connection makes it challenging for her to consider voting for any other candidate. Ultimately, her family's legacy complicates her political choices.",
    "published": "2025-10-05T04:00:24Z"
  },
  {
    "title": "Liberal frontbencher backs Hastie on immigration – as it happened",
    "url": "https://www.theguardian.com/australia-news/live/2025/oct/05/australia-news-live-hecs-student-debt-mark-butler-albanese-labor-melbourne-metro-nsw-qld-sussan-ley-andrew-hastie-coalition-ntwnfb",
    "image": "https://media.guim.co.uk/edd93429bceeeb5ef1316639bfebc83b28479949/658_0_6583_5266/500.jpg",
    "summary": "The blog has officially ceased operations and will no longer be updated. Readers are encouraged to seek alternative sources for similar content. Thank you for your support during its run.",
    "published": "2025-10-05T03:58:36Z"
  }
]