[
  {
    "title": "Arsenal v Real Madrid: Women’s Champions League – live",
    "url": "https://www.theguardian.com/football/live/2025/nov/19/arsenal-v-real-madrid-womens-champions-league-live",
    "image": "https://media.guim.co.uk/f0851d40c730d173aa76010721d043dbef25f2c8/727_425_2384_1908/500.jpg",
    "summary": "Scott Murray provides a live report as the European champions aim to bounce back from inconsistent performances while facing Real Madrid at home. The match is crucial for improving their momentum. Fans can expect minute-by-minute updates on this significant encounter.",
    "published": "2025-11-19T21:15:37Z"
  },
  {
    "title": "Cop30 live: Scientists warn countries must act decisively to protect people and life or risk ‘suffering for billions’",
    "url": "https://www.theguardian.com/environment/live/2025/nov/19/cop30-live-brazilian-president-lula-climate-summit-belem-latest-news-updates",
    "image": "https://media.guim.co.uk/35357afced045243f6ac8a856c43cd9dc01e4699/646_0_6455_5164/500.jpg",
    "summary": "President Lula is working to bridge gaps among negotiating countries to foster cooperation on climate action. Meanwhile, planetary scientists emphasize the urgent need for significant reductions in emissions to combat climate change. The call for immediate action highlights the critical intersection of diplomacy and environmental science.",
    "published": "2025-11-19T21:14:25Z"
  },
  {
    "title": "Australia news live: volcano erupts in Java; Sussan Ley to outline defence priorities",
    "url": "https://www.theguardian.com/australia-news/live/2025/nov/20/australia-news-live-volcano-java-labor-nature-laws-coalition-sussan-ley-anthony-albanese-nsw-leadership-spill-liberal-chaos-ntwnfb",
    "image": "https://media.guim.co.uk/8c453566b900c384d9af52aafa59405499d876eb/1000_0_5000_4000/500.jpg",
    "summary": "Please provide the news content you'd like summarized, and I'll be happy to help!",
    "published": "2025-11-19T21:11:36Z"
  },
  {
    "title": "Wimbledon’s development plans hit stumbling block after judge’s ruling",
    "url": "https://www.theguardian.com/sport/2025/nov/19/wimbledons-development-plans-hit-stumbling-block-after-judges-ruling",
    "image": "https://media.guim.co.uk/dd422ad5a0d067e41097e32cfa3b78ea9d915b90/82_0_3248_2599/500.jpg",
    "summary": "In 2024, the AELTC received approval to construct 39 grass courts. However, a judge has now granted a review of this decision due to pressure from the advocacy group Save Wimbledon Park. The situation highlights ongoing concerns regarding the project's impact on the local environment.",
    "published": "2025-11-19T21:11:26Z"
  },
  {
    "title": "Corrections and clarifications",
    "url": "https://www.theguardian.com/news/2025/nov/19/corrections-and-clarifications",
    "summary": "Dynamo Moscow announced the signing of former cricketer Jim Laker as a new coach. Laker, known for his impressive bowling skills, aims to improve the team's performance in the upcoming season. The club's management expressed confidence in his abilities to bring tactical innovation and leadership.",
    "published": "2025-11-19T21:00:04Z"
  }
]