[
  {
    "title": "Supreme court to hear Voting Rights Act challenge that could affect control of Congress – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/15/donald-trump-federal-government-shutdown-redistricting-voting-rights-act-kash-patel-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/7e8775e32cb6047f194b2f5815622a3aa4c8c769/1248_0_6269_5015/500.jpg",
    "summary": "The GOP is challenging Section 2 of the Voting Rights Act, which aims to prevent discrimination in voting, arguing it is unconstitutional. This move comes amid ongoing redistricting battles across the United States. Critics fear that such a challenge could undermine voting rights and protections.",
    "published": "2025-10-15T12:40:59Z"
  },
  {
    "title": "England v Pakistan: Women’s Cricket World Cup game hit by rain – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/15/england-v-pakistan-womens-cricket-world-cup-live",
    "image": "https://media.guim.co.uk/3dad24b838f3b6c950bc3b6ad55efaa4f1579a5d/548_0_3527_2823/500.jpg",
    "summary": "England aims to keep their perfect record in the tournament as they face off against Pakistan in Colombo. The game promises to be an exciting matchup, with both teams looking to assert their dominance. Fans are eagerly anticipating this over-by-over coverage.",
    "published": "2025-10-15T12:38:08Z"
  },
  {
    "title": "Gaza ceasefire live: Israel says body handed over by Hamas is not one of the hostages",
    "url": "https://www.theguardian.com/world/live/2025/oct/15/gaza-ceasefire-israel-hamas-palestine-aid-hostages-detainees-prisoners-live-news-updates",
    "image": "https://media.guim.co.uk/1fa1942e1069e28a7952e7ca5c08d14a65eef438/593_0_1993_1595/500.jpg",
    "summary": "Israel announced a reduction in the flow of aid by half and indicated that the Rafah crossing will remain closed as scheduled. This decision is linked to delays in the return of bodies of hostages. The situation continues to evolve amid ongoing tensions in the region.",
    "published": "2025-10-15T12:37:40Z"
  },
  {
    "title": "Sweden, Estonia, and Finland pledge to increase spending on weapons purchases from US – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/oct/15/russia-ukraine-nato-france-latest-europe-live-news-updates",
    "image": "https://media.guim.co.uk/07daa153d415a3842375865252675d0a46688e17/426_0_4163_3331/500.jpg",
    "summary": "NATO Secretary-General Mark Rutte announced the expectation of additional financial commitments, highlighting that $2 billion has already been pledged through the organization's funding mechanism. This statement underscores ongoing support for NATO initiatives. The anticipation of further contributions reflects the alliance's focus on enhancing its funding and operational capabilities.",
    "published": "2025-10-15T12:32:41Z"
  },
  {
    "title": "Starmer says he will publish witness statements for collapsed China spy trial – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/oct/15/keir-starmer-kemi-badenoch-pmqs-china-epping-rachel-reeves-imf-uk-politics-live-news-updates",
    "image": "https://media.guim.co.uk/a608a7b4df8b74e5e5689af8fcf6ce3ca013b47a/370_350_2283_1826/500.jpg",
    "summary": "The Prime Minister plans to release full statements regarding a case he is involved in. He attributes the case's failure to the actions of the previous government. This move aims to provide transparency and accountability.",
    "published": "2025-10-15T12:21:12Z"
  }
]