[
  {
    "title": "Union Saint-Gilloise v Newcastle: Champions League – live",
    "url": "https://www.theguardian.com/football/live/2025/oct/01/union-saint-gilloise-v-newcastle-champions-league-live",
    "image": "https://media.guim.co.uk/e47cd094e149a48863def3686f54ceca8196210c/9_82_1816_1453/500.jpg",
    "summary": "Newcastle's Eddie Howe aims for their first league points of the season in an upcoming match. Scott Murray provides a minute-by-minute report on the game's developments. Fans are eager to see if the team can turn their fortunes around.",
    "published": "2025-10-01T17:17:02Z"
  },
  {
    "title": "Starmer bests his conference critics but path ahead still looks perilous",
    "url": "https://www.theguardian.com/politics/2025/oct/01/starmer-bests-his-conference-critics-but-path-ahead-still-looks-perilous",
    "image": "https://media.guim.co.uk/4fe5f5b7f88dd705b766dea2232bf636ad319f0b/571_0_3704_2965/500.jpg",
    "summary": "The Prime Minister delivered a long-anticipated rallying call to address the threat posed by Reform. Despite this effort, many within Labour express concerns about his potential shortcomings. There are ongoing fears that these weaknesses could lead to a public challenge against his leadership.",
    "published": "2025-10-01T17:15:06Z"
  },
  {
    "title": "French military boards Russia-linked oil tanker suspected of launching drones",
    "url": "https://www.theguardian.com/world/2025/oct/01/france-oil-tanker-russia-drone-denmark",
    "image": "https://media.guim.co.uk/e8f782b43cab548046264f2247fd7f6934073f9b/819_0_6142_4915/500.jpg",
    "summary": "A tanker intercepted by the French navy is suspected of being a launchpad for drone flights that caused airport closures in Denmark. The incident has raised concerns about maritime security and the use of commercial vessels for unauthorized drone operations. Authorities are investigating the tanker’s connection to the drone activity.",
    "published": "2025-10-01T17:13:44Z"
  },
  {
    "title": "US government shutdown live: Republican stopgap funding bill fails in Senate as White House to hold press briefing on shutdown",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/01/us-government-shutdown-update-2025-shutting-funding-trump-democrats-republicans-live-updates-latest-news",
    "image": "https://media.guim.co.uk/1cdaebff7784a2a7255d78dd53eaa0e4593e0934/634_0_5000_4000/500.jpg",
    "summary": "The Senate voted 55-45 to reject a Republican bill, with three Democrats voting in favor. The failed legislation faced opposition from the majority. Press briefing to be held by Karoline Leavitt following the vote.",
    "published": "2025-10-01T17:12:31Z"
  },
  {
    "title": "UK government resumes row with Apple by demanding access to British users’ data",
    "url": "https://www.theguardian.com/technology/2025/oct/01/uk-government-apple-data-british-telecoms",
    "image": "https://media.guim.co.uk/3219c23c66ecaf3ca617bd9b761556e6afd8103a/349_0_4418_3535/500.jpg",
    "summary": "The Home Office has issued a new access order aimed at obtaining encrypted cloud backups from a tech company. This move raises concerns over data privacy and security. The implications of the order could affect user trust and the company's operating procedures.",
    "published": "2025-10-01T17:11:08Z"
  }
]