[
  {
    "title": "Only Fools and Horses actor Patrick Murray dies aged 68",
    "url": "https://www.theguardian.com/tv-and-radio/2025/oct/02/only-fools-and-horses-actor-patrick-murray-dies-aged-68",
    "image": "https://media.guim.co.uk/4173ca47ad0c69a4533fee710683cd0d4ca0c418/0_198_2905_2323/500.jpg",
    "summary": "The beloved actor, known for his role as the dim-witted Mickey Pearce in the classic BBC sitcom, has passed away. He was cherished by audiences for his memorable performances in film and television. His contributions to the entertainment industry will be fondly remembered.",
    "published": "2025-10-02T17:14:44Z"
  },
  {
    "title": "There are no good options at Thames Water. But temporary renationalisation is cleaner",
    "url": "https://www.theguardian.com/business/nils-pratley-on-finance/2025/oct/02/there-are-no-good-options-at-thames-water-but-temporary-renationalisation-is-cleaner",
    "image": "https://media.guim.co.uk/55c7b125803beb3009c9c8c615dd2a3f85696bdd/14_0_4580_3667/500.jpg",
    "summary": "Creditors are likely to achieve their request for reduced standards. However, customers are entitled to receive clear and detailed information. Transparency is essential for maintaining trust during this process.",
    "published": "2025-10-02T17:13:41Z"
  },
  {
    "title": "Trump to cut ‘Democrat agencies’ as White House says government shutdown layoffs could be in the thousands – live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/02/government-shutdown-trump-democrats-latest-updates",
    "image": "https://media.guim.co.uk/67f0cf364ead08501750764e4c7d8c49cf1252d5/200_0_6588_5271/500.jpg",
    "summary": "Trump highlights his meeting with Russ Vought, known for Project 2025, to discuss potential budget cuts. Meanwhile, Karoline Leavitt attributes the impending job losses to Democratic policies. Both emphasize their focus on economic issues ahead of upcoming elections.",
    "published": "2025-10-02T17:06:46Z"
  },
  {
    "title": "Synagogue attacker who killed two was a ‘terrorist targeting Jews because they are Jews’, says Starmer – latest updates",
    "url": "https://www.theguardian.com/uk-news/live/2025/oct/02/police-reports-stabbing-synagogue-greater-manchester-live",
    "image": "https://media.guim.co.uk/09f20100fbf2630c0e0352f448c48247471f5999/386_0_3289_2632/500.jpg",
    "summary": "British Prime Minister emphasizes the urgent need to combat rising antisemitism in the country. This statement comes in the wake of an attack in Manchester during Yom Kippur. The PM calls for a united effort to stand against hate and protect the Jewish community.",
    "published": "2025-10-02T17:06:35Z"
  },
  {
    "title": "Kemi Badenoch expected to announce plan to leave ECHR",
    "url": "https://www.theguardian.com/politics/2025/oct/02/kemi-badenoch-expected-to-announce-plan-to-leave-echr",
    "image": "https://media.guim.co.uk/8d5580732613185c2cf1a410494dc70d67c8f37f/23_0_4840_3872/500.jpg",
    "summary": "The Conservatives plan to implement a new policy if they win the next election to counter the rising popularity of Reform UK. This strategy aims to consolidate their voter base and address concerns about the effectiveness of their current platform. The move reflects the party's effort to adapt to shifting political dynamics and retain support.",
    "published": "2025-10-02T17:05:34Z"
  }
]