[
  {
    "title": "Europe seize initiative to take 11½-4½ lead over USA into Ryder Cup singles",
    "url": "https://www.theguardian.com/sport/2025/sep/28/europe-seize-initiative-to-take-1112-412-lead-over-us-into-ryder-cup-singles",
    "image": "https://media.guim.co.uk/62a8bddf938412632b1baeaeac367aedd576277c/251_0_2498_1999/500.jpg",
    "summary": "Europe takes a commanding lead in the Ryder Cup, with a score of 11½-4½ after dominating the USA in Saturday’s foursomes and fourballs. They need just 2½ points to secure victory and retain the trophy. The competition reflects Europe's strong performance throughout the event.",
    "published": "2025-09-27T23:12:39Z"
  },
  {
    "title": "Ryder Cup: USA 4½-11½ Europe – visitors dominate fourballs to stretch lead on fiery day two – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/27/ryder-cup-2025-day-two-live",
    "image": "https://media.guim.co.uk/001fbf87d4da06f4e985127a2e9d89cbe4726793/448_0_4349_3480/500.jpg",
    "summary": "Live updates from day two at Bethpage Black highlight Europe's efforts to strengthen their lead. Coverage includes hole-by-hole reports and the latest developments in the competition. Join our writers for real-time insights as the event unfolds.",
    "published": "2025-09-27T23:08:08Z"
  },
  {
    "title": "Australia news live: Albanese meets with King Charles; Lions fans celebrate after back-to-back AFL flags",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/28/australia-news-live-albanese-king-charles-afl-brisbane-coalition-liberals-western-australia-gst-queensland-nsw-victoria-labor-ntwnfb",
    "image": "https://media.guim.co.uk/37cfec70011ab0a74ced38a506f917147d25cea2/392_367_4998_3999/500.jpg",
    "summary": "I'm sorry, but I can't access current live news updates. However, if you provide details or specific content from the news you want summarized, I'd be happy to help!",
    "published": "2025-09-27T23:04:57Z"
  },
  {
    "title": "K-cure: South Korea’s booming market for traditional (and novel) hangover remedies",
    "url": "https://www.theguardian.com/world/2025/sep/28/south-korea-hangover-cures-booming-market-traditional-novel-remedies-k-cure",
    "image": "https://media.guim.co.uk/4c39ae64471278c1ede3b9448fa60d1e410a8eb3/262_0_4093_3275/500.jpg",
    "summary": "Hovenia dulcis, or heotgae in Korean, has emerged as a key ingredient in South Korea's rapidly growing hangover remedy market. The fruit's medicinal properties are being increasingly recognized and utilized in various products. This trend reflects a broader cultural focus on wellness and recovery methods in the country.",
    "published": "2025-09-27T23:01:03Z"
  },
  {
    "title": "Scottie Scheffler’s flop shows Ryder Cup can bring down even world No 1s | Bryan Armen Graham",
    "url": "https://www.theguardian.com/sport/2025/sep/28/scottie-schefflers-flop-shows-ryder-cup-can-bring-down-even-world-no-1s",
    "image": "https://media.guim.co.uk/701372e6d264b84917acce5642924b77b8ef1da9/818_0_4088_3271/500.jpg",
    "summary": "Scottie Scheffler, the world No. 1, made history at the Ryder Cup by losing all three of his opening matches, marking the worst start for a top-ranked player in the event's history. This unprecedented outcome highlights the pressure and unpredictability of the tournament. Scheffler's performance has drawn significant attention and criticism.",
    "published": "2025-09-27T23:00:35Z"
  }
]