[
  {
    "title": "Chelsea v Arsenal buildup, Slot under pressure, Frank angry at fan boos – matchday live",
    "url": "https://www.theguardian.com/sport/live/2025/nov/30/chelsea-v-arsenal-buildup-slot-under-pressure-at-liverpool-and-more-matchday-live",
    "image": "https://media.guim.co.uk/736869e9c95c2794ff7aebf250ca9d6babbee4aa/0_0_5000_4000/500.jpg",
    "summary": "John Brewin will host a news and discussion segment to provide insights and updates leading up to the day’s events. Viewers can expect expert analysis and commentary. Tune in for an engaging build-up to the day's action.",
    "published": "2025-11-30T08:24:12Z"
  },
  {
    "title": "‘In the presence of evil’: Manchester synagogue attack survivor on the day that shook British Jews",
    "url": "https://www.theguardian.com/news/2025/nov/30/in-the-presence-of-evil-manchester-synagogue-attack-survivor-on-the-day-that-shook-british-jews",
    "image": "https://media.guim.co.uk/da3c06331b76baae26593607190a78ca2ab89e40/720_0_7200_5760/500.jpg",
    "summary": "Yoni Finlay recounts his harrowing experience of being shot while barricading a synagogue during an assault. He highlights the underlying societal factors and climate that contributed to the attack. Finlay's story sheds light on the vulnerabilities faced by communities in times of increased violence and tension.",
    "published": "2025-11-30T08:09:17Z"
  },
  {
    "title": "TV tonight: Paul and Bob consider marriage in Mortimer & Whitehouse Gone Fishing",
    "url": "https://www.theguardian.com/tv-and-radio/2025/nov/30/tv-tonight-paul-and-bob-consider-marriage-in-mortimer-whitehouse-gone-fishing",
    "image": "https://media.guim.co.uk/77f309f2125fe8d03a75baae74977dd16c28b765/25_0_3814_3051/500.jpg",
    "summary": "In the Scottish Highlands, angling buddies deepen their bond during their journey. Meanwhile, Boris Johnson's actions put Nazanin Zaghari-Ratcliffe at risk as the situation surrounding Prisoner 951 unfolds. Tune in this evening for more on these stories.",
    "published": "2025-11-30T08:00:03Z"
  },
  {
    "title": "‘He massages Trump’s basest instincts’: why is Fifa’s Gianni Infantino cosying up to the US president?",
    "url": "https://www.theguardian.com/football/2025/nov/30/he-massages-trumps-basest-instincts-why-is-fifas-gianni-infantino-cosying-up-to-the-us-president",
    "image": "https://media.guim.co.uk/5955db572bed669f7123f6e42493b144de2adee5/0_11_2197_1757/500.jpg",
    "summary": "FIFA President Gianni Infantino, despite claiming that football should remain apolitical, is actively engaging with controversial political figures. His efforts raise questions about the true intersection of sports and politics. Critics are skeptical of his motivations and the potential impact on the integrity of football.",
    "published": "2025-11-30T08:00:02Z"
  },
  {
    "title": "Failure to diagnose treatable male infertility leading to unnecessary IVF, experts say",
    "url": "https://www.theguardian.com/society/2025/nov/30/male-infertility-overlooked-couples-attempting-ivf-experts-say",
    "image": "https://media.guim.co.uk/de24067d6c4b2e8fb3c039c0a6b9028e38e8bdef/663_0_6627_5304/500.jpg",
    "summary": "Men account for 50% of infertility cases, yet many general practitioners have a limited understanding of male infertility. As a result, these issues frequently go untreated, impacting couples trying to conceive. Increased awareness and education among healthcare providers are essential for addressing this gap.",
    "published": "2025-11-30T08:00:02Z"
  }
]