[
  {
    "title": "Australia news live: man arrested in Melbourne CBD after alleged carjackings; consumer confidence in economy hits 12-month low",
    "url": "https://www.theguardian.com/australia-news/live/2025/oct/14/australia-news-live-jim-chalmers-superannuation-concession-tax-cybercrime-anthony-albanese-sussan-ley-coalition-penny-wong-israel-gaza-ntwnfb",
    "image": "https://media.guim.co.uk/025311986730901596becc7162ac435341431cdf/181_0_2972_2379/500.jpg",
    "summary": "I apologize, but I can't provide a summary without specific content or details about the news. If you share the relevant information or article, I would be happy to help summarize it!",
    "published": "2025-10-14T02:57:04Z"
  },
  {
    "title": "Police expand search for missing boy Gus in outback SA after advice from ‘survival specialists’ ",
    "url": "https://www.theguardian.com/australia-news/2025/oct/14/four-year-old-missing-boy-gus-police-expand-search-sa-outback",
    "image": "https://media.guim.co.uk/15978ffebf6d420326646ba916485e1a7a9ac898/0_250_1200_960/500.jpg",
    "summary": "The South Australian commissioner stated that police are thoroughly investigating all leads to recover the body of a four-year-old child who went missing in late September. Efforts are ongoing, with authorities determined to find answers. The community remains hopeful and supportive during this difficult time.",
    "published": "2025-10-14T02:48:12Z"
  },
  {
    "title": "Victorian Coalition vows to scrap Australia’s first statewide treaty with First Nations peoples if it wins government",
    "url": "https://www.theguardian.com/australia-news/2025/oct/14/victorian-coalition-vows-scrap-first-nations-treaty-if-wins-government",
    "image": "https://media.guim.co.uk/38a6850d4974172cef65723552c18783b25b5ac4/850_0_6508_5206/500.jpg",
    "summary": "The opposition has unveiled a plan as the lower house of the state parliament commences debate on a significant treaty bill. This development marks a critical moment in the legislative process, with potential implications for future governance. The treaty bill seeks to address key issues and may reshape the relationship between the government and various stakeholders.",
    "published": "2025-10-14T02:41:48Z"
  },
  {
    "title": "Student’s alleged torture death by Cambodia scammers sparks turmoil in South Korea",
    "url": "https://www.theguardian.com/world/2025/oct/14/south-korea-student-alleged-torture-death-cambodia-scammers-sparks-turmoil",
    "image": "https://media.guim.co.uk/65202a208f03ece5bcf4ff7205b10ece6cc5670a/841_217_3816_3053/500.jpg",
    "summary": "The South Korean president has called for comprehensive measures to safeguard citizens following a significant rise in kidnappings in Cambodia in recent months. He emphasized the need for enhanced coordination between relevant authorities to ensure the safety of nationals abroad. The government is prioritizing citizen protection amid growing concerns over the safety situation in the region.",
    "published": "2025-10-14T01:48:44Z"
  },
  {
    "title": "Watching from Australia while Donald Trump targets my home of Chicago with armed troops prompts deep questions | Miles Herbert",
    "url": "https://www.theguardian.com/commentisfree/2025/oct/14/watching-from-australia-while-donald-trump-threatens-my-home-of-chicago-with-armed-troops-prompts-deep-questions",
    "image": "https://media.guim.co.uk/16ef2ce5e57ef1c162b1416a80b73e341dd04e07/508_0_5033_4024/500.jpg",
    "summary": "The speaker expresses a desire to avoid future regrets about missed opportunities to take action. They emphasize the importance of proactive engagement and commitment to making a difference. This sentiment reflects a determination to fully invest oneself in future endeavors.",
    "published": "2025-10-13T23:34:36Z"
  }
]