[
  {
    "title": "New Zealand v Australia: men’s first T20 international cricket – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/01/mens-t20-international-cricket-live-new-zealand-v-australia",
    "image": "https://media.guim.co.uk/2d6e9c7657a758d8f4f098f3dd445b21790fd436/682_0_3438_2750/500.jpg",
    "summary": "Australia competes against New Zealand in a three-match Twenty20 series at Bay Oval in Tauranga. Angus Fontaine will provide over-by-over updates on the match. Fans can expect live commentary and analysis throughout the series.",
    "published": "2025-10-01T07:19:04Z"
  },
  {
    "title": "Australia news live: Kamala Harris to speak at Australian women’s leadership summit next year",
    "url": "https://www.theguardian.com/australia-news/live/2025/oct/01/australia-news-live-nicole-kidman-divorce-keith-urban-sussan-ley-coalition-andrew-hastie-anthony-albanese-housing-ntwnfb",
    "image": "https://media.guim.co.uk/733add278c3ad81a7447670a5c4a03f0de493fff/585_0_6388_5111/500.jpg",
    "summary": "Please provide the specific news you'd like me to summarize.",
    "published": "2025-10-01T07:17:31Z"
  },
  {
    "title": "US government shutdown live: first closure since 2018 begins after funding bill fails",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/01/us-government-shutdown-update-2025-shutting-funding-trump-democrats-republicans-live-updates-latest-news",
    "image": "https://media.guim.co.uk/654b42cd87a48b55d6a8450a3407e027d0689673/275_0_4913_3933/500.jpg",
    "summary": "Competing bills aimed to address the US government shutdown were rejected in the Senate, highlighting partisan divides between Republicans and Democrats. Both parties exchanged accusations of engaging in political maneuvering. The impasse continues as the government remains closed and discussions evolve.",
    "published": "2025-10-01T07:15:17Z"
  },
  {
    "title": "UK’s FTSE 100 share index hits record high as investors shrug off US government shutdown – business live",
    "url": "https://www.theguardian.com/business/live/2025/oct/01/uk-house-prices-return-to-growth-us-dollar-shutdown-manufacturing-growth-business-live-news",
    "image": "https://media.guim.co.uk/74ba1d6637e24977b469b130f707df3cecca3f94/196_0_2989_2391/500.jpg",
    "summary": "The latest economic and financial news highlights ongoing market fluctuations and shifts in investor sentiment. Key indicators are being closely monitored, with analysts assessing the impact of recent policy changes and global events. Investors are advised to stay informed as developments unfold in the economy.",
    "published": "2025-10-01T07:14:02Z"
  },
  {
    "title": "Campaigners urged to counter far-right narrative on child poverty in Scotland",
    "url": "https://www.theguardian.com/society/2025/oct/01/child-poverty-scotland-narrative-practical-guide-charities",
    "image": "https://media.guim.co.uk/41a478b9017ee131d400b93063fb3448c30b73f7/1201_1374_4243_3395/500.jpg",
    "summary": "Charities have released a practical guide aimed at campaigners, emphasizing that the language used in advocacy can sometimes be counterproductive. The guide aims to improve communication strategies and foster more effective discussions. It highlights the importance of thoughtful messaging in promoting charitable causes.",
    "published": "2025-10-01T07:07:13Z"
  }
]