[
  {
    "title": "Australia news live: Sussan Ley says cost of net zero ‘looks too high’ as she sidesteps question on climate ructions",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/17/australia-news-live-liberal-sussan-ley-net-zero-target-climate-crisis-anthony-albanese-donald-trump-trade-tariffs-politics-ntwnfb",
    "image": "https://media.guim.co.uk/0d6add0940e9fe3d440eaecb674d44040122831a/0_0_5975_4783/500.jpg",
    "summary": "Please provide the news content you'd like me to summarize, and I'll be happy to help!",
    "published": "2025-09-17T04:35:01Z"
  },
  {
    "title": "Country diary: It’s hard not to fret over snails and their trails | Derek Niemann",
    "url": "https://www.theguardian.com/environment/2025/sep/17/country-diary-its-hard-not-to-fret-over-snails-and-their-trails",
    "image": "https://media.guim.co.uk/a433ed77e7102549cd5b5a812823e481fbb5239d/94_0_1666_1333/500.jpg",
    "summary": "In Frome, Somerset, unusual doormat-gathering phenomena have been observed with items appearing and disappearing due to recent dry weather. After months of absence, these items have returned, showcasing their full presence. The situation has drawn attention and intrigue from locals.",
    "published": "2025-09-17T04:30:25Z"
  },
  {
    "title": "American independent cinema owes much to Sundance king Robert Redford | Adrian Horton",
    "url": "https://www.theguardian.com/film/2025/sep/17/robert-redford-sundance-american-independent-cinema",
    "image": "https://media.guim.co.uk/ec7b9138875516a046a7884133ac5549ab9c0ec0/394_0_2548_2039/500.jpg",
    "summary": "Robert Redford leveraged his influence through the Sundance Film Festival and Institute to elevate the visibility of emerging filmmakers. His efforts have significantly impacted the film industry by fostering new talent. The festival continues to be a platform for diverse voices and innovative storytelling.",
    "published": "2025-09-17T04:24:25Z"
  },
  {
    "title": "UTS’s teacher education program set to close as university reveals plan to slash more than 1,000 subjects",
    "url": "https://www.theguardian.com/australia-news/2025/sep/17/utss-teacher-education-program-set-to-close-as-university-reveals-plan-to-slash-over-1000-subjects",
    "image": "https://media.guim.co.uk/92d8ab5f36f46eaf8ada1d4b7b4c9017c60800a4/141_0_2919_2335/500.jpg",
    "summary": "The University of Technology Sydney plans to discontinue 1,101 subjects, with 463 of them having no student enrollments and not being taught in 2024. This move is part of a proposal aimed at streamlining course offerings. The reduction reflects an effort to enhance educational efficiency at the university.",
    "published": "2025-09-17T04:20:44Z"
  },
  {
    "title": "‘The epitome of amazingness’: how electroclash brought glamour, filth and fun back to 00s music",
    "url": "https://www.theguardian.com/music/2025/sep/17/the-epitome-of-amazingness-how-electroclash-brought-glamour-filth-and-fun-back-to-00s-music",
    "image": "https://media.guim.co.uk/901f7b2ce8604d8276444ce624636a6a8eab8dea/80_0_2368_1894/500.jpg",
    "summary": "The 2000s punk scene, known for its witty and rebellious spirit, is experiencing a revival as artists like Peaches and Jonny Slut reflect on its vibrant and edgy culture. This era stood in contrast to polished superclubs and the rock establishment. The resurgence celebrates the raw sound and exuberance of that unique musical movement.",
    "published": "2025-09-17T04:00:28Z"
  }
]