[
  {
    "title": "US Open 2025: Osaka v Gauff, Swiatek wins, Auger-Aliassime beats Rublev on day nine – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/01/us-open-tennis-2025-swiatek-osaka-gauff-de-minaur-musetti-day-nine-live",
    "image": "https://media.guim.co.uk/a33ce9f26efd91fd7c727011efff6860b68d0fc9/465_0_4299_3438/500.jpg",
    "summary": "Taha Hashim will provide live updates as former champions Naomi Osaka and Coco Gauff compete in the fourth round of the tournament. This marks an exciting matchup in the ongoing event. Tune in for real-time insights and analysis.",
    "published": "2025-09-01T19:22:36Z"
  },
  {
    "title": "Transfer deadline day: Guéhi to Liverpool move collapses: Isak, Hincapié and Kolo Muani deals agreed – live",
    "url": "https://www.theguardian.com/football/live/2025/sep/01/transfer-deadline-day-guehi-wissa-martinez-ederson-latest-and-more-live",
    "image": "https://media.guim.co.uk/aa4d060273b35ea2fcd3c48387d741cf266a6f87/472_0_2598_2079/500.jpg",
    "summary": "Will Magee will provide ongoing coverage of the latest developments in the transfer window, highlighting key late drama and the subsequent implications. Stay tuned for real-time updates and analyses of player movements and team changes. Follow along for insights on the fallout from this transfer period.",
    "published": "2025-09-01T19:21:13Z"
  },
  {
    "title": "Starmer seeks to wrest back policy control from Treasury in No 10 shake-up",
    "url": "https://www.theguardian.com/politics/2025/sep/01/starmer-seeks-to-wrest-back-policy-control-from-treasury-in-no-10-shake-up",
    "image": "https://media.guim.co.uk/3cc07ee8aebb5fd3a78572388d08f0b4587a9359/2878_0_2276_1821/500.jpg",
    "summary": "The Prime Minister has appointed the Chancellor's deputy and a former Bank of England chief to newly established senior positions. This move aims to bolster economic leadership within the government. The appointments reflect a strategic approach to address current financial challenges.",
    "published": "2025-09-01T19:14:33Z"
  },
  {
    "title": "Reshuffle gymnastics prepare Starmer to walk tricky budget tightrope",
    "url": "https://www.theguardian.com/business/2025/sep/01/reshuffle-gymnastics-prepare-starmer-to-walk-tricky-budget-tightrope",
    "image": "https://media.guim.co.uk/02473b53a949a5d75459e8f547c2307bb582ad6c/676_58_7067_5658/500.jpg",
    "summary": "Economists believe that the newly formed team has the potential to counter the Treasury's actions effectively. However, they emphasize that the Prime Minister must clearly articulate his vision and priorities. Without this clarity, the team's effectiveness may be limited.",
    "published": "2025-09-01T18:55:41Z"
  },
  {
    "title": "The Smashing Machine review – Dwayne Johnson only possible casting for crisis-riddled UFC champ Mark Kerr",
    "url": "https://www.theguardian.com/film/2025/sep/01/the-smashing-machine-review-dwayne-johnson-mark-kerr",
    "image": "https://media.guim.co.uk/2d747ad966270fe2e11834b168815a1ca30d0aa2/94_0_2813_2250/500.jpg",
    "summary": "Former pro wrestler Johnson stars as Kerr, a giant of a man who experiences a crisis after suffering an unexpected defeat. The character's explosive meltdown explores themes of pride and resilience. The story promises an emotional rollercoaster as Kerr grapples with the impact of his loss.",
    "published": "2025-09-01T18:45:20Z"
  }
]