[
  {
    "title": "Ukraine should be able to use frozen Russian assets to buy and make weapons, says Zelenskyy – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/oct/23/russia-sanctions-ukraine-loan-assets-zelenskyy-putin-european-council-latest-news-updates",
    "image": "https://media.guim.co.uk/b387200571eee445ec1784a7f52cc056129063f1/950_0_4923_3938/500.jpg",
    "summary": "EU leaders are considering a proposal to utilize Russian assets for reparations loans associated with the war in Ukraine. In response, Russia's foreign ministry has issued a warning of a \"painful response\" should this plan be implemented. The discussions reflect ongoing tensions between the EU and Russia amidst the ongoing conflict.",
    "published": "2025-10-23T15:19:44Z"
  },
  {
    "title": "India set New Zealand 325 from 44 overs: Women’s Cricket World Cup – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/23/india-v-new-zealand-womens-cricket-world-cup-live",
    "image": "https://media.guim.co.uk/6d3b154760dd3a65ea0746ab8115cafba3fe054b/109_0_2256_1805/500.jpg",
    "summary": "Despite suffering three straight defeats, India has the opportunity to secure the final semi-final spot with a win in their upcoming match. The hosts aim to turn their fortunes around. Follow our writers for live updates and analysis.",
    "published": "2025-10-23T15:17:55Z"
  },
  {
    "title": "Eric Adams will reportedly endorse Andrew Cuomo in final stretch of NYC mayoral race – live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/23/trump-san-francisco-federal-agents-white-house-ice-immigration-latest-news-updates",
    "image": "https://media.guim.co.uk/6392f622d6b21cee96ab0813da28d1396bba0763/541_0_4669_3736/500.jpg",
    "summary": "Cuomo continues to trail in the polls behind frontrunner Zohran Mamdani, the Democratic nominee. Despite efforts to gain ground, he has not closed the gap. Mamdani maintains a strong lead in key voter demographics.",
    "published": "2025-10-23T15:16:07Z"
  },
  {
    "title": "Where’s her Pulitzer already? Joanna Newsom’s 20 best songs – ranked!",
    "url": "https://www.theguardian.com/music/2025/oct/23/joanna-newsom-20-best-songs-ranked",
    "image": "https://media.guim.co.uk/ab670088966e219228f56de6647cbe1e5bd0b205/218_0_3495_2796/500.jpg",
    "summary": "A decade after the release of her acclaimed album \"Divers,\" a retrospective highlights the most stunning and poignant songs by the singer-songwriter-harpist. The review celebrates her unique artistry and emotional depth. Fans are invited to revisit her most memorable tracks that define her musical journey.",
    "published": "2025-10-23T15:15:25Z"
  },
  {
    "title": "UK manufacturers hit by largest drop in orders since 2020; FTSE 100 hits record high – business live",
    "url": "https://www.theguardian.com/business/live/2025/oct/23/oil-price-us-sanctions-rosneft-lukoil-software-curbs-china-trade-war-business-live",
    "image": "https://media.guim.co.uk/fc1fa9ec5413a33f69cb897b360242e97204ff80/0_0_4164_3333/500.jpg",
    "summary": "Shares of oil companies rise following new U.S. sanctions on Russian energy firms, boosting investor confidence in the sector. Meanwhile, manufacturers express concerns over weak prospects, indicating potential challenges ahead. The contrasting market reactions highlight the divide between energy and manufacturing sectors amid geopolitical tensions.",
    "published": "2025-10-23T15:07:49Z"
  }
]