[
  {
    "title": "UK bank shares jump after ‘avoiding budget tax raid’; German economy stagnating – business live",
    "url": "https://www.theguardian.com/business/live/2025/nov/25/sterling-volatility-the-budget-rachel-reeves-german-economy-stagnating-stock-markets-business-live-news",
    "image": "https://media.guim.co.uk/1a4e00dd53e74be9e6a38aa502ceda64826638a6/0_0_2930_2344/500.jpg",
    "summary": "Stay updated with the latest developments in the economy and financial markets, featuring real-time analysis and insights. Key trends, stock movements, and financial policy changes are highlighted. This rolling coverage provides a comprehensive overview for informed decision-making.",
    "published": "2025-11-25T10:19:02Z"
  },
  {
    "title": "US to hold Russia-Ukraine peace talks in Abu Dhabi after Kyiv hit with deadly overnight strikes - Europe live ",
    "url": "https://www.theguardian.com/world/live/2025/nov/25/us-russia-ukraine-peace-talks-abu-dhabi-kyiv-strikes-zelenskyy-putin-europe-live-news",
    "image": "https://media.guim.co.uk/eb053601e69d2a0f8cc056d984033cbd97ca488f/252_0_4589_3672/500.jpg",
    "summary": "US Army Secretary Daniel Driscoll is set to hold a meeting today, following a reported meeting with Russia on Monday night. The discussions come amid ongoing tensions and strategic military considerations. The outcome of these talks may influence future US-Russia relations.",
    "published": "2025-11-25T10:16:47Z"
  },
  {
    "title": "One in seven English bathing spots rated as polluted in latest testing",
    "url": "https://www.theguardian.com/environment/2025/nov/25/one-in-seven-english-bathing-spots-rated-as-polluted-in-latest-testing",
    "image": "https://media.guim.co.uk/f3d567ad6bf763ce77ef2f5290c95a60aafeb1f5/0_0_5600_4480/500.jpg",
    "summary": "Water quality tests in Scarborough and Bognor Regis have revealed high levels of pollution, making it unsafe for swimming. Authorities have advised the public to avoid these areas until further notice. Concerns over water safety are prompting calls for improved testing and environmental protections.",
    "published": "2025-11-25T10:16:30Z"
  },
  {
    "title": "Labour condemns Nigel Farage after he ducks calls for probe into potential Reform UK links to Russia – UK politics live ",
    "url": "https://www.theguardian.com/politics/live/2025/nov/25/nigel-farage-nathan-gill-labour-reform-uk-russia-keir-starmer-uk-politics-live-news",
    "image": "https://media.guim.co.uk/6f3be033903775454125fda3bca9cde8f61df429/568_0_6422_5140/500.jpg",
    "summary": "Nigel Farage announced that he will not pursue a broader investigation following the recent sentencing of Nathan Gill, the former leader of Reform UK in Wales. This decision comes in the wake of last week's legal outcome. Farage's stance suggests a focus on moving forward rather than delving into further inquiries.",
    "published": "2025-11-25T10:12:25Z"
  },
  {
    "title": "The Breakdown | A November to remember: let’s celebrate the good in international rugby",
    "url": "https://www.theguardian.com/sport/2025/nov/25/rugby-union-autumn-internationals-south-africa-england-france-new-zealand",
    "image": "https://media.guim.co.uk/b174013d52e4d1184472ed6f88bfd7244616da3a/195_0_3240_2592/500.jpg",
    "summary": "The article reflects on the delightful and whimsical aspects of the autumn internationals in sports. It highlights memorable moments that captivated audiences and brought joy to fans. This nostalgic look aims to celebrate the overall charm of the event.",
    "published": "2025-11-25T10:05:29Z"
  }
]