[
  {
    "title": "USA v Australia: men’s international football friendly – live updates",
    "url": "https://www.theguardian.com/football/live/2025/oct/15/usa-v-australia-mens-international-football-friendly-live-updates",
    "image": "https://media.guim.co.uk/6db35343ef443ded22384d6e06b1999ddf9e20a9/487_0_3809_3048/500.jpg",
    "summary": "The US men's national soccer team is facing Australia in a friendly match held in Commerce City, Colorado. Fans can follow the live updates and action through Alexander Abnos. This match serves as a preparation for upcoming competitions.",
    "published": "2025-10-15T01:26:30Z"
  },
  {
    "title": "Candace Owens: Australia’s high court backs government decision to deny visa to US rightwinger",
    "url": "https://www.theguardian.com/australia-news/2025/oct/15/candace-owens-australia-visa-high-court-backs-government-decision-deny",
    "image": "https://media.guim.co.uk/d540bbb0f70e779366b49ccb42a5ab6f13de0c89/348_0_3480_2784/500.jpg",
    "summary": "A court has upheld the home affairs minister's decision to deny a visa application for a planned speaking tour, citing character concerns. The ruling supports the minister's assessment of the individual’s background. This decision may impact future speaking engagements.",
    "published": "2025-10-15T01:23:20Z"
  },
  {
    "title": "News live: far-right US commentator Candace Owens loses appeal over denied Australian visa; Allan says Ley ‘only focused’ on division after crime comments",
    "url": "https://www.theguardian.com/australia-news/live/2025/oct/15/australia-news-live-liberals-infighting-james-paterson-sussan-ley-andrew-hastie-superannuation-jim-chalmers-ntwnfb",
    "image": "https://media.guim.co.uk/2bacc9a45dc11915b7cac053ba924d04640104aa/965_795_3361_2689/500.jpg",
    "summary": "Please provide the news content you'd like me to summarize, and I'll be happy to help!",
    "published": "2025-10-15T01:23:17Z"
  },
  {
    "title": "Queensland’s pandering to climate deniers is making it even tougher for Albanese to drive down emissions | Clear Air",
    "url": "https://www.theguardian.com/environment/2025/oct/15/queenslands-pandering-to-climate-deniers-is-making-it-even-tougher-for-albanese-to-drive-down-emissions",
    "image": "https://media.guim.co.uk/3ff43fbce357048a40a90ca1ff9c8aeea328b086/586_0_3342_2676/500.jpg",
    "summary": "Queensland has been identified as Australia's largest polluter, surpassing Western Australia in emissions. This is notable given that Western Australia lacks a climate target and heavily supports its fossil fuel industry. The findings highlight significant concerns about Queensland's environmental impact and climate policy.",
    "published": "2025-10-15T01:14:32Z"
  },
  {
    "title": "US revokes visas from six foreign nationals for social media comments critical of Charlie Kirk – live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/14/donald-trump-government-shutdown-national-guard-javier-milei-charlie-kirk-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/b77efdf1af9a6bc9ba018e1f93014bc8b290d25c/355_0_3968_3174/500.jpg",
    "summary": "The Trump administration has announced a significant shift in its stance towards social media, contradicting its initial promise to combat censorship. This change has raised eyebrows, given the administration's previous commitment to protecting free speech online. The decision reflects a notable evolution in its approach to social media regulation.",
    "published": "2025-10-15T01:10:05Z"
  }
]