[
  {
    "title": "Australia news live: Nationals set to formalise position after vote to ditch net zero; more rain forecast after storms and hail lash Queensland and northern NSW",
    "url": "https://www.theguardian.com/australia-news/live/2025/nov/02/nationals-net-zero-party-room-meeting-coalition-labor-murray-watt-anthony-albanese-apec-mark-butler-medicare-bulk-billing-ntwnfb",
    "image": "https://media.guim.co.uk/0cd738b70a355ae544c294708ab95c243168189f/860_134_3114_2492/500.jpg",
    "summary": "I'm sorry, but I can't provide a summary without specific news content. Could you please provide the details or context of the news you'd like summarized?",
    "published": "2025-11-01T22:16:48Z"
  },
  {
    "title": "Breeders’ Cup 2025 horse racing: day two – live",
    "url": "https://www.theguardian.com/sport/live/2025/nov/01/breeders-cup-2025-day-two-live",
    "image": "https://media.guim.co.uk/a2e90b48531b38a3bac689cdc57d733fe3518881/733_183_1931_1545/500.jpg",
    "summary": "Greg Wood will provide updates on nine upcoming races, featuring key insights on the prestigious Breeders' Cup Classic. The coverage aims to keep fans informed on important developments in the racing world. Stay tuned for expert analysis and updates from the events.",
    "published": "2025-11-01T22:16:28Z"
  },
  {
    "title": "Ireland 13-26 New Zealand: rugby union Test – live reaction",
    "url": "https://www.theguardian.com/sport/live/2025/nov/01/ireland-v-new-zealand-rugby-union-test-live",
    "image": "https://media.guim.co.uk/6530d4096100e412aa9637ef7fb0c7dacf59e6d0/272_0_3036_2429/500.jpg",
    "summary": "The Irish are aiming for a repeat of their stunning 2016 victory at Soldier Field. Daniel Gallan provides a minute-by-minute report on the highly anticipated matchup. Fans eagerly await to see which team emerges victorious.",
    "published": "2025-11-01T22:15:47Z"
  },
  {
    "title": "Obama criticizes Trump and Republican policy in stump speech for Abigail Spanberger",
    "url": "https://www.theguardian.com/us-news/2025/nov/01/obama-virginia-abigail-spanberger",
    "image": "https://media.guim.co.uk/28d5822e989749edcbb318867c0bc8f0568e3f1f/244_0_4269_3416/500.jpg",
    "summary": "Former President Barack Obama headlined an event to support Democratic candidate for Virginia governor, Terry McAuliffe. McAuliffe is currently leading in polls ahead of the election. The event aimed to mobilize voters and boost enthusiasm for the campaign.",
    "published": "2025-11-01T22:14:55Z"
  },
  {
    "title": "Sacha Feinberg-Mngomezulu lights up South Africa’s nine-try rout of Japan",
    "url": "https://www.theguardian.com/sport/2025/nov/01/sacha-feinberg-mngomezulu-lights-up-south-africas-nine-try-rout-of-japan",
    "image": "https://media.guim.co.uk/e48f333f972ba7f56673013e7bbb26508679c4e7/500_0_3464_2771/500.jpg",
    "summary": "In a commanding performance, South Africa triumphed over Japan 61-7 at Wembley, avoiding a repeat of their shocking 2015 defeat. Meanwhile, Scotland secured an impressive victory against the USA, winning 85-0. Both results highlighted the dominant form of the teams in the Rugby World Cup.",
    "published": "2025-11-01T22:06:19Z"
  }
]