[
  {
    "title": "Yvette Cooper defends children as young as 13 needing digital ID – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/oct/10/uk-politics-latest-live-news-labour-reform-plaid-cymru-snp-conservatives",
    "image": "https://media.guim.co.uk/b89470e423fed5c8dcd44a6d00b035bc70b45338/1004_279_1890_1512/500.jpg",
    "summary": "The Foreign Secretary supports implementing digital IDs for young teenagers, calling it a positive step forward. This initiative aims to enhance identity verification and online safety for minors. The proposal is part of broader efforts to modernize identity management in the digital age.",
    "published": "2025-10-10T13:23:55Z"
  },
  {
    "title": "Is being a Guardian reporter as exciting as the movies make out?",
    "url": "https://www.theguardian.com/film/2025/oct/10/keira-knightley-netflix-woman-in-cabin-10-guardian-in-the-movies",
    "image": "https://media.guim.co.uk/97737e81d239018d9b37cacd83329794562c7894/686_0_4167_3333/500.jpg",
    "summary": "Keira Knightley shines in her role in \"The Woman in Cabin 10,\" presenting a glamorous image that contrasts with the Guardian staff. Meanwhile, David Tennant closely resembles star reporter Nick Davies. The article questions the authenticity of their portrayals.",
    "published": "2025-10-10T13:21:05Z"
  },
  {
    "title": "Rangers condemn ‘shameful’ attack on Smith statue; Tuchel criticises England fans: football – live",
    "url": "https://www.theguardian.com/football/live/2025/oct/10/tuchel-criticises-silent-england-fans-world-cup-qualifying-news-and-more-football-live",
    "image": "https://media.guim.co.uk/91c95a4ce920ea2bc5f35c724229358c43f191f2/0_0_3003_2403/500.jpg",
    "summary": "A live report is underway featuring reactions to the England vs. Wales match, along with updates on World Cup qualifying events. Writers are providing insights and commentary on the ongoing sports action. Stay tuned for more developments as the games progress.",
    "published": "2025-10-10T13:18:06Z"
  },
  {
    "title": "High street slot machine shops pay staff bonuses linked to how much gamblers lose",
    "url": "https://www.theguardian.com/society/2025/oct/10/high-street-slot-machine-shops-pay-staff-bonuses-linked-to-how-much-gamblers-lose",
    "image": "https://media.guim.co.uk/f6f947e83eae0faf09d76f487ce04da8d4cce669/805_0_6713_5373/500.jpg",
    "summary": "MPs and campaigners have expressed strong condemnation of a reward scheme for Merkur venue managers, labeling it as \"appalling.\" The criticism highlights concerns over the ethics and implications of incentivizing management in this manner. This backlash reflects growing scrutiny over corporate practices in the gaming sector.",
    "published": "2025-10-10T13:06:50Z"
  },
  {
    "title": "Letitia James accuses Donald Trump of ‘weaponizing’ US justice system after her indictment – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/10/letitia-james-donald-trump-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/4d0114ef50ca1dfd8805fb7ab4f3879c1e64ba3f/303_0_3026_2420/500.jpg",
    "summary": "The prosecutor who spearheaded the civil fraud investigation into Donald Trump in 2023 has dismissed the charges brought against her as unfounded. She asserts that the allegations lack merit and are intended to undermine her work. The situation highlights ongoing tensions surrounding Trump and legal accountability.",
    "published": "2025-10-10T13:04:20Z"
  }
]