[
  {
    "title": "Manchester City look to bounce back, EFL team news and buildup – matchday live",
    "url": "https://www.theguardian.com/football/live/2025/nov/29/manchester-city-look-to-bounce-back-in-premier-league-lionesses-in-action-matchday-live",
    "image": "https://media.guim.co.uk/1e361a820adc107e1f7d636768c365202e00b00d/0_0_3757_3005/500.jpg",
    "summary": "Yara El-Shaboury will host a news segment and discussion to prepare for the upcoming day's events. Viewers can expect insightful commentary and analysis. Tune in for updates and engagement as the action unfolds.",
    "published": "2025-11-29T12:33:21Z"
  },
  {
    "title": "Rage rooms: can smashing stuff up really help to relieve anger and stress?",
    "url": "https://www.theguardian.com/society/2025/nov/29/rage-rooms-can-smashing-stuff-up-help-relieve-anger-stress",
    "image": "https://media.guim.co.uk/751a757de1bc68964d3da2299947b6b59703c0d4/264_0_5000_4000/500.jpg",
    "summary": "New venues offering destruction as a form of stress relief are emerging across the UK. However, experts and correspondents express uncertainty about the efficacy and implications of these outlets. The trend raises questions about their impact on mental health and societal norms.",
    "published": "2025-11-29T12:00:37Z"
  },
  {
    "title": "‘We had to swim to safety. I didn’t think we would make it out alive’: the people fleeing climate breakdown – in pictures",
    "url": "https://www.theguardian.com/environment/2025/nov/29/people-fleeing-climate-breakdown-in-pictures",
    "image": "https://media.guim.co.uk/e2f88153525c6febd0b3188e3497f4351f4e0655/167_0_4980_3986/500.jpg",
    "summary": "Photographers Mathias Braschler and Monika Fischer document the lives of families, farmers, and fishers displaced by extreme weather events. Their work highlights both the human impact of climate change and the landscapes these individuals have had to abandon. Through powerful imagery, they raise awareness of the ongoing crisis faced by communities around the world.",
    "published": "2025-11-29T12:00:37Z"
  },
  {
    "title": "They tried to overturn the 2020 US election. Now, they hold power in Trump’s Washington",
    "url": "https://www.theguardian.com/us-news/2025/nov/29/2020-election-deniers-trump",
    "image": "https://media.guim.co.uk/4a8e04942c50ff4e80d04f5ef9119e030bee7f88/0_0_1500_1200/500.jpg",
    "summary": "Individuals involved in efforts to overturn the 2020 election have secured significant positions within the federal government. Their roles allow them to influence regulations and policies, potentially undermining public trust in future elections. As the 2026 election approaches, their presence raises concerns about electoral integrity.",
    "published": "2025-11-29T12:00:36Z"
  },
  {
    "title": "A Black Georgia community uprooted in 1942 still fights to go home",
    "url": "https://www.theguardian.com/news/2025/nov/29/georgia-harris-neck-gullah-geechee",
    "image": "https://media.guim.co.uk/63b631d618a2980c506453b961cad2454da87a65/867_0_5000_4000/500.jpg",
    "summary": "Descendants of Gullah Geechee families from Harris Neck are advocating for the return of ancestral land that was taken for the construction of a wartime airfield. They argue that the land holds cultural and historical significance for their community. The effort highlights ongoing issues of land restitution and Indigenous rights in the U.S.",
    "published": "2025-11-29T12:00:36Z"
  }
]