[
  {
    "title": "Schumer says Democrats will force vote to overturn Canada tariffs as Carney says nation ‘stands ready’ to continue US trade talks – live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/24/donald-trump-trade-negotiations-canada-mark-carney-terminated-tariff-letitia-james-new-york-us-politics-live-news",
    "image": "https://media.guim.co.uk/76634a605e91f546734d90beb535dfeb4fcb80e9/393_0_3400_2719/500.jpg",
    "summary": "The Democratic leader has criticized Canada's tariffs as harmful and pledged to work towards their reversal. Meanwhile, the Canadian Prime Minister expressed a desire for advancements in trade negotiations between the two countries. Efforts are underway to address the escalating trade tensions.",
    "published": "2025-10-24T18:24:38Z"
  },
  {
    "title": "Dejphon Chansiri and everything that has gone wrong at Sheffield Wednesday",
    "url": "https://www.theguardian.com/football/2025/oct/24/dejphon-chansiri-and-everything-that-has-gone-wrong-at-sheffield-wednesday",
    "image": "https://media.guim.co.uk/7018343c3b983a9cbb39fb23edbd6cb6acbb4585/337_0_4327_3461/500.jpg",
    "summary": "A significant event occurred that prompted regulatory scrutiny due to potential oversight failures. The situation arose from underlying issues within the system that went unaddressed, leading to the current crisis. Moving forward, regulators will likely evaluate their policies and enforcement measures to prevent similar incidents in the future, reflecting on whether more proactive measures could have been taken.",
    "published": "2025-10-24T18:21:13Z"
  },
  {
    "title": "US airstrike on ‘drug boat’ kills six as aircraft carrier sent to South America",
    "url": "https://www.theguardian.com/us-news/2025/oct/24/us-military-strike-alleged-drug-boat-caribbean",
    "image": "https://media.guim.co.uk/5c1abe0bf345176ff1b2a78f94b156cf93facc69/101_0_1482_1186/500.jpg",
    "summary": "Pete Hegseth reported that six 'narco-terrorists' were killed in the Caribbean during a U.S. military operation, marking the 10th strike in this ongoing campaign. The operation aims to combat drug trafficking and associated violence in the region. The U.S. military's actions highlight an increased focus on addressing narco-terrorism in the Caribbean.",
    "published": "2025-10-24T18:10:42Z"
  },
  {
    "title": "Leeds v West Ham: Premier League – live updates",
    "url": "https://www.theguardian.com/football/live/2025/oct/24/leeds-v-west-ham-premier-league-live-updates",
    "image": "https://media.guim.co.uk/93f4e692f5083eefe8ab3955d39ec30c4df80575/682_0_5000_4000/500.jpg",
    "summary": "A minute-by-minute report details a matchup at Elland Road between two teams struggling to secure victories. The focus is on which side will emerge victorious. The commentary is provided by John Brewin.",
    "published": "2025-10-24T18:09:57Z"
  },
  {
    "title": "NBA gambling scandal shines harsh light on US sports’ embrace of betting",
    "url": "https://www.theguardian.com/sport/2025/oct/24/nba-gambling-scandal-sports-betting",
    "image": "https://media.guim.co.uk/edeb69b7509854f7010a63656077732f426df2b9/275_0_5001_4000/500.jpg",
    "summary": "Two major federal indictments have linked prominent basketball figures to illegal activities, prompting concerns about the impacts of legalized gambling in the sport. These developments raise questions about the integrity of the game and who truly profits from gambling practices. The situation highlights the ongoing challenges facing professional sports amid the rise of sports betting.",
    "published": "2025-10-24T18:07:22Z"
  }
]