[
  {
    "title": "PMQs live: Starmer says Louise Casey will join grooming gangs inquiry after four survivors quit panel",
    "url": "https://www.theguardian.com/politics/live/2025/oct/22/grooming-gangs-inquiry-mahmood-starmer-caerphilly-pmqs-latest-news-updates",
    "image": "https://media.guim.co.uk/26e8e8d5b071207a31343169c953d2ca5bc6c635/0_0_1666_1333/500.jpg",
    "summary": "Grooming gang victims have alleged that the government is trying to pressure them into expanding a national inquiry regarding their experiences. They claim this action serves to dilute the focus on their specific cases. The victims express concerns about the potential impact on their pursuit of justice.",
    "published": "2025-10-22T11:17:36Z"
  },
  {
    "title": "Gaza ceasefire could lead to more Israeli alliances in Middle East, Vance says at Netanyahu meeting – live",
    "url": "https://www.theguardian.com/world/live/2025/oct/22/israel-gaza-ceasefire-jd-vance-netanyahu-hamas-hostages-middle-east-latest-news-updates",
    "image": "https://media.guim.co.uk/4e3e52f613ff6dfe5e4036fa96bd1ff899e6867b/527_0_4870_3896/500.jpg",
    "summary": "US Vice President Kamala Harris is meeting with Israeli Prime Minister Benjamin Netanyahu during a delicate ceasefire in Gaza. The talks aim to address ongoing tensions and the need for stability in the region. The meeting underscores the Biden administration's commitment to supporting Israel while navigating the conflict's complexities.",
    "published": "2025-10-22T11:16:17Z"
  },
  {
    "title": "Australia v England: Women’s Cricket World Cup – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/22/australia-v-england-womens-cricket-world-cup-live",
    "image": "https://media.guim.co.uk/cb69907e7c5efd34a47b64833f7eda41d1fcc57c/273_0_5839_4672/500.jpg",
    "summary": "The two unbeaten teams in the competition are set to face off in Indore. Writers will provide live updates throughout the match. Stay tuned for over-by-over reports on the action.",
    "published": "2025-10-22T11:15:27Z"
  },
  {
    "title": "Tebas vows La Liga will try again after plug pulled on Villarreal v Barcelona in Miami",
    "url": "https://www.theguardian.com/football/2025/oct/22/tebas-la-liga-game-miami-cancelled-barcelona-villarreal",
    "image": "https://media.guim.co.uk/9c0e494e16074037368c28c16f32e9cf3459334d/703_8_3513_2810/500.jpg",
    "summary": "Javier Tebas announced that La Liga intends to pursue plans to hold a match between Villarreal and Barcelona in Miami after previous efforts failed. Despite the setback, he remains committed to exploring international expansion opportunities for the league. Tebas emphasized the importance of moving forward with such initiatives.",
    "published": "2025-10-22T11:13:45Z"
  },
  {
    "title": "Children among six killed in Kyiv after Russian missile and drone attack",
    "url": "https://www.theguardian.com/world/2025/oct/22/kyiv-russian-missile-drone-strike-attack-people-killed",
    "image": "https://media.guim.co.uk/84bfcf6ce6c46d300f01c7af1c60151902ecbaa0/458_0_4583_3667/500.jpg",
    "summary": "A series of strikes utilizing more than 400 drones and 28 missiles were executed shortly after the cancellation of a meeting between Putin and Trump in Budapest. This escalation raises tensions in the region and highlights ongoing geopolitical conflicts. The situation remains fluid as the implications of the strikes unfold.",
    "published": "2025-10-22T11:03:45Z"
  }
]