[
  {
    "title": "Tottenham’s new era, England latest, Russo signs contract as WSL kicks off: football news – live",
    "url": "https://www.theguardian.com/football/live/2025/sep/05/tottenham-latest-russo-new-arsenal-deal-internationals-world-cup-qualifiers-wsl-football-news-live",
    "image": "https://media.guim.co.uk/2116baa05adc93259acbf19e53dc71e5fd267e9c/478_0_1897_1518/500.jpg",
    "summary": "Denmark and Scotland prepare to face off in an anticipated football match as the weekend approaches. The focus is on the upcoming World Cup qualifiers featuring various national teams. Stay tuned for updates and highlights leading up to the matches.",
    "published": "2025-09-05T14:34:24Z"
  },
  {
    "title": "Powell and Murray go in reshuffle after Rayner steps down – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/05/angela-rayner-stamp-duty-labour-starmer-reform-nigel-farage-uk-politics-live-news-updates",
    "image": "https://media.guim.co.uk/49277eb2080c04089b156c1fda1e8de5a385f02d/0_0_5000_4000/500.jpg",
    "summary": "The Leader of the Commons and the Scottish secretary are set to exit the government as Labour leader Keir Starmer reorganizes his senior team. This move indicates a strategic shift within the party as it prepares for upcoming challenges. The changes reflect Starmer's efforts to strengthen his leadership and align the team with his vision.",
    "published": "2025-09-05T14:32:40Z"
  },
  {
    "title": "Pentagon expected to become ‘Department of War’ as US cities brace for Trump’s next national guard deployment – live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/05/donald-trump-pentagon-department-of-war-immigration-tariffs-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/19d6d7e1c78a05cbf47a9397f76d18e5be650679/315_0_3826_3061/500.jpg",
    "summary": "Renaming the Pentagon may incur costs of tens of millions due to the need for new letterheads and signage. Meanwhile, Chicago and Boston are preparing for potential troop deployments following threats made by Trump this week. The situation highlights ongoing political tensions and military readiness in major cities.",
    "published": "2025-09-05T14:28:36Z"
  },
  {
    "title": "US labor market ‘has headed off a cliff-edge’ with just 22,000 jobs added in August – business live",
    "url": "https://www.theguardian.com/business/live/2025/sep/05/ons-crisis-retail-sales-error-uk-house-prices-record-high-us-jobs-report-business-live-news-updates",
    "image": "https://media.guim.co.uk/0070e71e0122b1d8877cd732b7eea519a348c0aa/715_0_4183_3347/500.jpg",
    "summary": "The latest US jobs report reveals a significant slowdown in hiring during the summer months, falling short of expectations. This disappointing trend raises concerns about the overall health of the labor market and economic growth. Analysts are closely monitoring the implications for future employment and spending trends.",
    "published": "2025-09-05T14:27:16Z"
  },
  {
    "title": "Putin says western troops in Ukraine would be ‘legitimate targets’ as European countries pledge security support – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/sep/05/volodymyr-zelenskyy-ukraine-robert-fico-slovakia-vladimir-putin-russia-energy-europe-live-news-updates",
    "image": "https://media.guim.co.uk/10279a80b8c79471003152985f4eab373b3512da/759_0_3496_2797/500.jpg",
    "summary": "French President Macron announced that 26 nations have extended security guarantees to Ukraine. This statement comes as Ukrainian President Zelenskyy meets with Slovakia’s Prime Minister Fico, addressing ongoing tensions related to Russian energy supplies. The discussions underscore the international support for Ukraine amidst its energy challenges.",
    "published": "2025-09-05T14:25:41Z"
  }
]