[
  {
    "title": "Thousands join protests in Rio favela after deadliest ever police race",
    "url": "https://www.theguardian.com/world/2025/nov/01/thousands-join-protests-in-rio-favela-after-deadliest-ever-police-race",
    "image": "https://media.guim.co.uk/5d8f619b8fc3d8f46cdaaa97f6b8329c14c7a17f/399_0_3000_2400/500.jpg",
    "summary": "Demonstrators are calling for an investigation following a recent operation that resulted in the deaths of at least 121 individuals. The event has sparked widespread outrage and demands for accountability. Activists are pressing for transparency and justice in light of the tragic outcome.",
    "published": "2025-11-01T09:16:51Z"
  },
  {
    "title": "Premier League buildup, Earps book revelations and more – matchday live ",
    "url": "https://www.theguardian.com/football/live/2025/nov/01/premier-league-buildup-earps-book-revelations-and-more-matchday-live",
    "image": "https://media.guim.co.uk/3fb7834f63dbb643b558df45f2d4daf3ae3be9fe/867_0_6010_4812/500.jpg",
    "summary": "Billy Munday will host a segment focused on the latest news, previews, and discussions. The show aims to gear up viewers for an exciting day ahead. Tune in for insights and expert analysis.",
    "published": "2025-11-01T09:16:14Z"
  },
  {
    "title": "What did Pasolini know? Fifty years after his brutal murder, the director’s vision of fascism is more urgent than ever",
    "url": "https://www.theguardian.com/books/2025/nov/01/what-did-pasolini-know-fifty-years-after-his-brutal-the-directors-vision-of-fascism-is-more-urgent-than-ever",
    "image": "https://media.guim.co.uk/c26079238272f2a994f5d7e13851266829c5267e/2_0_1698_1358/500.jpg",
    "summary": "The enigmatic death of poet and filmmaker Pier Paolo Pasolini continues to provoke intrigue, underscoring unresolved questions and theories. His prescient warnings about corruption and the rise of totalitarianism resonate powerfully in today's political climate. Pasolini's insights serve as a cautionary tale, highlighting the enduring relevance of his work in contemporary society.",
    "published": "2025-11-01T09:12:34Z"
  },
  {
    "title": "New Zealand edge past England in third men’s ODI to seal series sweep – as it happened",
    "url": "https://www.theguardian.com/sport/live/2025/nov/01/new-zealand-v-england-third-mens-cricket-one-day-international-live",
    "image": "https://media.guim.co.uk/a68d56da46a04cf396a09e994a672751705c90d2/249_0_3331_2666/500.jpg",
    "summary": "England's top-order batters struggled in their last international match before the Ashes, leading to a narrow defeat. New Zealand secured a tense two-wicket victory over the English side. This performance raises concerns for England ahead of the upcoming Ashes series.",
    "published": "2025-11-01T09:10:27Z"
  },
  {
    "title": "7ft 4in (at least) of menace: the Victor Wembanyama Era is already here | Lee Escobedo",
    "url": "https://www.theguardian.com/sport/2025/nov/01/nba-victor-wembanyama-san-antonio-spurs-dynasty",
    "image": "https://media.guim.co.uk/395e002f68042201014d41023c6c19264aea67bf/1000_0_5000_4000/500.jpg",
    "summary": "San Antonio Spurs rookie Victor Wembanyama has propelled the team to an impressive 5-0 start, marking the best season opener in franchise history. His standout performances are sparking excitement about the potential for a new basketball dynasty. Fans and analysts are keenly watching as the Spurs establish themselves as a formidable force in the league.",
    "published": "2025-11-01T09:00:30Z"
  }
]