[
  {
    "title": "Liverpool v Nottingham Forest, Fulham v Sunderland, and more: Premier League – live",
    "url": "https://www.theguardian.com/football/live/2025/nov/22/liverpool-v-nottingham-forest-fulham-v-sunderland-premier-league-live-clockwatch",
    "image": "https://media.guim.co.uk/dc5e8701f1daf7b1fac75b8773bfadf744a91ba6/791_0_5000_4000/500.jpg",
    "summary": "Tim de Lisle will provide goal updates and additional insights from the afternoon matches in the Premier League and other leagues. Tune in for real-time updates and analysis of the games in play. Stay informed on the latest happenings in football.",
    "published": "2025-11-22T16:22:53Z"
  },
  {
    "title": "Cop30 live: rumours of deal as delegates prepare for final plenary",
    "url": "https://www.theguardian.com/environment/live/2025/nov/22/cop30-climate-talks-deal-overtime-live-news",
    "image": "https://media.guim.co.uk/410e6c1216e81f2d331e156e15d1703df652b560/346_0_3449_2761/500.jpg",
    "summary": "The Brazilian presidency is hopeful that it has successfully negotiated a deal after extensive all-night meetings with various parties. This optimism indicates progress towards reaching an agreement on key issues. Details of the deal are yet to be disclosed.",
    "published": "2025-11-22T16:19:47Z"
  },
  {
    "title": "Newcastle United v Manchester City: Premier League – live",
    "url": "https://www.theguardian.com/football/live/2025/nov/22/newcastle-united-v-manchester-city-premier-league-live",
    "image": "https://media.guim.co.uk/687da5b1c4b48d0caf54a80ac37c4d8b7cbf1e33/427_0_4560_3648/500.jpg",
    "summary": "Manchester City's match at St James' Park is pivotal for their title chase. Pep Guardiola's team aims to reduce the points gap at the top of the table. Scott Murray provides live updates and analysis throughout the game.",
    "published": "2025-11-22T16:19:19Z"
  },
  {
    "title": "Scotland’s World Cup qualifying win reactions equivalent to small earthquake",
    "url": "https://www.theguardian.com/football/2025/nov/22/scotlands-world-cup-qualifying-win-celebrations-equivalent-to-small-earthquake",
    "image": "https://media.guim.co.uk/3ada9591b23ed7fc81825d4a125f060ab1fe9230/974_0_3674_2940/500.jpg",
    "summary": "McLean's impressive goal during a recent match has caught the attention of seismic activity monitors at the Glasgow Geothermal Observatory. The excitement generated by the goal was so intense that it registered as a notable event. This unique occurrence highlights how sports can evoke powerful emotional responses.",
    "published": "2025-11-22T16:15:47Z"
  },
  {
    "title": "Wales v New Zealand: Autumn Nations Series rugby union – live",
    "url": "https://www.theguardian.com/sport/live/2025/nov/22/wales-v-new-zealand-autumn-nations-series-rugby-union-live",
    "image": "https://media.guim.co.uk/06914c9f2ba33cdf8b2093ea247d6a917592368c/557_0_4088_3271/500.jpg",
    "summary": "Wales has achieved its first victory under coach Steve Tandy. They are now set to face a formidable New Zealand team in Cardiff. Follow the live minute-by-minute updates by Daniel Gallan.",
    "published": "2025-11-22T16:10:16Z"
  }
]