[
  {
    "title": "F1 Abu Dhabi Grand Prix: qualifying updates for the season finale – live",
    "url": "https://www.theguardian.com/sport/live/2025/dec/06/f1-abu-dhabi-grand-prix-qualifying-updates-for-the-season-finale-live",
    "image": "https://media.guim.co.uk/44fdd6eedd2a040008a801f36084609d3f922ef0/623_215_2669_2135/500.jpg",
    "summary": "Philip Cornwall will provide live coverage of the qualifying event as the intense three-way competition for the world drivers' title heads into its final round. Stay tuned for updates on this thrilling conclusion to the season. Don’t miss the action as the drivers vie for championship glory!",
    "published": "2025-12-06T14:17:14Z"
  },
  {
    "title": "Aston Villa v Arsenal: Premier League – live",
    "url": "https://www.theguardian.com/football/live/2025/dec/06/aston-villa-v-arsenal-premier-league-live",
    "image": "https://media.guim.co.uk/b5387d099d6cc523c45b64594ec763d1e672871b/91_104_3330_2664/500.jpg",
    "summary": "Barry Glendenning is providing minute-by-minute updates on the leaders' challenging match at Villa Park. Fans can expect real-time insights and key moments as the game unfolds. Stay tuned for the latest developments in this exciting matchup.",
    "published": "2025-12-06T14:17:11Z"
  },
  {
    "title": "Arsenal 2-1 Liverpool: Women’s Super League – live",
    "url": "https://www.theguardian.com/football/live/2025/dec/06/arsenal-v-liverpool-womens-super-league-live",
    "image": "https://media.guim.co.uk/1f37a5eef243a38f549dcac063489843258685be/280_63_2306_1846/500.jpg",
    "summary": "Arsenal aims to revitalize their title challenge in the WSL as the season resumes, facing the league's bottom club. Emillia Hawkins will provide minute-by-minute updates on the match. Fans are eager to see if Arsenal can secure a crucial victory.",
    "published": "2025-12-06T14:13:01Z"
  },
  {
    "title": "Tottenham v Brentford, Manchester City v Sunderland, and more: football – live",
    "url": "https://www.theguardian.com/football/live/2025/dec/06/tottenham-v-brentford-manchester-city-v-sunderland-and-more-football-live",
    "image": "https://media.guim.co.uk/73f91147f17ab12b33bac84d731d38e1fe694c60/321_261_2513_2011/500.jpg",
    "summary": "John Brewin provides live updates on goals and important moments from the 3pm kick-offs in the Premier League and other leagues. Stay tuned for real-time match action and insights. Don't miss out on the thrilling developments!",
    "published": "2025-12-06T14:07:49Z"
  },
  {
    "title": "Tower of London partially closed after food thrown at crown jewels display ",
    "url": "https://www.theguardian.com/uk-news/2025/dec/06/tower-of-london-closes-apple-crumble-thrown-on-crown-jewels-display-case",
    "image": "https://media.guim.co.uk/d111da60f69b98ea0e6114215754db972566ea55/3_0_3780_3024/500.jpg",
    "summary": "Four individuals were arrested during a protest by the civil-resistance group Take Back Power, which called for action against inequality in the UK. The demonstration aimed to draw attention to social and economic disparities. Authorities responded to the protest, leading to the arrests of the participants.",
    "published": "2025-12-06T14:04:17Z"
  }
]