[
  {
    "title": "Andy Burnham calls for UK to rejoin EU within his lifetime and rejects claim he is fiscally irresponsible – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/29/rachel-reeves-labour-party-conference-youth-guarantee-unemployment-uk-politics-live-latest-news",
    "image": "https://media.guim.co.uk/4d545c94f4024f1c5c49ee15f0b236d5448cfc1a/329_0_2500_2000/500.jpg",
    "summary": "The Mayor of Greater Manchester expressed a strong attachment to his city, stating he would have to be forcibly removed to leave. He also advocated for the UK to rejoin the European Union. His comments reflect ongoing discussions about the implications of Brexit in the region.",
    "published": "2025-09-29T16:15:56Z"
  },
  {
    "title": "Donald Trump ‘very confident’ ceasefire deal can be reached as he meets Benjamin Netanyahu – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/29/donald-trump-benjamin-netanyahu-gaza-white-house-us-politics-live",
    "image": "https://media.guim.co.uk/a8b6c8649e35b49d2fe7de99634765c3b1a3f0e7/1351_0_2223_1779/500.jpg",
    "summary": "The US president is set to encourage the Israeli prime minister to establish a new framework aimed at ending the conflict in Gaza. This initiative also seeks to facilitate the release of any remaining hostages held by Hamas. The discussions aim to promote peace and resolve ongoing tensions in the region.",
    "published": "2025-09-29T16:12:50Z"
  },
  {
    "title": "AstraZeneca’s listing rejig spells long-term danger for London | Nils Pratley",
    "url": "https://www.theguardian.com/business/nils-pratley-on-finance/2025/sep/29/astrazenecas-listing-rejig-spells-long-term-danger-for-london",
    "image": "https://media.guim.co.uk/44f91f5d67ccbcc0be753ad1d60a10cf2d1a4897/473_0_3937_3149/500.jpg",
    "summary": "A new trading arrangement will bypass the UK's stamp duty by settling trades in the US. This move challenges the existing tax framework in the UK. It raises concerns about potential revenue losses for the UK government.",
    "published": "2025-09-29T16:10:34Z"
  },
  {
    "title": "Quick surface expected for Arc de Triomphe in boost to Japanese challengers",
    "url": "https://www.theguardian.com/sport/blog/2025/sep/29/quick-surface-expected-for-arc-de-triomphe-in-boost-to-japanese-challengers",
    "image": "https://media.guim.co.uk/6fa30eb9085e079d2c5fc112a43630d42d51a48a/1079_0_5774_4621/500.jpg",
    "summary": "For the second time in three seasons, the going at Longchamp for the Arc de Triomphe may be described as 'bon'. This suggests favorable conditions for the race. The announcement is generating excitement among competitors and fans alike.",
    "published": "2025-09-29T16:02:21Z"
  },
  {
    "title": "Investigation into Nicolas Sarkozy not due to ‘hatred’, his prosecutor says",
    "url": "https://www.theguardian.com/world/2025/sep/29/investigation-into-nicolas-sarkozy-not-due-to-hatred-his-prosecutor-says",
    "image": "https://media.guim.co.uk/35a44b1018e0ce06208675e479eb09370362cbd4/787_195_1769_1415/500.jpg",
    "summary": "Jean-François Bohnert dismissed allegations made by former French President Nicolas Sarkozy regarding his conviction for election funding conspiracy. Sarkozy has been sentenced to five years in prison for the offense. Bohnert's rejection emphasizes his stance on the integrity of the judicial process surrounding the case.",
    "published": "2025-09-29T16:01:15Z"
  }
]