[
  {
    "title": "Three more arrests in synagogue attack investigation; Lammy heckled at vigil for Manchester synagogue attack – latest",
    "url": "https://www.theguardian.com/uk-news/live/2025/oct/03/manchester-synagogue-attack-victims-adrian-daulby-melvin-cravitz-attacker-jihad-al-shamie-latest-news-updates",
    "image": "https://media.guim.co.uk/5347b15f89fa47dd6352daad2ae5a946f25a0b07/231_0_5423_4340/500.jpg",
    "summary": "Police have arrested three additional suspects, raising the total to six in connection with a recent terror attack. Justice Secretary faces public backlash and shouts of \"shame on you\" during a gathering to honor the victims. The community is coming together to remember those affected by the tragedy.",
    "published": "2025-10-03T21:12:23Z"
  },
  {
    "title": "French sees off Leigh to put Wigan in Grand Final after week of acrimony",
    "url": "https://www.theguardian.com/sport/2025/oct/03/french-sees-off-leigh-to-put-wigan-in-grand-final-after-week-of-acrimony",
    "image": "https://media.guim.co.uk/575d523ce538fd88b9fd7d91690d310c3f02b608/364_0_3638_2910/500.jpg",
    "summary": "Bevan French scored two first-half tries, leading to Wigan's 18-6 victory in the Super League playoff semi-final against Leigh. Jai Field made a crucial tackle in the second half to help secure the win. The victory advances Wigan to the finals.",
    "published": "2025-10-03T21:10:20Z"
  },
  {
    "title": "Semenyo’s double downs Fulham and sends buoyant Bournemouth second",
    "url": "https://www.theguardian.com/football/2025/oct/03/bournemouth-fulham-premier-league-match-report",
    "image": "https://media.guim.co.uk/a11a755ed854d420326995213bbe3fb80a0922a5/175_0_2283_1826/500.jpg",
    "summary": "Bournemouth secured a 3-1 home victory over Fulham, with Justin Kluivert scoring a stunning goal and Antoine Semenyo netting two. This win propelled Bournemouth to second place in the Premier League. The victory marks a significant achievement for the team in the league.",
    "published": "2025-10-03T21:07:46Z"
  },
  {
    "title": "Hamas agrees to release all Israeli hostages, dead or alive, as it accepts parts of Trump’s Gaza plan – live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/03/shutdown-congress-trump-senate-latest-updates",
    "image": "https://media.guim.co.uk/9b4205aea3f4fabc735b6ffe16d553a37b6532ec/580_0_5802_4644/500.jpg",
    "summary": "A group has consented to release all remaining hostages, but they indicate that additional negotiations are necessary regarding other elements of a 20-point plan. The discussions aim to address outstanding issues beyond the hostage release. This move reflects a commitment to ongoing dialogue and resolution.",
    "published": "2025-10-03T21:07:25Z"
  },
  {
    "title": "Henry Arundell leads Bath to nervy win against Sale as Borthwick takes note",
    "url": "https://www.theguardian.com/sport/2025/oct/03/bath-sale-prem-rugby-match-report",
    "image": "https://media.guim.co.uk/3e5ce539d0f862e4738983edd6e24f70bc670ec3/0_0_3496_2798/500.jpg",
    "summary": "Bath secured a solid 28-16 victory over Sale, fueled by strong performances from Henry Arundell, Cameron Redpath, and Beno Obano, who built a substantial lead. Despite Sale's efforts in the second half, they were unable to close the gap. The win solidifies Bath's performance in the match.",
    "published": "2025-10-03T21:07:16Z"
  }
]