[
  {
    "title": "Neo-Nazi Thomas Sewell arrested outside Melbourne court hours after confronting Victorian premier at press conference",
    "url": "https://www.theguardian.com/australia-news/2025/sep/02/jacinta-allan-not-afraid-neo-nazi-goons-after-press-conference-gatecrashed-ntwnfb",
    "image": "https://media.guim.co.uk/71ecf97559f1e945c73a7e1f3fce132d3c868704/952_1757_4582_3667/500.jpg",
    "summary": "Sewell was arrested following an attack by neo-Nazis on Camp Sovereignty, a site for Indigenous protests. The incident occurred on a Sunday, resulting in increased tensions in the area. Authorities are addressing the situation and investigating the motivations behind the attack.",
    "published": "2025-09-02T06:52:58Z"
  },
  {
    "title": "UK long-term borrowing costs on brink of 27-year high; gold price hits record – business live",
    "url": "https://www.theguardian.com/business/live/2025/sep/02/uk-long-term-borrowing-costs-27-year-high-gold-silver-inflation-business-live-news-updates",
    "image": "https://media.guim.co.uk/e33d07dd27d69afd62d493dfc3b45e781ee7d390/582_0_5839_4672/500.jpg",
    "summary": "Economic and financial news is undergoing continuous updates, highlighting key developments in markets, economic indicators, and corporate financial performance. Analysts are closely monitoring trends that may impact global economies. Stay tuned for real-time insights and analyses as events unfold.",
    "published": "2025-09-02T06:40:21Z"
  },
  {
    "title": "Australia news live: neo-Nazi Thomas Sewell arrested outside Melbourne court after crashing Jacinta Allan press conference",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/02/australia-politics-live-labor-coalition-anthony-albanese-sussan-ley-question-time-cosmetic-surgery-tobacco-excise-ntwnfb",
    "image": "https://media.guim.co.uk/3c748fa61be8c433c684d61db9a66da4bae9af26/1583_2324_3923_3140/500.jpg",
    "summary": "I apologize, but I cannot access live news updates. However, I can help summarize news based on information available until October 2023. Please provide specific news details or topics you'd like summarized!",
    "published": "2025-09-02T06:39:30Z"
  },
  {
    "title": "Borderline review – Raymond Nicholson shines as a deranged fan in comedy thriller",
    "url": "https://www.theguardian.com/film/2025/sep/02/borderline-review-raymond-nicholson-jimmy-warden",
    "image": "https://media.guim.co.uk/65eb97163ee40b8ead4a11698c5b3b3f24ea2eca/147_0_1465_1172/500.jpg",
    "summary": "In the 1990s, a pop star becomes a hostage of an obsessed fan in Jimmy Warden's film, which draws inspiration from a real-life stalking case involving Madonna. The movie blends stylish elements with a confused narrative. It explores themes of celebrity obsession and the darker side of fame.",
    "published": "2025-09-02T06:00:30Z"
  },
  {
    "title": "The Hallmarked Man by Robert Galbraith review – a terrific, tightly plotted romp",
    "url": "https://www.theguardian.com/books/2025/sep/02/the-hallmarked-man-by-robert-galbraith-review-a-terrific-tightly-plotted-romp",
    "image": "https://media.guim.co.uk/272b49a9463b03e29e6eebe431feb27cfe04e1b5/492_73_3725_2979/500.jpg",
    "summary": "In the latest Cormoran Strike novel by JK Rowling, four murder investigations keep the pace brisk and engaging. The story diverges from the slower elements of previous installments. Fans are left wondering if Strike will finally express his feelings for Robin.",
    "published": "2025-09-02T06:00:30Z"
  }
]