[
  {
    "title": "US struck another boat illegally carrying drugs off Venezuela coast, Trump says",
    "url": "https://www.theguardian.com/us-news/2025/oct/05/trump-drug-boat-strike-venezuela",
    "image": "https://media.guim.co.uk/74ddd22c3ac4e136ab8e8a5ec5201a352482f616/219_0_4141_3313/500.jpg",
    "summary": "During a speech at a navy ceremony, the President announced that the U.S. would focus on combating drug trafficking occurring on land. This initiative comes as part of broader efforts to address issues related to drug-related crimes. The President emphasized the importance of enhancing security and public safety in response to this challenge.",
    "published": "2025-10-05T22:12:18Z"
  },
  {
    "title": "Australia news live: fire danger warnings in Queensland as crews battle Moreton Island blaze",
    "url": "https://www.theguardian.com/australia-news/live/2025/oct/06/australia-news-live-queensland-bushfire-danger-warnings-moreton-island-croydon-park-shooting-sydney-anthony-albanese-sussan-ley-andrew-hastie-labor-liberal-ntwnfb",
    "image": "https://media.guim.co.uk/f6b4efd52d2291f8ef2ccf6cea41c7d1158fb6cd/0_82_1456_1164/500.jpg",
    "summary": "I'm sorry, but I need the content of the news article you're referring to in order to provide a summary. Could you please share the details?",
    "published": "2025-10-05T22:07:30Z"
  },
  {
    "title": "Swaggering Reece Walsh reaches NRL summit with ascendant grand final display | Jack Snape",
    "url": "https://www.theguardian.com/sport/blog/2025/oct/06/brisbane-broncos-reece-walsh-nrl-summit-grand-final-performance",
    "image": "https://media.guim.co.uk/1999f9c0d84c8f6c37f956b12e09b81aebc89723/1636_585_3590_2872/500.jpg",
    "summary": "The Brisbane Broncos fullback delivered a compelling performance on Sunday, countering criticisms of his behavior as immature. His play on the field showcased his skills and determination. This display effectively highlighted his commitment to the team despite any off-field controversy.",
    "published": "2025-10-05T21:54:21Z"
  },
  {
    "title": "UK ministers aim to speed up homebuying by four weeks ",
    "url": "https://www.theguardian.com/money/2025/oct/05/uk-ministers-aim-to-speed-up-homebuying-by-four-weeks",
    "image": "https://media.guim.co.uk/542ee80a049baf1424259d0c08af86de325601b2/720_0_7200_5760/500.jpg",
    "summary": "The government is proposing an overhaul of the house purchase process that aims to ease the financial burden on buyers. This plan includes shifting some associated costs from buyers to sellers. The changes are intended to make home buying more accessible and affordable for potential homeowners.",
    "published": "2025-10-05T21:30:45Z"
  },
  {
    "title": "WNBA finals Game 2: Aces take another step towards title after overwhelming Mercury",
    "url": "https://www.theguardian.com/sport/2025/oct/05/wnba-finals-game-2-aces-take-another-step-towards-title-after-overwhelming-mercury",
    "image": "https://media.guim.co.uk/5be40057cfb5ba95e66da6c57c3ad850d31527da/575_0_5751_4601/500.jpg",
    "summary": "The Las Vegas Aces took a significant step toward their third championship in four years by decisively defeating the Phoenix Mercury on Sunday. The victory highlights their dominance in the league. The Aces continue to showcase their championship potential.",
    "published": "2025-10-05T21:24:31Z"
  }
]