[
  {
    "title": "Rising costs push John Lewis Partnership into deeper loss; London tube strike enters fourth day – business live",
    "url": "https://www.theguardian.com/business/live/2025/sep/11/john-lewis-deeper-loss-london-tube-strike-fourth-day-ecb-interest-rates-us-inflation-business-live-news-updates",
    "image": "https://media.guim.co.uk/786143db12f1911f45f9116c23f50a7aac93d90f/477_0_4426_3541/500.jpg",
    "summary": "Stay updated with ongoing reports on economic and financial developments, highlighting key trends and market movements. Coverage includes insights into global markets, policy changes, and economic indicators. This updates readers on essential information affecting their financial decisions.",
    "published": "2025-09-11T06:49:40Z"
  },
  {
    "title": "Charlie Kirk shooting: Trump blames ‘radical left’, but does not mention attacks on Democrats as search for suspect continues – follow live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/10/donald-trump-jeffrey-epstein-tariffs-immigration-crime-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/2673fb19ee0d09b38b7c9c4de993bd283a9eb6e7/313_215_3046_2437/500.jpg",
    "summary": "In a recent Oval Office address, Trump promised retribution but failed to address the murder of Melissa Hortman, the attack on Paul Pelosi, or the threats faced by Mike Pence. His speech focused on other issues, leaving out significant incidents of violence and intimidation. Critics point out this omission highlights a troubling disregard for political violence in the current climate.",
    "published": "2025-09-11T06:47:28Z"
  },
  {
    "title": "Australia news live: Victoria police officers charged with manslaughter over death of man in custody",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/11/australia-news-live-sydney-storm-weather-anthony-albanese-solomon-islands-pacific-sussan-ley-jacinta-nampijinpa-price-ntwnfb",
    "image": "https://media.guim.co.uk/9345ce378508444325d5e2aba15d512ece249208/0_1_3332_2663/500.jpg",
    "summary": "To provide a summary, I'll need more context or details about the news you're referring to. Please share the content or main points you'd like summarized!",
    "published": "2025-09-11T06:47:22Z"
  },
  {
    "title": "Sydney Water failed to properly test before declaring ‘no known Pfas hotspots’ in catchments, inquiry finds",
    "url": "https://www.theguardian.com/environment/2025/sep/11/sydney-water-erred-when-claiming-there-were-no-known-pfas-hotspots-in-drinking-water-catchments-committee-finds",
    "image": "https://media.guim.co.uk/1e5afc6b9db428edfdf5660328b6c51d9f8f6a72/0_0_2254_1803/500.jpg",
    "summary": "A committee chair emphasizes the urgent need to address the growing problem of contamination of waterways with \"forever chemicals.\" These substances, known for their persistence in the environment, pose significant health and ecological risks. Increased focus and action are necessary to tackle this escalating issue.",
    "published": "2025-09-11T06:45:53Z"
  },
  {
    "title": "Trump blames ‘radical left’ for Kirk shooting; Ley apologises to Indian Australians; and Queensland’s historic AFL final",
    "url": "https://www.theguardian.com/australia-news/2025/sep/11/afternoon-update-thursday-ntwnfb",
    "image": "https://media.guim.co.uk/5c1b7c637b1c39436d9090350e119d42061aea24/245_0_5000_4000/500.jpg",
    "summary": "Australian leaders have condemned the killing of conservative activist Charlie Kirk, emphasizing that such acts of political violence are unacceptable. Deputy Prime Minister expressed strong disapproval of the incident, reiterating a commitment to a peaceful political discourse. The statement reflects a broader call for unity against political extremism in Australia.",
    "published": "2025-09-11T06:44:39Z"
  }
]