[
  {
    "title": "France recognises state of Palestine, Emmanuel Macron tells UN general assembly – Middle East crisis live",
    "url": "https://www.theguardian.com/world/live/2025/sep/22/palestinian-state-gaza-israel-middle-east-hamas-benjamin-netanyahu-latest-live-updates",
    "image": "https://media.guim.co.uk/944e804bb81f5a77f0d68dd7363ee27724e20944/29_0_4598_3681/500.jpg",
    "summary": "The French president announced key developments during an official address. Former President Trump is set to participate in crucial meetings with leaders from Ukraine, the European Union, and various Middle Eastern countries on Tuesday. These high-stakes discussions are expected to address pressing international issues.",
    "published": "2025-09-22T20:36:24Z"
  },
  {
    "title": "Ballon d’Or 2025: Wiegman and Hampton win prizes, main player awards to come – live",
    "url": "https://www.theguardian.com/football/live/2025/sep/22/ballon-dor-2025-who-will-be-voted-the-best-male-and-female-footballers-live",
    "image": "https://media.guim.co.uk/0221946787fe72b9e6be24b393c41e359a4b0fa3/27_0_2941_2354/500.jpg",
    "summary": "In Paris, England's duo secured accolades as the best goalkeeper and manager at a prestigious award ceremony. The event highlights their outstanding achievements in football. Michael Butler will provide continuous updates on the proceedings.",
    "published": "2025-09-22T20:36:02Z"
  },
  {
    "title": "Jimmy Kimmel will return to TV after highly criticized suspension",
    "url": "https://www.theguardian.com/tv-and-radio/2025/sep/22/jimmy-kimmel-show-return-charlie-kirk-suspension-disney",
    "image": "https://media.guim.co.uk/6b722026db019f0d7bf2d7cfee1bcc818da9e31e/354_0_2500_2000/500.jpg",
    "summary": "A late-night host has been reinstated following a brief suspension due to remarks about MAGA and Charlie Kirk, which Disney deemed \"insensitive.\" The comments sparked controversy, leading to the host's temporary removal. The decision to reinstate reflects the ongoing tension between media personalities and corporate sensitivity.",
    "published": "2025-09-22T20:31:53Z"
  },
  {
    "title": "Australia news live: Butler seeks urgent advice on paracetamol safety as report expected from US officials",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/23/australia-news-live-albanese-new-york-palestine-united-nations-donald-trump-mark-butler-paracetamol-pregnancy-ntwnfb",
    "image": "https://media.guim.co.uk/0946e1d3f73f00ca5c5d5d591bef69c7c9c41cb1/546_0_5463_4371/500.jpg",
    "summary": "I’m sorry, but I need more context or details about the news you would like summarized. Please provide additional information or the main points of the news story.",
    "published": "2025-09-22T20:31:33Z"
  },
  {
    "title": "Trump due to make announcement about autism – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/22/donald-trump-charlie-kirk-autism-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/2bf617d2916561d1650df1a794a15518fc2757f6/720_0_7200_5760/500.jpg",
    "summary": "The President is set to hold a media briefing soon amid reports that the administration plans to associate Tylenol (acetaminophen) with autism. This potential link is causing concern and anticipation among health experts and the public. Further details are expected to be revealed during the address.",
    "published": "2025-09-22T20:25:58Z"
  }
]