[
  {
    "title": "World Athletics Championships 2025: Duplantis goes for pole vault gold, hurdles finals and more – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/15/world-athletics-championships-2025-armand-duplantis-goes-for-pole-vault-gold-hurdles-finals-and-more-live",
    "image": "https://media.guim.co.uk/7c74c2ee5ff388cc00f933f9f877fbe02e0390d3/288_0_1533_1226/500.jpg",
    "summary": "On the third day of action from Tokyo, Yara El-Shaboury offers the latest updates and news. Key highlights include significant performances and results that have emerged. The day showcases a mix of competitive events, building excitement for the ongoing action.",
    "published": "2025-09-15T11:24:58Z"
  },
  {
    "title": "Post your questions for Richard Osman and Mick Herron",
    "url": "https://www.theguardian.com/books/2025/sep/15/post-your-questions-for-richard-osman-and-mick-herron",
    "image": "https://media.guim.co.uk/28d8c6d8a758af42bbf8922a39c57c3ecb9d627f/143_0_875_700/500.jpg",
    "summary": "The bestselling authors of \"The Thursday Murder Club\" and the Slough House series will participate in a Q&A session. Fans will have the opportunity to ask them questions. This event promises to engage readers with insights from their favorite writers.",
    "published": "2025-09-15T11:24:00Z"
  },
  {
    "title": "From breezy beginners to downhill demons: Europe’s best ski resorts for every level and budget",
    "url": "https://www.theguardian.com/if-you-snow-you-know/2025/sep/15/best-european-ski-resorts-for-all-levels-and-budgets",
    "image": "https://media.guim.co.uk/8d70d19ac98d4e1c5131fa6ecb7f8ccc0db330e6/1020_88_2180_1744/500.jpg",
    "summary": "The article highlights four top European ski resorts tailored to various preferences, whether for beginners seeking gentle slopes, advanced skiers looking for challenging diamond runs, or those interested in vibrant après-ski options. These diverse resorts cater to all types of ski enthusiasts. Choose based on your key priorities for an ideal ski experience.",
    "published": "2025-09-15T11:22:47Z"
  },
  {
    "title": "Don’t DIY it! Why a package trip is perfect for your first ski holiday",
    "url": "https://www.theguardian.com/if-you-snow-you-know/2025/sep/15/why-package-holidays-are-best-for-first-time-skiers",
    "image": "https://media.guim.co.uk/846ab4f1199f63bd24b3859ecbece87e589bf916/1276_60_2721_2177/500.jpg",
    "summary": "Planning your first ski holiday can be daunting with various options for lift passes, rentals, and accommodations. Package trips offer a hassle-free solution, combining necessities for a seamless experience. These all-inclusive deals ensure an enjoyable ski adventure without the stress of individual bookings.",
    "published": "2025-09-15T11:21:17Z"
  },
  {
    "title": "Cycling teams could boycott races involving Israel-Premier Tech after Vuelta chaos",
    "url": "https://www.theguardian.com/sport/2025/sep/15/cycling-teams-could-boycott-races-israel-premier-tech-vuelta-a-espana",
    "image": "https://media.guim.co.uk/86e97ac59a1d78a3c9a06881a14ff4d390bb2fe3/0_79_3846_3077/500.jpg",
    "summary": "World Tour cycling teams may consider not racing against Israel-Premier Tech following protests supporting Palestine, which led to the cancellation of the Vuelta a España finale. This decision comes in response to the escalating tensions surrounding the conflict. The situation highlights the intersection of sports and political issues.",
    "published": "2025-09-15T11:20:31Z"
  }
]