[
  {
    "title": "News live: Australia and PNG to sign defence agreement; Aldi joins latest retail stores to sell solar panels",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/14/australia-news-live-albanese-papua-new-guinea-aldi-solar-environment-richard-marles-sunday-ntwnfb",
    "image": "https://media.guim.co.uk/3be0eab5d0e6dc93d25299df1d1345095f6a67aa/1047_0_6785_5431/500.jpg",
    "summary": "I'm unable to access real-time news updates or provide live summaries. Please share specific news content you'd like summarized, and I can help with that!",
    "published": "2025-09-13T23:19:35Z"
  },
  {
    "title": "Police assaulted as far-right rally led by Tommy Robinson sparks clashes",
    "url": "https://www.theguardian.com/uk-news/2025/sep/13/unite-the-kingdom-far-right-rally-london-tommy-robinson-police-assaulted",
    "image": "https://media.guim.co.uk/da19315ad3260f40773e4e24c7c0bbb2fe1f4c8e/109_0_5623_4501/500.jpg",
    "summary": "Over 110,000 individuals attended a protest organized by Tommy Robinson, which prominently featured racist conspiracy theories and instances of hate speech. The event sparked significant controversy and condemnation from various groups. Critics argue that such gatherings promote division and intolerance within society.",
    "published": "2025-09-13T22:37:30Z"
  },
  {
    "title": "Trump administration reportedly has plan to send national guard to Louisiana – as it happened",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/13/charlie-kirk-suspect-tyler-robinson-erika-kirk-us-politics-latest-news-donald-trump",
    "image": "https://media.guim.co.uk/3d1ce0d457a72e97eb99e82157f59ac8f675e244/272_0_5365_4292/500.jpg",
    "summary": "Leaked documents reveal plans to deploy 1,000 troops for law enforcement operations in urban areas. The initiative aims to enhance security and maintain order. The blog detailing this information has now been closed.",
    "published": "2025-09-13T22:30:33Z"
  },
  {
    "title": "Far right’s show of force leaves Met desperately kettling counter-protesters",
    "url": "https://www.theguardian.com/politics/2025/sep/13/far-rights-show-of-force-leaves-met-desperately-kettling-counter-protesters",
    "image": "https://media.guim.co.uk/fa7156680c204f41f48954929127edbe47c23ee9/1224_463_6214_4971/500.jpg",
    "summary": "Police faced significant challenges while managing large-scale brawls incited by Tommy Robinson and other provocative speakers. The events escalated tensions and overwhelmed law enforcement efforts to maintain order. Concerns are rising about the impact of such inflammatory rhetoric on public safety.",
    "published": "2025-09-13T22:21:21Z"
  },
  {
    "title": "Elon Musk calls for dissolution of parliament at far-right rally in London",
    "url": "https://www.theguardian.com/technology/2025/sep/13/elon-musk-calls-for-dissolution-of-parliament-at-far-right-rally-in-london",
    "image": "https://media.guim.co.uk/5e94db6facccea3459b942c5d868c20bd50e9eb4/879_0_863_690/500.jpg",
    "summary": "A US-based tech executive spoke via video link at the \"Unite the Kingdom\" protest organized by Tommy Robinson. The event aimed to rally support for Robinson's cause. The speech highlighted the ongoing controversy surrounding Robinson and his movement within the UK.",
    "published": "2025-09-13T21:44:27Z"
  }
]