[
  {
    "title": "Europe live: Putin claims he never opposed EU membership for Ukraine but draws line at Nato",
    "url": "https://www.theguardian.com/world/live/2025/sep/02/russia-ukraine-war-putin-china-visit-europe-live-news-updates",
    "image": "https://media.guim.co.uk/1cbe3a1706d5bcbb93043bc21856ebcb4c3387ea/1141_564_3762_3010/500.jpg",
    "summary": "Russian leader Vladimir Putin, currently on a visit to China, was joined by Slovakia's Prime Minister Robert Fico. The meeting highlights ongoing discussions and collaborations between Russia and Slovakia amid global geopolitical shifts. This visit underscores the strengthening ties between Russia and various nations in the context of current international relations.",
    "published": "2025-09-02T14:42:45Z"
  },
  {
    "title": "England v South Africa: first men’s one-day international – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/02/england-south-africa-first-mens-odi-cricket-live",
    "image": "https://media.guim.co.uk/bd3e513163dd55ad99e1e0350094eb4ddc3d5def/421_360_3351_2681/500.jpg",
    "summary": "England faces South Africa in the first match of a three-game ODI series at Headingley. The report provides live updates and insights throughout the game. Join the writers for detailed commentary and analysis.",
    "published": "2025-09-02T14:42:16Z"
  },
  {
    "title": "Putin hails ties with China as Kim Jong-un arrives in Beijing on eve of parade",
    "url": "https://www.theguardian.com/world/2025/sep/02/vladimir-putin-xi-jinping-russia-china-ties-kim-jong-un-beijing-parade",
    "image": "https://media.guim.co.uk/aa883e558e1d35ba2cab594ee807bff00567cdff/0_0_2671_2138/500.jpg",
    "summary": "Russian President Vladimir Putin announced that relations with various countries are at an \"unprecedentedly high level\" during Victory Day celebrations. The event saw dozens of international leaders in attendance, highlighting geopolitical ties. The gathering underscores Russia's efforts to strengthen alliances amid ongoing global tensions.",
    "published": "2025-09-02T14:35:19Z"
  },
  {
    "title": "Grimsby fined after fielding ineligible player against Manchester United",
    "url": "https://www.theguardian.com/football/2025/sep/02/grimsby-fined-after-fielding-ineligible-player-against-manchester-united-carabao-cup",
    "image": "https://media.guim.co.uk/e84e2c7d35021bcf5392bc5d4f8959beb4747a0a/561_152_3310_2649/500.jpg",
    "summary": "Grimsby faced costly consequences due to a slight delay in registering a new player, but they have managed to avoid expulsion from the Carabao Cup. The situation highlights the importance of timely administrative processes in football. The League Two club can now focus on their upcoming matches without the looming threat of disqualification.",
    "published": "2025-09-02T14:35:16Z"
  },
  {
    "title": "Trump’s ‘exciting announcement’ related to the Pentagon, White House says – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/02/congress-returns-government-shutdown-funding-trump-announcement-us-politics-live-latest-updates",
    "image": "https://media.guim.co.uk/934755303f5380d328b0d1d9140a6be39d349d04/317_0_2500_2000/500.jpg",
    "summary": "The White House is set to make an announcement related to the Department of Defense, though the specifics remain unclear. Press Secretary Karoline Leavitt confirmed the upcoming news. Details about the announcement have not yet been disclosed.",
    "published": "2025-09-02T14:32:18Z"
  }
]