[
  {
    "title": "US and UK have done ‘more good than any two nations in history’, says Trump – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/18/donald-trump-state-visit-uk-keir-starmer-labour-politics-latest-news",
    "image": "https://media.guim.co.uk/3b481b3e5184381ee343d9f990e06eea26f9b1b9/463_0_5000_4000/500.jpg",
    "summary": "US President emphasizes the \"unbreakable\" bond between the United States and the United Kingdom during his state visit. He highlights the shared values and commitment to collaboration on global issues. The visit underscores the longstanding alliance and deep ties between the two nations.",
    "published": "2025-09-18T14:36:11Z"
  },
  {
    "title": "Top Democrats call for FCC chair to resign, claiming Jimmy Kimmel suspension is ‘corrupt abuse of power’ – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/18/jimmy-kimmel-charlie-kirk-comments-show-cancelled-suspended-monologue-trump-us-politics-live",
    "image": "https://media.guim.co.uk/2d731b09c5ef58a420c26fcedc65713f29b77eb9/578_0_1106_886/500.jpg",
    "summary": "Democratic House leaders are calling for the removal of Brendan Carr, a media official associated with Trump. They criticized the cancellation of his show, labeling it an \"act of cowardice.\" The remarks highlight ongoing tensions between the Democratic Party and Trump’s affiliates.",
    "published": "2025-09-18T14:35:45Z"
  },
  {
    "title": "Corbyn clashes with Sultana over membership portal as split emerges in new party",
    "url": "https://www.theguardian.com/politics/2025/sep/18/jeremy-corbyn-clashes-zarah-sultana-your-party-split",
    "image": "https://media.guim.co.uk/c4544f0246d535db5cc6966168e6f649f0c6fc01/342_67_2495_1996/500.jpg",
    "summary": "The former Labour leader announced that legal advice is being sought regarding a particular issue. Meanwhile, Sultana criticized the party, claiming it operates as a \"sexist boys' club.\" Tensions within the party regarding gender dynamics and governance continue to escalate.",
    "published": "2025-09-18T14:32:36Z"
  },
  {
    "title": "Nottinghamshire stun Surrey, Somerset v Hampshire, and more: county cricket, day four – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/18/surrey-v-nottinghamshire-somerset-v-hampshire-and-more-county-cricket-day-four-live",
    "image": "https://media.guim.co.uk/c05c1e0a91abc803fa8b8879d58806d56c163b65/269_0_4546_3636/500.jpg",
    "summary": "Tanya Aldred provides updates on the concluding day of the most recent County Championship matches. Fans can expect highlights and key moments from the final games. Stay tuned for the latest results and developments in the tournament.",
    "published": "2025-09-18T14:31:23Z"
  },
  {
    "title": "Bank of England governor says UK ‘not out of the woods’ on inflation, after leaving interest rates on hold – business live",
    "url": "https://www.theguardian.com/business/live/2025/sep/18/bank-of-england-uk-interest-rates-bond-selling-qt-programme-andrew-bailey-business-live",
    "image": "https://media.guim.co.uk/1569d81fc094ab2948d99c38fcb53b3898d72b72/610_0_4591_3674/500.jpg",
    "summary": "The Bank of England has decided to reduce its holdings of government bonds gradually over the next year. This move reflects a cautious approach to monetary policy amid economic considerations. The decision signals the central bank's ongoing efforts to manage inflation and stabilize the economy.",
    "published": "2025-09-18T14:30:00Z"
  }
]