[
  {
    "title": "Downing Street says Starmer still has ‘confidence in his top team’ after Rayner and Mandelson departures – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/12/uk-politics-latest-news-peter-mandelson-labour-keir-starmer-angela-rayner",
    "image": "https://media.guim.co.uk/3d9e657df2b5d8643a71e1a40ab54a800a554b19/0_0_5000_4000/500.jpg",
    "summary": "Scotland Secretary Douglas Alexander expressed that MPs are experiencing a deep sense of loss following Rayner’s departure. He highlighted the emotional impact her absence has had on colleagues. The sentiment reflects the importance of her role and contributions.",
    "published": "2025-09-12T16:35:31Z"
  },
  {
    "title": "Trump-supporting billionaire prevented from filling lake on UK estate during drought",
    "url": "https://www.theguardian.com/environment/2025/sep/12/trump-supporting-billionaire-stephen-schwarzman-prevented-filling-lake-uk-estate-during-drought",
    "image": "https://media.guim.co.uk/a27c82ef0eab30a1100ef11dc5b179de8696225e/647_0_4071_3257/500.jpg",
    "summary": "Blackstone founder Stephen Schwarzman has faced complaints from residents regarding actions tied to Southern Water, although his conduct was deemed legal. The concerns raised by residents likely relate to water management and associated issues. Despite the complaints, there is no indication of any legal wrongdoing on Schwarzman's part.",
    "published": "2025-09-12T16:32:11Z"
  },
  {
    "title": "Charlie Kirk shooting latest: Utah governor confirms identity of suspect and says family friend turned him in",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/12/charlie-kirk-shooter-suspect-latest-news-updates-donald-trump-utah",
    "image": "https://media.guim.co.uk/b3900dee754cc4e9b61442cbd4826f211c47f0af/0_969_1693_1353/500.jpg",
    "summary": "Utah Governor Spencer Cox reported that 22-year-old Tyler Robinson informed a family friend about shooting Kirk. The FBI confirmed that the suspect was apprehended on Thursday evening. Further details about the incident are yet to be released.",
    "published": "2025-09-12T16:31:37Z"
  },
  {
    "title": "Premier League team news: predicted lineups for the weekend action",
    "url": "https://www.theguardian.com/football/2025/sep/12/premier-league-team-news-predicted-lineups-for-the-weekend-action",
    "image": "https://media.guim.co.uk/cc2418b20ba4a9471ec27cf1d212b1e89cd2532a/125_927_3470_2776/500.jpg",
    "summary": "Arsenal will face Nottingham Forest, managed by Ange Postecoglou, in a match on Saturday. This weekend also features the highly anticipated Manchester derby on Sunday. Both matches are key fixtures in the Premier League schedule.",
    "published": "2025-09-12T16:30:28Z"
  },
  {
    "title": "Sweet William is punters’ darling again after second successive Doncaster Cup success",
    "url": "https://www.theguardian.com/sport/2025/sep/12/sweet-william-doncaster-cup-st-leger-preview-horse-racing-tips",
    "image": "https://media.guim.co.uk/69abb0fd0e4a13544862fea8d51478c3a1d39312/496_195_4419_3537/500.jpg",
    "summary": "A talented horse known for his unique racing strategies showcased his gentle personality. He is set to return next year in pursuit of a third consecutive victory. Fans are eager to see his performance in the upcoming season.",
    "published": "2025-09-12T16:29:03Z"
  }
]