[
  {
    "title": "How could Tropical Forest Forever fund proposed at Cop30 tackle climate change?",
    "url": "https://www.theguardian.com/environment/2025/nov/06/tropical-forest-forever-fund-proposed-cop30-tackle-climate-change",
    "image": "https://media.guim.co.uk/6a005aabcf172f338af36ada6dd77905aff3dd10/420_0_4200_3361/500.jpg",
    "summary": "A new initiative aims to combat deforestation by raising $125 billion to invest in bonds. The returns from these investments will be used to incentivize tropical forest nations for their conservation efforts. This scheme seeks to promote sustainable practices and support regions critical to global ecology.",
    "published": "2025-11-06T15:21:18Z"
  },
  {
    "title": "WTA Finals tennis: Jessica Pegula breezes past Jasmine Paolini; Aryna Sabalenka v Coco Gauff – live",
    "url": "https://www.theguardian.com/sport/live/2025/nov/06/wta-finals-tennis-aryna-sabalenka-v-coco-gauff-jessica-pegula-v-jasmine-paolini-live",
    "image": "https://media.guim.co.uk/b999d1179118a82d9012ae73520a710ed0f351f7/0_153_2829_2263/500.jpg",
    "summary": "Coco Gauff, ranked No. 3 in the world, is set to face No. 1 Aryna Sabalenka at the WTA Finals on Thursday. Before that match, Jessica Pegula will compete against Jasmine Paolini. The tournament continues to showcase top tennis talent.",
    "published": "2025-11-06T15:20:48Z"
  },
  {
    "title": "Dallas Cowboys defensive end Marshawn Kneeland dies at age of 24",
    "url": "https://www.theguardian.com/sport/2025/nov/06/marshawn-kneeland-dallas-cowboys-dies-nfl",
    "image": "https://media.guim.co.uk/eddc2f38ea5bcd8f13ef9c8a9fb2a65bcb2acf24/265_0_2642_2115/500.jpg",
    "summary": "Dallas Cowboys defensive end Marshawn Kneeland has passed away at the age of 24, as confirmed by the team on Thursday. The cause of his death has not been disclosed. Kneeland was a promising player and his loss is mourned by teammates and fans alike.",
    "published": "2025-11-06T15:20:44Z"
  },
  {
    "title": "Bank of England says UK inflation has peaked after leaving rates at 4%; US job cuts jump as firms turn to AI – business live",
    "url": "https://www.theguardian.com/business/live/2025/nov/06/bank-of-england-interest-rates-andrew-bailey-stock-markets-pound-budget-business-live-news",
    "image": "https://media.guim.co.uk/cf2749c6401a2fc1124fba5bf11661e1d65ffbe6/1032_0_5908_4727/500.jpg",
    "summary": "Economists anticipate that the Bank of England will implement interest rate cuts in December, following a narrow decision to maintain the Bank Rate at 4%. The decision reflects ongoing economic challenges and uncertainties. Analysts are closely monitoring the situation for any signs of shifts in monetary policy.",
    "published": "2025-11-06T15:20:43Z"
  },
  {
    "title": "Nancy Pelosi, former House speaker, says she will not seek re-election to Congress – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/nov/06/donald-trump-government-shutdown-venezuela-senate-vote-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/9305a5fb4cacc6e0ced5395b6e23371ab27f961d/262_0_1611_1289/500.jpg",
    "summary": "Nancy Pelosi, the representative for San Francisco, has announced that she will step down from her position in 2027. This decision marks a significant transition as she has been a prominent figure in U.S. politics. Pelosi's announcement has sparked discussions about the future leadership of the Democratic Party.",
    "published": "2025-11-06T15:18:30Z"
  }
]