[
  {
    "title": "Women’s Cricket World Cup: Australia v New Zealand – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/01/womens-cricket-world-cup-live-australia-v-new-zealand",
    "image": "https://media.guim.co.uk/8248ba0f980cb50ec59536ed51c1470eed0d810b/263_0_2755_2204/500.jpg",
    "summary": "Australia begins its title defense in the 50-over cricket tournament at Holkar Stadium in Indore. Updates will be provided by Megan Maurice. Fans can follow the match for real-time developments.",
    "published": "2025-10-01T11:16:21Z"
  },
  {
    "title": "Europe ‘in most difficult and dangerous situation since second world war,’ Danish PM warns – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/oct/01/mette-frederiksen-denmark-europe-russia-vladimir-putin-volodymyr-zelenskyy-ukraine-hybrid-war-security-europe-live-news",
    "image": "https://media.guim.co.uk/3a2046c1b05f2c3d33d25b6814cef100f5cbcee9/566_0_5618_4495/500.jpg",
    "summary": "Danish Prime Minister Mette Frederiksen expressed her support for the European Commission's plan to provide a reparation loan to Ukraine. This loan would be backed by frozen Russian assets. Frederiksen's endorsement aligns with broader European efforts to assist Ukraine financially amid ongoing conflicts.",
    "published": "2025-10-01T11:16:03Z"
  },
  {
    "title": "Sigur Rós and the London Contemporary Orchestra review – crashing waves of refined harmony",
    "url": "https://www.theguardian.com/music/2025/oct/01/sigur-ros-and-the-london-contemporary-orchestra-review-royal-albert-hall",
    "image": "https://media.guim.co.uk/5b6694883a0fece4997412172fd61d375e76f713/880_729_3335_2668/500.jpg",
    "summary": "The Icelandic band effectively enhances their mid-career performance with the addition of a classical orchestra. This collaboration amplifies the emotional intensity of their beautiful crescendos. The orchestra's presence brings a unique depth to their music.",
    "published": "2025-10-01T11:14:37Z"
  },
  {
    "title": "Red Cross forced to suspend work in Gaza City as Israeli offensive intensifies – Middle East crisis live",
    "url": "https://www.theguardian.com/world/live/2025/oct/01/israel-gaza-offensive-benjamin-netanyahu-hamas-donald-trump-middle-east-crisis-live-news",
    "image": "https://media.guim.co.uk/5c74d93af9a3b45d92f3212627f646a7721700d4/325_0_4914_3933/500.jpg",
    "summary": "The International Committee of the Red Cross (ICRC) announced a new measure aimed at ensuring the safety of its staff and maintaining operational continuity. This decision highlights the organization's commitment to protecting personnel while delivering humanitarian aid. The specifics of the move have not been disclosed, but it emphasizes the need for security in challenging environments.",
    "published": "2025-10-01T11:14:19Z"
  },
  {
    "title": "Miliband vows to ban fracking, labels Reform ‘ideological extremists’ and tells Musk to ‘get the hell out of our politics’ – live",
    "url": "https://www.theguardian.com/politics/live/2025/oct/01/keir-starmer-labour-conference-nigel-farage-reform-uk-politics-latest-news-updates",
    "image": "https://media.guim.co.uk/342084aedda41105706a2e00f3ccc1823c4569fb/136_0_2330_1864/500.jpg",
    "summary": "Environmental groups have expressed support for the energy secretary’s recent announcement regarding fracking. They believe that the measures outlined will help address environmental concerns associated with hydraulic fracturing. This approval signals a potential shift towards more sustainable energy practices.",
    "published": "2025-10-01T11:12:56Z"
  }
]