[
  {
    "title": "Why has the US-China trade war restarted and how have markets reacted?",
    "url": "https://www.theguardian.com/world/2025/oct/13/why-us-china-trade-war-restarted-tariffs",
    "image": "https://media.guim.co.uk/5722ab6c61c26af7f05210e2dde2015692a440ed/452_0_2494_1995/500.jpg",
    "summary": "Trump has imposed 100% tariffs on Chinese imports in response to Beijing's new restrictions on rare earth minerals. This escalation comes just a month before the U.S. and China were set to negotiate a trade agreement. The move heightens tensions between the two countries amid ongoing trade disputes.",
    "published": "2025-10-13T14:16:56Z"
  },
  {
    "title": "French political crisis continues as Macron blames rivals for ‘sense of disorder’– Europe live",
    "url": "https://www.theguardian.com/world/live/2025/oct/13/france-political-crisis-lecornu-macron-sarkozy-ukraine-russia-gaza-europe-news-latest-updates",
    "image": "https://media.guim.co.uk/10f1e402df8dafd93549e6cee8551d3b205b6c32/434_0_4342_3473/500.jpg",
    "summary": "At a Gaza summit in Egypt, the President reaffirmed his commitment to remain in office despite facing no-confidence motions from opponents. He emphasized his determination to lead amidst the political challenges. The situation highlights ongoing tensions within the government.",
    "published": "2025-10-13T14:16:47Z"
  },
  {
    "title": "Global financial system vulnerable to shocks amid recent stock market surge, Bank of England chief warns – as it happened",
    "url": "https://www.theguardian.com/business/live/2025/oct/13/asian-stocks-tumble-fresh-us-china-trade-spat-chinese-exports-top-forecasts-business-live",
    "image": "https://media.guim.co.uk/bcba079c5f476d1235d4c3c7845e549a90c88ffe/101_0_5710_4568/500.jpg",
    "summary": "Wall Street opened with strong gains as investor concerns regarding the US-China trade war subsided. Positive sentiment was fueled by optimism about trade negotiations between the two countries. This rally reflects a renewed confidence in the market amid easing tensions.",
    "published": "2025-10-13T14:14:35Z"
  },
  {
    "title": "Markets rebound amid latest US-China tariff spat as traders look to possible ‘Taco trade’",
    "url": "https://www.theguardian.com/business/2025/oct/13/markets-rebound-us-china-tariff-taco-trade",
    "image": "https://media.guim.co.uk/358b8e828a183f32753af2f6e74d5cce6b98a196/919_0_6601_5282/500.jpg",
    "summary": "The US S&P 500 and Nasdaq Composite indexes experienced gains, alongside a rebound in cryptocurrencies. This surge followed a post by Donald Trump on his platform, Truth Social. The market reacted positively, reflecting investor sentiment influenced by the former president's comments.",
    "published": "2025-10-13T14:12:26Z"
  },
  {
    "title": "US east coast braces for nor’easter while storm sweeps away homes in Alaska",
    "url": "https://www.theguardian.com/us-news/2025/oct/13/us-east-coast-noreaster-storm-alaska",
    "image": "https://media.guim.co.uk/ec51e0004ae9cb39f8114f2fac253a6eab9db6cd/763_0_4523_3619/500.jpg",
    "summary": "Severe weather has caused flooding and high winds across regions from the Carolinas to New England. In Alaska, intense flooding has resulted in homes being swept away. These extreme conditions highlight ongoing challenges posed by climate-related events.",
    "published": "2025-10-13T14:09:09Z"
  }
]