[
  {
    "title": "FBI director Kash Patel fails to recognize name of Charleston church shooter Dylann Roof in Senate questioning – live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/17/donald-trump-charlie-kirk-free-speech-nyt-cdc-rfk-epstein-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/c5052be8de3754455f466b51fcd243ecda850f45/765_0_6827_5464/500.jpg",
    "summary": "Patel seemed confused and struggled to remember the name of the white supremacist responsible for the 2015 murder of nine Black parishioners in South Carolina. This incident highlights ongoing challenges in recalling specific details related to significant events. The failure to name the perpetrator raises concerns about awareness of hate crimes and their impact.",
    "published": "2025-09-17T22:26:10Z"
  },
  {
    "title": "Bernie Sanders becomes first US senator to say Israel committing genocide in Gaza",
    "url": "https://www.theguardian.com/us-news/2025/sep/17/bernie-sanders-israel-gaza-genocide",
    "image": "https://media.guim.co.uk/dcd4cfa10565632f39217d8f35ba5891ec0961e5/476_0_4583_3667/500.jpg",
    "summary": "Vermont Senator Bernie Sanders faced criticism for not taking a stance on ongoing conflicts as a UN panel reported that Israel's actions meet the criteria for genocide. His reluctance to engage in the debate has drawn ire from various political circles. Speculation continues around his political motivations and implications for future policies.",
    "published": "2025-09-17T22:18:40Z"
  },
  {
    "title": "West coast states band together to issue vaccine guidelines after CDC and HHS purge",
    "url": "https://www.theguardian.com/us-news/2025/sep/17/west-coast-vaccine-guidelines",
    "image": "https://media.guim.co.uk/78bea9663cf8063b275ffc54c8fb57f3d45860f5/507_0_4283_3429/500.jpg",
    "summary": "California, Oregon, Washington, and Hawaii have issued recommendations following recent firings at federal health agencies. The states aim to address concerns regarding public health leadership and agency stability. The recommendations focus on improving transparency and accountability within health agencies.",
    "published": "2025-09-17T21:50:15Z"
  },
  {
    "title": "Starmer banks on £150bn investment to placate critics of Trump state visit",
    "url": "https://www.theguardian.com/us-news/2025/sep/17/keir-starmer-150bn-investment-critics-donald-trump-state-visit",
    "image": "https://media.guim.co.uk/ef4685aa429892fd9a05258be9274cbc2d513488/0_0_4932_3946/500.jpg",
    "summary": "The Prime Minister aims to leverage a challenging state visit by the US President by securing a range of commitments from US companies. This strategy seeks to enhance bilateral relations and bring economic benefits. The visit highlights the importance of collaborative efforts between the two nations.",
    "published": "2025-09-17T21:47:58Z"
  },
  {
    "title": "$30bn Santos takeover collapses after Abu Dhabi consortium reconsiders offer",
    "url": "https://www.theguardian.com/australia-news/2025/sep/18/30bn-santos-takeover-collapses-after-abu-dhabi-consortium-reconsiders-offer",
    "image": "https://media.guim.co.uk/c3ab56a475e606a75aa5aa82cae95027b8bfc6a5/470_0_3068_2456/500.jpg",
    "summary": "The federal government has withdrawn from a high-stakes decision regarding whether to support a particular deal. This move alleviates pressure and potential consequences tied to the government's backing. The withdrawal signifies a shift in responsibility, leaving the deal's outcome uncertain.",
    "published": "2025-09-17T21:47:30Z"
  }
]