[
  {
    "title": "Trump’s praise for Mamdani upends Republican talking points as they bond over New York, working class and FDR – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/nov/21/donald-trump-democrats-republicans-zohran-mamdani-us-politics-latest-news-updates",
    "image": "https://media.guim.co.uk/688c0d6cac8063aaed10172b8cd4bd39dfac0cbd/1030_0_6880_5504/500.jpg",
    "summary": "The president and the newly elected mayor avoided addressing their differences during discussions, despite numerous efforts to provoke a conflict. Both leaders maintained a united front and focused on collaboration. Their commitment to teamwork was evident, leaving no room for divisive commentary.",
    "published": "2025-11-22T01:23:58Z"
  },
  {
    "title": "Australia v England: Ashes first Test, day two – live",
    "url": "https://www.theguardian.com/sport/live/2025/nov/22/australia-vs-england-live-ashes-first-1st-test-day-two-aus-v-eng-cricket-scores-updates-perth",
    "image": "https://media.guim.co.uk/7b3dd9df35475cd29a5fd0a2af143d3c1a7c3c10/500_0_5000_4000/500.jpg",
    "summary": "The second day of the Ashes opener in Perth features updates from writers covering the match. Following an exciting start to the series, the report provides live insights into the ongoing action. Fans can follow the developments as the teams compete for early dominance.",
    "published": "2025-11-22T01:20:12Z"
  },
  {
    "title": "Cop30 live: summit president says ‘everybody will lose’ as fears rise that conference will end without a deal",
    "url": "https://www.theguardian.com/world/live/2025/nov/21/cop30-live-fossil-fuel-phaseout-final-text-brazil-belem-latest-news-updates",
    "image": "https://media.guim.co.uk/b9df2e7064fb3fba79bfc87a214d9a2dad11d9e6/359_0_5000_4000/500.jpg",
    "summary": "André Corrêa do Lago stresses the importance of upholding the Paris Agreement as negotiations stall on the final day. Many countries are still struggling to reach a consensus on key climate issues. His plea underscores the urgency of collaborative action to combat climate change.",
    "published": "2025-11-22T01:16:56Z"
  },
  {
    "title": "Survivor of Chilean blizzard that killed Briton says staff told trekkers they could proceed",
    "url": "https://www.theguardian.com/world/2025/nov/22/survivor-of-chilean-blizzard-that-killed-briton-says-staff-told-trekkers-to-proceed",
    "image": "https://media.guim.co.uk/d6204b3116773fd9e1f63319065d0be96e51c4a4/465_38_903_722/500.jpg",
    "summary": "Tom Player has publicly addressed the tragic incident resulting in the deaths of Victoria Bond, two Mexican nationals, and two Germans. He emphasized the need for clarity and justice in the aftermath of the event. The circumstances surrounding the fatalities remain under investigation.",
    "published": "2025-11-22T00:30:43Z"
  },
  {
    "title": "Severe Tropical Cyclone Fina intensifies to category three system as it closes in on Darwin",
    "url": "https://www.theguardian.com/environment/2025/nov/22/severe-tropical-cyclone-fina-intensifies-to-category-three-system-as-it-closes-in-on-darwin",
    "image": "https://media.guim.co.uk/0374367b0b39cefc8d7794f70fe5bb8da76bf383/1009_0_5043_4035/500.jpg",
    "summary": "Australia is experiencing its first strong cyclone in November in 20 years, featuring sustained winds of 120 km/h. This unusual weather event highlights a significant shift in early cyclone activity. The cyclone poses potential risks to coastal areas and local communities.",
    "published": "2025-11-22T00:25:18Z"
  }
]