[
  {
    "title": "Arteta warns that clubs could pull out of cups amid fixture congestion: football news – live",
    "url": "https://www.theguardian.com/football/live/2025/oct/31/weekend-team-news-and-previews-football-live",
    "image": "https://media.guim.co.uk/ef1dccb65a5690bddc4e4596d5ae49bcbbbc7678/65_560_4583_3665/500.jpg",
    "summary": "Join our team for updates and insights as the weekend's football matches approach. Stay informed about key developments and predictions. Don't miss out on expert analysis and previews!",
    "published": "2025-10-31T15:18:38Z"
  },
  {
    "title": "Amazon shares surge as AI boom fuels cloud growth; Nvidia boss says selling chips in China is Trump’s call – business live",
    "url": "https://www.theguardian.com/business/live/2025/oct/31/uk-house-prices-rise-asian-stocks-mixed-tech-earnings-business-live-news",
    "image": "https://media.guim.co.uk/9f253a9e05ce291a6d856cd2cada13f940e41038/244_0_3333_2667/500.jpg",
    "summary": "Stay updated with ongoing developments in the economic and financial landscape, featuring real-time updates on market trends, key financial indicators, and major corporate announcements. Expert analysis and commentary provide insights into how these factors impact global economies. The coverage also highlights significant policy changes and their implications for investors and consumers.",
    "published": "2025-10-31T15:17:34Z"
  },
  {
    "title": "D66 has shown the world populists can be beaten, says Jetten, as party is projected to win Dutch election – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/oct/31/ukraine-russian-attacks-secret-missile-netherlands-dutch-elections-europe-live-latest-news-updates",
    "image": "https://media.guim.co.uk/ebe8712db16dec7828a10f8ea3a8903a004af11f/375_0_3003_2403/500.jpg",
    "summary": "D66 leader hailed a 'historic result' following an analysis by a Netherlands news agency indicating that the party has secured the most votes. The report also suggests that Geert Wilders' far-right PVV is no longer in contention for victory. This marks a significant shift in the political landscape of the Netherlands.",
    "published": "2025-10-31T15:17:28Z"
  },
  {
    "title": "‘A sense of freedom’: 80 years on from the Pan-African Congress in Manchester",
    "url": "https://www.theguardian.com/news/2025/oct/31/80-years-pan-african-congress-manchester-black-history",
    "image": "https://media.guim.co.uk/9bbfe4f212749a2d4dbe001d0248969a86de2c9d/0_0_5000_4000/500.jpg",
    "summary": "The legacy of this significant moment in Black history resonates globally, emphasizing the importance of unity. It serves as a reminder of the struggles faced and the progress made. The event's impact spans across generations, inspiring ongoing movements and solidarity.",
    "published": "2025-10-31T15:11:08Z"
  },
  {
    "title": "Worries about immigration are ‘manufactured panic’ says charity as poll shows issue not a local concern – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/oct/31/uk-politics-prince-andrew-latest-news-updates-labour-conservatives-keir-starmer-rachel-reeves",
    "image": "https://media.guim.co.uk/abe5bd8a7bcdd3079bc7bd44272705d3e30e7a88/818_0_4565_3652/500.jpg",
    "summary": "A YouGov poll found that only 26% of respondents view immigration as a local issue, while over half consider it a national concern. This discrepancy highlights differing perceptions of immigration's impact at local versus national levels. The findings suggest a nuanced understanding of the immigration debate among the public.",
    "published": "2025-10-31T15:10:27Z"
  }
]