[
  {
    "title": "Australia politics live: Bragg agrees Coalition ‘running out of people to offend’; 7 October anniversary ‘not a day for demonstrations’, Marles says",
    "url": "https://www.theguardian.com/australia-news/live/2025/oct/07/australia-politics-live-october-7-anniversary-hamas-israel-anthony-albanese-sussan-ley-question-time-andrew-hastie-labor-coalition-ntwnfb",
    "image": "https://media.guim.co.uk/572695e0252537854e27e8314ad4565b5bc21dfb/582_280_4570_3659/500.jpg",
    "summary": "I can't access live news updates, but if you provide specific content or details about the news you'd like summarized, I'd be happy to help!",
    "published": "2025-10-06T23:14:04Z"
  },
  {
    "title": "Schumer rejects Trump’s claim that bipartisan government shutdown negotiations are under way – live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/06/donald-trump-national-guard-ice-government-shutdown-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/45d69873abb59bc113455dd937bc906007151707/811_0_6827_5464/500.jpg",
    "summary": "The Senate Democratic leader expressed willingness to collaborate with the president, stating, \"if he’s finally ready to work with Democrats, we’ll be at the table.\" This statement indicates an openness to bipartisan efforts moving forward. It highlights a potential shift in cooperation between the administration and Democrats in Congress.",
    "published": "2025-10-06T23:13:38Z"
  },
  {
    "title": "Global renewable energy generation surpasses coal for first time",
    "url": "https://www.theguardian.com/environment/2025/oct/07/global-renewable-energy-generation-surpasses-coal-first-time",
    "image": "https://media.guim.co.uk/ddf5282ada8d1aabe4d8e443275c500f53556288/120_0_4932_3948/500.jpg",
    "summary": "A recent report highlights that record solar energy expansion and consistent wind energy growth are pivotal in the global transition away from fossil fuels by 2025. This shift indicates a significant commitment to renewable energy sources. The findings emphasize the accelerating pace of this transformation in the energy sector.",
    "published": "2025-10-06T23:01:26Z"
  },
  {
    "title": "US shutdown enters second week as Senate again rejects rival funding bills",
    "url": "https://www.theguardian.com/us-news/2025/oct/06/us-shutdown-government-funding",
    "image": "https://media.guim.co.uk/1703c2062ddde285069e88141fe7cd76834f2430/418_0_4164_3333/500.jpg",
    "summary": "Competing health care bills failed to meet the 60-vote threshold needed for passage. Meanwhile, former President Trump suggested the possibility of a deal with Democrats regarding health subsidies. The situation leaves uncertainty about future health care legislation.",
    "published": "2025-10-06T23:00:27Z"
  },
  {
    "title": "Cryptic crossword No 29,819",
    "url": "https://www.theguardian.com/crosswords/cryptic/29819",
    "summary": "I'm sorry, but I do not have access to specific crossword puzzles or their content. If you provide details or the main points of the news regarding the crossword, I'd be happy to help summarize!",
    "published": "2025-10-06T23:00:26Z"
  }
]