[
  {
    "title": "Streeting praises health staff from overseas and says Reform UK would be ‘disaster’ for NHS – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/30/labour-conference-starmer-speech-streeting-nhs-reform",
    "image": "https://media.guim.co.uk/fa5a663df5b3af529e35fcf6dabf92f8d8c1e1d3/271_0_6539_5231/500.jpg",
    "summary": "The Health Secretary is set to address the Labour conference, presenting plans for an innovative 'online hospital' initiative. This initiative aims to reduce patient waiting times for healthcare services. The announcement highlights the government's efforts to enhance access to care through digital solutions.",
    "published": "2025-09-30T08:27:20Z"
  },
  {
    "title": "Australia news live: Michele Bullock says ‘nothing I can do personally’ about house prices as November cut still possible",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/30/australia-news-live-albanese-supermarket-united-arab-emirates-uae-coalition-sussan-ley-andrew-hastie-reserve-bank-rba-chalmers-interest-rates-decision-ntwnfb",
    "image": "https://media.guim.co.uk/4a73d0a2a7f63616a981256fca0a118dd20d0e5c/435_0_4379_3504/500.jpg",
    "summary": "It appears that there is no specific news article provided for summarization. If you can provide the content or key points of the news, I'd be happy to help you summarize it in three lines!",
    "published": "2025-09-30T08:26:51Z"
  },
  {
    "title": "Hamas says it will study Trump Gaza plan, as Netanyahu warns Israel will ‘finish the job’ if deal rejected – Middle East crisis live",
    "url": "https://www.theguardian.com/world/live/2025/sep/30/netanyahu-israel-gaza-hamas-trump-peace-plan-latest-news-middle-east-crisis-live",
    "image": "https://media.guim.co.uk/7fbc4a01c269f5db73728c44b73ea6a3dc6d8f9f/306_0_3202_2563/500.jpg",
    "summary": "A senior Hamas official announced that the group will start reviewing proposals today. However, the timeline for when they will provide a response remains uncertain. This development indicates ongoing discussions but lacks clarity on the outcomes.",
    "published": "2025-09-30T08:26:47Z"
  },
  {
    "title": "Keir Starmer to announce NHS ‘online hospital’ to help cut waiting lists",
    "url": "https://www.theguardian.com/politics/2025/sep/30/keir-starmer-to-announce-nhs-online-hospital-to-help-cut-waiting-lists",
    "image": "https://media.guim.co.uk/80c26492e534e1828cd9424f0c3f0541e63e7301/341_0_3043_2435/500.jpg",
    "summary": "Labour promises to provide up to 8.5 million additional NHS appointments within the first three years of its proposed healthcare service. The initiative aims to address growing demand and improve access to medical care. This plan seeks to prioritize and enhance patient services in the NHS.",
    "published": "2025-09-30T08:23:41Z"
  },
  {
    "title": "Europe must give strong and united response to Russian drone incursions, says von der Leyen – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/sep/30/europe-russia-drones-ukraine-rutte-von-der-leyen-poland-kellogg-latest-updates",
    "image": "https://media.guim.co.uk/6fdb8185396973882dbb01bfd9ce26b58437039c/1199_0_5994_4795/500.jpg",
    "summary": "The European Commission President held a press conference alongside NATO Secretary General Jens Stoltenberg and Dutch Prime Minister Mark Rutte. They discussed security issues in anticipation of an upcoming EU security college meeting. The gathering aims to address collaborative efforts on European defense and security challenges.",
    "published": "2025-09-30T08:16:57Z"
  }
]