[
  {
    "title": "Rescue operations at Hong Kong apartment complex ‘almost complete’, as death toll reaches 94",
    "url": "https://www.theguardian.com/news/2025/nov/28/hong-kong-apartment-fire-response-rescue-operations-death-toll",
    "image": "https://media.guim.co.uk/520b8905279ac27d743c239461d00a769a9b7c9c/681_0_3747_2999/500.jpg",
    "summary": "By Friday morning, officials reported that the fires, which had been burning for over 24 hours, were mostly contained. The efforts to control the blaze have been largely successful. Firefighters are continuing to monitor the situation to prevent any flare-ups.",
    "published": "2025-11-28T07:20:10Z"
  },
  {
    "title": "The Abandons to With Love, Meghan: Holiday Celebration – the seven best shows to stream this week",
    "url": "https://www.theguardian.com/tv-and-radio/2025/nov/28/the-abandons-to-with-love-meghan-holiday-celebration-the-seven-best-shows-to-stream-this-week",
    "image": "https://media.guim.co.uk/eab45ad231f14c20012971c16860848457c1e8eb/1520_18_2140_1712/500.jpg",
    "summary": "In a lively period drama set in 1850s Oregon, Gillian Anderson portrays a wealthy landowner who threatens local smallholders. Meanwhile, the Sussexes are surrounded by overwhelming festive decorations in their rental mansion. Both stories offer engaging themes of conflict and extravagance.",
    "published": "2025-11-28T07:00:04Z"
  },
  {
    "title": "Bog People: A Working-Class Anthology of Folk Horror review – dark tales with a sting",
    "url": "https://www.theguardian.com/books/2025/nov/28/bog-people-a-working-class-anthology-of-folk-horror-review-dark-tales-with-a-sting",
    "image": "https://media.guim.co.uk/08fc23c6cf5c6f39dd483760b69518eb1feefcc4/0_416_4281_3424/500.jpg",
    "summary": "A new collection of macabre stories set in England delves into themes of class and hierarchy. The narratives examine the persistent nature of inequality within society. Through a blend of eerie tales, the collection prompts reflection on social structures and their implications.",
    "published": "2025-11-28T07:00:02Z"
  },
  {
    "title": "Beyond the negative headlines, some truly good things came out of Cop30 ",
    "url": "https://www.theguardian.com/environment/2025/nov/27/beyond-the-negative-headlines-some-truly-good-things-came-out-of-cop30",
    "image": "https://media.guim.co.uk/ab715302c447cb905f0b6614e73cfbf427341e39/163_0_7200_5760/500.jpg",
    "summary": "This week's newsletter highlights that meaningful climate progress relies on tangible actions. The recent summit has shown promising advancements in addressing climate change. Overall, it emphasizes the importance of real-world initiatives in achieving climate goals.",
    "published": "2025-11-28T07:00:02Z"
  },
  {
    "title": "‘We awoke to find the Peak District under a blanket of snow’: readers’ favourite rural winter UK breaks",
    "url": "https://www.theguardian.com/travel/2025/nov/28/readers-favourite-rural-winter-uk-holidays-country-breaks",
    "image": "https://media.guim.co.uk/51fa5d6effada6b0ade845e7879a6163642002d2/492_0_4330_3464/500.jpg",
    "summary": "Tipsters recommend their favorite winter getaway spots, including an ancient castle in Easter Ross and a cozy cabin on Lough Erne. These picturesque locations are perfect for those seeking an active escape in the countryside. The suggestions highlight a variety of unique accommodations for a refreshing winter retreat.",
    "published": "2025-11-28T07:00:01Z"
  }
]