[
  {
    "title": "WTA Finals tennis: Coco Gauff v Jasmine Paolini, Aryna Sabalenka v Jessica Pegula – live",
    "url": "https://www.theguardian.com/sport/live/2025/nov/04/wta-finals-tennis-coco-gauff-v-jasmine-paolini-aryna-sabalenka-v-jessica-pegula-live",
    "image": "https://media.guim.co.uk/0e55be67826e11fe645ee4b5666b5524b5413dce/444_0_3333_2667/500.jpg",
    "summary": "Yara El-Shaboury will host coverage of the upcoming group-stage matches in the season-ending tournament. Tune in for the latest highlights and insights. Don't miss out on the action!",
    "published": "2025-11-04T13:30:31Z"
  },
  {
    "title": "EU says Ukraine must accelerate reforms on rule of law and other ‘fundamentals’ if it wants membership - Europe live",
    "url": "https://www.theguardian.com/world/live/2025/nov/04/european-union-eu-latest-news-updates-live",
    "image": "https://media.guim.co.uk/dc048cce5c7bafaba8ff588429afecb6bf3b9711/341_0_3240_2592/500.jpg",
    "summary": "The EU emphasizes the need for essential reforms, particularly concerning the rule of law, for a prospective candidate to advance in accession talks. These reforms are deemed critical to potentially conclude negotiations by the end of 2028. The statement underscores the importance of meeting foundational democratic standards for EU integration.",
    "published": "2025-11-04T13:29:49Z"
  },
  {
    "title": "US elections 2025 live: Americans go to the polls, with elections in New York City, New Jersey, Virginia and California",
    "url": "https://www.theguardian.com/us-news/live/2025/nov/04/us-elections-2025-live-new-york-city-new-jersey-virginia-california-latest-news-updates-live",
    "image": "https://media.guim.co.uk/0965b087be591a2ae6e1804d1ce1af3e63bad4df/1131_49_3758_3005/500.jpg",
    "summary": "The New York mayoral race is drawing significant attention both domestically and internationally. Democratic candidate Zohran Mamdani is competing against former governor Andrew Cuomo and Republican Curtis Sliwa. The election is seen as a pivotal moment for the city's political landscape.",
    "published": "2025-11-04T13:22:38Z"
  },
  {
    "title": "Reeves refuses to say she will stick to manifesto pledge on tax rises and insists she must face world ‘as it is’ – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/nov/04/rachel-reeves-speech-tax-budget-labour-keir-starmer-latest-politics-news-live",
    "image": "https://media.guim.co.uk/7ebd2ee66722401ff1d8a55b51fe33ca1c924190/363_0_3411_2729/500.jpg",
    "summary": "In her pre-budget speech, the Chancellor emphasized her commitment to addressing the priorities of the British public. She signaled that tax increases are likely on the horizon to support governmental strategies. The speech aims to set expectations for upcoming fiscal measures.",
    "published": "2025-11-04T13:19:30Z"
  },
  {
    "title": "The art of the possible: the Nottingham art gallery being run by citizens’ assembly ",
    "url": "https://www.theguardian.com/artanddesign/2025/nov/04/new-art-exchange-nottingham-community-run-art-gallery",
    "image": "https://media.guim.co.uk/a9bc722e874b9d9fdc7cd84336a0b7e65b609b3a/779_0_6829_5464/500.jpg",
    "summary": "New Art Exchange has become the first cultural institution globally to transfer permanent leadership to its community. This pioneering move empowers local voices in decision-making processes. The initiative aims to foster inclusivity and community engagement in the arts sector.",
    "published": "2025-11-04T13:15:53Z"
  }
]