[
  {
    "title": "Manchester United v West Ham, Tottenham v Aston Villa, and more: WSL clockwatch – live",
    "url": "https://www.theguardian.com/football/live/2025/dec/07/manchester-united-v-west-ham-tottenham-v-aston-villa-and-more-wsl-clockwatch-live",
    "image": "https://media.guim.co.uk/283a240ddab00054d30ba0b4156904503a47dc53/1109_201_3848_3079/500.jpg",
    "summary": "Dominic Booth provides updates on the upcoming Women’s Super League matches. Five fixtures are scheduled to take place soon. Stay tuned for the latest developments from the grounds.",
    "published": "2025-12-07T12:35:15Z"
  },
  {
    "title": "Young unemployed to be offered work in construction and hospitality in UK",
    "url": "https://www.theguardian.com/society/2025/dec/07/young-unemployed-to-be-offered-work-in-construction-and-hospitality-in-uk",
    "image": "https://media.guim.co.uk/f1778390a6dec49642a627bce7f0c9c072b4053c/288_0_2236_1790/500.jpg",
    "summary": "The Department for Work and Pensions (DWP) plans to provide 350,000 new opportunities for NEETs (Not in Education, Employment, or Training). Those who fail to participate in these programs may face sanctions. The initiative aims to encourage engagement and support for young people.",
    "published": "2025-12-07T12:34:02Z"
  },
  {
    "title": "Premier League buildup, FA Cup second round updates, and more – live",
    "url": "https://www.theguardian.com/football/live/2025/dec/07/premier-league-buildup-fa-cup-second-round-updates-and-more-live",
    "image": "https://media.guim.co.uk/9b6a91e516d60b8e80c79f7e65ac248e188ca955/0_0_5000_4000/500.jpg",
    "summary": "Coverage includes pre-match insights for Brighton vs. West Ham and Fulham vs. Crystal Palace in the FA Cup. Additionally, it features updates from Scottish and European football. Stay tuned for comprehensive analysis and highlights.",
    "published": "2025-12-07T12:33:51Z"
  },
  {
    "title": "Abu Dhabi Grand Prix: F1 title decider – live",
    "url": "https://www.theguardian.com/sport/live/2025/dec/07/abu-dhabi-grand-prix-formula-one-f1-title-decider-norris-verstappen-piastri-live",
    "image": "https://media.guim.co.uk/95b79f31832b96c51aabafce25b4b8178f52f6b8/300_0_4836_3870/500.jpg",
    "summary": "Lando Norris, Max Verstappen, and Oscar Piastri are set to compete for the title at the Yas Marina Circuit. Fans can join Niall McVeigh for live updates on the event. The competition promises an exciting showdown among the top drivers.",
    "published": "2025-12-07T12:33:17Z"
  },
  {
    "title": "Company linked to raid on illicit weight-loss drug facility still selling unlicensed drugs",
    "url": "https://www.theguardian.com/money/2025/dec/07/mhra-raid-weight-loss-drugs-alluvi-retatrutide-tirzepatide",
    "image": "https://media.guim.co.uk/e3f83a4299d4a0f1133ccf92fe1bad66c15f6c20/0_32_1838_1470/500.jpg",
    "summary": "Alluvi is still selling on Telegram despite the MHRA's seizure of counterfeit and unlicensed retatrutide and tirzepatide pens. The regulatory agency had previously taken action against these illegal products. This ongoing sales activity raises concerns about public health and safety.",
    "published": "2025-12-07T12:23:41Z"
  }
]