[
  {
    "title": "Australia news live: police pepper-spray protesters and make arrests outside Sydney weapons expo; Ryan says Coalition may face oblivion",
    "url": "https://www.theguardian.com/australia-news/live/2025/nov/04/australia-politics-live-keating-trump-anthony-albanese-sussan-ley-david-littleproud-net-zero-policy-coalition-question-time-energy-policy-ntwnfb",
    "image": "https://media.guim.co.uk/12271e2481142985fa44991ce34c238f5739b4fd/668_0_7857_6286/500.jpg",
    "summary": "Please provide the news article or content you'd like summarized, and I'll be happy to assist!",
    "published": "2025-11-03T22:18:00Z"
  },
  {
    "title": "Sunderland 1-1 Everton: Premier League – as it happened",
    "url": "https://www.theguardian.com/football/live/2025/nov/03/sunderland-v-everton-premier-league-live",
    "image": "https://media.guim.co.uk/0706f7ccb110de50274ccb0c3a578447a3787a68/469_154_2417_1933/500.jpg",
    "summary": "Iliman Ndiaye scored a stunning solo goal, giving his team an early lead in the match at the Stadium of Light. However, Granit Xhaka equalized, resulting in a hard-fought draw. Both teams showed resilience throughout the game.",
    "published": "2025-11-03T22:08:46Z"
  },
  {
    "title": "Trump administration says it will partially fund Snap food aid benefits– live",
    "url": "https://www.theguardian.com/us-news/live/2025/nov/03/us-government-shutdown-donald-trump-latest-politics-news",
    "image": "https://media.guim.co.uk/c77959f8bedd35ba713f13cb326bde041092e86f/461_0_3901_3122/500.jpg",
    "summary": "The Trump administration announced in a court filing that it intends to utilize emergency funds to help cover November SNAP benefits for millions of Americans. This move comes amid challenges related to funding for the program. The decision aims to ensure continued support for those reliant on food assistance during the critical month.",
    "published": "2025-11-03T22:06:56Z"
  },
  {
    "title": "More than $70tn of inherited wealth over next decade will widen inequality, economists warn",
    "url": "https://www.theguardian.com/inequality/2025/nov/03/more-than-70tn-of-inherited-wealth-over-next-decade-will-widen-inequality-economists-warn",
    "image": "https://media.guim.co.uk/695467e430b7145ad11d8dc7240d7334ade1aa47/435_0_4251_3401/500.jpg",
    "summary": "An expert panel emphasizes that a recent report revealing the growing gap in global wealth between the rich and poor calls for urgent intervention from the G20. The findings suggest that without action, economic disparities will continue to escalate. The panel advocates for collaborative efforts to address these inequalities on an international scale.",
    "published": "2025-11-03T22:01:10Z"
  },
  {
    "title": "Commanders coach accepts blame for leaving Jayden Daniels in game before serious injury",
    "url": "https://www.theguardian.com/sport/2025/nov/03/commanders-coach-accepts-blame-for-leaving-jayden-daniels-in-game-before-serious-injury",
    "image": "https://media.guim.co.uk/6de385b034dff4a4416b99c20cd886f144acb120/755_0_7548_6039/500.jpg",
    "summary": "Washington Commanders head coach Dan Quinn acknowledged his responsibility for the significant injury sustained by quarterback Jayden Daniels. Quinn's acceptance of blame highlights the impact of coaching decisions on player safety. The injury raises concerns about the team's performance and future strategy.",
    "published": "2025-11-03T21:27:14Z"
  }
]