[
  {
    "title": "Walsh takes lead role as England face new test in clash of continental champions",
    "url": "https://www.theguardian.com/football/2025/nov/28/keira-walsh-england-china-continental-champions-lionesses",
    "image": "https://media.guim.co.uk/5e536c37e9ec4e97030d14988b0b777f699ebae2/160_43_1805_1443/500.jpg",
    "summary": "Sarina Wiegman has made adjustments to the defense and captaincy for the upcoming friendly match against China at Wembley. The changes aim to address new challenges the Lionesses may face in the game. The match presents an opportunity for the team to test their strengths and strategies.",
    "published": "2025-11-28T13:28:28Z"
  },
  {
    "title": "Putin praises Orbán’s ‘balanced’ position on Ukraine as leaders meet in Moscow – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/nov/28/europe-latest-news-andriy-yermak-anti-corruption-zelenskyy-ukraine-russia-war-peace-talks-putin",
    "image": "https://media.guim.co.uk/597879bd9c804269eb6fdfb97ccc50ef89b4fafe/126_0_1621_1297/500.jpg",
    "summary": "Hungarian Prime Minister Viktor Orbán met with Russian President Vladimir Putin at the Kremlin to discuss various topics, including energy deliveries. The meeting highlights ongoing cooperation between Hungary and Russia amid broader geopolitical tensions. Energy security remains a key concern for both nations amidst Europe's shifting energy landscape.",
    "published": "2025-11-28T13:27:04Z"
  },
  {
    "title": "OBR challenges claims Reeves dropped income tax rise due to rosier forecasts ",
    "url": "https://www.theguardian.com/business/2025/nov/28/obr-reeves-income-tax-rise-forecasts-budget",
    "image": "https://media.guim.co.uk/a27ec190cc58f16168cb696f66deddd0641ab8f3/0_0_3624_2898/500.jpg",
    "summary": "The official forecaster's chair revealed that the chancellor was aware of updated economic predictions prior to altering the budget. This raises concerns about transparency and decision-making processes. The revelation may impact trust in fiscal policy.",
    "published": "2025-11-28T13:25:22Z"
  },
  {
    "title": "No 10 dismisses claim that OBR revelations show Reeves misled public about need for tax rises in budget – UK politics live ",
    "url": "https://www.theguardian.com/politics/live/2025/nov/28/workers-rights-bill-unfair-dismissal-uk-politics-latest-news-updates-labour-budget-keir-starmer",
    "image": "https://media.guim.co.uk/c0bd7148a2ad825edf852af383dc2802df685233/1033_0_6880_5504/500.jpg",
    "summary": "Downing Street has dismissed allegations that the chancellor misled the public regarding the state of public finances before the upcoming budget. Officials assert that the government's communication was accurate and transparent. The controversy has raised questions about fiscal accountability ahead of the budget announcement.",
    "published": "2025-11-28T13:22:33Z"
  },
  {
    "title": "Today is Black Friday. Here are 65+ very best deals in the US, curated and vetted",
    "url": "https://www.theguardian.com/thefilter-us/2025/nov/18/best-black-friday-cyber-monday-deals",
    "image": "https://media.guim.co.uk/ff6d50ae9eaf51e0b9fd03292584c87049fd958a/1_0_5998_4800/500.jpg",
    "summary": "Experts have identified the top deals and sales that provide the best value for your money. Their selections include high-quality pillows, bath towels, packing cubes, and other items. These recommendations aim to help consumers make informed purchasing decisions.",
    "published": "2025-11-28T13:19:32Z"
  }
]