[
  {
    "title": "England v Wales: international football friendly – live",
    "url": "https://www.theguardian.com/football/live/2025/oct/09/england-v-wales-international-football-friendly-live-score-updates",
    "image": "https://media.guim.co.uk/0e9bd9579a2a28d4f91022dd2c76f6a3c2904fd7/399_0_3567_2855/500.jpg",
    "summary": "Scott Murray is providing live updates from a friendly match taking place at Wembley. Fans can follow along for minute-by-minute coverage of the game. Stay tuned for all the action and key moments as they unfold.",
    "published": "2025-10-09T20:21:15Z"
  },
  {
    "title": "Gaza ceasefire plan live: Hamas chief negotiator says group received guarantees that war has ended",
    "url": "https://www.theguardian.com/world/live/2025/oct/09/gaza-ceasefire-live-trump-says-hostages-probably-released-monday-idf-says-gaza-city-still-extremely-dangerous",
    "image": "https://media.guim.co.uk/2072190864951de196b7397a409549fc0aaa136b/53_0_4800_3840/500.jpg",
    "summary": "Khalil al-Hayya states that the US, Arab mediators, and Turkey have assured that the war has permanently ended. However, Israel's security cabinet has not yet publicly approved the agreement. The situation remains uncertain as all parties await formal endorsement.",
    "published": "2025-10-09T20:17:57Z"
  },
  {
    "title": "US prosecutor seeks criminal charges against Letitia James in Trump’s latest effort to punish rivals",
    "url": "https://www.theguardian.com/us-news/2025/oct/09/criminal-charges-letitia-james-new-york-attorney-general",
    "image": "https://media.guim.co.uk/46945c38a3d217e26a1d470a6ce8814f19c31d06/1049_194_4020_3215/500.jpg",
    "summary": "An attorney seeking grand jury approval for charges was appointed due to Trump’s frustrations regarding the slow progress of investigations into his political rivals. This move reflects ongoing tensions within the legal landscape surrounding Trump. The situation highlights the intersection of legal strategy and political maneuvering.",
    "published": "2025-10-09T20:16:37Z"
  },
  {
    "title": "Good Boy review – Stephen Graham and Andrea Riseborough turn nasty in Kubrickian absurdist nightmare",
    "url": "https://www.theguardian.com/film/2025/oct/09/good-boy-review-stephen-graham-and-andrea-riseborough-turn-nasty-in-kubrickian-absurdist-nightmare",
    "image": "https://media.guim.co.uk/40d6fbfe5688878b47094027a44bd94fd7f436ea/5_0_2884_2307/500.jpg",
    "summary": "The London Film Festival features Jan Komasa's provocative film about a couple attempting to reform a troubled teenager through harsh methods. The narrative explores the moral complexities of their brutal approach. Komasa's storytelling delivers a gripping and thought-provoking experience.",
    "published": "2025-10-09T20:15:33Z"
  },
  {
    "title": "National guard remains in Chicago area as judge to rule on Trump deployment",
    "url": "https://www.theguardian.com/us-news/2025/oct/09/chicago-national-guard-troops",
    "image": "https://media.guim.co.uk/46a2ec4c6c48c03f9d2fca876d6ebf11f90189ce/333_0_3333_2667/500.jpg",
    "summary": "President Biden criticized Chicago's mayor and Illinois' governor for their handling of local issues while extra troops were deployed to an army training site southwest of the city. His comments highlight ongoing tensions between federal and state officials regarding public safety and security measures. The increased military presence underscores concerns about crime and violence in urban areas.",
    "published": "2025-10-09T20:15:28Z"
  }
]