[
  {
    "title": "Trump’s border czar says there will be a ‘ramp up’ of Ice operations in Democratic-led cities – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/aug/28/cdc-susan-monarez-trump-news-updates-us-politics-live",
    "image": "https://media.guim.co.uk/7f889abfd676bfeef05e9a62dc73b0a35a85ba77/333_0_3333_2667/500.jpg",
    "summary": "Tom Homan announced that ICE will enhance its operations in Chicago and other Democratic-led cities following Labor Day. He also defended the Trump administration's decision to increase federal presence in Washington, D.C. The move is seen as part of a broader strategy to bolster immigration enforcement efforts.",
    "published": "2025-08-28T17:32:15Z"
  },
  {
    "title": "Champions League group-phase draw: Liverpool face Real Madrid and potential Alexander-Arnold reunion – live",
    "url": "https://www.theguardian.com/football/live/2025/aug/28/champions-league-draw-2025-26-group-phase-fixtures-revealed-live",
    "image": "https://media.guim.co.uk/e7e8509750eb0084860214fe079c4eab3995da10/919_44_4798_3838/500.jpg",
    "summary": "Billy Munday provides live updates on the unveiling of this season's group phase fixtures. Follow along for minute-by-minute coverage as the teams and matchups are announced. Stay tuned to get all the latest developments in real-time.",
    "published": "2025-08-28T17:29:43Z"
  },
  {
    "title": "US Open tennis 2025: Iga Swiatek, Jannik Sinner and Naomi Osaka in action on day five – live",
    "url": "https://www.theguardian.com/sport/live/2025/aug/28/us-open-tennis-2025-swiatek-sinner-osaka-musetti-day-five-live",
    "image": "https://media.guim.co.uk/36d8d1ab93dea5873e6567993862d101339eb59d/263_0_4211_3370/500.jpg",
    "summary": "Daniel Harris is providing live updates from the second round of an event taking place in New York. Follow along for the latest developments and information. Stay tuned for insights and key moments as the round progresses.",
    "published": "2025-08-28T17:29:21Z"
  },
  {
    "title": "Judges to rule on Epping hotel injunction on Friday - UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/aug/28/latest-uk-politics-news-keir-starmer-rachel-reeves-labour-live-updates",
    "image": "https://media.guim.co.uk/ce98a439324cf0ec721f78c26607e0cdcd8d57b5/137_0_2501_2001/500.jpg",
    "summary": "The Home Office and the owner of Bell Hotel are contesting a high court injunction that was awarded to Epping Council last week. The injunction likely pertains to regulations affecting the hotel or its operations. Both parties are seeking to overturn the decision made by the court.",
    "published": "2025-08-28T17:26:46Z"
  },
  {
    "title": "Chelsea poised to close £36.2m Nkunku deal with Milan as Spurs step up Simons pursuit",
    "url": "https://www.theguardian.com/football/2025/aug/28/christopher-nkunku-milan-chelsea",
    "image": "https://media.guim.co.uk/5bff3238a074ee55b2e820bd1139f048621c9a5b/944_240_3137_2511/500.jpg",
    "summary": "Milan is set to sign Chelsea forward Christopher Nkunku for a total package of €42 million (£36.2 million). The agreement marks a significant move for the Italian club as they bolster their attacking options. Nkunku’s transfer is anticipated to enhance Milan’s competitiveness in the league.",
    "published": "2025-08-28T17:10:19Z"
  }
]