[
  {
    "title": "Steelers v Browns, Ravens v Rams and more: NFL week six – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/12/steelers-v-browns-ravens-v-rams-and-more-nfl-week-six-live",
    "image": "https://media.guim.co.uk/8f57ef2ef407a79489db2c620ac2292a89fdf065/320_254_3932_3146/500.jpg",
    "summary": "Graham Searles will provide live updates throughout week six of the NFL season. Fans can expect timely information on games, scores, and player performances. Stay tuned for engaging commentary and essential insights.",
    "published": "2025-10-12T19:11:54Z"
  },
  {
    "title": "Strictly Come Dancing: week three results – live",
    "url": "https://www.theguardian.com/tv-and-radio/live/2025/oct/11/strictly-come-dancing-week-three-live",
    "image": "https://media.guim.co.uk/9c81fe7a1bcb926f848a5f93e8bcaa9d407ee22f/254_0_3485_2788/500.jpg",
    "summary": "Lewis Cope achieved the first perfect score of the year with his impressive Zorro paso doble during Movie Week. Ross King landed at the bottom of the standings among the contestants. The competition raises questions about which performances might face elimination in the upcoming dance-off.",
    "published": "2025-10-12T19:10:07Z"
  },
  {
    "title": "Gaza ceasefire live: Netanyahu warns ‘campaign is not over’ as Israel awaits release of hostages",
    "url": "https://www.theguardian.com/world/live/2025/oct/12/gaza-ceasefire-live-aid-relief-hamas-release-israel-hostages",
    "image": "https://media.guim.co.uk/b826099457fa74a398182d2a2a34105b1b0e6877/500_0_5000_4000/500.jpg",
    "summary": "Israeli Prime Minister highlights significant security challenges facing the nation. He confirms that hostages will be released tomorrow. This statement underscores ongoing tensions and concerns within the region.",
    "published": "2025-10-12T18:59:56Z"
  },
  {
    "title": "Tony Blair wins nod from Palestine Authority for role in postwar Gaza",
    "url": "https://www.theguardian.com/world/2025/oct/12/tony-blair-wins-nod-from-palestine-authority-for-role-in-postwar-gaza",
    "image": "https://media.guim.co.uk/bf8cba4e62f06140e2206bee094fef191b568021/595_0_4453_3563/500.jpg",
    "summary": "A senior Palestinian Authority leader has expressed readiness to collaborate with former UK Prime Minister Tony Blair on initiatives for post-ceasefire recovery. This cooperation aims to address the needs arising from recent conflicts. The partnership highlights ongoing efforts to foster stability and support in the region.",
    "published": "2025-10-12T18:39:04Z"
  },
  {
    "title": "Liverpool remain pointless in WSL after Fujino strike gives Manchester City late win",
    "url": "https://www.theguardian.com/football/2025/oct/12/liverpool-manchester-city-womens-super-league-match-report",
    "image": "https://media.guim.co.uk/282b28c7241fc2670015ea9787df47fd5e99aeb9/320_0_3202_2561/500.jpg",
    "summary": "Manchester City triumphed 2-1 against Liverpool, overcoming an initial deficit. This defeat marked Liverpool's fifth consecutive loss in the league. The match highlighted Manchester City's resilience and Liverpool's ongoing struggles.",
    "published": "2025-10-12T18:20:04Z"
  }
]