[
  {
    "title": "European leaders meet at Denmark summit to discuss security, defence and migration – Europe live ",
    "url": "https://www.theguardian.com/world/live/2025/oct/02/epc-european-political-community-leaders-copenhagen-denmark-ukraine-russia-europe-live",
    "image": "https://media.guim.co.uk/ed27b0372ad6924ac08728696ae27138904e3aff/0_345_3733_2988/500.jpg",
    "summary": "Over 45 leaders convened in Copenhagen for the seventh summit of the European Political Community. The meeting aimed to strengthen cooperation and address key challenges facing Europe. Discussions focused on various political, security, and economic issues impacting the region.",
    "published": "2025-10-02T08:21:58Z"
  },
  {
    "title": "Gaza aid flotilla: more than a dozen vessels intercepted by Israeli forces; Greta Thunberg arrested – live",
    "url": "https://www.theguardian.com/world/live/2025/oct/01/israel-gaza-aid-global-sumud-flotilla-middle-east-crisis-latest-updates",
    "image": "https://media.guim.co.uk/1dc8eff7cd550ab162294c9a1525393e9bf0e162/107_0_705_564/500.jpg",
    "summary": "The Israeli foreign ministry released a video of activist Greta Thunberg's arrest as part of a protest. This occurred when vessels carrying around 500 activists were intercepted approximately 75 miles off the coast of the conflict-stricken area. The incident highlights ongoing tensions surrounding activist efforts in the region.",
    "published": "2025-10-02T08:17:52Z"
  },
  {
    "title": "Thames Water creditors propose new rescue plan; Tesco ups profit outlook despite pressure on household budgets – business live",
    "url": "https://www.theguardian.com/business/live/2025/oct/02/thames-water-creditors-rescue-plan-tesco-profit-markets-business-live-news",
    "image": "https://media.guim.co.uk/55c7b125803beb3009c9c8c615dd2a3f85696bdd/458_0_4583_3667/500.jpg",
    "summary": "A rescue plan has been initiated to cover outstanding fines from sewage spills. This measure aims to address environmental concerns and compliance issues related to sewage management. The plan underscores a commitment to improving water quality and regulatory adherence.",
    "published": "2025-10-02T08:01:16Z"
  },
  {
    "title": "The Finest Hotel in Kabul by Lyse Doucet review – a monument to Afghan resilience",
    "url": "https://www.theguardian.com/books/2025/oct/02/the-finest-hotel-in-kabul-by-lyse-doucet-review-a-monument-to-afghan-resilience",
    "image": "https://media.guim.co.uk/7f9e24b2ad39d816a0236613b156c4333651598c/367_0_2943_2356/500.jpg",
    "summary": "A social history of Afghanistan is explored through the experiences of staff at Kabul's InterContinental hotel. The narrative highlights their resilience amid the harsh realities of life in a conflict zone. The hotel serves as a microcosm reflecting the broader challenges faced by Afghan society.",
    "published": "2025-10-02T08:00:43Z"
  },
  {
    "title": "The Shadow’s Edge review – Jackie Chan as watchable as ever as fisticuff-prone cop-turned-dog-walker",
    "url": "https://www.theguardian.com/film/2025/oct/02/the-shadows-edge-review-jackie-chan-as-watchable-as-ever-as-fisticuff-prone-cop-turned-dog-walker",
    "image": "https://media.guim.co.uk/8a1f1316e84992802c8bbd1fabdfde5e210d0c27/531_425_1844_1476/500.jpg",
    "summary": "The review describes a lengthy and overly intricate cops-and-robbers thriller, critiquing its bloated narrative. Despite its flaws, it highlights that action star Chan ensures frequent fight scenes and shootouts. Overall, the film may disappoint in coherence but entertains with consistent action.",
    "published": "2025-10-02T08:00:42Z"
  }
]