[
  {
    "title": "Ed Davey to attack ‘cruelty and stupidity’ of Trump administration in speech to Lib Dem conference – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/23/lib-dem-ed-davey-conference-donald-trump-keir-starmer-labour-reform-tory-latest-politics-live-news-updates",
    "image": "https://media.guim.co.uk/74274f191a1c07ef5df4110361d950aaa7ffc0b8/654_0_6544_5235/500.jpg",
    "summary": "The Liberal Democrat leader is set to deliver a keynote speech at the party conference, where he will directly criticize Donald Trump. This marks a significant moment as the party seeks to position itself against the former president's policies and rhetoric. The speech aims to reinforce the party's values and unify members against perceived threats to democracy.",
    "published": "2025-09-23T08:45:02Z"
  },
  {
    "title": "UK private sector growth hits four-month low as JLR production shutdown hits manufacturing – business live",
    "url": "https://www.theguardian.com/business/live/2025/sep/23/gold-price-on-track-best-year-since-1979-record-high-global-economy-uk-growth-business-live-news",
    "image": "https://media.guim.co.uk/bfd843445e219422226741ab9c2f957671f7ef15/560_0_5600_4480/500.jpg",
    "summary": "Gold has surged to $3,759 per ounce, reaching a new record. Meanwhile, Jaguar Land Rover is still facing disruptions due to a recent cyber-attack. The company is working to resolve the issues impacting its operations and supply chain.",
    "published": "2025-09-23T08:44:05Z"
  },
  {
    "title": "Trump to address UN general assembly as Israeli attacks on Gaza City continue – Middle East crisis live",
    "url": "https://www.theguardian.com/world/live/2025/sep/23/gaza-israel-palestinian-state-recognition-donald-trump-un-unga-latest-news-live-updates",
    "image": "https://media.guim.co.uk/0a53750903b79f83688de3607e10debccbe459d7/211_0_4680_3744/500.jpg",
    "summary": "The US president is set to address the UN General Assembly in New York following the recognition of a Palestinian state by several countries, including the UK, France, Belgium, Canada, Australia, and Portugal. This move signals a shift in international relations regarding Palestine. The address may address the implications of this recognition and the US stance on the issue.",
    "published": "2025-09-23T08:36:44Z"
  },
  {
    "title": "Danish PM links drone sightings that closed Copenhagen and Oslo airports with recent European airspace violations – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/sep/23/copenhagen-oslo-airport-drones-denmark-norway-russia-nato-estonia-europe-live-latest-news-updates",
    "image": "https://media.guim.co.uk/923cc95ca1bf2c8196130f2df87122b0974cfab6/881_75_2972_2378/500.jpg",
    "summary": "Copenhagen airport was closed for four hours due to sightings of large drones in the area. Similarly, Oslo airport experienced a three-hour shutdown after two drone sightings. Authorities took precautionary measures to ensure safety during these incidents.",
    "published": "2025-09-23T08:14:27Z"
  },
  {
    "title": "Sky News Australia staffer helped arrange bacon on guest’s shirt before offensive anti-Islam interview",
    "url": "https://www.theguardian.com/media/2025/sep/23/sky-news-australia-staffer-helped-arrange-bacon-on-guests-shirt-before-offensive-anti-islam-interview",
    "image": "https://media.guim.co.uk/887bff83c4cbb1fde25c3ee75cd03415140fee7e/110_27_829_663/500.jpg",
    "summary": "UK influencer Ryan Williams shared a video showing a friendly exchange with a staff member, highlighting insider knowledge about News Corp's prior awareness of content for an upcoming segment. The interaction raised questions about transparency and how much editorial control the company exercised. This revelation has sparked discussions on the influence of media corporations over content dissemination.",
    "published": "2025-09-23T08:11:08Z"
  }
]