[
  {
    "title": "Records tumble as England set South Africa target of 305: second men’s T20 international – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/12/england-v-south-africa-second-mens-t20-international-live",
    "image": "https://media.guim.co.uk/23c8b8703ea2fe2ec36cf45735eb5cfdb1a2a230/395_0_2276_1820/500.jpg",
    "summary": "Rob Smyth provides an over-by-over report as Harry Brook's team aims to equalize the series at Old Trafford. The match unfolds with key updates and player performances. Fans are eager to see if Brook's side can secure a victory.",
    "published": "2025-09-12T19:17:31Z"
  },
  {
    "title": "Charlie Kirk shooting latest: Utah governor confirms identity of suspect and says family friend turned him in",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/12/charlie-kirk-shooter-suspect-latest-news-updates-donald-trump-utah",
    "image": "https://media.guim.co.uk/b3900dee754cc4e9b61442cbd4826f211c47f0af/0_969_1693_1353/500.jpg",
    "summary": "Spencer Cox reported that Tyler Robinson, 22, informed a family friend about shooting Kirk. The FBI director confirmed that Robinson was apprehended on Thursday evening. The investigation continues as authorities gather more details.",
    "published": "2025-09-12T19:10:54Z"
  },
  {
    "title": "Trump says he ‘couldn’t care less’ about uniting US after Charlie Kirk killing",
    "url": "https://www.theguardian.com/us-news/2025/sep/12/trump-fox-friends-charlie-kirk-shooting",
    "image": "https://media.guim.co.uk/b9c34bac6011ba9c7a169de65f0e4da8a2e05658/0_0_6829_5464/500.jpg",
    "summary": "The President stated in an interview with Fox News that \"the radicals on the left are the problem\" regarding the current political climate. He conveyed a reluctance to pursue collaborative solutions with opposing factions. This statement highlights ongoing partisan tensions in the political landscape.",
    "published": "2025-09-12T18:58:24Z"
  },
  {
    "title": "Marcus Willcocks obituary",
    "url": "https://www.theguardian.com/artanddesign/2025/sep/12/marcus-willcocks-obituary",
    "image": "https://media.guim.co.uk/1a96b079427936286415ba11dee36c20ca6b5dea/0_196_571_457/500.jpg",
    "summary": "A renowned designer known for their innovative work in creating safer public spaces has passed away. Their projects emphasized community engagement and environmental considerations, leaving a lasting impact on urban design. Colleagues and admirers remember them for their dedication to enhancing public safety and fostering inclusive environments.",
    "published": "2025-09-12T18:54:41Z"
  },
  {
    "title": "Government shutdown draws near as Democrats push for healthcare funding",
    "url": "https://www.theguardian.com/us-news/2025/sep/12/congress-healthcare-government-shutdown",
    "image": "https://media.guim.co.uk/cece843a61e5a1da135740873dda5a1378153b05/483_0_4585_3667/500.jpg",
    "summary": "A leading Senate Republican claims that Democrats perceive a government shutdown as beneficial for their political agenda, with the September 30 deadline approaching. Concerns grow over potential impacts of a shutdown on government operations and services. The political climate intensifies as both parties strategize ahead of the deadline.",
    "published": "2025-09-12T18:53:53Z"
  }
]