[
  {
    "title": "Nampijinpa Price accuses Liberal colleague of ‘cowardly’ conduct as Ley tries to tone down Indian migrants debate",
    "url": "https://www.theguardian.com/australia-news/2025/sep/07/jacinta-nampijinpa-price-indian-immigration-alex-hawke",
    "image": "https://media.guim.co.uk/2c6da7889525cc1f4d5ee23b4527c2baa695bef5/298_0_2983_2387/500.jpg",
    "summary": "Northern Territory senator has accused Alex Hawke of berating her staff, claiming that certain media coverage of her remarks is influenced by an agenda. She suggests the reporting does not accurately reflect the situation. The controversy highlights ongoing tensions within Australian politics.",
    "published": "2025-09-07T06:04:18Z"
  },
  {
    "title": "Six of the best farm stays in Europe for delicious local food in glorious countryside",
    "url": "https://www.theguardian.com/travel/2025/sep/07/six-best-farm-stays-europe-local-food-glorious-countryside",
    "image": "https://media.guim.co.uk/155eba7cb000bbccd0b234f51ae39ed63b4cde88/1300_97_2581_2066/500.jpg",
    "summary": "Enjoy delicious cuisine and beverages at various accommodations like hotels, farms, and B&Bs across France, Ireland, Portugal, and other destinations. These establishments offer unique culinary experiences for travelers seeking local flavors. Explore the diverse dining options available while staying in picturesque settings.",
    "published": "2025-09-07T06:00:13Z"
  },
  {
    "title": "South West Water taken to court over cryptosporidium outbreak in Devon",
    "url": "https://www.theguardian.com/uk-news/2025/sep/07/south-west-water-taken-to-court-over-cryptosporidium-outbreak-in-devon",
    "image": "https://media.guim.co.uk/92dbd79b00b0d7a13bc474f4c4118fac5bdb2cec/453_0_4561_3648/500.jpg",
    "summary": "An inspectorate has issued summons related to a water supply incident in Brixham that infected 140 people with a diarrhoea-type disease last year. The investigation follows health concerns raised by the outbreak. Authorities are seeking accountability for the contamination and its effects on public health.",
    "published": "2025-09-07T06:00:13Z"
  },
  {
    "title": "PCN parking fines: drivers warned over rise in text scams",
    "url": "https://www.theguardian.com/money/2025/sep/07/pcn-parking-fines-text-scams-sms",
    "image": "https://media.guim.co.uk/eb9d446677955d09c978c82e8c154cad8a84913a/28_0_5223_4178/500.jpg",
    "summary": "Councils in the UK are warning residents about a growing SMS scam that is spreading rapidly. The scam involves fraudulent text messages designed to deceive recipients. Authorities are urging the public to remain vigilant and report any suspicious messages.",
    "published": "2025-09-07T06:00:13Z"
  },
  {
    "title": "Private menopause tests risk undermining NHS care, doctors say",
    "url": "https://www.theguardian.com/society/2025/sep/07/private-menopause-tests-risk-undermining-nhs-care-doctors-say",
    "image": "https://media.guim.co.uk/93b3b698278d7ac3d7079dc9414d698906226eab/255_0_6829_5464/500.jpg",
    "summary": "An expert has stated that self-testing kits lack clinical utility and may divert attention from effective, evidence-based treatment options. The commentary raises concerns about the reliability of these kits in clinical settings. This critique emphasizes the importance of relying on established medical practices for better health outcomes.",
    "published": "2025-09-07T06:00:12Z"
  }
]