[
  {
    "title": "Stop shilly-shallying and scrap the two-child benefit cap | Letters",
    "url": "https://www.theguardian.com/politics/2025/sep/22/stop-shilly-shallying-and-scrap-the-two-child-benefit-cap",
    "image": "https://media.guim.co.uk/c6d43c0f1ce30761f1322e32405837e1a3cab473/552_0_5000_4000/500.jpg",
    "summary": "Readers shared their thoughts on articles addressing the increasing child poverty in Britain, highlighting the severe impact of the government's two-child benefit cap. The education secretary's remarks about the cap \"punishing\" families and exacerbating hardship have sparked further discussion. Overall, the correspondence reflects widespread concern over the implications of such policies on children's wellbeing.",
    "published": "2025-09-22T16:38:43Z"
  },
  {
    "title": "Labour should have a single-minded focus on social housing | Letters",
    "url": "https://www.theguardian.com/politics/2025/sep/22/labour-should-have-a-single-minded-focus-on-social-housing",
    "image": "https://media.guim.co.uk/4569ce1f8a0d767bfca8cf35f4d8cf00f3476517/8_0_5983_4787/500.jpg",
    "summary": "In a letter, Caroline Mozley argues that a focus on building homes for social rent would improve the government's public image more than vague slogans. Meanwhile, Ken Guy expresses a desire for more open debates to highlight clear differences between political parties. Both letters emphasize the importance of addressing housing issues and promoting transparent discussions in politics.",
    "published": "2025-09-22T16:38:35Z"
  },
  {
    "title": "A worrying obsession with Robert Redford’s looks | Letters",
    "url": "https://www.theguardian.com/film/2025/sep/22/a-worrying-obsession-with-robert-redford-looks",
    "image": "https://media.guim.co.uk/a5d6816e24c21f1b1f4ffcec23554187314432bc/0_187_3952_3161/500.jpg",
    "summary": "John Mister critiques the double standards in society's focus on physical attributes. Linda Perham expresses a desire for more photographs of the late star. Both letters highlight different perspectives on societal values and remembrance.",
    "published": "2025-09-22T16:38:30Z"
  },
  {
    "title": "Death and taxes – inheritance levy has become an ageist lottery for me | Letter",
    "url": "https://www.theguardian.com/money/2025/sep/22/death-and-taxes-inheritance-levy-has-become-an-ageist-lottery-for-me",
    "image": "https://media.guim.co.uk/dc48ac3fd8d2de89ffdb91cd7d9eb60d63c6b08a/844_17_6410_5127/500.jpg",
    "summary": "Robert Thomas has written a letter addressing an article concerning family businesses facing challenges due to upcoming changes in inheritance tax regulations. He emphasizes the potential impact on these firms and the need for careful consideration of the new rules. Thomas advocates for a balanced approach to ensure the sustainability of family-owned enterprises amid tax reforms.",
    "published": "2025-09-22T16:38:22Z"
  },
  {
    "title": "Number crunching premium bonds | Brief letters",
    "url": "https://www.theguardian.com/money/2025/sep/22/number-crunching-premium-bonds",
    "image": "https://media.guim.co.uk/b485730ba3cb4780099a500fb608c7ad489d68fb/417_0_4167_3333/500.jpg",
    "summary": "A reader expresses frustration over complex tax regulations. Another shares their enjoyable experience with canal-boating. Additionally, there are comments on a lack of direction in sprinting and reflections on effective changes, along with a critique of The Guardian's perspective.",
    "published": "2025-09-22T16:38:15Z"
  }
]