[
  {
    "title": "MPs vote down Farage’s proposal for UK to leave ECHR – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/oct/29/shabana-mahmood-home-office-immigration-pmqs-labour-keir-starmer-kemi-badenoch-conservatives-uk-politics-live-news",
    "image": "https://media.guim.co.uk/09245e6279f27cb50c4ff8a126094c43766d4d7b/563_0_1685_1348/500.jpg",
    "summary": "The Liberal Democrats emphasize the importance of the European Court of Human Rights (ECHR) in safeguarding the rights of the elderly and vulnerable individuals. They argue that the ECHR plays a crucial role in providing protection for those who are most in need. The party is advocating for the continued support of the ECHR to uphold these essential rights.",
    "published": "2025-10-29T16:27:04Z"
  },
  {
    "title": "Nvidia becomes world’s first $5tn company amid stock market and AI boom",
    "url": "https://www.theguardian.com/technology/2025/oct/29/nvidia-first-company-5-trillion",
    "image": "https://media.guim.co.uk/6a6dd63a83de704f59e3bc7cdb6331c20edb9d25/0_0_3333_2667/500.jpg",
    "summary": "A Silicon Valley chipmaker has achieved a $5 trillion valuation, marking a significant milestone just three months after it became the first company to surpass the $4 trillion mark. This rapid growth reflects the ongoing demand for technology and semiconductor products. The achievement underscores the company's dominant position in the industry.",
    "published": "2025-10-29T16:25:07Z"
  },
  {
    "title": "South Africa claim historic World Cup final spot as Wolvaardt blows England away",
    "url": "https://www.theguardian.com/sport/2025/oct/29/cricket-england-south-africa-womens-world-cup-report",
    "image": "https://media.guim.co.uk/f7657945dfebfcd3488331e282591de14c775cd3/421_166_3398_2719/500.jpg",
    "summary": "South Africa's captain, Laura Wolvaardt, delivered an outstanding performance, leading her team to their inaugural 50-over World Cup final. This historic achievement marks a significant milestone in South African cricket. The team has made a remarkable impact in the tournament, showcasing their talent and determination.",
    "published": "2025-10-29T16:24:49Z"
  },
  {
    "title": "Australia will target Freeman at centre in England clash, George Gregan warns",
    "url": "https://www.theguardian.com/sport/2025/oct/29/australia-tommy-freeman-england-george-gregan-rugby-union-autumn-nations-series",
    "image": "https://media.guim.co.uk/03d8770f48c8c17c59dc29e3c1cc3970715d8634/106_0_4378_3503/500.jpg",
    "summary": "The former captain highlights concerns over Tommy Freeman's defensive capabilities as he prepares to transition from his usual wide position this Saturday. This change is expected to raise questions about Freeman's performance in a different role. The upcoming match will test his adaptability on the field.",
    "published": "2025-10-29T16:19:36Z"
  },
  {
    "title": "Akram Khan Company: Thikra – Night of Remembering review – forget the meaning, feel the colour and emotion",
    "url": "https://www.theguardian.com/stage/2025/oct/29/akram-khan-company-thikra-night-of-remembering-review-sadlers-wells-london",
    "image": "https://media.guim.co.uk/07afc15a3577c31fee7ed61a91569ec736858423/43_0_834_667/500.jpg",
    "summary": "Sadler's Wells in London showcased a captivating mythological performance featuring 12 female dancers. Developed in Saudi Arabia, the piece is a powerful exploration of physical intensity and ancestral rage. Its unique cultural roots and dynamic execution made for a striking theatrical experience.",
    "published": "2025-10-29T16:16:58Z"
  }
]