[
  {
    "title": "US attorney general vows to appeal dismissal of criminal cases against James Comey and Letitia James – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/nov/25/us-politics-pam-bondi-appeal-james-comey-letitia-james-cases-donald-trump-venezuela-latest-updates",
    "image": "https://media.guim.co.uk/7a2973947b2f12d34f50c2f860e165dadc1927e6/1_1_3330_2665/500.jpg",
    "summary": "Pam Bondi announced her intention to pursue all possible legal avenues after cases against former FBI Director James Comey and New York Attorney General Letitia James were dismissed. She expressed dissatisfaction with the legal outcomes and is determined to seek justice. This move underscores her commitment to continuing the legal battle despite the setbacks.",
    "published": "2025-11-25T11:18:08Z"
  },
  {
    "title": "Budget uncertainty hammers retail confidence; UK bank shares jump after ‘avoiding windfall tax raid’ – business live",
    "url": "https://www.theguardian.com/business/live/2025/nov/25/sterling-volatility-the-budget-rachel-reeves-german-economy-stagnating-stock-markets-business-live-news",
    "image": "https://media.guim.co.uk/85d68c8f037b1fb65fb032f777bd34ea14769049/684_0_5078_4063/500.jpg",
    "summary": "Economic and financial news is being continuously updated, focusing on key developments affecting markets and economies worldwide. Analysts are tracking trends, policy changes, and significant financial events. This ongoing coverage aims to provide insights and forecasts for investors and stakeholders.",
    "published": "2025-11-25T11:13:01Z"
  },
  {
    "title": "How Lord Dannatt used his peerage to open doors for business interests",
    "url": "https://www.theguardian.com/politics/2025/nov/25/how-lord-dannatt-used-his-peerage-to-open-doors-for-business-interests",
    "image": "https://media.guim.co.uk/94f503f5ed67ab9e725f17db8751ace8c89bfb2a/0_0_5000_4000/500.jpg",
    "summary": "The former head of the British Army has been suspended from the House of Lords after being caught on camera violating established rules. The incident raised concerns about adherence to conduct standards among members of the House. The suspension emphasizes the importance of accountability for public officials.",
    "published": "2025-11-25T11:10:41Z"
  },
  {
    "title": "Tell us: what have you been reading this month?",
    "url": "https://www.theguardian.com/books/2022/feb/23/tell-us-what-have-you-been-reading-this-month",
    "image": "https://media.guim.co.uk/b791117314a30cf187ab0b89f0d23de6d5b1d22b/0_0_5760_3456/500.jpg",
    "summary": "Readers are invited to share their favorite books from this month. The request aims to gather diverse recommendations and insights into current literary interests. Participants are encouraged to engage and contribute their thoughts.",
    "published": "2025-11-25T11:04:33Z"
  },
  {
    "title": "Idrissa Gueye applauded by Everton teammates after apologising for Michael Keane slap",
    "url": "https://www.theguardian.com/football/2025/nov/25/idrissa-gueye-applauded-by-everton-teammates-after-apologising-for-michael-keane-slap",
    "image": "https://media.guim.co.uk/c30aac680924be78ec007106e45a3227dc081349/512_0_4192_3353/500.jpg",
    "summary": "Idrissa Gueye apologized to the Everton squad for his red card during their recent victory against Manchester United. His apology was well-received, leading to a round of applause from his teammates. The gesture highlights the team's camaraderie and support for one another following the match.",
    "published": "2025-11-25T11:03:36Z"
  }
]