[
  {
    "title": "US government shutdown: White House halts $2.1bn of Chicago transport funding; ‘I don’t have anything to negotiate’, says Mike Johnson – live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/03/shutdown-congress-trump-senate-latest-updates",
    "image": "https://media.guim.co.uk/4552f1f7817e2cb44bdb4b189dfb79c34355ef31/512_0_5275_4222/500.jpg",
    "summary": "Trump aide Russ Vought warned that a government hold could hinder efforts to extend and modernize the city’s transit lines. He expressed concerns amid a lack of optimism for a Senate resolution to avoid a government shutdown. The situation raises worries about the future of transit improvements during potential budgetary standoffs.",
    "published": "2025-10-03T17:15:45Z"
  },
  {
    "title": "Lammy heckled at vigil for Manchester synagogue attack; one victim died after apparently being hit by police bullet – latest",
    "url": "https://www.theguardian.com/uk-news/live/2025/oct/03/manchester-synagogue-attack-victims-adrian-daulby-melvin-cravitz-attacker-jihad-al-shamie-latest-news-updates",
    "image": "https://media.guim.co.uk/5347b15f89fa47dd6352daad2ae5a946f25a0b07/231_0_5423_4340/500.jpg",
    "summary": "The justice secretary faced backlash from a crowd gathering to commemorate the victims of a recent terror attack, with attendees vocally expressing their disapproval, shouting “shame on you.” The event highlighted the community's ongoing grief and anger over the incident. Tensions rose as the public sought accountability from government officials in the wake of the tragedy.",
    "published": "2025-10-03T17:11:03Z"
  },
  {
    "title": "Manchester synagogue attack: charity volunteer among injured",
    "url": "https://www.theguardian.com/uk-news/2025/oct/03/manchester-synagogue-attack-cst-charity-volunteer-injured",
    "image": "https://media.guim.co.uk/d3c1c946d37a44ea81a8e2fb99cded3be6146cbe/0_0_6890_5512/500.jpg",
    "summary": "The Community Security Trust (CST) is dedicated to safeguarding the Jewish community in the UK and addressing issues of antisemitism. It provides various services, including security measures and education to combat hate crimes. The CST plays a vital role in ensuring the safety and well-being of Jewish individuals and organizations across the country.",
    "published": "2025-10-03T17:06:25Z"
  },
  {
    "title": "Sean ‘Diddy’ Combs sentencing live: mogul’s children say he is ‘changed man’; prosecutor says he is casting himself as ‘victim’",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/03/sean-diddy-combs-sentencing-trial-conviction-latest-updates",
    "image": "https://media.guim.co.uk/f481d2573a78ffbd126134345e03b8e177261762/429_0_4088_3270/500.jpg",
    "summary": "Combs, convicted of prostitution charges in July and facing a potentially lengthy prison sentence, is anticipated to address the court. Her upcoming statement may influence the sentencing outcome. The situation highlights ongoing legal challenges she is facing.",
    "published": "2025-10-03T17:03:38Z"
  },
  {
    "title": "Family pay tribute to Manchester ‘hero’ believed to have been accidentally shot by police",
    "url": "https://www.theguardian.com/uk-news/2025/oct/03/manchester-synagogue-attack-police-name-two-victims-killed",
    "image": "https://media.guim.co.uk/1458c7605fb37f81e6b0ab0019b5ceda9299245e/103_180_1001_801/500.jpg",
    "summary": "Adrian Daulby, 53, displayed remarkable bravery by preventing an attacker from entering a synagogue. His quick actions have been recognized as an \"act of profound courage.\" The incident highlights the importance of community vigilance in ensuring safety.",
    "published": "2025-10-03T17:02:33Z"
  }
]