[
  {
    "title": "Premier League buildup and WSL action, Earps book revelations, Vieira out – matchday live ",
    "url": "https://www.theguardian.com/football/live/2025/nov/01/premier-league-buildup-earps-book-revelations-and-more-matchday-live",
    "image": "https://media.guim.co.uk/efbcbf8bf48856e53ce27b78da44149846d50fe6/421_109_2948_2358/500.jpg",
    "summary": "Join our writers for updates and previews as we gear up for an exciting day of events. Engage in discussions about the latest happenings. Stay informed and connected with the latest news.",
    "published": "2025-11-01T13:22:44Z"
  },
  {
    "title": "‘You’re either poor or rich’: the Argentinians struggling under Milei’s chainsaw austerity",
    "url": "https://www.theguardian.com/world/2025/nov/01/argentinians-struggling-milei-chainsaw-austerity",
    "image": "https://media.guim.co.uk/c987e60b5512122f3470cfcd2532da104252ee79/708_0_3067_2454/500.jpg",
    "summary": "Despite a decline in inflation rates, many people are struggling to meet their financial obligations. This is largely due to stagnant wages and decreased purchasing power. The economic situation remains challenging for the majority of individuals.",
    "published": "2025-11-01T13:00:37Z"
  },
  {
    "title": "US public health officials vigilant as newer mpox variant detected",
    "url": "https://www.theguardian.com/world/2025/nov/01/mpx-variant-us-public-health",
    "image": "https://media.guim.co.uk/91a50b9a8ff5bc370394d714b184d2867004547f/350_0_3498_2800/500.jpg",
    "summary": "While the risk to the general public remains low, recent cases in California indicate that the virus may be spreading unnoticed in certain communities. Health officials are monitoring the situation closely. Increased vigilance and testing may be needed to identify and address these undetected cases.",
    "published": "2025-11-01T13:00:37Z"
  },
  {
    "title": "‘An aftertaste that haunted me’: the best (and worst) meat-free sausages, tasted and rated",
    "url": "https://www.theguardian.com/thefilter/2025/nov/01/best-worst-meat-free-vegetarian-sausages-tasted-rated",
    "image": "https://media.guim.co.uk/9d8d714098f5d79cbe55effb9ad266809fb4a6b6/23_0_5586_4470/500.jpg",
    "summary": "A survey of supermarket meatless sausages aims to determine whether they offer delicious and nutritious alternatives or fall short as bland, inferior products. The investigation will highlight the variety of veggie sausages available, assessing taste and quality. Results will provide insight into the best options for consumers seeking meatless choices.",
    "published": "2025-11-01T13:00:36Z"
  },
  {
    "title": "‘I try to make them feel as ignorant as possible’: German museum’s ‘grumpy guide’ is surprise hit",
    "url": "https://www.theguardian.com/world/2025/nov/01/german-museum-grumpy-guide-kunstpalast-dusseldorf",
    "image": "https://media.guim.co.uk/2d7e0177c7c0c2c44c25ad829fab2986b1631b56/34_376_3718_2973/500.jpg",
    "summary": "A performance artist has taken the art world by storm with a provocative character, an aggressive art historian who shouts at visitors and insults curators during tours. Despite the contentious approach, his events are selling out quickly. The unconventional technique has sparked discussions about the role of performance and engagement in contemporary art.",
    "published": "2025-11-01T13:00:35Z"
  }
]