[
  {
    "title": "New home secretary Shabana Mahmood says she will not run for deputy leader after Labour accused of ‘stitch-up’ over contest – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/08/labour-deputy-leadership-election-contest-keir-starmer-angela-rayner-uk-politics-live",
    "image": "https://media.guim.co.uk/3feebe9d00a304694d348fe690a9078bb0821a0b/35_0_2218_1775/500.jpg",
    "summary": "Former minister Louise Haigh advocates for an \"economic reset\" amid reports indicating that candidates will have a mere four days to secure their nominations for Parliament. This time constraint could impact the electoral process significantly. Haigh emphasizes the need for a strategic approach to tackle current economic challenges.",
    "published": "2025-09-08T11:26:31Z"
  },
  {
    "title": "Six people killed in Jerusalem shooting; Israel threatens Gaza City with ‘powerful hurricane’ – Middle East crisis live",
    "url": "https://www.theguardian.com/world/live/2025/sep/08/middle-east-crisis-live-jerusalem-shooting-israel-threatens-gaza-city-powerful-hurricane-latest-news",
    "image": "https://media.guim.co.uk/8f08c5ac32cba1a7bbe727134e644e7c9349a662/597_0_4917_3933/500.jpg",
    "summary": "Israel's Defence Minister, Israel Katz, has issued a warning about an imminent and significant military operation in Gaza City, referring to it as a ‘powerful hurricane’ that will impact the region. This statement suggests a forthcoming escalation in hostilities. The specific details of the operation remain unclear.",
    "published": "2025-09-08T11:25:57Z"
  },
  {
    "title": "Trump tells foreign firms to ‘respect’ immigration laws after Hyundai raid – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/08/donald-trump-immigration-hyundai-tariffs-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/206b6a050c7692b19e2a312a1b21419be68db1c9/224_0_2045_1636/500.jpg",
    "summary": "The President encourages foreign companies to invest in the U.S. while emphasizing the importance of hiring and training American workers. He believes that such practices will benefit the American workforce. The call aims to balance foreign investment with domestic job creation.",
    "published": "2025-09-08T11:25:20Z"
  },
  {
    "title": "London tube strike shuts down services, causing congestion on roads",
    "url": "https://www.theguardian.com/uk-news/2025/sep/08/london-tube-strike-tfl-website-rmt",
    "image": "https://media.guim.co.uk/25c51046d6279e2e5c7a737998beeb1118e82d59/324_0_4123_3298/500.jpg",
    "summary": "Commuters in the capital are facing disruptions as the RMT union begins a four-day strike, forcing many to seek alternative travel routes. The strike is affecting public transportation services significantly. Passengers are being advised to plan their journeys accordingly.",
    "published": "2025-09-08T11:20:42Z"
  },
  {
    "title": "Leicestershire v Gloucestershire, Somerset v Yorkshire and more: county cricket – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/08/county-championship-cricket-surrey-warwickshire-somerset-yorkshire-live",
    "image": "https://media.guim.co.uk/0bdae1b8e7c23c98c97e0324c37bb2a1bb310702/349_0_3566_2853/500.jpg",
    "summary": "Tanya Aldred provides live updates on day one of the County Championship as it resumes following a month-long hiatus. Excitement builds as teams take to the field once again. Fans can expect real-time highlights and key moments from the matches.",
    "published": "2025-09-08T11:20:23Z"
  }
]