[
  {
    "title": "Trump administration asks supreme court to allow deployment of national guard in Chicago area – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/17/donald-trump-john-bolton-volodymyr-zelenskyy-us-politics-latest-news-updates",
    "image": "https://media.guim.co.uk/86828e38e8bfac51bbcabd839058ba84457e6cfb/512_0_5000_4000/500.jpg",
    "summary": "President Trump’s decision to potentially deploy the military on U.S. soil intensifies his ongoing clash with Democratic governors. This escalation highlights the deepening political divide over federal intervention in state matters. The situation raises concerns about the implications for civil liberties and governance.",
    "published": "2025-10-17T21:12:44Z"
  },
  {
    "title": "Alaska governor asks Trump for federal aid after typhoon displaces 1,500 people",
    "url": "https://www.theguardian.com/us-news/2025/oct/17/alaska-typhoon-halong-trump-aid",
    "image": "https://media.guim.co.uk/07bba9fbabeba5ac6df1e43a5e8a96b327f0b478/354_0_4861_3888/500.jpg",
    "summary": "Lawmakers are calling on the president to facilitate repairs for housing and utilities in areas affected by Typhoon Halong. The storm has caused significant damage to villages, impacting the lives of residents. Urgent action is needed to support recovery efforts and restore essential services.",
    "published": "2025-10-17T21:08:27Z"
  },
  {
    "title": "Five Great Reads: When Virginia Giuffre met Jeffrey Epstein, Malala Yousafzai, and life as a diagnosed narcissist",
    "url": "https://www.theguardian.com/australia-news/2025/oct/18/virginia-giuffre-epstein-malala-yousafzai-narcissists-five-great-reads",
    "image": "https://media.guim.co.uk/7adfd07671b46c8bc458dd854789d366186ffaf3/0_0_1667_1334/500.jpg",
    "summary": "Guardian Australia's weekend wrap, curated by Kris Swales, highlights the essential reads from the past week. The selection covers a range of significant news stories and developments. Stay informed with these key insights and analyses.",
    "published": "2025-10-17T21:00:26Z"
  },
  {
    "title": "The fall of Prince Andrew – a timeline",
    "url": "https://www.theguardian.com/uk-news/2022/jan/13/prince-andrew-a-timeline",
    "image": "https://media.guim.co.uk/d2d2cd8c1522bfb8fbec01596b97329e5e384fce/0_18_4094_2456/500.jpg",
    "summary": "Concerns have been brought to light regarding an individual's relationship with convicted child sex offender Jeffrey Epstein. Critics are highlighting the implications of this association on the individual's credibility and character. The scrutiny has intensified as more details about their interactions emerge.",
    "published": "2025-10-17T20:58:17Z"
  },
  {
    "title": "Anger at Maccabi ban shows power of sport and why fans now expect more from its leaders | Paul MacInnes",
    "url": "https://www.theguardian.com/football/2025/oct/17/anger-maccabi-ban-shows-power-sport-and-why-fans-now-expect-more-from-leaders",
    "image": "https://media.guim.co.uk/9cdf23d2ce903cc90777766eae6df953117756fd/616_0_5040_4032/500.jpg",
    "summary": "Politicians are finding it increasingly challenging to engage with their constituents, while the realm of sports continues to grow in popularity and influence. This shift raises important questions for leaders about their connection with the public. The evolving landscape highlights the potential for sports to play a significant role in societal engagement.",
    "published": "2025-10-17T20:23:01Z"
  }
]