[
  {
    "title": "Jude Bellingham and Phil Foden left out of England squad but Bukayo Saka returns ",
    "url": "https://www.theguardian.com/football/2025/oct/03/england-squad-thomas-tuchel-jude-bellingham-phil-foden-left-out-bukayo-saka-returns",
    "image": "https://media.guim.co.uk/dafa12cc12e5f4903f32e15e1d4cde794716491e/0_186_3600_2880/500.jpg",
    "summary": "Thomas Tuchel has retained the England squad that performed well against Andorra and Serbia, making no changes for the upcoming matches. Notably, Jude Bellingham and Phil Foden have not been included in the squad. This decision reflects Tuchel's confidence in his current selections.",
    "published": "2025-10-03T09:17:26Z"
  },
  {
    "title": "Labour are ‘handmaidens’ to Reform UK’s ‘dangerous’ politics, Polanski to tell Green conference – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/oct/03/greens-labour-reform-conservatives-immigration-uk-politics-live-news-updates",
    "image": "https://media.guim.co.uk/af85f32311ce4034c66fce3f51aad6f32c180def/0_0_4548_3640/500.jpg",
    "summary": "The new leader of the Green Party is advocating for increased immigration, greater investment in public services, and the implementation of a wealth tax. This comes as Green Party membership reaches a record high. The leader aims to highlight these key issues to strengthen the party’s platform.",
    "published": "2025-10-03T09:15:20Z"
  },
  {
    "title": "England v South Africa: Women’s Cricket World Cup – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/03/england-v-south-africa-womens-cricket-world-cup-live",
    "image": "https://media.guim.co.uk/96cdd8011d230a1b43472d7105f15850332bc4aa/473_0_6612_5290/500.jpg",
    "summary": "Nat Sciver's team begins their campaign against South Africa in Guwahati, with live updates provided by reporters. The match promises to showcase the team's performance and set the tone for the tournament. Fans can follow the action with an over-by-over report.",
    "published": "2025-10-03T09:15:01Z"
  },
  {
    "title": "Fungi finds: UK citizen scientists make rare pink and purple discoveries",
    "url": "https://www.theguardian.com/science/2025/oct/03/fungi-finds-uk-citizen-scientists-make-rare-pink-and-purple-discoveries",
    "image": "https://media.guim.co.uk/be797c94f34ed78b7226f4e40332522ec86e9569/272_0_2715_2172/500.jpg",
    "summary": "The Plantlife charity mobilized 850 volunteers to search for waxcap fungi in various locations, including private gardens. This initiative aims to increase awareness and conservation efforts for these unique fungi. The community-driven effort highlights the importance of citizen science in environmental conservation.",
    "published": "2025-10-03T09:14:36Z"
  },
  {
    "title": "UK business growth hits five-month low amid budget uncertainty and weak demand – business live",
    "url": "https://www.theguardian.com/business/live/2025/oct/03/oil-price-weekly-fall-opec-fuel-services-sector-no-non-farm-business-live-news",
    "image": "https://media.guim.co.uk/2cf3ac9741f743b964dfd19bb7c0abebc5708749/661_0_6417_5132/500.jpg",
    "summary": "This news highlights ongoing updates in the economic and financial sectors, focusing on current trends and developments. It provides insights into market movements, economic indicators, and key financial events. The coverage aims to keep readers informed on the latest changes and their potential impacts.",
    "published": "2025-10-03T09:12:28Z"
  }
]