[
  {
    "title": "Crystal Palace v Manchester United: Premier League – live",
    "url": "https://www.theguardian.com/football/live/2025/nov/30/crystal-palace-v-manchester-united-premier-league-live",
    "image": "https://media.guim.co.uk/e0b4d8280c1a91a9ffeb95b31ac7474faf2ab32e/400_0_4261_3411/500.jpg",
    "summary": "Oliver Glasner's team aims to maintain their impressive start to the season. A minute-by-minute report by Michael Butler will cover the matchup. Stay tuned for live updates on the game's progress.",
    "published": "2025-11-30T13:24:58Z"
  },
  {
    "title": "West Ham United v Liverpool: Premier League – live",
    "url": "https://www.theguardian.com/football/live/2025/nov/30/west-ham-united-v-liverpool-premier-league-live",
    "image": "https://media.guim.co.uk/2ac0cbbaf9b961288ed487c6ce2918fecec90991/969_0_4918_3934/500.jpg",
    "summary": "John Brewin provides live updates during an emotional day for home fans, focusing on key moments and reactions. The reports highlight significant events, responses from supporters, and the atmosphere surrounding the occasion. This coverage aims to capture the essence of the day for those in attendance.",
    "published": "2025-11-30T13:17:15Z"
  },
  {
    "title": "Vote for collective leadership shows Your Party are ‘doing politics differently’ – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/nov/30/rachel-reeves-defend-budget-deficit-claims-keir-starmer-your-party-uk-politics-live",
    "image": "https://media.guim.co.uk/6189dedb78fc448ad6a226d0425f002dd7cb8994/1109_0_7308_5846/500.jpg",
    "summary": "A spokesperson announced a recent decision perceived as a triumph for Zarah Sultana, highlighting the organization’s commitment to being a \"truly member-led party.\" This move underscores the influence of members in shaping the party's direction. The spokesperson emphasized the importance of member engagement in the decision-making process.",
    "published": "2025-11-30T13:15:16Z"
  },
  {
    "title": "Mama Goose review – boisterous satirical panto is a carnival of colour and style",
    "url": "https://www.theguardian.com/stage/2025/nov/30/mama-goose-review-panto-theatre-royal-stratford-east",
    "image": "https://media.guim.co.uk/19fa9fe490ad7f6d5939c89ba91dba72adc640d4/599_0_6628_5303/500.jpg",
    "summary": "The festive show features Afrobeat-inspired music, an AI love interest, and Elon Musk portrayed as a panto villain. With a lively cast enjoying themselves, it offers a diverse range of entertainment for all audiences. Overall, the production combines humor and musicality for a fun experience.",
    "published": "2025-11-30T13:11:51Z"
  },
  {
    "title": "Benjamin Netanyahu asks Israel’s president for pardon in corruption case",
    "url": "https://www.theguardian.com/world/2025/nov/30/benjamin-netanyahu-asks-israel-president-isaac-herzog-for-pardon-corruption-case",
    "image": "https://media.guim.co.uk/075070a2b67694efae237cf77a7a3adf508183b9/1196_1198_2742_2194/500.jpg",
    "summary": "A request for a pardon has been submitted weeks after Donald Trump urged Israeli President Isaac Herzog to grant clemency to the Israeli prime minister. The call for the pardon reflects Trump's ongoing support for the leader amidst legal challenges. This development highlights the intersection of U.S. and Israeli political dynamics.",
    "published": "2025-11-30T13:04:17Z"
  }
]