[
  {
    "title": "US Open tennis 2025: Shelton sunk by injury, Vondrousova shocks Paolini, Alcaraz flies through – live",
    "url": "https://www.theguardian.com/sport/live/2025/aug/29/us-open-tennis-2025-emma-raducanu-carlos-alcaraz-shelton-paolini-day-six-live",
    "image": "https://media.guim.co.uk/466bc5e246d47f69f9eb5884b8d4cb21fdedee45/105_0_4148_3318/500.jpg",
    "summary": "Katy Murrells is providing live updates from the third round of a significant event in New York. Follow her coverage for the latest developments and insights. Stay tuned for ongoing updates throughout the round.",
    "published": "2025-08-29T21:27:26Z"
  },
  {
    "title": "Parents identify victims of Minneapolis school shooting: ‘Our hearts are broken’",
    "url": "https://www.theguardian.com/us-news/2025/aug/29/minneapolis-school-shooting-victims-identified",
    "image": "https://media.guim.co.uk/046dd15570bd1a42433c676bbebd58f72e69a07e/0_0_3000_2400/500.jpg",
    "summary": "Fletcher Merkel, 8, and Harper Moyski, 10, tragically lost their lives in an attack at the Annunciation Catholic school church. The incident has shocked the community and prompted discussions about safety in schools. Authorities are investigating the circumstances surrounding the attack.",
    "published": "2025-08-29T21:23:28Z"
  },
  {
    "title": "Leicester 2-0 Birmingham: Championship – live reaction",
    "url": "https://www.theguardian.com/football/live/2025/aug/29/leicester-v-birmingham-championship-live",
    "image": "https://media.guim.co.uk/44316f8b50e5594556ee31dccb7c39b2b5c3ae37/629_358_3232_2587/500.jpg",
    "summary": "Abdul Fatawu scored the opening goal, followed by a second from Ricardo, both contributing to a victory for their team. The assist for Ricardo's goal came from 16-year-old Jeremy Monga. This performance secured the midlands spoils for their side.",
    "published": "2025-08-29T21:18:51Z"
  },
  {
    "title": "Police warn protesters not to travel to Epping after asylum hotel ruling – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/aug/29/latest-live-uk-politics-news-updates-asylum-hotels-labour-conservatives-reform",
    "image": "https://media.guim.co.uk/69db6f531143c0c52f448704b7123eb50758b45e/396_137_3832_3066/500.jpg",
    "summary": "The Home Office and the owner of the Bell hotel have contested an injunction issued by the local council, which aimed to prevent the accommodation of numerous asylum seekers at the hotel. The challenge raises questions about housing policies and local governance. The outcome could significantly impact the management of asylum seeker placements in the area.",
    "published": "2025-08-29T21:07:14Z"
  },
  {
    "title": "Trump aide defends Robert F Kennedy Jr over CDC chaos, calling him ‘crown jewel of this administration’ – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/aug/29/cdc-robert-f-kennedy-jr-donald-trump-federal-reserve-lisa-cook-latest-us-politics-news-live-updates",
    "image": "https://media.guim.co.uk/66b75160ea01a84e1ac788e77bdbe431144da8f7/0_0_3252_2603/500.jpg",
    "summary": "Stephen Miller controversially asserted that CDC experts lacked expertise in public health while defending the health secretary. His remarks were met with criticism for undermining public health authorities. This statement is part of a broader political narrative regarding the government's handling of health policy during the pandemic.",
    "published": "2025-08-29T20:58:28Z"
  }
]