[
  {
    "title": "Australia news live: nation’s first Indigenous treaty passes Victorian parliament: Coalition to meet on net zero policy",
    "url": "https://www.theguardian.com/australia-news/live/2025/oct/31/australia-news-live-politics-parliament-coalition-labor-net-zero-anthony-albanese-sussan-ley-epbc-nature-laws-ntwnfb",
    "image": "https://media.guim.co.uk/95c32ae2b6cb2cfc853523883457aa6ce1b5d27f/667_0_6641_5316/500.jpg",
    "summary": "I'm sorry, but I can't access live news updates. If you provide me with specific details or key points from the news article, I'd be happy to help summarize it for you!",
    "published": "2025-10-30T20:16:55Z"
  },
  {
    "title": "News Corp books in advertisers in campaign for a ‘self-reliant’ Australia that ‘made things here’ | Weekly Beast",
    "url": "https://www.theguardian.com/media/commentisfree/2025/oct/31/news-corp-books-in-advertisers-in-campaign-for-a-self-reliant-australia-that-made-things-here",
    "image": "https://media.guim.co.uk/b7046caf9b768ba7b49a6e900edbf7655f44de49/0_0_2500_2000/500.jpg",
    "summary": "The Daily Telegraph editor stated that the current campaign reflects the values of its sponsors, including RM Williams, Qantas, and Bunnings. Additionally, Stokes remains resolute regarding the BRS issue. The campaign highlights the newspaper's commitment to its supporters' principles.",
    "published": "2025-10-30T20:15:35Z"
  },
  {
    "title": "Senate passes bill to nullify Trump’s sweeping global tariffs on more than 100 nations – US politics live",
    "url": "https://www.theguardian.com/world/live/2025/oct/30/donald-trump-xi-jinping-meeting-live-updates",
    "image": "https://media.guim.co.uk/97046f776aac162b3e42421270440d729ca4c94c/918_0_6827_5464/500.jpg",
    "summary": "A bipartisan vote successfully passed 51-47 to end tariffs, following earlier resolutions that repealed tariffs on Canada and Brazil. This marks a significant step in trade policy adjustments. The focus is now on broader implications for international trade relations.",
    "published": "2025-10-30T20:11:40Z"
  },
  {
    "title": "Hurricane Melissa leaves 29 dead as category 2 storm heads towards Bermuda – as it happened",
    "url": "https://www.theguardian.com/world/live/2025/oct/30/hurricane-melissa-jamaica-cuba-haiti-bermuda-caribbean-latest-updates-live",
    "image": "https://media.guim.co.uk/18fadf78fc8fcc431c469478208ba847a0f0e91b/687_0_3440_2752/500.jpg",
    "summary": "Jamaica, Haiti, and Cuba are evaluating the damage caused by a recent storm. Meanwhile, residents of Bermuda are bracing for the arrival of the storm, which has been downgraded in intensity. Authorities are mobilizing resources to address the needs of affected areas and ensure safety.",
    "published": "2025-10-30T20:03:57Z"
  },
  {
    "title": "The fall of Prince Andrew – a timeline",
    "url": "https://www.theguardian.com/uk-news/2022/jan/13/prince-andrew-a-timeline",
    "image": "https://media.guim.co.uk/d2d2cd8c1522bfb8fbec01596b97329e5e384fce/0_18_4094_2456/500.jpg",
    "summary": "Concerns have emerged regarding a prominent individual's relationship with convicted child sex offender Jeffrey Epstein, prompting public scrutiny. Details about their interactions have raised alarm among critics and advocates for child safety. Calls for accountability and investigation into the nature of their association continue to grow.",
    "published": "2025-10-30T20:02:02Z"
  }
]