[
  {
    "title": "Manchester City v Manchester United: Premier League – live",
    "url": "https://www.theguardian.com/football/live/2025/sep/14/manchester-city-v-manchester-united-premier-league-live",
    "image": "https://media.guim.co.uk/3c8e274c18d0a2f51a08e669bb32c9b22c082a80/1828_548_6109_4887/500.jpg",
    "summary": "The first Manchester derby of the season is set to take place, sparking excitement among fans. Rob Smyth will provide insights and analysis on the match. The anticipation is high as both teams aim for victory in this historic rivalry.",
    "published": "2025-09-14T16:33:38Z"
  },
  {
    "title": "England v Scotland: Women’s Rugby World Cup 2025 quarter-final – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/14/england-v-scotland-womens-rugby-world-cup-2025-quarter-final-live",
    "image": "https://media.guim.co.uk/bb317f66040624a7761f43c5829cbe344248fdd8/247_0_4707_3765/500.jpg",
    "summary": "Niall McVeigh provides live updates as the hosts compete against Scotland for a spot in the semi-finals. The match is set to be closely contested, with both teams vying for victory. Stay tuned for minute-by-minute coverage of this exciting clash.",
    "published": "2025-09-14T16:33:12Z"
  },
  {
    "title": "Musk’s Grok AI bot falsely suggests Met misrepresented footage of clashes with far right",
    "url": "https://www.theguardian.com/technology/2025/sep/14/musks-grok-ai-bot-falsely-suggests-met-misrepresented-footage-of-clashes-with-far-right",
    "image": "https://media.guim.co.uk/bdcb95bdb35d6a23429f02adb1b72518b72fe543/292_0_2504_2003/500.jpg",
    "summary": "Police addressed misinformation spread by journalist Allison Pearson regarding a London rally, where Elon Musk faced allegations of inciting violence. The situation intensified as authorities sought to clarify the facts and mitigate public concern. The incident highlights the challenges of managing misinformation in social and political contexts.",
    "published": "2025-09-14T16:31:39Z"
  },
  {
    "title": "The Guardian view on the UK’s dangerous moment: as Labour falters, the far right mobilises | Editorial",
    "url": "https://www.theguardian.com/commentisfree/2025/sep/14/the-guardian-view-on-the-uks-dangerous-moment-as-labour-falters-the-far-right-mobilises",
    "image": "https://media.guim.co.uk/ee7c2cc266ef0d44e1e8761834242826983f5fa0/244_0_5000_4000/500.jpg",
    "summary": "The editorial highlights a significant absence of political leadership in Britain during a critical time. It emphasizes the urgent need for the government to take action amidst rising division and public disillusionment. Effective leadership is crucial to address these challenges and unite the nation.",
    "published": "2025-09-14T16:30:38Z"
  },
  {
    "title": "Ken Brown obituary",
    "url": "https://www.theguardian.com/science/2025/sep/14/ken-brown-obituary",
    "image": "https://media.guim.co.uk/7ca555b9b43b947316605ecfaad15e75fcc0123d/235_94_1203_962/500.jpg",
    "summary": "A senior lecturer in anthropology at Manchester University, known for founding the Mediterraneans review, has passed away. His contributions to the field of anthropology and dedication to exploring Mediterranean cultures were widely recognized. His legacy will continue to influence future generations of scholars.",
    "published": "2025-09-14T16:28:18Z"
  }
]