[
  {
    "title": "FBI reportedly seeks to interview Democrats involved in video to troops as senator calls out Trump administration ‘intimidation’ - live",
    "url": "https://www.theguardian.com/us-news/live/2025/nov/25/us-politics-pam-bondi-appeal-james-comey-letitia-james-cases-donald-trump-venezuela-latest-updates",
    "image": "https://media.guim.co.uk/d906b2a8c14e356c13b15dcbdf44bfa715e2b6f4/614_0_6435_5148/500.jpg",
    "summary": "The Pentagon is investigating Arizona Senator Mark Kelly for allegedly violating military law by appearing in a video encouraging military personnel to \"refuse illegal orders.\" The video features lawmakers discussing their stance on military directives. The investigation arises amid concerns about the implications of such statements on military discipline.",
    "published": "2025-11-25T19:17:09Z"
  },
  {
    "title": "Chelsea v Barcelona: Champions League – live",
    "url": "https://www.theguardian.com/football/live/2025/nov/25/chelsea-v-barcelona-champions-league-live",
    "image": "https://media.guim.co.uk/3a0f0a0600e9a2ef6feb0352c81ba01d4fe6b389/229_0_2250_1800/500.jpg",
    "summary": "Scott Murray will provide live updates for a high-stakes Champions League match taking place at Stamford Bridge. Fans can expect real-time coverage of the key moments and developments throughout the game. This encounter is anticipated to be thrilling and pivotal for the teams involved.",
    "published": "2025-11-25T19:10:30Z"
  },
  {
    "title": "Jair Bolsonaro ordered to start 27-year prison term for plotting Brazil coup",
    "url": "https://www.theguardian.com/world/2025/nov/25/jair-bolsonaro-brazil-prison",
    "image": "https://media.guim.co.uk/99c3bb20d2b10f1815c51ec8c376ff18934dfcdb/0_0_6279_5026/500.jpg",
    "summary": "The former president is set to begin serving his prison sentence in a small 12-square-meter bedroom at a police base in Brasília. This follows the expiration of the time allowed for appeals against his conviction. The decision marks a significant chapter in the legal proceedings surrounding his case.",
    "published": "2025-11-25T19:08:24Z"
  },
  {
    "title": "Marseille v Newcastle, Manchester City v Bayer Leverkusen, and more: Champions League – live",
    "url": "https://www.theguardian.com/football/live/2025/nov/25/marseille-v-newcastle-manchester-city-v-bayer-leverkusen-and-more-champions-league-live",
    "image": "https://media.guim.co.uk/9e73b5f9e3c4fc8cf6b2259e6f52b7493abcf371/14_362_4547_3638/500.jpg",
    "summary": "Rob Smyth is providing live updates on a bustling evening in the Champions League. Fans can expect continuous coverage of the latest match developments across Europe. Stay tuned for real-time insights and game highlights.",
    "published": "2025-11-25T19:07:26Z"
  },
  {
    "title": "Trump may have inadvertently issued mass pardon for 2020 voter fraud, experts say",
    "url": "https://www.theguardian.com/us-news/2025/nov/25/trump-voter-fraud-pardon",
    "image": "https://media.guim.co.uk/0cffdbc7505f2cebf838b437dcb4b0c41d9a6726/1566_107_2719_2175/500.jpg",
    "summary": "Recent pardons granted to Rudy Giuliani and others involved in the fake elector scheme were primarily symbolic but may have significant ramifications. These pardons highlight the ongoing controversies related to electoral integrity and legal accountability. The implications of such actions could influence public perception and future political maneuvers.",
    "published": "2025-11-25T19:01:00Z"
  }
]