[
  {
    "title": "North Melbourne v Brisbane: 2025 AFLW grand final – live",
    "url": "https://www.theguardian.com/sport/live/2025/nov/29/aflw-grand-final-live-north-melbourne-kangaroos-v-brisbane-lions",
    "image": "https://media.guim.co.uk/4d3a3521a23772ec80e642ff219e50160cf79865/130_0_2948_2359/500.jpg",
    "summary": "The article previews a match between the Lions and the Kangaroos, highlighting the potential for an upset against the reigning champions. Martin Pegan will provide goal-by-goal updates during the game. The focus is on whether the Kangaroos can maintain their winning streak.",
    "published": "2025-11-29T10:20:16Z"
  },
  {
    "title": "Airbus issues major A320 recall after mid-air incident grounds planes, disrupting global travel",
    "url": "https://www.theguardian.com/business/2025/nov/28/airbus-issues-major-a320-recall-after-recent-mid-air-incident",
    "image": "https://media.guim.co.uk/8b543eceb935a29afb9c4766392fcf17b088fc72/0_225_2101_1681/500.jpg",
    "summary": "A critical software change required for a significant number of jets will lead to disruptions affecting half of the global fleet. Airlines are scrambling to implement the updates, which could result in flight delays and cancellations. The situation underscores ongoing challenges within the aviation industry as it adapts to new safety and operational requirements.",
    "published": "2025-11-29T10:17:12Z"
  },
  {
    "title": "Manchester City look to bounce back in Premier League, Lionesses in action – matchday live",
    "url": "https://www.theguardian.com/football/live/2025/nov/29/manchester-city-look-to-bounce-back-in-premier-league-lionesses-in-action-matchday-live",
    "image": "https://media.guim.co.uk/1e361a820adc107e1f7d636768c365202e00b00d/0_0_3757_3005/500.jpg",
    "summary": "Yara El-Shaboury will host a news segment and discussion leading up to the day's events. The program aims to provide insights and updates. Tune in for an engaging buildup to the action ahead.",
    "published": "2025-11-29T10:13:10Z"
  },
  {
    "title": "Mark Wood Ashes blow as England pace bowler ruled out of Gabba Test",
    "url": "https://www.theguardian.com/sport/2025/nov/29/mark-wood-ashes-blow-as-england-pace-bowler-ruled-out-of-gabba-test",
    "image": "https://media.guim.co.uk/97100e065d6ca91019a7248b91ca0e27dbaf1754/1597_1745_5289_4231/500.jpg",
    "summary": "Mark Wood will likely miss England's upcoming Ashes Test at the Gabba due to soreness in his left knee. The injury has been a recurring issue for the pace bowler. His absence could impact England's bowling lineup.",
    "published": "2025-11-29T10:00:52Z"
  },
  {
    "title": "Trump’s hate-filled rant ignores facts on immigrant crime and economic benefits",
    "url": "https://www.theguardian.com/us-news/2025/nov/29/trumps-hate-filled-rant-ignores-facts-on-immigrant-and-economic-benefits",
    "image": "https://media.guim.co.uk/f44a49cbed72353a210739d4c2d98273a2b44a96/62_0_4298_3438/500.jpg",
    "summary": "Following a fatal shooting in Washington DC, former President Trump attributed blame to immigrants, stating they are undermining American values. However, data and studies indicate that immigrants contribute positively to society and the economy. The assertion of immigrants negatively impacting America is contradicted by evidence and expert analyses.",
    "published": "2025-11-29T10:00:35Z"
  }
]