[
  {
    "title": "NFL week nine: Bills v Chiefs, Steelers stun Colts, Bears earn wild win over Bengals – live",
    "url": "https://www.theguardian.com/sport/live/2025/nov/02/nfl-week-nine-colts-v-steelers-falcons-v-patriots-chiefs-bills-live",
    "image": "https://media.guim.co.uk/70f642145962ac64b272ad6e77987ef90dc2c030/100_0_5811_4649/500.jpg",
    "summary": "Graham Searles provides updates on the Bills vs. Chiefs game following an exciting day of NFL action. Chicago triumphed over their opponents with a close score of 47-42, while Pittsburgh delivered an unexpected upset against Indianapolis. Fans can stay tuned for further highlights and analysis.",
    "published": "2025-11-02T23:16:51Z"
  },
  {
    "title": "Australia politics live: Holmes à Court says net zero decision means ‘Coalition as we knew it is dead’; Optus chief grilled over triple zero deaths",
    "url": "https://www.theguardian.com/australia-news/live/2025/nov/03/australia-politics-live-nationals-net-zero-liberals-labor-bulk-billing-optus-sussan-ley-anthony-albanese-question-time",
    "image": "https://media.guim.co.uk/f17c24267f9f42d2e25b3d8dd4f36d1ff6a2b15a/1014_270_4303_3442/500.jpg",
    "summary": "Please provide the news article or details you'd like summarized.",
    "published": "2025-11-02T23:12:34Z"
  },
  {
    "title": "Louisiana: Alexandria diocese files for bankruptcy over clergy abuse claims",
    "url": "https://www.theguardian.com/us-news/2025/nov/02/louisiana-diocese-bankruptcy-clergy-abuse-claims",
    "image": "https://media.guim.co.uk/f2044bbced4d3216428e338b0a3916b374308d2c/380_0_2817_2255/500.jpg",
    "summary": "Over 40 Roman Catholic dioceses have filed for Chapter 11 bankruptcy protection. Among these, 28 dioceses show clear signs of financial repercussions related to abuse claims. This trend highlights the ongoing challenges within the church related to allegations of misconduct.",
    "published": "2025-11-02T23:00:15Z"
  },
  {
    "title": "‘Football can sicken you’: Moyes knows game’s pain from his Sunderland exit",
    "url": "https://www.theguardian.com/sport/2025/nov/02/football-can-sicken-you-moyes-knows-games-pain-from-his-sunderland-exit",
    "image": "https://media.guim.co.uk/609206b83e9db3670603fa2fa9389b70e2a4cd9c/124_0_2896_2316/500.jpg",
    "summary": "Everton manager David Moyes reflected on his career lows and their impact on his development as a coach. He is returning to Sunderland for the first time since resigning as their manager in 2017. Moyes aims to draw from his experiences as he faces his former club.",
    "published": "2025-11-02T22:30:14Z"
  },
  {
    "title": "FBI fires top official amid Kash Patel’s outrage over reports of agency jet use",
    "url": "https://www.theguardian.com/us-news/2025/nov/02/fbi-fires-top-official-kash-patel-jet-use",
    "image": "https://media.guim.co.uk/e504121e7f92a514c0b72041a88c2c1fbb571065/369_0_5000_4000/500.jpg",
    "summary": "Patel expressed anger after it was disclosed he traveled to see his girlfriend. This revelation comes amid the agency's decision to fire the official responsible for overseeing their fleet. The incident has raised significant concerns within the agency.",
    "published": "2025-11-02T21:12:16Z"
  }
]