[
  {
    "title": "Australia v England: Ashes second Test, day one – live",
    "url": "https://www.theguardian.com/sport/live/2025/dec/04/australia-vs-england-live-ashes-second-2nd-test-day-one-aus-v-eng-cricket-scores-updates-gabba-brisbane",
    "image": "https://media.guim.co.uk/0cb2eeebdb505540a70ce867bad7720283bf26ca/629_189_4910_3928/500.jpg",
    "summary": "The Ashes series continues with a day-night Test match in Brisbane. Join our writers for live updates and insights as the action unfolds. Fans can look forward to detailed over-by-over reports.",
    "published": "2025-12-04T10:25:00Z"
  },
  {
    "title": "German chancellor warns leaders that decisions they make now on Ukraine will ‘decide the future of Europe’ – live",
    "url": "https://www.theguardian.com/world/live/2025/dec/04/german-chancellor-ukraine-russia-future-of-europe-live-latest-news",
    "image": "https://media.guim.co.uk/0100e0c88c81e308396a3ce0cd622e83d01427d9/416_0_4169_3335/500.jpg",
    "summary": "Merz's intervention arises amidst differing views on peace negotiations, as Putin describes the talks as \"difficult work.\" In contrast, Trump asserts that the Russian president is genuinely interested in reaching a deal. The situation highlights the complexities and varied perspectives on the ongoing conflict.",
    "published": "2025-12-04T10:16:56Z"
  },
  {
    "title": "Jamiroquai review – hat-sporting acid jazz superstars are slick but lack substance",
    "url": "https://www.theguardian.com/music/2025/dec/04/jamiroquai-review-jay-kay-ovo-hydro-glasgow",
    "image": "https://media.guim.co.uk/5d85c8f62d4e4fb2f41b7b50d56a3f04d45b9582/615_191_3511_2808/500.jpg",
    "summary": "Frontman Jay Kay showcases impressive vocals amidst a plethora of novelty headgear. However, the strong musical content is overshadowed by overly polished performance and extravagant production elements. This results in a sound that lacks the raw energy fans might expect.",
    "published": "2025-12-04T10:16:50Z"
  },
  {
    "title": "‘Biggest band that ever lived’: inside the Grateful Dead art show",
    "url": "https://www.theguardian.com/music/2025/dec/04/grateful-dead-band-art-show-california",
    "image": "https://media.guim.co.uk/f0336e60b733d10bb2fa1dfcd8eacac518f3ac35/843_460_3859_3086/500.jpg",
    "summary": "As the band marks its 60th anniversary, a California exhibition highlights the distinctive psychedelic artwork that reflects their history and legacy. This celebration showcases the visual elements that have accompanied their music over the decades. The event draws attention to the cultural significance of the band's artistic expression.",
    "published": "2025-12-04T10:03:10Z"
  },
  {
    "title": "Budget uncertainty blamed for plunge in UK construction output, and investor exodus from the stock market – business live",
    "url": "https://www.theguardian.com/business/live/2025/dec/04/uk-energy-network-28bn-upgrade-ofgem-construction-car-sales-stock-markets-business-live-news-updates",
    "image": "https://media.guim.co.uk/c03adfc6086159bb03bd211def2bacc340932f60/375_0_3750_3000/500.jpg",
    "summary": "The latest economic and financial news is being continuously updated, highlighting key market movements, economic indicators, and relevant financial developments. Analysts are providing insights into trends affecting global markets and economies. Investors are advised to stay informed as conditions evolve.",
    "published": "2025-12-04T10:02:37Z"
  }
]