[
  {
    "title": "Ryder Cup 2025: USA 6-12 Europe as hosts threaten comeback in singles finale – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/28/ryder-cup-2025-usa-europe-golf-singles-matches-live",
    "image": "https://media.guim.co.uk/531e23a7a286325f96441480a3af67869529cc9c/0_0_4784_3826/500.jpg",
    "summary": "Scott Murray is providing live updates on the 11 singles matches, where the US team is making a strong effort to stage a comeback. Stay tuned for hole-by-hole coverage of the exciting action. Follow along for real-time developments!",
    "published": "2025-09-28T20:17:02Z"
  },
  {
    "title": "Corrections and clarifications",
    "url": "https://www.theguardian.com/news/2025/sep/28/corrections-and-clarifications1",
    "summary": "BP reported a rise in natural gas demand, driven by increased industrial use and a shift towards cleaner energy sources. The company emphasized its commitment to transitioning to renewable energy while continuing to meet global energy needs. Analysts project ongoing growth in natural gas consumption as economies recover and decarbonization efforts expand.",
    "published": "2025-09-28T20:00:20Z"
  },
  {
    "title": "Exciting attack, clear culture and a new captain: how England won Rugby World Cup | Sarah Rendell",
    "url": "https://www.theguardian.com/sport/2025/sep/28/exciting-attack-clear-culture-and-a-new-captain-how-england-won-rugby-world-cup",
    "image": "https://media.guim.co.uk/925900725899df483014a01885ad617fca4cb1d1/541_0_4915_3932/500.jpg",
    "summary": "Following a disappointing final, the team revamped its coaching staff and prioritized better communication. These changes aim to enhance performance and address past issues. The focus now is on building a stronger foundation for future success.",
    "published": "2025-09-28T20:00:20Z"
  },
  {
    "title": "Arteta hails Arsenal after ‘remarkable’ comeback victory against Newcastle",
    "url": "https://www.theguardian.com/football/2025/sep/28/mikel-arteta-arsenal-newcastle-premier-league-football",
    "image": "https://media.guim.co.uk/396422153e1f5bda0ebc88c7f422a9a7b20dfbbf/310_0_4277_3422/500.jpg",
    "summary": "Mikel Arteta expressed pride in his Arsenal team's performance, highlighting their resilience after a dramatic comeback to secure a late victory against Newcastle. He emphasized that the match showcased the team's true identity in the Premier League. The win reinforces Arsenal's competitive spirit and determination.",
    "published": "2025-09-28T19:57:24Z"
  },
  {
    "title": "‘Dozens’ arrested at Palestine Action protest outside Labour party conference",
    "url": "https://www.theguardian.com/uk-news/2025/sep/28/arrests-palestine-action-protest-labour-party-conference",
    "image": "https://media.guim.co.uk/78ce1f02a1ce8a2f25deecbb6012e6127bb9b590/2_0_2957_2367/500.jpg",
    "summary": "Around 100 protesters gathered outside a conference venue in Liverpool, organized by the group Defend Our Juries. The demonstrators were holding signs to express their concerns, although specific details about their grievances were not mentioned. The protest underscores escalating tensions regarding jury-related issues in the legal system.",
    "published": "2025-09-28T19:51:36Z"
  }
]