[
  {
    "title": "Moldova voters choose pro-EU government over Moscow-leaning alliance – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/sep/29/moldova-voters-pro-eu-government-russia-drones-europe-live",
    "image": "https://media.guim.co.uk/b5ee027ff34740dacd919e5428404ea832a216b7/876_0_5201_4161/500.jpg",
    "summary": "Moldovan President Maia Sandu has accused Russia of employing covert strategies to influence voter behavior in the country. She highlighted concerns over external interference in the democratic process. This accusation underscores escalating tensions between Moldova and Russia regarding electoral integrity.",
    "published": "2025-09-29T09:20:58Z"
  },
  {
    "title": "Pharma shake-up: GSK shares rise 3% after surprise change of CEO; AstraZeneca announces New York stock market listing – business live",
    "url": "https://www.theguardian.com/business/live/2025/sep/29/moral-hazard-fears-jlr-jaguar-land-rover-government-loan-gsk-ceo-astrazeneca-listing-dollar-shutdown-business-live-news",
    "image": "https://media.guim.co.uk/93a963962303e4034d3bdd8149d02e3940fdd356/333_0_3333_2668/500.jpg",
    "summary": "The latest economic news highlights ongoing developments in global markets, with a focus on key indicators affecting investment trends. Financial analysts are closely monitoring inflation rates, interest changes, and international trade dynamics. Overall, the coverage provides critical insights into the factors influencing the current economic landscape.",
    "published": "2025-09-29T09:20:47Z"
  },
  {
    "title": "Rachel Reeves confirms she no longer stands by pledge not to raise taxes",
    "url": "https://www.theguardian.com/politics/2025/sep/29/rachel-reeves-confirms-she-no-longer-stands-by-pledge-not-to-raise-taxes",
    "image": "https://media.guim.co.uk/32d19c9318d4f64091568882c1e6ce42a9e2d8e8/376_0_4274_3420/500.jpg",
    "summary": "The Chancellor emphasizes that the global landscape has shifted, impacting the UK economically. He highlights that the country is facing challenges from ongoing wars, US tariffs, and increased borrowing costs. These factors collectively contribute to a more difficult financial environment for the UK.",
    "published": "2025-09-29T09:18:35Z"
  },
  {
    "title": "Moldova’s election result boosts move towards EU and away from Moscow",
    "url": "https://www.theguardian.com/world/2025/sep/29/moldova-election-result-boosts-move-towards-eu-away-from-moscow",
    "image": "https://media.guim.co.uk/6c8e77e2d80344afed324ab33cb6f9a54eb2447b/319_0_4706_3764/500.jpg",
    "summary": "A pro-European ruling party has secured victory amid significant pressure from Russia and its proxies. The election reflects a broader geopolitical struggle influenced by external forces. This outcome highlights the resilience of pro-European sentiment in the face of ongoing challenges.",
    "published": "2025-09-29T09:17:09Z"
  },
  {
    "title": "Supporting Reform’s ‘racist policy’ does not make voters racist, says Rachel Reeves – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/29/rachel-reeves-labour-party-conference-youth-guarantee-unemployment-uk-politics-live-latest-news",
    "image": "https://media.guim.co.uk/5a59b30e3b68e5aec9de018f01b3c08b8c6f5bad/505_0_4910_3930/500.jpg",
    "summary": "Chancellor supports Keir Starmer's assertion that the policy to end indefinite leave to remain is racist. He believes many supporters of the Reform party would be appalled by this stance. The statement highlights ongoing divisions in immigration policy perspectives.",
    "published": "2025-09-29T09:16:06Z"
  }
]