[
  {
    "title": "The Exmouth factor – exploring the south Devon beach town by bus, train and on foot",
    "url": "https://www.theguardian.com/travel/2025/sep/28/exmouth-south-devon-beach-holiday-by-train-bus",
    "image": "https://media.guim.co.uk/951c4a27314a307aa23ca65d46375ae8e1cf6267/142_0_4680_3744/500.jpg",
    "summary": "Exmouth is easily accessible by rail and renowned for its seafood, making it an ideal destination for relaxation. Visitors can enjoy scenic walks and boat rides in the area. It's a perfect getaway for those seeking tranquility by the sea.",
    "published": "2025-09-28T06:00:05Z"
  },
  {
    "title": "Artists given chance to use wood from felled Sycamore Gap tree",
    "url": "https://www.theguardian.com/environment/2025/sep/28/sycamore-gap-tree-art-national-trust-uk",
    "image": "https://media.guim.co.uk/19bbf44b2fd6e9b726cd8c7c62a00b1355c62e65/500_0_5000_4000/500.jpg",
    "summary": "The National Trust is responding to the loss of a tree cut down two years ago by aiming to transform that sense of loss into a message of hope. The initiative seeks to inspire positive action and community engagement. This effort reflects a broader commitment to environmental preservation and future resilience.",
    "published": "2025-09-28T06:00:04Z"
  },
  {
    "title": "Something inside so wrong: Labi Siffre tells Tommy Robinson to stop using anti-apartheid anthem",
    "url": "https://www.theguardian.com/uk-news/2025/sep/28/labi-siffre-cease-and-desist-letter-tommy-robinson-anti-apartheid-anthem-something-inside-so-strong",
    "image": "https://media.guim.co.uk/a4a942a33b0bceb4a95fcf3f3273e721c3ec2689/567_322_2243_1794/500.jpg",
    "summary": "An 80-year-old UK singer has described it as \"absurd\" for far-right groups to claim his work, highlighting his identity as a \"positive atheist, homosexual black artist.\" He firmly rejects their association, emphasizing the disconnect between his values and their agenda. The singer's comments underline the ongoing tensions surrounding art, identity, and political appropriation.",
    "published": "2025-09-28T06:00:03Z"
  },
  {
    "title": "‘Highly manipulative’: steps to help you avoid the rise in romance fraud ",
    "url": "https://www.theguardian.com/money/2025/sep/28/steps-to-help-you-avoid-the-rise-in-romance-fraud-scams",
    "image": "https://media.guim.co.uk/4fa9170b3355f4ba9c9f4072da8d84b9c68e36a1/0_0_4680_3744/500.jpg",
    "summary": "Scams targeting older individuals have surged, leading to significant financial losses. The increase in incidents emphasizes the need for caution. Always avoid sending money to someone you've only met online.",
    "published": "2025-09-28T06:00:03Z"
  },
  {
    "title": "Lions coach hails AFL grand final win as ‘better than last year’ – as it happened",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/28/australia-news-live-albanese-king-charles-afl-brisbane-coalition-liberals-western-australia-gst-queensland-nsw-victoria-labor-ntwnfb",
    "image": "https://media.guim.co.uk/04db23bfc529decea7d380d18b5fb8262ee0d709/756_0_6608_5286/500.jpg",
    "summary": "The blog has officially concluded its operations. No further posts or updates will be made. Readers are thanked for their support throughout its run.",
    "published": "2025-09-28T05:35:19Z"
  }
]