[
  {
    "title": "West Ham v Brentford: Premier League – live",
    "url": "https://www.theguardian.com/football/live/2025/oct/20/west-ham-v-brentford-premier-league-live",
    "image": "https://media.guim.co.uk/bc4916176cb94845b72976cbb00c24f0f34003b9/384_73_2458_1967/500.jpg",
    "summary": "In a thrilling east vs. west London derby, hosts aim to secure their first home points of the season. The match is being covered with a minute-by-minute report by Niall McVeigh. Fans eagerly anticipate the outcome as the teams clash on the pitch.",
    "published": "2025-10-20T19:15:59Z"
  },
  {
    "title": "Prince Andrew tried to hire ‘internet trolls’ to hassle Virginia Giuffre, book claims",
    "url": "https://www.theguardian.com/uk-news/2025/oct/20/prince-andrew-internet-trolls-virginia-giuffre-book-nobodys-girl",
    "image": "https://media.guim.co.uk/8cecbc77c719778e1ce8191d66e7ae7fb84465ec/1369_0_3168_2536/500.jpg",
    "summary": "In her memoir \"Nobody's Girl,\" an accuser alleges that Prince Andrew sought refuge behind the gates of Balmoral to avoid being served court papers. The claim highlights the ongoing legal challenges facing the royal. The memoir sheds light on the controversial circumstances surrounding the allegations against him.",
    "published": "2025-10-20T19:12:14Z"
  },
  {
    "title": "Amazon battles to fix Web Services outage after millions of users report disruption to websites and apps – business live",
    "url": "https://www.theguardian.com/business/live/2025/oct/20/china-economic-growth-gdp-low-house-prices-fall-stock-markets-ftse-business-live-news",
    "image": "https://media.guim.co.uk/ad093e8329a29aecba6f1623b63fcffeb49c4113/368_0_3879_3106/500.jpg",
    "summary": "Several major online services, including Fortnite, Roblox, Snapchat, Lloyds Bank, and Ring doorbells, experienced a significant outage. Users reported difficulties accessing these platforms, causing disruptions in gaming, communication, and banking. The cause of the outage has not been publicly disclosed.",
    "published": "2025-10-20T19:10:32Z"
  },
  {
    "title": "Trump says he doesn’t think Ukraine will win back land taken by Russia during war – live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/20/james-comey-donald-trump-charges-shutdown-albanese-politics-live-updates",
    "image": "https://media.guim.co.uk/573f5205b5354a03231ed58da798edfec5f7ff13/66_145_3777_3024/500.jpg",
    "summary": "U.S. President highlights uncertainty in the Russia-Ukraine war while signing a rare earth minerals deal with the Australian prime minister. The agreement signifies a push for bolstering supply chains and reducing reliance on foreign sources. The leaders emphasized collaboration in addressing global challenges.",
    "published": "2025-10-20T19:08:28Z"
  },
  {
    "title": "English universities can raise tuition fees if they meet ‘tough’ standards, says Phillipson",
    "url": "https://www.theguardian.com/education/2025/oct/20/english-universities-can-raise-tuition-fees-if-they-meet-tough-standards-says-phillipson",
    "image": "https://media.guim.co.uk/96ef203aa93f6d01f58e2a1dfd3ee964a7fb4be9/150_0_2666_2134/500.jpg",
    "summary": "The new measure outlined in the white paper on post-16 education and skills will enable funding increases in alignment with inflation. This initiative aims to enhance educational resources and support for students. It reflects a commitment to ensuring educational institutions can meet rising costs effectively.",
    "published": "2025-10-20T19:00:07Z"
  }
]