[
  {
    "title": "Hurricane Melissa live: life-threatening category 5 storm to bring 175mph winds as it moves towards Jamaica",
    "url": "https://www.theguardian.com/world/live/2025/oct/27/hurricane-melissa-jamaica-cuba-caribbean-haiti-dominican-republic-live-news-latest-updates",
    "image": "https://media.guim.co.uk/bd0cb90693aef40d91495d4257499a7b67bda865/0_138_5000_3999/500.jpg",
    "summary": "Residents in Jamaica are being urged to seek shelter immediately due to a significant threat from severe weather. The alert extends to neighboring countries, including Cuba, Haiti, and the Dominican Republic, which are also at risk. Authorities are emphasizing the importance of preparedness as the situation develops.",
    "published": "2025-10-27T22:17:28Z"
  },
  {
    "title": "Australia politics live: Nationals senator claims TikTok staff member bullied his office over questions on under-16s social media ban",
    "url": "https://www.theguardian.com/australia-news/live/2025/oct/28/federal-parliament-algae-report-senate-social-media-age-assurance-labor-coalition-anthony-albanese-sussan-ley-barnaby-joyce-telco-penalties-ntwnfb",
    "image": "https://media.guim.co.uk/cd3b002e2e9bc8695227b8137f63445d41299c66/350_0_2500_2001/500.jpg",
    "summary": "Please provide the news article or details you would like summarized, and I'll be happy to help!",
    "published": "2025-10-27T22:14:35Z"
  },
  {
    "title": "Underground mine explosion kills two people at Cobar in far western NSW",
    "url": "https://www.theguardian.com/business/2025/oct/28/cobar-nsw-underground-mine-explosion-kills-two-people",
    "image": "https://media.guim.co.uk/39555e9da0d7c4e7bd31abc7389bed6c13af48e5/493_0_4560_3648/500.jpg",
    "summary": "A blast at a mine located 450 km east of Broken Hill has resulted in the deaths of a woman and a man. Another woman was airlifted to the hospital for treatment. Authorities are investigating the incident.",
    "published": "2025-10-27T22:13:04Z"
  },
  {
    "title": "Brendan Rodgers resigns at Celtic with Martin O’Neill to be interim manager",
    "url": "https://www.theguardian.com/football/2025/oct/27/brendan-rodgers-resigns-celtic-martin-oneill",
    "image": "https://media.guim.co.uk/051be88f728b20391cd8c42661fb9d8216d6b88d/355_0_3619_2896/500.jpg",
    "summary": "Brendan Rodgers has stepped down as manager of Celtic amid a struggling season. The club is currently eight points adrift of Hearts in the Scottish Premiership standings. His resignation marks a significant shift for the team as they seek to improve their performance.",
    "published": "2025-10-27T22:06:32Z"
  },
  {
    "title": "It: Welcome to Derry review – the demonic, liver-eating baby in this Stephen King prequel is horrifying",
    "url": "https://www.theguardian.com/tv-and-radio/2025/oct/27/it-welcome-to-derry-review-stephen-king-prequel-sky-atlantic-now-hbo-max",
    "image": "https://media.guim.co.uk/692e9c7323cc1e0ec0b223be9346a2ea215176cb/257_0_6440_5152/500.jpg",
    "summary": "The new series, set before the 2017 Pennywise film, offers a gory, mystery-filled horror experience rich in Stephen King's signature themes. While it provides solid entertainment, it may not be the finest adaptation of his work. Overall, it captures the essence of King’s storytelling.",
    "published": "2025-10-27T22:05:10Z"
  }
]