[
  {
    "title": "Amazon confirms plans to lay off 14,000 corporate workers as part of wave of cuts",
    "url": "https://www.theguardian.com/technology/2025/oct/27/amazon-corporate-jobs-cuts",
    "image": "https://media.guim.co.uk/27879db407d04c2b930da0c7403853afaa773d5d/0_0_3684_2946/500.jpg",
    "summary": "A major retail company is working to reduce costs and streamline operations following a surge in hiring during the pandemic. The effort aims to address operational inefficiencies and adapt to changing market conditions. This move reflects a broader trend among retailers seeking to recalibrate after rapid expansions.",
    "published": "2025-10-28T12:30:46Z"
  },
  {
    "title": "Hurricane Melissa latest updates: Red Cross says 1.5m people in Jamaica could be impacted by ‘storm of the century’",
    "url": "https://www.theguardian.com/world/live/2025/oct/28/hurricane-melissa-live-updates-category-5-storm-jamaica-landfall-latest-news",
    "image": "https://media.guim.co.uk/df3f43a5029df1885e1ae9982573bf2aa22bd1c0/181_0_2870_2297/500.jpg",
    "summary": "The World Meteorological Organization (WMO) warns that hurricane Melissa is likely to create a \"catastrophic situation.\" The storm poses serious threats, with significant impacts anticipated. Authorities are urged to prepare for severe weather conditions associated with the hurricane.",
    "published": "2025-10-28T12:29:54Z"
  },
  {
    "title": "Tilda Swinton and Gary Oldman return to stage for Royal Court’s 70th anniversary",
    "url": "https://www.theguardian.com/stage/2025/oct/28/royal-court-70th-anniversary-tilda-swinton-gary-oldman",
    "image": "https://media.guim.co.uk/0cb345e260217c83205020670eec458cec21c8ea/542_0_5423_4339/500.jpg",
    "summary": "Tilda Swinton returns to the stage after 30 years, showcasing her talent once again. Meanwhile, Gary Oldman is set to perform in the play \"Krapp's Last Tape.\" Both actors are making notable theatrical comebacks.",
    "published": "2025-10-28T12:27:43Z"
  },
  {
    "title": "Three more Reform UK councillors expelled from party over ‘dishonest’ behaviour after leaked video meeting – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/oct/28/labour-asylum-seekers-military-sites-keir-starmer-rachel-reeves-reform-uk-yvette-cooper-uk-politics-live-news-latest-updates",
    "image": "https://media.guim.co.uk/4bd9ed0f44567a2d0c22285fcf7a47ed42f07a09/302_0_1349_1080/500.jpg",
    "summary": "In a recent online meeting, the leader of Kent County Council was seen expressing frustration and reprimanding councillors. The footage captured the intensity of the discussions among council members. This incident has drawn attention to the ongoing challenges within the council.",
    "published": "2025-10-28T12:26:54Z"
  },
  {
    "title": "Trump and new Japanese prime minister share praise and vow to strengthen ‘remarkable’ relationship – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/28/donald-trump-sanae-takaichi-japan-trade-national-guard-us-politics-live",
    "image": "https://media.guim.co.uk/b54141de9497e413508dcc3aa6afd12ecc4ab883/365_0_3554_2843/500.jpg",
    "summary": "During a speech on the USS George Washington, the president proposed the possibility of deploying the National Guard to additional cities across the United States. This move aims to address ongoing safety and security concerns. The suggestion underscores the administration's commitment to responding to pressing national issues.",
    "published": "2025-10-28T12:24:37Z"
  }
]