[
  {
    "title": "England v South Africa: Women’s Cricket World Cup semi-final – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/29/england-v-south-africa-womens-cricket-world-cup-semi-final-live",
    "image": "https://media.guim.co.uk/185c8030614b4199a18c2cc4110c139778c18c7d/355_74_3097_2478/500.jpg",
    "summary": "England and South Africa are competing for a place in the Women's Cricket World Cup final in India. An over-by-over report provides updates and insights from the match. Fans are eagerly watching as both teams vie for victory.",
    "published": "2025-10-29T11:17:11Z"
  },
  {
    "title": "Attorney general says, if spy case had gone to trial, Badenoch saying China not a foe would have helped accused get off – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/oct/29/shabana-mahmood-home-office-immigration-pmqs-labour-keir-starmer-kemi-badenoch-conservatives-uk-politics-live-news",
    "image": "https://media.guim.co.uk/ea4a8f2f2daaccf03fbd1dec02fe410e7923bcc8/397_68_2057_1646/500.jpg",
    "summary": "Lord Hermer provided testimony to a joint committee on national security strategy regarding the recent China spy case. He discussed the implications of foreign espionage on national security and the government's response to such threats. The committee is examining measures to enhance defense against foreign interference.",
    "published": "2025-10-29T11:15:37Z"
  },
  {
    "title": "Profit upgrade at Next raises hopes UK shoppers still keen to spend",
    "url": "https://www.theguardian.com/business/2025/oct/29/profit-upgrade-at-next-raises-hopes-uk-shoppers-still-keen-to-spend",
    "image": "https://media.guim.co.uk/28222b6bf16ae0154686fab623ac0e368903279c/549_0_2915_2333/500.jpg",
    "summary": "Sales increased due to a warm summer season, along with improvements in supply chains. Marks & Spencer experienced disruptions from an online shutdown following a cyber-attack. Overall, these factors positively impacted the company's sales performance.",
    "published": "2025-10-29T11:15:35Z"
  },
  {
    "title": "Kathryn Bigelow responds to Pentagon criticism of House of Dynamite: ‘I just state the truth’",
    "url": "https://www.theguardian.com/film/2025/oct/29/kathryn-bigelow--pentagon-house-of-dynamite-netflix",
    "image": "https://media.guim.co.uk/cfd4aeb7901c80c98d7c16c5391c504ba1ebd6e9/2131_1102_2892_2315/500.jpg",
    "summary": "The director of a popular Netflix series about a nuclear strike responded to U.S. government claims of inaccuracy, stating that these assessments do not capture the current volatile global situation. He emphasized the realism and relevance of the show's themes. The comments highlight ongoing tensions surrounding nuclear issues and artistic representation.",
    "published": "2025-10-29T11:11:16Z"
  },
  {
    "title": "Hurricane Melissa live updates: hundreds of thousands evacuated as Cuba faces 120mph winds; disaster area declared in Jamaica",
    "url": "https://www.theguardian.com/world/live/2025/oct/29/hurricane-melissa-live-updates-strengthens-cuba-extensive-damage-parts-of-jamaica",
    "image": "https://media.guim.co.uk/57ba5cc648a4a4e51519f3324300dc031e3a9795/432_0_5417_4333/500.jpg",
    "summary": "A powerful storm has struck Cuba, prompting warnings of life-threatening flooding in the region. Jamaica has already experienced significant damage due to the storm's destructive path. Residents in affected areas are urged to prepare for severe weather conditions.",
    "published": "2025-10-29T11:11:06Z"
  }
]