[
  {
    "title": "Australia news live: ANZ to sack 3,500 workers; PM says Price should ‘of course’ apologise for Indian migrant comments",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/09/australia-news-live-anthony-albanese-vanuatu-china-pacific-forum-murray-watt-nature-protection-laws-ntwnfb",
    "image": "https://media.guim.co.uk/03a45867e2105ada698fc1d88ba8df5229d9bcb2/338_0_2729_2184/500.jpg",
    "summary": "I'm sorry, but I need more context or specific information about the news you would like summarized. Please provide additional details or the content you want summarized.",
    "published": "2025-09-08T23:21:10Z"
  },
  {
    "title": "NHS hospital league tables are brought back by ministers",
    "url": "https://www.theguardian.com/society/2025/sep/09/nhs-hospital-league-tables-are-brought-back-by-ministers",
    "image": "https://media.guim.co.uk/3ff2ff3f53c28669981e482df8abc1dea5782f77/409_0_3954_3164/500.jpg",
    "summary": "All health trusts in England have been ranked from best to worst, providing a comparative overview of their performance. However, analysts caution that this ranking may have limited utility for patients seeking care. Critics argue that the focus on rankings could overshadow other important factors in healthcare quality.",
    "published": "2025-09-08T23:01:09Z"
  },
  {
    "title": "Trump state visit will see police drones and airspace limits over Windsor",
    "url": "https://www.theguardian.com/us-news/2025/sep/09/trump-state-visit-will-see-police-drones-and-airspace-limits-over-windsor",
    "image": "https://media.guim.co.uk/554771c35314b8b29289db78dd612e8442a78fac/680_345_4208_3367/500.jpg",
    "summary": "A major police operation is set for the US president's second state visit, featuring two days of drone patrols. The heightened security measures aim to ensure safety during the event. Authorities are employing advanced technology to monitor the area effectively.",
    "published": "2025-09-08T23:01:08Z"
  },
  {
    "title": "Pret a Manger to take on supermarkets by trialling meal deals",
    "url": "https://www.theguardian.com/business/2025/sep/09/pret-a-manger-to-take-on-supermarkets-by-trialling-meal-deals",
    "image": "https://media.guim.co.uk/708551353cdba0c2181e693ee6da609e179e7820/13_22_1931_1546/500.jpg",
    "summary": "A new format is set to be tested in the last quarter of the year as the chain faces a significant valuation drop of one-third. This decline is attributed to the intense pressures currently affecting the hospitality industry. The upcoming trial aims to address these challenges and improve the chain’s performance.",
    "published": "2025-09-08T23:01:08Z"
  },
  {
    "title": "Ofsted to press ahead with new inspection regime despite opposition",
    "url": "https://www.theguardian.com/education/2025/sep/09/ofsted-press-ahead-inspection-regime-despite-opposition",
    "image": "https://media.guim.co.uk/b65879d4c2d54975233a90cab5f4e6db0c4f3dba/141_0_2536_2029/500.jpg",
    "summary": "Unions and headteachers criticize a new 'Nando’s-style' scorecard for school evaluations, claiming it is inferior to the existing system used by the schools watchdog. They argue that the scoring system fails to accurately reflect school performance. The feedback highlights concerns over transparency and fairness in assessing educational quality.",
    "published": "2025-09-08T23:01:08Z"
  }
]