[
  {
    "title": "India v Australia: Women’s Cricket World Cup semi-final heads for thrilling finish – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/30/india-v-australia-womens-cricket-world-cup-semi-final-live",
    "image": "https://media.guim.co.uk/1c0d1209ddd442820c651c903bd5ac9aa2987972/295_101_2246_1797/500.jpg",
    "summary": "The second semi-final in Navi Mumbai features the co-hosts facing off against the defending champions. Writers provide live updates and commentary on the match as it unfolds. Tune in for real-time coverage of this exciting showdown.",
    "published": "2025-10-30T16:25:20Z"
  },
  {
    "title": "Nabil Shaban obituary",
    "url": "https://www.theguardian.com/stage/2025/oct/30/nabil-shaban-obituary",
    "image": "https://media.guim.co.uk/f9e39e1bf8b95bceb0eed70da91362e0ba387413/103_1_1699_1359/500.jpg",
    "summary": "The actor has established Graeae, a theatre company dedicated to supporting disabled and neurodivergent performers. The platform aims to promote inclusivity and representation in the arts. Through Graeae, the actor champions diversity and empowers underrepresented voices in theatre.",
    "published": "2025-10-30T16:19:25Z"
  },
  {
    "title": "Rachel Reeves row: standards adviser looking at new information",
    "url": "https://www.theguardian.com/politics/2025/oct/30/rachel-reeves-row-standards-adviser-looking-at-new-infomation",
    "image": "https://media.guim.co.uk/a2af28279a5803dca05c01c6d118628db7bdbc99/325_0_1962_1570/500.jpg",
    "summary": "No 10 has revealed that new information has emerged regarding the Chancellor's failure to obtain a license for renting out her family home. This situation raises concerns about compliance with regulations. Further developments may follow as the issue is investigated.",
    "published": "2025-10-30T16:18:59Z"
  },
  {
    "title": "Ethics adviser given new information about Reeves’ rental error but Starmer still backs her – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/oct/30/rachel-reeves-labour-keir-starmer-uk-politics-latest-news-updates",
    "image": "https://media.guim.co.uk/042e4d5b2b45b212202ef947cf7e2b8fe3ba3099/295_103_1834_1467/500.jpg",
    "summary": "A recent review of emails sent and received by the husband of a university chancellor has led to significant developments. The findings from this investigation have raised questions and prompted further scrutiny within the institution. The situation highlights potential conflicts of interest and the need for transparency in university governance.",
    "published": "2025-10-30T16:16:05Z"
  },
  {
    "title": "Senate postpones hearing for Trump’s surgeon general pick after she goes into labor ",
    "url": "https://www.theguardian.com/us-news/2025/oct/30/casey-means-surgeon-general-senate-hearing",
    "image": "https://media.guim.co.uk/a8c06ebeb38e8683e3bbd799ed3bb844a95eac4f/0_0_3736_2989/500.jpg",
    "summary": "Casey Means, a prominent figure in the Maha movement, has been selected by Trump as his second choice for a key position, despite holding an inactive medical license. This appointment raises questions about her qualifications. The decision highlights Trump's ongoing efforts to fill important roles within his administration.",
    "published": "2025-10-30T16:15:54Z"
  }
]