[
  {
    "title": "US Open 2025: Osaka shocks Gauff, Swiatek wins, Auger-Aliassime beats Rublev on day nine – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/01/us-open-tennis-2025-swiatek-osaka-gauff-de-minaur-musetti-day-nine-live",
    "image": "https://media.guim.co.uk/a33ce9f26efd91fd7c727011efff6860b68d0fc9/465_0_4299_3438/500.jpg",
    "summary": "Taha Hashim will provide live updates on day nine of the tournament. Two former champions, Naomi Osaka and Coco Gauff, are set to compete against each other in the fourth round. The match promises to be an exciting clash between these top players.",
    "published": "2025-09-01T20:30:58Z"
  },
  {
    "title": "Transfer deadline day: City agree Donnarumma deal, Guéhi to Liverpool move collapses – live",
    "url": "https://www.theguardian.com/football/live/2025/sep/01/transfer-deadline-day-guehi-wissa-martinez-ederson-latest-and-more-live",
    "image": "https://media.guim.co.uk/566b7cb0dc9794e3df4d2f5be84d31c288a76d90/58_0_4280_3424/500.jpg",
    "summary": "Will Magee will provide ongoing updates and coverage of the latest developments in the transfer window, including last-minute moves and their implications. Stay tuned for insights on the evolving situation and its impact on teams and players. Don't miss the latest drama and fallout as it unfolds.",
    "published": "2025-09-01T20:30:54Z"
  },
  {
    "title": "Liverpool sign Alexander Isak in British transfer record £125m deal from Newcastle",
    "url": "https://www.theguardian.com/football/2025/sep/01/liverpool-sign-alexander-isak-british-transfer-record-125m-newcastle",
    "image": "https://media.guim.co.uk/566b7cb0dc9794e3df4d2f5be84d31c288a76d90/493_0_4280_3424/500.jpg",
    "summary": "Alexander Isak has transferred to Liverpool from Newcastle for £125 million. He has signed a six-year contract with the club. This move marks a significant addition to Liverpool's squad.",
    "published": "2025-09-01T20:30:08Z"
  },
  {
    "title": "Randal Kolo Muani agrees to join Tottenham on loan from PSG",
    "url": "https://www.theguardian.com/football/2025/sep/01/randal-kolo-muani-agrees-to-join-tottenham-on-loan-from-psg",
    "image": "https://media.guim.co.uk/38512a239552f2f41c3c02769a74e04e31f40157/467_249_2939_2351/500.jpg",
    "summary": "Thomas Frank has secured a loan deal for Randal Kolo Muani from Paris Saint-Germain to enhance his attacking lineup. This move aims to provide additional depth for the team. However, it also complicates Frank's selection choices for the Champions League.",
    "published": "2025-09-01T20:09:19Z"
  },
  {
    "title": "China to show off military might in parade attended by anti-west leaders",
    "url": "https://www.theguardian.com/world/2025/sep/01/china-military-parade-anti-west-leaders",
    "image": "https://media.guim.co.uk/7b326111e5959ab8db9e90a53365cf4d6a2c1496/318_0_3948_3158/500.jpg",
    "summary": "Leaders from Russia, Iran, and North Korea are set to attend an event commemorating the 80th anniversary of Japan's defeat in World War II. This gathering highlights the growing ties among these nations amid geopolitical tensions. The event is expected to showcase their solidarity against Western influence.",
    "published": "2025-09-01T20:01:17Z"
  }
]