[
  {
    "title": "Fulham v Crystal Palace: Premier League – live",
    "url": "https://www.theguardian.com/football/live/2025/dec/07/fulham-v-crystal-palace-premier-league-live",
    "image": "https://media.guim.co.uk/d3d28eb6f9ee4375db6932fc0bd2ba75d7e5f72a/791_85_2313_1850/500.jpg",
    "summary": "Crystal Palace aims to maintain their impressive performance as they face Fulham at Craven Cottage. The match promises an exciting clash, highlighting both teams' current forms. Rob Smyth will provide insights on the outcome.",
    "published": "2025-12-07T16:21:39Z"
  },
  {
    "title": "Brighton v West Ham: Premier League – as it happened",
    "url": "https://www.theguardian.com/football/live/2025/dec/07/brighton-v-west-ham-premier-league-live",
    "image": "https://media.guim.co.uk/05516614adb0a994b8fa1cf17358f19bbc8ba583/265_86_2784_2227/500.jpg",
    "summary": "Jarrod Bowen's stunning goal put West Ham ahead in their match against Brighton. However, Georginio Rutter scored a late equaliser for Brighton, securing a point despite their lackluster performance. The game ended in a draw.",
    "published": "2025-12-07T16:17:04Z"
  },
  {
    "title": "Rutter rescues late point for Brighton against West Ham after Bowen’s opener",
    "url": "https://www.theguardian.com/football/2025/dec/07/brighton-west-ham-premier-league-match-report",
    "image": "https://media.guim.co.uk/343b8258fe0bfc131b599d7b0db03ef449287f35/152_0_1786_1429/500.jpg",
    "summary": "Georginio Rutter scored a last-minute goal to help Brighton secure a 1-1 draw against West Ham. Jarrod Bowen put West Ham ahead with a goal in the second half. The draw maintained both teams' competitive spirits in the match.",
    "published": "2025-12-07T16:13:58Z"
  },
  {
    "title": "Hegseth gives defiant speech defending ‘drug boat’ strikes amid scrutiny",
    "url": "https://www.theguardian.com/us-news/2025/dec/06/hegseth-boat-strikes",
    "image": "https://media.guim.co.uk/c65623785fcd4515ae04e4995dbb1dd835396bd1/0_0_2500_2000/500.jpg",
    "summary": "During an event in California, the US Defense Secretary stated that former President Trump possesses the authority to take military action as he deems appropriate. This remark underscores ongoing discussions about presidential powers and military decisions. The statement has sparked debate regarding the implications of such authority in the current political climate.",
    "published": "2025-12-07T16:13:52Z"
  },
  {
    "title": "Disarming Hamas should not be first task of Gaza stabilisation force, Turkey says",
    "url": "https://www.theguardian.com/world/2025/dec/07/disarming-hamas-should-not-first-task-gaza-stabilisation-force-turkey-says",
    "image": "https://media.guim.co.uk/157d5a98d5e6e0b4aae86c76cbe3aeed5a9d2229/128_0_2500_2000/500.jpg",
    "summary": "Ankara's foreign minister advocates for international partners to first focus on separating Israeli troops from Hamas. This proposal aims to de-escalate tensions in the region. The call underscores the need for diplomatic solutions amid ongoing conflict.",
    "published": "2025-12-07T16:13:30Z"
  }
]