[
  {
    "title": "MPs to question key BBC figures amid editorial crises – latest updates",
    "url": "https://www.theguardian.com/media/live/2025/nov/24/bbc-board-mps-select-committee-latest-updates",
    "image": "https://media.guim.co.uk/0be08c29bb56b6ba83067d61290991b22a6ce04c/308_0_4583_3667/500.jpg",
    "summary": "Michael Prescott, the author of a leaked memo, along with chair Samir Shah and board members Robbie Gibb and Caroline Thomson, are set to testify before a select committee. Their appearance follows the release of the memo, which has garnered significant attention. The committee aims to address the implications and context of the leaked information.",
    "published": "2025-11-24T15:22:28Z"
  },
  {
    "title": "EU leaders welcome ‘new momentum’ in Ukraine peace talks but stress red lines on territory – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/nov/24/ukraine-russia-war-peace-talks-europe-us-trump-germany-latest-updates",
    "image": "https://media.guim.co.uk/42ec1ad5df7897e323d98de22e987965f30f4a0b/536_0_4560_3648/500.jpg",
    "summary": "Swedish Prime Minister emphasizes the need to compel Russia to engage in negotiations during a meeting of European leaders in Angola. The discussions focus on the upcoming Geneva talks aimed at resolving ongoing conflicts. The call for diplomacy reflects growing concerns over regional instability.",
    "published": "2025-11-24T15:20:37Z"
  },
  {
    "title": "Risk of Maccabi Tel Aviv facing antisemitic attacks not ‘predominant’ reason for match ban, police tell MPs – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/nov/24/budget-labour-rachel-reeves-criticism-conservatives-nigel-farage-latest-news-updates",
    "image": "https://media.guim.co.uk/412cc4e7547d9a8ebe259c9d33696346736822de/177_0_3333_2667/500.jpg",
    "summary": "West Midlands police's assistant chief constable emphasized that the potential threat of violence from Maccabi fans was the primary concern. This consideration influenced their operational decisions. The statement underscores the challenges faced in managing fan safety at events.",
    "published": "2025-11-24T15:20:01Z"
  },
  {
    "title": "European defence company shares fall amid Ukraine peace talk hopes; Novo Nordisk reports Ozempic fails to help with Alzheimer’s – business live",
    "url": "https://www.theguardian.com/business/live/2025/nov/24/bhp-walks-away-takeover-approach-anglo-mining-merger-uk-budget-cbi-ftse-pound-business-live-news",
    "image": "https://media.guim.co.uk/6797c69e1e249d8761d0831bc75b874ed8f2d080/301_0_4164_3333/500.jpg",
    "summary": "Novo Nordisk's semaglutide drug has been found ineffective in treating Alzheimer's disease, according to recent findings. The news has implications for the company's research and development strategies. Analysts are closely monitoring the impact on Novo Nordisk's overall financial performance.",
    "published": "2025-11-24T15:17:18Z"
  },
  {
    "title": "Ukraine makes significant changes to US ‘peace plan’, sources say",
    "url": "https://www.theguardian.com/world/2025/nov/24/zelenskyy-trump-meeting-revised-us-peace-plan-ukraine-russia",
    "image": "https://media.guim.co.uk/9db26e6a635fd6e0e40e8e15559eeb918b3ec7a8/285_0_1350_1080/500.jpg",
    "summary": "Russia has reportedly removed some of its extreme demands from its initial 28-point proposal for negotiations. This change suggests a potential shift in their approach to ongoing discussions. The adjustment may pave the way for more constructive dialogue.",
    "published": "2025-11-24T15:17:07Z"
  }
]