[
  {
    "title": "Zelenskyy urges world leaders not to lose momentum for finding peace, and says the war in Europe can also be ended – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/oct/14/france-lecornu-macron-ukraine-russia-zelenskyy-europe-latest-news-updates",
    "image": "https://media.guim.co.uk/c9ebb1393c4c89711f762cd8429170b4f5847fc6/44_0_4733_3786/500.jpg",
    "summary": "The Ukrainian leader has expressed optimism regarding Trump's Gaza deal, interpreting it as a positive step towards peace in various regions. He believes it could foster a broader sense of hope beyond the immediate conflict. This sentiment reflects Ukraine's desire for stability and cooperation in global affairs.",
    "published": "2025-10-14T11:14:20Z"
  },
  {
    "title": "Gaza ceasefire live: Red Cross warns of ‘massive challenge’ in returning bodies of hostages as key truce issues remain",
    "url": "https://www.theguardian.com/world/live/2025/oct/14/gaza-ceasefire-israel-hamas-palestine-hostages-detainees-truce-live-news-updates",
    "image": "https://media.guim.co.uk/b911994cfbf7f44c97869341e06f2dc62d4b1759/794_0_4680_3744/500.jpg",
    "summary": "The Israeli defense minister stated that delaying the return of bodies would breach the ceasefire. This comes as Israeli forces opened fire on individuals approaching troops in northern Gaza. The situation highlights ongoing tensions despite the ceasefire agreement.",
    "published": "2025-10-14T11:14:09Z"
  },
  {
    "title": "First Thing: Israelis and Palestinians celebrate as key truce issues remain",
    "url": "https://www.theguardian.com/us-news/2025/oct/14/first-thing-israelis-palestinians-celebrate-key-truce-issues-remain",
    "image": "https://media.guim.co.uk/5be2911711c669d7c6572cd223f0d8a43cf44200/961_0_6977_5582/500.jpg",
    "summary": "The UN emphasizes that Gaza continues to require urgent humanitarian assistance as world leaders convene in Sharm el-Sheikh to discuss a 20-point proposal. Meanwhile, nude cyclists staged a protest against the deployment of the national guard. The situation underscores ongoing concerns over aid and civil rights amid the discussions.",
    "published": "2025-10-14T11:13:42Z"
  },
  {
    "title": "Letitia James warns of ‘powerful voices trying to silence the truth’ – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/14/donald-trump-government-shutdown-national-guard-javier-milei-charlie-kirk-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/1d3e072276c0ff4f682fe8b2c7b44ca04e009481/347_0_3333_2667/500.jpg",
    "summary": "New York Attorney General Letitia James delivered a bold speech at a Mamdani rally, marking her first public appearance since facing indictment. She expressed resilience and determination to continue her work despite the legal challenges. James emphasized her commitment to justice and the fight against corruption in her address.",
    "published": "2025-10-14T11:11:34Z"
  },
  {
    "title": "People in the UK: have you been shocked at food prices in the supermarket?",
    "url": "https://www.theguardian.com/money/2025/oct/14/people-in-the-uk-have-you-been-shocked-at-food-prices-in-the-supermarket",
    "image": "https://media.guim.co.uk/0e6ee38633a2245fffbae49caba9ad34b82678e7/0_0_3333_2667/500.jpg",
    "summary": "Groceries are becoming more expensive, leading to consumers receiving less value for their money compared to the past. This increase in prices is impacting household budgets and shopping habits. Many shoppers are feeling the financial strain as inflation affects the cost of essential items.",
    "published": "2025-10-14T11:10:20Z"
  }
]