[
  {
    "title": "Go Ahead Eagles v Aston Villa, Brann v Rangers and more: Europa League – live",
    "url": "https://www.theguardian.com/football/live/2025/oct/23/go-ahead-eagles-aston-villa-brann-rangers-nottingham-forest-porto-celtic-europa-league-live",
    "image": "https://media.guim.co.uk/525628343af22ccec6b0972a87412c359793e619/206_0_2225_1780/500.jpg",
    "summary": "Michael Butler will provide live updates on goals from various matches across Europe. Fans can stay informed about the latest scoring actions as they happen. Tune in for real-time coverage of the exciting European football scene!",
    "published": "2025-10-23T18:28:58Z"
  },
  {
    "title": "Trump cancels plans to send federal troops to San Francisco for immigration crackdown",
    "url": "https://www.theguardian.com/us-news/2025/oct/23/san-francisco-federal-immigration-operation",
    "image": "https://media.guim.co.uk/f1e6a6adbf7322ce6237ffd28583640228a20a8b/306_0_5040_4032/500.jpg",
    "summary": "Trump confirmed discussing with Mayor Daniel Lurie the possibility of canceling a planned deployment. No specific details about the deployment were provided. The conversation highlights ongoing communication between Trump and local officials.",
    "published": "2025-10-23T18:19:03Z"
  },
  {
    "title": "Louvre thieves’ slow-motion getaway using furniture lift was caught on video",
    "url": "https://www.theguardian.com/world/2025/oct/23/louvre-thieves-slow-motion-getaway-caught-on-video",
    "image": "https://media.guim.co.uk/f7cacdcec798569959063bba368f880913c6e6a4/571_0_1349_1080/500.jpg",
    "summary": "Footage captured from a nearby window at a museum shows two men engaged in an undisclosed activity. The video's context and the identities of the individuals remain unclear. The incident has drawn attention and is likely to spark further investigation.",
    "published": "2025-10-23T18:18:22Z"
  },
  {
    "title": "Senate fails to pass bill to keep essential federal workers and troops paid throughout government shutdown – live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/23/trump-san-francisco-federal-agents-white-house-ice-immigration-latest-news-updates",
    "image": "https://media.guim.co.uk/e7d6d40d5252725c7a28608b2e504755d0a6d76c/354_0_4420_3536/500.jpg",
    "summary": "Three Democratic senators, John Fetterman, Raphael Warnock, and Jon Ossoff, defied party lines by voting in favor of a Republican bill. This bipartisan move highlights the increasingly complex dynamics within the Senate. The vote could signal shifting alliances and a potential for more collaboration across party lines on certain issues.",
    "published": "2025-10-23T18:10:24Z"
  },
  {
    "title": "India beat New Zealand to secure last Women’s Cricket World Cup semi-final spot – as it happened",
    "url": "https://www.theguardian.com/sport/live/2025/oct/23/india-v-new-zealand-womens-cricket-world-cup-live",
    "image": "https://media.guim.co.uk/6d3b154760dd3a65ea0746ab8115cafba3fe054b/109_0_2256_1805/500.jpg",
    "summary": "Pratika Rawal and Smriti Mandhana delivered a stunning opening partnership, leading India to a decisive victory. Their performance was instrumental in securing a spot in the semi-finals. The team's strong display showcased their potential in the tournament.",
    "published": "2025-10-23T18:07:53Z"
  }
]