[
  {
    "title": "Australia news live: pro-Palestine Opera House protesters vow to fight police block in court; search for missing four-year-old scaled back",
    "url": "https://www.theguardian.com/australia-news/live/2025/oct/03/png-agreement-aukus-submarines-pact-anthony-albanese-richard-marles-retired-admiral-slams-aukus-deal-gaza-flotilla-intercepted-ntwnfb",
    "image": "https://media.guim.co.uk/68a72c23d3615b204ec6993f8f642217a59152ca/250_0_2500_2000/500.jpg",
    "summary": "I'm unable to provide a summary without specific content or context related to the news. Please provide the details you'd like summarized!",
    "published": "2025-10-03T05:15:20Z"
  },
  {
    "title": "What a £5 coffee (or a £100 Pizza Express) tells us about a changing Britain | Gaby Hinsliff",
    "url": "https://www.theguardian.com/commentisfree/2025/oct/03/coffee-pizza-express-changing-britain",
    "image": "https://media.guim.co.uk/26fec75efafd860cc53d71b57b768a4419c50e03/0_0_5001_4000/500.jpg",
    "summary": "Guardian columnist Gaby Hinsliff reflects on how many Gen Xers feel a return to their childhood experiences, where dining out was reserved for special occasions. The nostalgia evokes a simpler time dominated by home-packed lunches and Thermoses. This sentiment highlights a shift in societal norms and personal habits in today's economy.",
    "published": "2025-10-03T05:00:27Z"
  },
  {
    "title": "English National Ballet’s R:Evolution review – a triple whammy of Balanchine, Forsythe and Graham",
    "url": "https://www.theguardian.com/stage/2025/oct/03/english-national-ballet-revolution-review",
    "image": "https://media.guim.co.uk/6ce3c6a2e1b8b519211024c7dbdfc01cc3b4af39/7_142_2671_2138/500.jpg",
    "summary": "In a captivating performance, bold and flawless dancers showcased three classic pieces, culminating in a beautifully understated work by David Dawson. The evening was filled with skill and artistry, leaving a lasting impression. The final piece offered a poignant contrast to the earlier vigor.",
    "published": "2025-10-03T05:00:26Z"
  },
  {
    "title": "Frailty in ageing populations worsened by air pollution, global review finds",
    "url": "https://www.theguardian.com/environment/2025/oct/03/frailty-in-ageing-populations-worsened-by-air-pollution-global-review-finds",
    "image": "https://media.guim.co.uk/ec86b4748613223bb0724080945ffa894c724a7b/0_0_5000_4000/500.jpg",
    "summary": "A coauthor of a recent study highlights that a specific condition is associated with increased vulnerability and loss of independence in affected individuals. However, the research indicates that this condition is reversible. Interventions may help restore independence and improve overall well-being.",
    "published": "2025-10-03T05:00:26Z"
  },
  {
    "title": "Benjamina Ebuehi’s recipe for plum and ginger buns",
    "url": "https://www.theguardian.com/food/2025/oct/03/plum-ginger-buns-recipe-benjamina-ebuehi",
    "image": "https://media.guim.co.uk/959a1aeedf856bc204be91f71639fbc2cea63b7f/0_752_5148_4118/500.jpg",
    "summary": "A new popular dessert has emerged this autumn, characterized as a roly-poly treat that is both sticky and satisfying. It has gained attention for its comforting flavor and texture, appealing to seasonal cravings. People are embracing this indulgent dish during the fall season.",
    "published": "2025-10-03T05:00:25Z"
  }
]