[
  {
    "title": "European defence company shares and gas prices fall after US and Ukraine discuss Russia peace plan – business live",
    "url": "https://www.theguardian.com/business/live/2025/nov/24/bhp-walks-away-takeover-approach-anglo-mining-merger-uk-budget-cbi-ftse-pound-business-live-news",
    "image": "https://media.guim.co.uk/6797c69e1e249d8761d0831bc75b874ed8f2d080/301_0_4164_3333/500.jpg",
    "summary": "BHP has once again been turned down by mining competitor Anglo American in its pursuit to merge or collaborate. This ongoing situation highlights the competitive nature of the mining industry. Investors are closely watching for further developments in these negotiations.",
    "published": "2025-11-24T11:06:02Z"
  },
  {
    "title": "‘Extra challenging during a difficult time’: Robert Redford’s daughter criticises AI tributes to the late actor",
    "url": "https://www.theguardian.com/film/2025/nov/24/extra-challenging-during-a-difficult-time-robert-redfords-daughter-criticises-ai-tributes-to-the-late-actor",
    "image": "https://media.guim.co.uk/fafa684ed121099b9c7f1906e1758e802117a7b0/0_0_10585_8470/500.jpg",
    "summary": "Amy Redford expressed her gratitude to fans for their love and support, but criticized the use of artificial intelligence to create fabricated tributes, quotes, and funeral tributes related to her family. She emphasized her discomfort with these representations. Redford's comments highlight concerns about the authenticity and ethics of using AI in personal memorials.",
    "published": "2025-11-24T11:04:46Z"
  },
  {
    "title": "Business secretary dismisses claim ‘shambolic’ pre-budget uncertainty has caused hit to growth – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/nov/24/budget-labour-rachel-reeves-criticism-conservatives-nigel-farage-latest-news-updates",
    "image": "https://media.guim.co.uk/388cb09911ab29d4d4ab6660808199b2cd9b4f4e/302_0_2682_2145/500.jpg",
    "summary": "Peter Kyle has come to the government's defense amid criticism directed at Shadow Chancellor Rachel Reeves regarding her pre-budget briefings ahead of Wednesday's announcement. The controversy stems from concerns over transparency and communication. Kyle's support highlights ongoing tensions in the political landscape as budget discussions intensify.",
    "published": "2025-11-24T11:02:05Z"
  },
  {
    "title": "Ukraine working with US on ‘compromises that strengthen us’, says Zelenskyy – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/nov/24/ukraine-russia-war-peace-talks-europe-us-trump-germany-latest-updates",
    "image": "https://media.guim.co.uk/d72d9ae86fb81986c501107d8a50b1ae102b65ca/385_231_2211_1769/500.jpg",
    "summary": "The US and Ukraine have announced an \"updated framework\" for a peace plan following discussions in Geneva over the weekend. This collaboration aims to address ongoing conflict and promote stability in the region. Details of the framework were not disclosed, but it signifies continued diplomatic efforts between the two nations.",
    "published": "2025-11-24T11:01:46Z"
  },
  {
    "title": "The ‘war on terror’ has killed millions. Trump is reviving it in Venezuela | Daniel Mendiola",
    "url": "https://www.theguardian.com/commentisfree/2025/nov/24/war-on-terror-venezuela-donald-trump",
    "image": "https://media.guim.co.uk/809bb815cb8b6849ebd754941a6e2675d3aebf43/215_0_3070_2456/500.jpg",
    "summary": "The White House is redefining its approach to counterterrorism, aiming to diminish oversight after years of controversial actions that have affected civilians. Critics argue that this move could exacerbate human rights abuses. The shift raises concerns about accountability and the potential for increased civilian suffering.",
    "published": "2025-11-24T11:00:26Z"
  }
]