[
  {
    "title": "Netanyahu says he did not agree to Palestinian state as part of Trump Gaza plan, and IDF will remain ‘in most of the territory’ – live",
    "url": "https://www.theguardian.com/world/live/2025/sep/30/netanyahu-israel-gaza-hamas-trump-peace-plan-latest-news-middle-east-crisis-live",
    "image": "https://media.guim.co.uk/7fbc4a01c269f5db73728c44b73ea6a3dc6d8f9f/306_0_3202_2563/500.jpg",
    "summary": "Israeli Prime Minister shared details of his meeting with Donald Trump in a Telegram post. Meanwhile, a senior Hamas official indicated that the group would review the proposals discussed. The interactions highlight ongoing international and regional discussions amidst the conflict.",
    "published": "2025-09-30T09:19:44Z"
  },
  {
    "title": "From World Cup halo to turmoil: why the A-League Women is at a crossroads",
    "url": "https://www.theguardian.com/football/2025/sep/30/a-league-women-australia-womens-football-moving-the-goalposts",
    "image": "https://media.guim.co.uk/2fc9d0b31627460c8ed81db488b598761e2d25f4/393_0_4096_3279/500.jpg",
    "summary": "The Matildas' success was expected to enhance the domestic football scene, but the league has now lost a team, raising concerns about the sustainability of the growth. Many are questioning whether the anticipated boom in popularity has faltered. This situation poses challenges for the future of women's football in the region.",
    "published": "2025-09-30T09:10:53Z"
  },
  {
    "title": "Streeting praises health staff from overseas and says Reform UK would be ‘disaster’ for NHS – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/30/labour-conference-starmer-speech-streeting-nhs-reform",
    "image": "https://media.guim.co.uk/fa5a663df5b3af529e35fcf6dabf92f8d8c1e1d3/271_0_6539_5231/500.jpg",
    "summary": "The Health Secretary is set to address the Labour conference, where he will unveil plans for an 'online hospital.' This initiative aims to reduce patient waiting times in the healthcare system. The proposal reflects efforts to improve access and efficiency in medical care.",
    "published": "2025-09-30T09:09:39Z"
  },
  {
    "title": "UK economy grew faster than thought in first six months of Labour government – business live",
    "url": "https://www.theguardian.com/business/live/2025/sep/30/uk-economy-grew-faster-than-thought-six-months-labour-government-markets-pound-sterling-business-live",
    "image": "https://media.guim.co.uk/9cde9912ab08e5e1fa39d144f3c2c029adc02a1a/569_0_4379_3503/500.jpg",
    "summary": "The Office for National Statistics has released updated GDP data, prompting rolling coverage of the latest economic and financial developments. Analysts are closely monitoring the implications of these statistics on economic growth and stability. The news is part of an ongoing assessment of the nation's economic performance.",
    "published": "2025-09-30T09:09:28Z"
  },
  {
    "title": "Trump’s peace proposal welcomed by world leaders but Palestinians remain sceptical",
    "url": "https://www.theguardian.com/world/2025/sep/30/trump-gaza-proposal-peace-reactions-welcomed-world-leaders-palestinian-residents-remain-sceptical",
    "image": "https://media.guim.co.uk/23ab304ddd42ef3797accbfba76638deff09fd35/273_0_2363_1890/500.jpg",
    "summary": "Arab, Islamic, and European leaders have expressed their welcoming stance towards a new peace initiative. Experts indicate that the responsibility now lies with Hamas to accept the proposed plan. The development emphasizes the ongoing geopolitical dynamics and the need for cooperation in the region.",
    "published": "2025-09-30T09:06:35Z"
  }
]