[
  {
    "title": "US Open tennis 2025: Sinner wins in four sets, Gauff and Osaka advance on day seven – live",
    "url": "https://www.theguardian.com/sport/live/2025/aug/30/us-open-tennis-2025-gauff-sinner-osaka-day-seven-live",
    "image": "https://media.guim.co.uk/8ed068ceffbfe9d884edfeb9090173a6dba5e586/70_0_4864_3891/500.jpg",
    "summary": "Katy Murrells will provide ongoing updates from the third round of the tournament at Flushing Meadows. Stay tuned for live coverage and highlights. Follow along for the latest developments.",
    "published": "2025-08-30T21:22:38Z"
  },
  {
    "title": "USA 31-31 Australia: 2025 Women’s Rugby World Cup – as it happened",
    "url": "https://www.theguardian.com/sport/live/2025/aug/30/usa-v-australia-live-2025-womens-rugby-world-cup-wallaroos-eagles-usa-vs-aus-latest-score-updates",
    "image": "https://media.guim.co.uk/6530e1e1ccef0046ea3776de8c691dcb735f39a7/876_0_4489_3592/500.jpg",
    "summary": "In a thrilling match, both the Eagles and Wallaroos each scored five tries, showcasing their competitive spirit. The intense clash helped both teams maintain their chances for a spot in the quarter-finals. The game highlighted the skill and determination of both sides as they fought for advancement.",
    "published": "2025-08-30T21:01:28Z"
  },
  {
    "title": "Australia and USA draw thriller to bring belated jeopardy to Rugby World Cup",
    "url": "https://www.theguardian.com/sport/2025/aug/30/usa-australia-womens-rugby-world-cup-match-report",
    "image": "https://media.guim.co.uk/033eef08f7146f3e56afd58dda2dd925feadec8d/399_0_3628_2903/500.jpg",
    "summary": "Australia and the USA played to a 31-31 draw in York, creating a tense finish in Pool A. The result leaves the qualification for the quarter-finals uncertain, with both teams vying for a spot. England's performance plays a crucial role in determining the final standings.",
    "published": "2025-08-30T20:57:53Z"
  },
  {
    "title": "Joy for Samoa as Harmony Vatau kicks their first World Cup points for 11 years | Andy Bull",
    "url": "https://www.theguardian.com/sport/2025/aug/30/joy-for-samoa-as-harmony-vatau-kicks-their-first-world-cup-points-for-11-years",
    "image": "https://media.guim.co.uk/41893f386ae19c848fbd7bf76dca976d6d5146e3/480_116_1857_1485/500.jpg",
    "summary": "Despite facing significant challenges, the financially struggling nation achieved the remarkable feat of reaching England. The fly half's successful penalty, even in a heavy loss to the Red Roses, made all the sacrifices worthwhile for the team. Their determination highlights the resilience and spirit of the nation in the face of adversity.",
    "published": "2025-08-30T20:06:17Z"
  },
  {
    "title": "John Mitchell demands England improve despite record World Cup win over Samoa",
    "url": "https://www.theguardian.com/sport/2025/aug/30/john-mitchell-demands-england-improve-basics-despite-record-world-cup-win-over-samoa",
    "image": "https://media.guim.co.uk/e690f17a1257a497bfb307b9f912175db65c9679/1000_0_5000_4000/500.jpg",
    "summary": "England achieved a record victory against Samoa in the Rugby World Cup, showcasing their strength on the field. Despite the impressive win, head coach John Mitchell highlighted that the team struggled with basic skills at times. This indicates room for improvement as they advance in the tournament.",
    "published": "2025-08-30T20:02:35Z"
  }
]