[
  {
    "title": "Formula One: Qatar Grand Prix qualifying after Piastri wins sprint race – live",
    "url": "https://www.theguardian.com/sport/live/2025/nov/29/formula-one-qatar-sprint-race-grand-prix-qualifying-live-updates",
    "image": "https://media.guim.co.uk/152305a7342515c00c83f34126e279acc2ce26de/563_0_3655_2925/500.jpg",
    "summary": "A dramatic final round in Las Vegas has raised questions about who will step up to take the lead. Philip Cornwall provides insights on the situation. Stay tuned for updates on the unfolding events.",
    "published": "2025-11-29T19:14:48Z"
  },
  {
    "title": "England v China: women’s friendly football international – live",
    "url": "https://www.theguardian.com/football/live/2025/nov/29/england-v-china-womens-friendly-football-international-live",
    "image": "https://media.guim.co.uk/9bee4bafdc66cdc5284fb9f937c1f66c6dfe20d0/1035_207_4431_3546/500.jpg",
    "summary": "In a live report, Sarah Rendell discusses the matchup between Sarina Wiegman's team and China, following Wiegman's side's recent victory over Australia. The focus is on whether the team can maintain their momentum or if China will deliver an unexpected outcome. Excitement builds as the game unfolds.",
    "published": "2025-11-29T19:14:27Z"
  },
  {
    "title": "Tottenham v Fulham: Premier League – live",
    "url": "https://www.theguardian.com/football/live/2025/nov/29/tottenham-v-fulham-premier-league-live",
    "image": "https://media.guim.co.uk/5d5d5939007dcdb90bad4dffb2580db9853d0a2f/1835_520_3519_2815/500.jpg",
    "summary": "In a minute-by-minute report, Scott Murray covers the matchup between Thomas Frank's Spurs and Marco Silva's team, focusing on whether Spurs can recover from two consecutive defeats. The article highlights the potential for increased pressure on Frank if his team struggles further. The outcome of the game is critical for both teams' morale and standings.",
    "published": "2025-11-29T19:14:01Z"
  },
  {
    "title": "Everton v Newcastle: Premier League – live",
    "url": "https://www.theguardian.com/football/live/2025/nov/29/everton-v-newcastle-premier-league-live",
    "image": "https://media.guim.co.uk/dc82c0747e4617a525e942a0625f86e1479f6731/538_340_2841_2273/500.jpg",
    "summary": "David Moyes' team aims to extend their winning streak while facing Eddie Howe's Newcastle, who are looking to rebound from a recent loss in Marseille. The match promises excitement as both teams vie for crucial points. Rob Smyth provides a detailed minute-by-minute report on the action.",
    "published": "2025-11-29T19:13:45Z"
  },
  {
    "title": "Strictly Come Dancing: week 10 – live",
    "url": "https://www.theguardian.com/tv-and-radio/live/2025/nov/29/strictly-come-dancing-week-10-live",
    "image": "https://media.guim.co.uk/5a28522e7f74e6e68d8798508147cd93c12b0c6e/0_311_2841_2271/500.jpg",
    "summary": "The couples at Elstree Studios take on the first-ever Instant Dance challenge featuring music from Lady Gaga, Frank Sinatra, and Tina Turner. Participants will showcase their dance routines in a high-stakes competition. The quest is on to see who will emerge as the standout performer of the night.",
    "published": "2025-11-29T19:12:47Z"
  }
]