[
  {
    "title": "Conservative supreme court justices appear skeptical of key provision of Voting Rights Act – live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/15/donald-trump-federal-government-shutdown-redistricting-voting-rights-act-kash-patel-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/27fea511a7ff897118d15cf9f069bf03d3060207/308_0_4276_3420/500.jpg",
    "summary": "Conservative justices are showing sympathy towards claims that Louisiana's newly drawn congressional maps, which include a majority-Black district, may be unconstitutional. The discussions suggest concerns about potential racial gerrymandering. The outcome could impact the representation of Black voters in Louisiana.",
    "published": "2025-10-15T17:17:25Z"
  },
  {
    "title": "Starmer only read China spy witness statements this morning, No 10 says, as Cleverly accuses PM of misquoting him – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/oct/15/keir-starmer-kemi-badenoch-pmqs-china-epping-rachel-reeves-imf-uk-politics-live-news-updates",
    "image": "https://media.guim.co.uk/a608a7b4df8b74e5e5689af8fcf6ce3ca013b47a/370_350_2283_1826/500.jpg",
    "summary": "The Prime Minister plans to release complete statements related to a specific case and attributes its failure to the actions of the previous government. He emphasizes accountability and transparency in handling the situation. This move marks a significant stance against past administration decisions.",
    "published": "2025-10-15T17:16:58Z"
  },
  {
    "title": "English councils to remain poorer than in 2010 despite funding rise, says report",
    "url": "https://www.theguardian.com/society/2025/oct/15/english-councils-to-remain-poorer-than-2010-despite-funding-boost-says-report",
    "image": "https://media.guim.co.uk/43377c3e3630a77bb622c03f9cb81368af080629/676_0_6781_5425/500.jpg",
    "summary": "A recent analysis reveals that the effects of austerity measures cannot be reversed by the current parliament, even with increased funding that exceeds inflation rates. The findings suggest that the long-term consequences of fiscal tightening remain significant. As a result, any potential recovery efforts may fall short of addressing the underlying issues caused by austerity.",
    "published": "2025-10-15T17:06:00Z"
  },
  {
    "title": "Outcry after US strips visas from six foreigners over Charlie Kirk remarks",
    "url": "https://www.theguardian.com/us-news/2025/oct/15/us-visas-charlie-kirk-reaction",
    "image": "https://media.guim.co.uk/0b06962b66732e21313d656436c2208bb5434c2f/306_0_2501_2000/500.jpg",
    "summary": "A government-wide initiative is intensifying to suppress criticism directed at a prominent rightwing influencer. This effort includes a series of cancellations aimed at silencing dissenting voices. The actions highlight rising tensions over free speech and political discourse.",
    "published": "2025-10-15T17:03:59Z"
  },
  {
    "title": "Who’s to blame for the NHS’s blame culture? | Letters",
    "url": "https://www.theguardian.com/society/2025/oct/15/whos-to-blame-for-the-nhs-blame-culture",
    "image": "https://media.guim.co.uk/bbfe4c16f198100803d14cf85d5189ae35da4149/821_0_6144_4915/500.jpg",
    "summary": "In a letter to the editor, Dr. David Zigmond, Dr. Richard Sloan, Dr. Eric Watts, and Dr. Ian Freeman respond to former Health Secretary Jeremy Hunt's article, addressing key issues raised. Their responses highlight differing perspectives on health policy and its implications. The letter emphasizes the need for ongoing dialogue in the healthcare sector.",
    "published": "2025-10-15T17:01:03Z"
  }
]