[
  {
    "title": "Ryder Cup 2025: USA 1-3 Europe after day-one foursomes – live updates",
    "url": "https://www.theguardian.com/sport/live/2025/sep/26/ryder-cup-2025-day-one-golf-europe-usa-bethpage-black-live",
    "image": "https://media.guim.co.uk/a0a3e0a101c2a89ff757822aa37f1fa8566e72d9/144_0_4335_3469/500.jpg",
    "summary": "Europe begins their title defense at Bethpage Black with a strong performance. Live updates provide hole-by-hole coverage of the event. Join the writers for ongoing insights and updates.",
    "published": "2025-09-26T18:22:36Z"
  },
  {
    "title": "Labour restores whip to two more child benefit cap rebels",
    "url": "https://www.theguardian.com/politics/2025/sep/26/labour-restores-whip-to-two-more-child-benefit-cap-rebels",
    "image": "https://media.guim.co.uk/1c42f0f34ead640b0ea324053de5927c8491a16a/0_0_5000_4000/500.jpg",
    "summary": "John McDonnell and Apsana Begum are among the last individuals still suspended from the Labour Party due to their involvement in a rebellion in July 2024. The suspensions reflect ongoing tensions within the party following the rebellion. Their cases remain under review as party leadership considers reinstatement options.",
    "published": "2025-09-26T18:16:20Z"
  },
  {
    "title": "Donald Trump’s Ryder Cup visit results in fans missing early action due to tight security",
    "url": "https://www.theguardian.com/sport/2025/sep/26/donald-trump-ryder-cup-visit-fans-miss-early-action-tight-security-golf",
    "image": "https://media.guim.co.uk/5f0471def3d9f2143e27b10b06a72573713d9e4b/1049_70_4312_3450/500.jpg",
    "summary": "Donald Trump's presence at Bethpage Black in New York caused significant delays, leading to long queues for both spectators and staff. Many people were affected by the congestion on the course. The high-profile appearance drew considerable attention and disrupted the usual flow of events.",
    "published": "2025-09-26T18:10:36Z"
  },
  {
    "title": "Assata Shakur, an icon of Black liberation who was exiled to Cuba, dies aged 78",
    "url": "https://www.theguardian.com/us-news/2025/sep/26/assata-shakur-dies-aged-78",
    "image": "https://media.guim.co.uk/2aa53ca99c100710ee62afcdc23cf53c200e8529/29_870_1412_1130/500.jpg",
    "summary": "Shakur fled the U.S. after being convicted in 1977 for the murder of a state trooper and escaped from prison. For decades, she lived in exile, mainly in Cuba. Her case has drawn significant attention and debate regarding justice and political asylum.",
    "published": "2025-09-26T18:09:54Z"
  },
  {
    "title": "With the Donald’s golfing tips, surely the USA can’t fail to win this Ryder Cup bigly",
    "url": "https://www.theguardian.com/sport/2025/sep/26/with-the-donalds-golfing-tips-surely-the-usa-cant-fail-to-win-this-ryder-cup-bigly",
    "image": "https://media.guim.co.uk/2e3e907e9444dd9b3eead03d8ac9bb79a5e74c66/379_0_3794_3035/500.jpg",
    "summary": "President Donald Trump sidestepped the transportation issues at Bethpage Black. He expressed confidence in overcoming challenges despite his US team's poor performance. Trump's commitment to \"get it done\" reflects his determination to rally support amidst the difficulties.",
    "published": "2025-09-26T18:09:33Z"
  }
]