[
  {
    "title": "TV tonight: the end of an era for the most controversial cookery show",
    "url": "https://www.theguardian.com/tv-and-radio/2025/sep/26/tv-tonight-the-end-of-an-era-for-the-most-controversial-cookery-show",
    "image": "https://media.guim.co.uk/15fe1e1f712bf58a2bb2498562b8fd79a996c0b4/384_67_2839_2272/500.jpg",
    "summary": "The Masterchef final features Gregg Wallace and John Torode as they conclude the season. Viewers can also enjoy some entertaining media antics with The Paper. Tune in this evening for an exciting lineup!",
    "published": "2025-09-26T05:15:57Z"
  },
  {
    "title": "Australia news live: Trump tariff announcement wipes $1bn from CSL value",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/26/australia-news-live-afl-grand-final-could-spread-queensland-measles-outbreak-albanese-heads-for-uk-talks-ntwnfb",
    "image": "https://media.guim.co.uk/23e55ca4616555f8a28f0a45f5756218c8b4a134/1277_0_6385_5108/500.jpg",
    "summary": "I apologize, but I need more context or information to summarize the news you are referring to. Could you please provide additional details or specify the topic?",
    "published": "2025-09-26T05:01:28Z"
  },
  {
    "title": "Volume of US YouTube shows ‘weakens UK children’s ties to their own culture’",
    "url": "https://www.theguardian.com/tv-and-radio/2025/sep/26/volume-of-us-youtube-shows-weakens-uk-childrens-ties-to-their-own-culture",
    "image": "https://media.guim.co.uk/e48dbd8abdd7a0eccefb368460613e49b9142668/770_0_2064_1652/500.jpg",
    "summary": "The head of children's TV at BBC has criticized YouTube's algorithm for directing children primarily towards US-based content instead of UK programming. This trend potentially undermines local content and cultural relevance for young viewers in the UK. The statement highlights concerns over global platforms influencing children's media consumption.",
    "published": "2025-09-26T05:00:59Z"
  },
  {
    "title": "‘History will remember who showed up’: Keir Starmer faces call to attend Cop30 summit",
    "url": "https://www.theguardian.com/environment/2025/sep/26/keir-starmer-faces-call-to-attend-cop30-summit",
    "image": "https://media.guim.co.uk/69c2444171bc9fbaa219854940dd54aae0e24890/740_0_5733_4587/500.jpg",
    "summary": "Leaders and influential climate figures have reacted after Prime Minister's aides suggested avoiding attendance at an event due to fears that the Reform party might launch attacks against him. This response highlights the tension between political strategies and engagement in climate discussions. The situation underscores the challenges faced by leaders in addressing environmental issues while navigating political pressures.",
    "published": "2025-09-26T05:00:59Z"
  },
  {
    "title": "Weatherwatch: EU survey gives a few hints on voter-friendly climate policies",
    "url": "https://www.theguardian.com/news/2025/sep/26/weatherwatch-eu-survey-gives-a-few-hints-on-voter-friendly-climate-policies",
    "image": "https://media.guim.co.uk/871401889f737ceba60ab11170e08d83126e18d6/517_0_4166_3333/500.jpg",
    "summary": "A recent survey indicates that 70% of respondents favor a rail fund that would reduce fares. However, proposals for taxes on beef and air travel received lower support among the public. The findings highlight differing priorities regarding transportation funding and environmental initiatives.",
    "published": "2025-09-26T05:00:58Z"
  }
]