[
  {
    "title": "China’s trade surplus hits $1tn for first time despite Trump’s tariffs – business live",
    "url": "https://www.theguardian.com/business/live/2025/dec/08/china-trade-surplus-trump-tariffs-stock-market-ftse-pound-business-live-latest-news",
    "image": "https://media.guim.co.uk/a8a8e884064b63796db597744e3dfe86e6aa72a1/166_0_2880_2304/500.jpg",
    "summary": "China's exports exceeded expectations in November, fueled by a significant increase in shipments to markets outside the United States. This surge highlights China's expanding trade relationships with countries beyond its largest trading partner. The positive trade data signals resilience in China's economy amid global economic uncertainties.",
    "published": "2025-12-08T07:22:39Z"
  },
  {
    "title": "Can you solve it? The forgotten Dutch invention that created the modern world",
    "url": "https://www.theguardian.com/science/2025/dec/08/can-you-solve-it-the-forgotten-dutch-invention-that-created-the-modern-world",
    "image": "https://media.guim.co.uk/fe61d9b826df170af1c53a244fb7f1adcbc2341e/0_0_4687_3750/500.jpg",
    "summary": "Of course! Please provide the news details you would like summarized, and I'll help you with that.",
    "published": "2025-12-08T07:10:43Z"
  },
  {
    "title": "Ex-Honduran president thanks God – and Trump – for drug-trafficking pardon",
    "url": "https://www.theguardian.com/us-news/2025/dec/08/ex-honduran-president-juan-orlando-hernandez-trump-pardon",
    "image": "https://media.guim.co.uk/72e9ade939f04083d035e2d536337aa56c75e415/188_0_1433_1147/500.jpg",
    "summary": "Juan Orlando Hernández expressed gratitude to God for his freedom and thanked former President Trump for significantly impacting his life. His remarks highlight the political and personal transformations he experienced during his leadership. Hernández's statement comes in the context of his recent legal challenges and subsequent release.",
    "published": "2025-12-08T07:00:46Z"
  },
  {
    "title": "Seizure of South Yemen by UAE-backed forces could lead to independence claim",
    "url": "https://www.theguardian.com/world/2025/dec/08/seizure-south-yemen-uae-backed-forces-could-lead-independence-claim",
    "image": "https://media.guim.co.uk/ca72b39cd0f47810d7fb982f98e5c56a4eb07b12/278_0_3351_2681/500.jpg",
    "summary": "STC troops have gained control over all eight governorates in a significant development. This advancement represents a major setback for Saudi Arabia, a regional rival of the United Arab Emirates. The shift in control highlights the changing dynamics in the region.",
    "published": "2025-12-08T07:00:46Z"
  },
  {
    "title": "Local authorities in England and Wales warn finances at ‘breaking point’",
    "url": "https://www.theguardian.com/society/2025/dec/08/local-authorities-england-and-wales-warn-finances-breaking-point",
    "image": "https://media.guim.co.uk/7b889b9e9e5e37c0ecbb711e88e947cf53b3e268/88_0_4352_3481/500.jpg",
    "summary": "Many councils are anticipating bankruptcy due to uncertainty surrounding future government funding. This financial strain could lead to severe impacts on local services and budgets. As councils brace for potential financial crises, the situation remains tense and precarious.",
    "published": "2025-12-08T07:00:45Z"
  }
]