[
  {
    "title": "Trump says all trade negotiations with Canada ‘terminated’ over an anti-tariff advertising campaign – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/24/donald-trump-trade-negotiations-canada-mark-carney-terminated-tariff-letitia-james-new-york-us-politics-live-news",
    "image": "https://media.guim.co.uk/47d1344ad043ca49c696490a8a5dde76db550753/830_0_6388_5111/500.jpg",
    "summary": "The US president terminated negotiations in response to an advertisement featuring Ronald Reagan criticizing tariffs. This move highlights ongoing tensions regarding trade policies. The decision reflects the administration's sensitivity to public sentiment and historic figures in political discourse.",
    "published": "2025-10-24T10:22:09Z"
  },
  {
    "title": "WHO says aid situation in Gaza ‘remains catastrophic’ despite ceasefire – Middle East live ",
    "url": "https://www.theguardian.com/world/live/2025/oct/24/aid-gaza-israel-palestine-benjamin-netanyahu-hamas-ceasefire-west-bank-middle-east-live-news",
    "image": "https://media.guim.co.uk/65b514a7e3d0cd5c5d90471c266ac6d1f10b2907/0_0_5600_4480/500.jpg",
    "summary": "The WHO's Director General announced that aid flow into Gaza has seen minimal improvement despite the ongoing ceasefire. This situation highlights the continued humanitarian challenges faced by the region. The statement underscores the need for increased support and resources to address the crisis effectively.",
    "published": "2025-10-24T10:20:12Z"
  },
  {
    "title": "Rashford wants Barcelona stay, Benítez in at Panathinaikos, Premier League news: football – live",
    "url": "https://www.theguardian.com/football/live/2025/oct/24/premier-league-news-europa-league-reaction-and-more-weekend-football-countdown-live",
    "image": "https://media.guim.co.uk/3067e62d3fcbc32c11c5ddf85324d0a6ae653248/142_0_3290_2632/500.jpg",
    "summary": "A team of writers is set to cover an action-packed weekend of football across various leagues. They will provide updates and insights as matches unfold. Fans can follow along for real-time reports and analysis.",
    "published": "2025-10-24T10:19:55Z"
  },
  {
    "title": "Bank of England finance chief Afua Kyei tops list of influential black Britons",
    "url": "https://www.theguardian.com/world/2025/oct/24/bank-of-england-finance-chief-afua-kyei-tops-list-of-influential-black-britons",
    "image": "https://media.guim.co.uk/812c9c304489ff972d3321bb550905137c60a8f9/0_23_520_416/500.jpg",
    "summary": "Kyei has been highlighted as a leading figure in a new power list that celebrates Black role models across various sectors, including business, science, technology, and the arts. This initiative aims to recognize and promote the achievements of Black professionals. The list serves as an inspiration for future generations, showcasing the impact of diversity and representation.",
    "published": "2025-10-24T10:14:52Z"
  },
  {
    "title": "Who’s Afraid of Virginia Woolf? review – carnage in New Carthage as couples fight, flirt, booze and bruise",
    "url": "https://www.theguardian.com/stage/2025/oct/24/whos-afraid-of-virginia-woolf-review-curve-theatre-leicester-albee-cathy-tyson",
    "image": "https://media.guim.co.uk/c8438abfc3e9f7bb3edf4257d95acdc52af8ae6a/496_160_3979_3183/500.jpg",
    "summary": "Cathy Tyson and Patrick Robinson deliver standout performances in a powerful production of Edward Albee's intense play. The work features sharp, misogynistic dialogue and explores themes of damaged identities. The production captivates audiences with its raw emotional depth.",
    "published": "2025-10-24T10:08:11Z"
  }
]