[
  {
    "title": "Strictly Come Dancing: week three – live",
    "url": "https://www.theguardian.com/tv-and-radio/live/2025/oct/11/strictly-come-dancing-week-three-live",
    "image": "https://media.guim.co.uk/9c81fe7a1bcb926f848a5f93e8bcaa9d407ee22f/254_0_3485_2788/500.jpg",
    "summary": "During Movie Week, stars will dance to music from films like Miss Congeniality, James Bond, K-Pop Demon Hunters, and Mary Poppins. The competition will reveal which performances shine and which falter. Viewers are left wondering who will achieve success and strike box office gold.",
    "published": "2025-10-11T20:18:05Z"
  },
  {
    "title": "Portugal v Republic of Ireland, Spain v Georgia: World Cup 2026 qualifying – live",
    "url": "https://www.theguardian.com/football/live/2025/oct/11/portugal-v-republic-of-ireland-spain-v-georgia-world-cup-2026-qualifying-live",
    "image": "https://media.guim.co.uk/ec7ad6b5077d725451e7c962470c4d09fe8bd5c4/566_0_3713_2970/500.jpg",
    "summary": "John Brewin will provide live goal updates from across Europe as teams compete for a place in next year's tournament. Fans can stay informed on the latest scores and developments. Tune in for real-time coverage of these crucial matches.",
    "published": "2025-10-11T20:15:33Z"
  },
  {
    "title": "More than 500,000 people return to Gaza City amid ceasefire, as Steve Witkoff addresses Tel Aviv crowd – live",
    "url": "https://www.theguardian.com/world/live/2025/oct/11/israel-gaza-ceasefire-hamas-hostages-netanyahu-trump-middle-east-latest-news-updates",
    "image": "https://media.guim.co.uk/373bb91e694a157d575f69e59bb39001116b511f/704_0_6250_5000/500.jpg",
    "summary": "Palestinians returning home face devastation as they assess the aftermath of conflict. U.S. special envoy visits Hostages Square in Israel, accompanied by Jared Kushner and Ivanka Trump. The visit highlights ongoing tensions and humanitarian issues in the region.",
    "published": "2025-10-11T20:08:43Z"
  },
  {
    "title": "Rangers could turn to Röhl after Steven Gerrard rules out return as manager",
    "url": "https://www.theguardian.com/football/2025/oct/11/rangers-could-turn-to-danny-rohl-after-steven-gerrard-rules-out-return-as-manager",
    "image": "https://media.guim.co.uk/d6d99cd52bfee9b6651f2efbfd33ba78d3c2f60e/594_0_4350_3481/500.jpg",
    "summary": "Steven Gerrard has decided to halt discussions regarding his potential return as manager of Rangers. The club may now consider Danny Röhl as a possible candidate for the position. This development leaves Rangers searching for new leadership after Gerrard's withdrawal.",
    "published": "2025-10-11T20:02:45Z"
  },
  {
    "title": "Trump says military members will be paid despite government shutdown",
    "url": "https://www.theguardian.com/us-news/2025/oct/11/trump-shutdown-military-pay",
    "image": "https://media.guim.co.uk/ee44816f3936ce5e6f2f15fcd261554e2048c339/683_0_6827_5464/500.jpg",
    "summary": "The President announced he has identified a method to secure funding for troops' payments. He has instructed the Secretary of Defense to release the necessary funds by October 15. This move aims to ensure timely compensation for military personnel.",
    "published": "2025-10-11T19:53:26Z"
  }
]