[
  {
    "title": "NFL on Thanksgiving: Lions v Packers updates before Cowboys v Chiefs – live",
    "url": "https://www.theguardian.com/sport/live/2025/nov/27/nfl-on-thanksgiving-lions-v-packers-updates-cowboys-v-chiefs-live",
    "image": "https://media.guim.co.uk/b20874e40bf2e2b3a654249285a8f10364f446ad/692_0_4983_3987/500.jpg",
    "summary": "Graham Searles will host a special double-header event on Thanksgiving to kick off week 13 of the season. The games promise exciting matchups for football fans. Don't miss the action as the holiday festivities begin!",
    "published": "2025-11-27T18:25:54Z"
  },
  {
    "title": "Washington DC national guard shooting: what we know so far",
    "url": "https://www.theguardian.com/us-news/2025/nov/27/washington-dc-national-guard-shooting-what-we-know-so-far",
    "image": "https://media.guim.co.uk/8764df763209ab4c37028d75025c9b26f9cbffeb/0_0_3395_2718/500.jpg",
    "summary": "On Wednesday, Rahmanullah Lakanwal opened fire on troop members, injuring Sarah Beckstrom and Andrew Wolfe. The incident is under investigation as authorities assess the circumstances surrounding the shooting. Further details about the event and the motives of Lakanwal have yet to be released.",
    "published": "2025-11-27T18:24:12Z"
  },
  {
    "title": "The 20+ best US Black Friday tech deals on TVs, tablets, phones, smart watches and more",
    "url": "https://www.theguardian.com/thefilter-us/2025/nov/19/best-black-friday-cyber-monday-tech-deals",
    "image": "https://media.guim.co.uk/43eaf26d6c93bd98601a0c78042b6df5258e1244/1_0_5998_4800/500.jpg",
    "summary": "Major tech brands like Apple, Samsung, and Google are offering discounts on a wide range of gadgets, including smartphones, TVs, smart-home cameras, and headphones. These sales present an opportunity for consumers to purchase popular electronics at reduced prices. The promotions are available now, inviting shoppers to take advantage of the deals.",
    "published": "2025-11-27T18:20:50Z"
  },
  {
    "title": "Putin says US peace plan could form basis for end to Ukraine war – as it happened",
    "url": "https://www.theguardian.com/world/live/2025/nov/27/russia-ukraine-war-peace-deal-eu-europe-latest-news-updates",
    "image": "https://media.guim.co.uk/562448be5b4cb6c2f4eaba964dfdd1302eee3c80/916_0_4584_3666/500.jpg",
    "summary": "Russian President Vladimir Putin reiterated his call for the international community to acknowledge Russia's territorial gains in Ukraine. He emphasized that this recognition is a critical demand for Russia. The stance represents a significant point of contention, marking a clear red line for Ukraine.",
    "published": "2025-11-27T18:16:15Z"
  },
  {
    "title": "Ministers face calls to explain how £6bn Send funding hole will be paid for",
    "url": "https://www.theguardian.com/education/2025/nov/27/ministers-face-calls-to-explain-how-6bn-send-funding-hole-will-be-paid-for",
    "image": "https://media.guim.co.uk/a5361700d2192d0f159bcd47a49dd3ba4616d5a3/911_0_4529_3624/500.jpg",
    "summary": "Bridget Phillipson has assured MPs that the costs associated with Special Educational Needs and Disabilities (SEND) will not impact core school funding. Instead, these expenses will be covered by the government's budget. This commitment aims to alleviate concerns regarding financial strain on regular school resources.",
    "published": "2025-11-27T18:16:11Z"
  }
]