[
  {
    "title": "Rafah crossing to stay closed, Israel says, affecting aid after Hamas failed to hand over bodies of hostages – Gaza ceasefire live",
    "url": "https://www.theguardian.com/world/live/2025/oct/14/gaza-ceasefire-israel-hamas-palestine-hostages-detainees-truce-live-news-updates",
    "image": "https://media.guim.co.uk/b911994cfbf7f44c97869341e06f2dc62d4b1759/794_0_4680_3744/500.jpg",
    "summary": "The Israeli defense minister stated that the ongoing delay in the return of bodies constitutes a breach of the ceasefire agreement. He emphasized that such actions undermine peace efforts. The remarks highlight escalating tensions amid the conflict.",
    "published": "2025-10-14T14:19:51Z"
  },
  {
    "title": "UK economy at risk of ‘bumpy landing’; JP Morgan’s Dimon warns of ‘more cockroaches’ after collapse of First Brands and Tricolor – business live",
    "url": "https://www.theguardian.com/business/live/2025/oct/14/us-treasury-secretary-beijing-rare-earths-us-china-port-fees-imf-tariffs-business-live-news",
    "image": "https://media.guim.co.uk/1b2a96f686428c9005a81e801fc781ce35e56b97/419_0_6830_5464/500.jpg",
    "summary": "The latest economic and financial news highlights significant market fluctuations, with investors reacting to changing interest rates and inflation data. Key sectors are experiencing volatility, leading to varied forecasts for economic growth. Analysts are closely monitoring global events that could impact financial stability.",
    "published": "2025-10-14T14:17:39Z"
  },
  {
    "title": "Starmer says he expects debate about ‘full horror’ of what happened in Gaza when media allowed in – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/oct/14/keir-starmer-china-national-security-spying-gaza-nigel-farage-uk-politics-live-news-updates",
    "image": "https://media.guim.co.uk/a62e2bee5a65addf5e2afa8e22f90a0f32212ab2/388_2_1151_921/500.jpg",
    "summary": "Prime Minister praises Trump's role in facilitating a Middle East peace deal but emphasizes that the focus must now shift to its effective implementation. He asserts that practical steps are essential for achieving lasting peace in the region. The Prime Minister underscores the importance of collaboration among all parties involved.",
    "published": "2025-10-14T14:16:30Z"
  },
  {
    "title": "US shares risk ‘sharp correction’ but markets seem complacent, IMF warns",
    "url": "https://www.theguardian.com/business/2025/oct/14/us-shares-correction-markets-imf-bonds",
    "image": "https://media.guim.co.uk/bcba079c5f476d1235d4c3c7845e549a90c88ffe/101_0_5710_4568/500.jpg",
    "summary": "The Global Financial Stability Report highlights growing strains in government bond markets, raising concerns about financial stability. Increased pressures are attributed to changing economic conditions and rising interest rates. Investors are urged to closely monitor these developments to assess potential risks.",
    "published": "2025-10-14T14:15:42Z"
  },
  {
    "title": "Boots: the Netflix sleeper hit that’s a stunning indictment of military homophobia",
    "url": "https://www.theguardian.com/tv-and-radio/2025/oct/14/boots-netflix-homophobia-military-greg-cope-white-pink-marine",
    "image": "https://media.guim.co.uk/31878a03db0a0976c7666407b20ae62d09573a3d/682_173_2034_1627/500.jpg",
    "summary": "The news highlights a powerful film that addresses the treatment of homosexuality among US marines, generating significant buzz. However, it introduces an unexpected shift with a bizarre food fight scene, veering into a comedic tone reminiscent of \"Orange Is the New Black.\" This juxtaposition has left audiences questioning its overall direction and themes.",
    "published": "2025-10-14T14:11:33Z"
  }
]