[
  {
    "title": "Surrey v Warwickshire, Somerset v Yorkshire and more: county cricket – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/10/surrey-v-warwickshire-somerset-v-yorkshire-and-more-county-cricket-live",
    "image": "https://media.guim.co.uk/f0ff7d69f121d19d04ce8d7c69d556f5c26cbf89/707_0_2685_2149/500.jpg",
    "summary": "Tanya Alfred provides important updates from day three of the County Championship, focusing on matches taking place at Lord's and the Oval. The coverage highlights key performances and developments in the ongoing games. Stay tuned for more insights on the tournament's progress.",
    "published": "2025-09-10T14:36:16Z"
  },
  {
    "title": "Kamala Harris calls Joe Biden’s choice to run for 2024 re-election ‘reckless’ in new book – live updates",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/10/donald-trump-jeffrey-epstein-tariffs-immigration-crime-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/89519a6037be3e1c43ea0cd9a4652037d193a748/667_0_3333_2667/500.jpg",
    "summary": "In a recent excerpt from a new book, former Vice President critiques President Biden's decision to seek re-election, suggesting it reflects personal ego rather than collective necessity. He argues that such choices should not be based solely on individual desires. This commentary adds fuel to ongoing discussions about Biden's leadership and candidacy.",
    "published": "2025-09-10T14:36:06Z"
  },
  {
    "title": "National Gallery accused of risking ‘bad blood’ with Tate over 20th-century art",
    "url": "https://www.theguardian.com/artanddesign/2025/sep/10/national-gallery-accused-of-risking-bad-blood-with-tate-over-20th-century-art",
    "image": "https://media.guim.co.uk/60f39eb13acf10bca8211569353fe261b5718d2a/0_1330_3911_3129/500.jpg",
    "summary": "The decision to collect \"modern\" art has led to concerns that two galleries might compete fiercely against each other. However, some art community members view the initiative positively, seeing potential for growth and innovation. The differing opinions highlight a divide in how such acquisitions could impact the art scene.",
    "published": "2025-09-10T14:33:17Z"
  },
  {
    "title": "Trump reportedly asks EU to levy 100% tariffs on India and China; Ozempic maker Novo to cut 9,000 jobs – as it happened",
    "url": "https://www.theguardian.com/business/live/2025/sep/10/trade-tariffs-eu-trump-ozempic-novo-jobs-markets-business-live-news",
    "image": "https://media.guim.co.uk/a22500b598bb72689541af622cd81fac33541b21/345_0_3452_2761/500.jpg",
    "summary": "U.S. President Biden is seeking to increase pressure on Russia to bring an end to the ongoing war in Ukraine. He aims to bolster support for Ukraine through enhanced military and economic aid. The strategy includes rallying international allies to take a stronger stance against Russian aggression.",
    "published": "2025-09-10T14:32:02Z"
  },
  {
    "title": "Wegovy maker Novo Nordisk to cut 9,000 jobs amid increased competition",
    "url": "https://www.theguardian.com/business/2025/sep/10/ozempic-maker-novo-nordisk-to-cut-9000-jobs-amid-increased-competition",
    "image": "https://media.guim.co.uk/b411c032ef3eb3f2a9d059078898b5fd7d4d7e05/0_0_2670_2137/500.jpg",
    "summary": "Danish pharmaceutical company developing weight-loss and diabetes medications is facing increased competition from US rival Eli Lilly. Eli Lilly's advancements in drug development are putting pressure on the Danish firm. This competition could impact market dynamics and sales for both companies.",
    "published": "2025-09-10T14:31:00Z"
  }
]