[
  {
    "title": "News live: Australian doctor joins Gaza flotilla; Marles ‘confident’ about future of US relationship",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/26/australia-news-live-afl-grand-final-could-spread-queensland-measles-outbreak-albanese-heads-for-uk-talks-ntwnfb",
    "image": "https://media.guim.co.uk/fa0d945202c8bbb7b6388d5d30ac3395aabfc2a0/792_0_4560_3648/500.jpg",
    "summary": "Please provide the news article or details you'd like me to summarize, and I'll be happy to help!",
    "published": "2025-09-26T01:24:21Z"
  },
  {
    "title": "Trump celebrates indictment of former FBI director James Comey: ‘Justice in America’ – live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/25/donald-trump-james-comey-fbi-ice-texas-latest-us-politics-news-updates-live",
    "image": "https://media.guim.co.uk/b3db41a23b873fec6659df36a1379b3cdc6a23e1/0_0_3000_2400/500.jpg",
    "summary": "President criticizes former FBI Director James Comey, labeling him as \"one of the worst human beings\" following his indictment by a federal grand jury on two counts. The indictment adds to the ongoing tensions surrounding Comey's controversial tenure and actions while in office. This development has sparked renewed debates over accountability and justice within the political landscape.",
    "published": "2025-09-26T01:24:11Z"
  },
  {
    "title": "Timed to perfection: Patrick Dangerfield can cement legacy and power Cats to AFL grand final glory | Jonathan Horn",
    "url": "https://www.theguardian.com/sport/blog/2025/sep/26/afl-2025-grand-final-patrick-dangerfield-legacy-geelong-cats-glory",
    "image": "https://media.guim.co.uk/298c9249cf1970877bba200c396301f5e6d21235/0_836_2500_1997/500.jpg",
    "summary": "Geelong's recent success has facilitated the management of their veteran player in his final years. This strategic approach positions the team to capitalize on his experience. As a result, they are well-prepared to benefit from his contributions at a crucial time.",
    "published": "2025-09-26T01:00:52Z"
  },
  {
    "title": "Ex-FBI director James Comey indicted on two charges as Trump pushes to prosecute political enemies",
    "url": "https://www.theguardian.com/us-news/2025/sep/25/james-comey-fbi-director-indictment",
    "image": "https://media.guim.co.uk/0631ddd3b2ed282013f109f7a835197fd8991bb2/1616_265_3188_2550/500.jpg",
    "summary": "James Comey, the former FBI director frequently criticized by Donald Trump, has been indicted on charges of making false statements and obstruction of justice. The indictment adds to the ongoing scrutiny surrounding Comey's actions during his tenure. This development marks a significant moment in the political landscape, intensifying debates over justice and accountability.",
    "published": "2025-09-26T00:19:33Z"
  },
  {
    "title": "Civilian injuries in Gaza similar to those of soldiers in war zones, study finds",
    "url": "https://www.theguardian.com/world/2025/sep/25/civilian-injuries-gaza-combat-soldiers-study",
    "image": "https://media.guim.co.uk/76f28dfdb3bb496cdccc9901715590e4b82876c7/509_0_5600_4480/500.jpg",
    "summary": "Wounds like burns and leg injuries are reportedly more prevalent in Gaza compared to injuries sustained by US soldiers during their deployments in Iraq and Afghanistan. This highlights the severe conditions faced by civilians in conflict zones. The comparison underscores the intense and often brutal realities of life in Gaza amidst ongoing violence.",
    "published": "2025-09-26T00:16:53Z"
  }
]