[
  {
    "title": "England v Bangladesh: Women’s Cricket World Cup match heading for tense finish – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/07/england-v-bangladesh-womens-cricket-world-cup-live",
    "image": "https://media.guim.co.uk/9a3db9c8f23a04f8d9571160846dd53fe3979765/0_0_2833_2266/500.jpg",
    "summary": "Nat Sciver-Brunt's team aims to capitalize on their recent dominant victory against South Africa. The over-by-over report will provide ongoing updates from the match. Join the writers for live commentary and insights.",
    "published": "2025-10-07T15:20:40Z"
  },
  {
    "title": "Pam Bondi spars with Democratic senator over Epstein ‘client list’ and national guard deployments in tense hearing – live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/07/donald-trump-national-guard-pam-bondi-mark-carney-government-shutdown-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/de6426e93a01b83337d36da9b73f1b82c59486bd/447_0_4583_3667/500.jpg",
    "summary": "Illinois Senator Dick Durbin questioned Trump’s Attorney General about the Epstein investigation during a Senate hearing. In response to concerns about violence in Chicago, Attorney General Pam Bondi stated that the National Guard is on the way to assist. The exchange highlights ongoing issues surrounding both the Epstein case and public safety in Chicago.",
    "published": "2025-10-07T15:19:51Z"
  },
  {
    "title": "Far-right National Rally snubs French PM’s bid to salvage cabinet amid political turmoil – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/oct/07/france-macron-lecornu-cabinet-europe-live",
    "image": "https://media.guim.co.uk/23110a5d401f5c412a95efd5c655b22eca2d4cd8/28_0_4834_3867/500.jpg",
    "summary": "Jordan Bardella and Marine Le Pen have rejected an invitation from Minister Sébastien Lecornu to participate in talks aimed at addressing the ongoing crisis. Their refusal indicates ongoing tensions and disagreements over potential solutions. This decision highlights continued divisions within French politics regarding the current situation.",
    "published": "2025-10-07T15:17:39Z"
  },
  {
    "title": "Federal agents taunted Chicago woman to ‘do something’ before shooting her, attorney claims",
    "url": "https://www.theguardian.com/us-news/2025/oct/07/chicago-woman-shot-immigration-agents",
    "image": "https://media.guim.co.uk/404fae663f20ac5a2ef5f6c4e7b79fc6d66c7086/325_0_2481_1984/500.jpg",
    "summary": "A woman led law enforcement on a chase that ended with her ramming a Border Patrol vehicle amid heightened immigration enforcement during Trump's administration. The incident highlights tensions and challenges faced by border officials. The situation underscores ongoing debates over immigration policy and border security.",
    "published": "2025-10-07T15:16:26Z"
  },
  {
    "title": "Javier Milei belts out 80s anthems as Argentina’s economy unravels",
    "url": "https://www.theguardian.com/world/2025/oct/07/javier-milei-argentina-economy",
    "image": "https://media.guim.co.uk/841d938ccaf3d7b173c827a9e28874f8b4509097/97_0_2031_1625/500.jpg",
    "summary": "Amid ongoing protests and controversy, Argentina's president, often dubbed the 'rock star president,' held a performance in Buenos Aires. During the event, he expressed his humanity, acknowledging the challenges he faces. His public appearance comes at a time of heightened scrutiny and unrest in the country.",
    "published": "2025-10-07T15:08:40Z"
  }
]