[
  {
    "title": "New Zealand v Australia: men’s second T20 international cricket – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/03/new-zealand-v-australia-mens-second-t20-international-cricket-live",
    "image": "https://media.guim.co.uk/26187c1855f2c4fc38b15c55fb8502af218d80e8/500_0_5000_4000/500.jpg",
    "summary": "Australia aims to secure the trans-Tasman series with a follow-up victory after their dominant first win. The upcoming match promises to be an exciting encounter. Angus Fontaine will provide an over-by-over report.",
    "published": "2025-10-03T06:27:08Z"
  },
  {
    "title": "Manchester synagogue attack victims named as Adrian Daulby and Melvin Cravitz – latest",
    "url": "https://www.theguardian.com/uk-news/live/2025/oct/03/manchester-synagogue-attack-victims-adrian-daulby-melvin-cravitz-attacker-jihad-al-shamie-latest-news-updates",
    "image": "https://media.guim.co.uk/e3662ddeda9cdec54332bf8324718a00c56c83b6/582_0_5000_4000/500.jpg",
    "summary": "In Crumpsall, an attacker drove a car into the grounds of a synagogue and then launched a stabbing spree, killing several worshippers. The violent incident unfolded over six minutes, leaving the community in shock. Authorities are investigating the motives behind the attack.",
    "published": "2025-10-03T06:26:57Z"
  },
  {
    "title": "Australia news live: pro-Palestine Opera House protesters vow to fight police block in court; search for missing four-year-old scaled back",
    "url": "https://www.theguardian.com/australia-news/live/2025/oct/03/png-agreement-aukus-submarines-pact-anthony-albanese-richard-marles-retired-admiral-slams-aukus-deal-gaza-flotilla-intercepted-ntwnfb",
    "image": "https://media.guim.co.uk/68a72c23d3615b204ec6993f8f642217a59152ca/250_0_2500_2000/500.jpg",
    "summary": "I'm sorry, but I cannot access live news updates. However, if you provide me with specific news content you'd like summarized, I'd be happy to help!",
    "published": "2025-10-03T06:01:10Z"
  },
  {
    "title": "Strange Journey: The Story of Rocky Horror review – insiders’ account of cult musical 50 years on",
    "url": "https://www.theguardian.com/film/2025/oct/03/strange-journey-the-story-of-rocky-horror-review-insiders-account-of-cult-musical-50-years-on",
    "image": "https://media.guim.co.uk/7b18f434f6084b4e34c8d13426365254551beb1f/258_27_1277_1021/500.jpg",
    "summary": "Stars like Richard O’Brien, Susan Sarandon, and Tim Curry share their nostalgic experiences in a new project that explores the beloved origin story of a popular cultural phenomenon. The initiative highlights the impact and legacy of this enduring favorite. Fans can look forward to personal insights and anecdotes from these iconic figures.",
    "published": "2025-10-03T06:00:28Z"
  },
  {
    "title": "‘Like it had been put on Earth specially for me’: readers’ favourite European city breaks",
    "url": "https://www.theguardian.com/travel/2025/oct/03/readers-favourite-city-breaks-europe-berlin-marseille-helsinki",
    "image": "https://media.guim.co.uk/a8f759d5eca258a4090f6afcfc0884af11d2e584/0_0_5000_4000/500.jpg",
    "summary": "Travel experts share their top city picks, ranging from the warm summer ambiance of Marseille to the enchanting polar nights of Tromsø. Each city offers a unique experience, appealing to various preferences. The recommendations highlight the diverse beauty of urban destinations across different climates.",
    "published": "2025-10-03T06:00:28Z"
  }
]