[
  {
    "title": "Former Bush adviser charged with amassing top secret files ",
    "url": "https://www.theguardian.com/us-news/2025/oct/16/indian-born-former-george-w-bush-adviser-ashley-tellis-accused-of-amassing-top-secret-files",
    "image": "https://media.guim.co.uk/4d57ef7cf3739a8d8fa784690aaef0f489af3ed6/342_20_2833_2267/500.jpg",
    "summary": "Indian-American Ashley Tellis is accused of acquiring sensitive US military data and delivering envelopes to Chinese officials. The allegations suggest espionage activities that could compromise national security. Authorities are investigating the extent of the breach and its implications.",
    "published": "2025-10-16T13:30:28Z"
  },
  {
    "title": "Women’s Cricket World Cup: Australia v Bangladesh – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/16/womens-cricket-world-cup-australia-v-bangladesh-live",
    "image": "https://media.guim.co.uk/722564bb2069558c8a009261fd1f3ca47a345bbd/706_0_4389_3512/500.jpg",
    "summary": "Australia has secured their place in the finals of the 50-over match held in Visakhapatnam. The over-by-over report provides real-time updates on the match. Join Megan Maurice for comprehensive coverage.",
    "published": "2025-10-16T13:29:50Z"
  },
  {
    "title": "Top Senate Republican says he can ‘guarantee’ a vote on key healthcare provision amid shutdown standoff – live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/16/trump-latest-shutdown-vote-jd-vance-republicans-democrats",
    "image": "https://media.guim.co.uk/14b9f122f0d86ee69c264de3f18004600cf1dc11/667_0_6830_5464/500.jpg",
    "summary": "Senate Majority Leader confirmed that a vote on Obamacare subsidies will take place, as requested by Democrats. However, he cautioned that he cannot ensure its passage. The outcome remains uncertain amid ongoing discussions.",
    "published": "2025-10-16T13:23:39Z"
  },
  {
    "title": "IMF chief reveals worries about private credit market keep her awake at night – business live",
    "url": "https://www.theguardian.com/business/live/2025/oct/16/uk-gdp-economy-growth-august-reeves-budget-imf-business-live-news",
    "image": "https://media.guim.co.uk/fbe0df09a525d0892573d1fa9ae8f132475b51fc/375_0_3748_2998/500.jpg",
    "summary": "IMF managing director Kristalina Georgieva calls for increased focus on non-bank financial institutions, highlighting potential vulnerabilities in the global financial system. She warns that the world may be facing economic instability, akin to having “a foot out in the cold.” Georgieva's comments emphasize the need for vigilance and reform in the financial sector.",
    "published": "2025-10-16T13:23:35Z"
  },
  {
    "title": "ROG Xbox Ally X review – like nothing handheld gaming has seen before, for better or worse",
    "url": "https://www.theguardian.com/games/2025/oct/16/rog-xbox-ally-x-review-like-nothing-handheld-gaming-has-seen-before",
    "image": "https://media.guim.co.uk/c51ab88c3d2532850102314450f693fee2089a58/726_0_5000_4000/500.jpg",
    "summary": "Xbox's new portable console aims to merge the flexibility of PC gaming with the convenience of gaming on the go, reflecting Microsoft’s commitment to accessibility. However, it is priced on the higher end and may present some operational challenges. Gamers looking for portability will need to weigh these factors carefully.",
    "published": "2025-10-16T13:21:05Z"
  }
]