[
  {
    "title": "Chelsea v Benfica, Bodø/Glimt v Tottenham, and more: Champions League – live",
    "url": "https://www.theguardian.com/football/live/2025/sep/30/chelsea-v-benfica-bodglimt-v-tottenham-and-more-champions-league-live",
    "image": "https://media.guim.co.uk/79b66be42f5c4c99ce0559a650a7cf02847de086/717_0_3583_2867/500.jpg",
    "summary": "Stay updated with the latest from a packed night of European and Football League matches. Yara El-Shaboury will be covering all the action as it unfolds. Don't miss out on any key moments!",
    "published": "2025-09-30T18:24:13Z"
  },
  {
    "title": "Covid exercise messaging left children stuck indoors, UK inquiry hears",
    "url": "https://www.theguardian.com/uk-news/2025/sep/30/children-play-covid-lockdown-exercise-rules-uk-inquiry",
    "image": "https://media.guim.co.uk/77620d073aa908fb41a6df6be50d696766284407/259_0_3000_2400/500.jpg",
    "summary": "A campaigner has criticized restrictions that prevent children from playing outside, arguing that their natural exercise through play is being limited because it appears to be \"too much like fun.\" This raises concerns about children's physical activity and wellbeing. The situation highlights the tension between safety measures and healthy outdoor play for kids.",
    "published": "2025-09-30T18:20:42Z"
  },
  {
    "title": "Trump says government shutdown likely as House Democrats call out Republicans for delaying votes before funding deadline – live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/30/us-government-shutdown-funding-trump-vance-portland-hegseth-latest-updates",
    "image": "https://media.guim.co.uk/3a7fa41ff81c50527e6b747b3ef56a5b8670e32d/263_0_3333_2667/500.jpg",
    "summary": "Government funding will expire at midnight ET, creating a potential shutdown. Republican Speaker Mike Johnson postponed the House's return to block further negotiations with Democrats. This move aims to assert Republican control over the funding discussions.",
    "published": "2025-09-30T18:12:48Z"
  },
  {
    "title": "Galatasaray v Liverpool: Champions League – live",
    "url": "https://www.theguardian.com/football/live/2025/sep/30/galatasaray-v-liverpool-champions-league-live",
    "image": "https://media.guim.co.uk/362bccdb2a4409e23f05bc8c38d337a02be2a29d/1023_374_6022_4818/500.jpg",
    "summary": "Scott Murray provides a live report from Istanbul as the Turkish champions face Arne Slot's team. Stay updated with minute-by-minute coverage of the match. Fans can follow the action and key developments as the game unfolds.",
    "published": "2025-09-30T18:12:43Z"
  },
  {
    "title": "Judge rules Trump policy to deport students over pro-Palestinian views is unconstitutional",
    "url": "https://www.theguardian.com/us-news/2025/sep/30/trump-administration-immigration-palestine",
    "image": "https://media.guim.co.uk/4a1d9769d20052426bd9b608bb750d2f7df38493/250_0_2500_2000/500.jpg",
    "summary": "A judge has determined that noncitizens possess the same free speech rights as U.S. citizens, affirming that the First Amendment explicitly safeguards these rights. The ruling emphasizes that free expression is fundamental regardless of citizenship status. This decision reinforces the principle of free speech as a universal right.",
    "published": "2025-09-30T18:10:28Z"
  }
]