[
  {
    "title": "Vodafone outage: thousands of broadband and mobile users report problems",
    "url": "https://www.theguardian.com/business/2025/oct/13/vodafone-outage-broadband-mobile-down-internet-calls",
    "image": "https://media.guim.co.uk/3b1a08a894d52beb69e451301a9356ce53ed518d/285_0_5039_4033/500.jpg",
    "summary": "Numerous customers are reporting outages, experiencing difficulties accessing services such as the internet and making mobile phone calls. The disruptions are affecting a significant number of users. Service providers are likely addressing the issue, but details on the cause and timeline for resolution remain unclear.",
    "published": "2025-10-13T16:24:50Z"
  },
  {
    "title": "Former French president Nicolas Sarkozy ordered to go to jail next week",
    "url": "https://www.theguardian.com/world/2025/oct/13/former-french-president-nicolas-sarkozy-ordered-to-go-to-jail-next-week",
    "image": "https://media.guim.co.uk/7d32e8177068b4cc45099c86dcbee1eebd6a0d8e/465_65_3482_2786/500.jpg",
    "summary": "Former French President Nicolas Sarkozy has been sentenced to prison in Paris for attempting to secure election funds from the Gaddafi regime. He must serve his term at La Santé prison following his conviction. This marks a significant legal setback for the former leader amidst ongoing controversies surrounding his political legacy.",
    "published": "2025-10-13T16:23:27Z"
  },
  {
    "title": "Gaza ceasefire: all living Israeli hostages freed as Trump arrives in Egypt for summit – latest updates",
    "url": "https://www.theguardian.com/world/live/2025/oct/13/gaza-ceasefire-live-updates-israel-hostages-release-hamas-trump-middle-east",
    "image": "https://media.guim.co.uk/f3251fd8d428a4f79cb43f8b5fac83ec53372e55/16_369_3597_2878/500.jpg",
    "summary": "During a visit to Israel, US President receives a standing ovation in the Knesset after the return of 20 hostages. This occasion coincides with the release of hundreds of Palestinian prisoners. The events underscore the ongoing complexities of the Israeli-Palestinian conflict.",
    "published": "2025-10-13T16:22:47Z"
  },
  {
    "title": "No 10 says claims it concealed evidence or withdrew witnesses to stop China spy trial are ‘categorically untrue’ – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/oct/13/china-spy-trial-keir-starmer-egypt-margaret-thatcher-anniversary-uk-politics-live-news-updates",
    "image": "https://media.guim.co.uk/d2d80b936dfd8305dce9c8788f464b483c87fb7e/1309_695_3678_2942/500.jpg",
    "summary": "The Prime Minister's spokesperson denied claims that the government influenced the Crown Prosecution Service (CPS) to drop a case related to Chinese espionage. They labeled these allegations as \"entirely false.\" The statement aims to clarify the government's position amid rising concerns about foreign interference.",
    "published": "2025-10-13T16:21:04Z"
  },
  {
    "title": "Muriel Manning obituary",
    "url": "https://www.theguardian.com/world/2025/oct/13/muriel-manning-obituary",
    "image": "https://media.guim.co.uk/32ed56d78f5702d9c547dae20d69653031d94375/0_9_961_769/500.jpg",
    "summary": "A wartime wireless operator played a crucial role by intercepting German messages, which were then relayed to Bletchley Park for cryptanalysis. This effort significantly contributed to the Allied code-breaking operations during World War II. The operator's work highlights the importance of communication intelligence in the war effort.",
    "published": "2025-10-13T16:16:06Z"
  }
]