[
  {
    "title": "Zelenskyy says Ukraine ready to move forward with US plan and discuss ‘sensitive points’ with Trump - Europe live ",
    "url": "https://www.theguardian.com/world/live/2025/nov/25/us-russia-ukraine-peace-talks-abu-dhabi-kyiv-strikes-zelenskyy-putin-europe-live-news",
    "image": "https://media.guim.co.uk/eb053601e69d2a0f8cc056d984033cbd97ca488f/252_0_4589_3672/500.jpg",
    "summary": "The Ukrainian leader emphasizes the importance of involving European allies in ongoing negotiations. Meanwhile, former President Trump claims that a deal regarding the situation is nearing completion. This highlights a concerted effort for resolution involving multiple stakeholders.",
    "published": "2025-11-25T18:31:14Z"
  },
  {
    "title": "No 10 says no final decisions after leak reveals jury trials might be scrapped except for alleged rapists and killers – UK politics live ",
    "url": "https://www.theguardian.com/politics/live/2025/nov/25/nigel-farage-nathan-gill-labour-reform-uk-russia-keir-starmer-uk-politics-live-news",
    "image": "https://media.guim.co.uk/6c3fe2b422002e81586155c32ffec772e1eeded5/383_469_4388_3512/500.jpg",
    "summary": "Downing Street has not dismissed reports that Justice Secretary David Lammy is contemplating the elimination of juries in most trials. This proposal has sparked significant debate regarding the future of the judicial process. Further details on the potential changes remain unclear.",
    "published": "2025-11-25T18:28:49Z"
  },
  {
    "title": "Hugh Nowell obituary",
    "url": "https://www.theguardian.com/books/2025/nov/25/hugh-nowell-obituary",
    "image": "https://media.guim.co.uk/f289cec71bb5ee0519f8351d0ef42d3b70f11fcd/0_53_401_321/master/401.jpg",
    "summary": "A co-founder and head of Grosvenor Books, a Christian publishing company, has passed away, leaving behind a legacy in the publishing industry. Known for promoting Christian literature, the company has made significant contributions to the field. His impact on the industry and community will be remembered.",
    "published": "2025-11-25T18:28:18Z"
  },
  {
    "title": "US attorney general vows to appeal dismissal of criminal cases against James Comey and Letitia James – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/nov/25/us-politics-pam-bondi-appeal-james-comey-letitia-james-cases-donald-trump-venezuela-latest-updates",
    "image": "https://media.guim.co.uk/d906b2a8c14e356c13b15dcbdf44bfa715e2b6f4/614_0_6435_5148/500.jpg",
    "summary": "The Pentagon is investigating Arizona Senator Mark Kelly for allegedly violating military law by appearing in a video that encourages military personnel to \"refuse illegal orders.\" This investigation highlights concerns around the potential influence of lawmakers on military conduct. Details of the specific laws potentially violated have not been disclosed.",
    "published": "2025-11-25T18:27:44Z"
  },
  {
    "title": "Fifty higher education providers at risk of exiting market in England, MPs told",
    "url": "https://www.theguardian.com/education/2025/nov/25/fifty-higher-education-providers-risk-exiting-market-england-mps-told",
    "image": "https://media.guim.co.uk/8e25ef1314ebc20d0dcd60e5bed7834109183107/0_12_4535_3628/500.jpg",
    "summary": "A regulator has identified 24 institutions at immediate risk of needing to halt degree courses within the next year. These institutions face potential intervention due to concerns about their viability. Students enrolled at these schools may need to explore alternative options for their education.",
    "published": "2025-11-25T18:26:38Z"
  }
]