[
  {
    "title": "Australia v England: Ashes second Test, day four – live",
    "url": "https://www.theguardian.com/sport/live/2025/dec/07/australia-vs-england-live-ashes-second-2nd-test-day-four-aus-v-eng-cricket-scores-updates-gabba-brisbane",
    "image": "https://media.guim.co.uk/75144625d9e32f27e7123278365dd4cf94060e82/1167_119_4101_3281/500.jpg",
    "summary": "England faces a critical moment in their match in Brisbane, with updates being provided by writers from the Gabba. The tension surrounding the game highlights the importance of this performance for the team's prospects. Stay tuned for live commentary and insights as the situation unfolds.",
    "published": "2025-12-07T03:26:09Z"
  },
  {
    "title": "Australia news live: NSW Central Coast ‘not out of the woods yet’ as bushfire conditions ease; more platforms could be added after under-16 social media ban begins, Wells says",
    "url": "https://www.theguardian.com/australia-news/live/2025/dec/07/australia-news-live-nsw-bushfire-central-coast-upper-hunter-chris-minns-anthony-albanese-anika-wells-social-media-ban-syria-refugees-tasmania-dolphin-sands-labor-coalition-ntwnfb",
    "image": "https://media.guim.co.uk/e5625f8590adc6d9e3787407c31dcb31213c80f5/166_0_1088_870/500.jpg",
    "summary": "I'm sorry, but I need more information or context about the news you'd like summarized. Please provide the details or link, and I'll be happy to help!",
    "published": "2025-12-07T03:13:40Z"
  },
  {
    "title": "Trump news at a glance: Hegseth faces most serious crisis of tenure ",
    "url": "https://www.theguardian.com/us-news/2025/dec/07/trump-administration-news-update-today",
    "image": "https://media.guim.co.uk/e1939d30f844cd348ad7346759ca10e7d3a1e1c8/0_0_4912_3930/500.jpg",
    "summary": "US Defense Secretary Pete Hegseth faces significant scrutiny due to allegations of mishandling classified military intelligence and his response to attacks on boats in the Caribbean. Critics are questioning his leadership amid growing national security concerns. This controversy marks a pivotal moment in US politics as calls for accountability intensify.",
    "published": "2025-12-07T03:02:49Z"
  },
  {
    "title": "Double-post salvation gives Busquets and Alba a fitting farewell in MLS Cup final",
    "url": "https://www.theguardian.com/football/2025/dec/06/inter-miami-mls-cup-messi-busquets-alba-vancouver",
    "image": "https://media.guim.co.uk/4c6c00f1250d6db98e5d2a1b8de694be415693f0/62_0_3073_2459/500.jpg",
    "summary": "Inter Miami clinched their first MLS Cup in a thrilling match marked by a near-miss on a double-post hit. Lionel Messi and his teammates secured the victory, providing a memorable farewell for Sergio Busquets and Jordi Alba. The win underscores a triumphant achievement for the club in its inaugural season.",
    "published": "2025-12-07T01:56:43Z"
  },
  {
    "title": "Ukraine war briefing: With no Miami breakthrough, Zelenskyy turns to European allies",
    "url": "https://www.theguardian.com/world/2025/dec/07/ukraine-war-briefing-with-no-miami-breakthrough-zelenskyy-turns-to-european-allies",
    "image": "https://media.guim.co.uk/a8d70560ee965477562aeae086d36314fedb43a5/305_0_4705_3764/500.jpg",
    "summary": "Florida talks with the Ukrainian president generated a positive atmosphere as he prepares to meet with leaders like Starmer, Macron, and Merz in London. This gathering aims to strengthen international support for Ukraine. The discussions are taking place on day 1,383 of the ongoing conflict.",
    "published": "2025-12-07T01:53:37Z"
  }
]