[
  {
    "title": "Emily Thornberry joins deputy Labour leader race and says Gaza and wealth tax among her priorities – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/09/bridget-phillipson-labour-deputy-leader-uk-politics-latest-news-updates-keir-starmer",
    "image": "https://media.guim.co.uk/6efe5708d8219a9bd68da361c9ae671fde9a7c66/378_0_5600_4480/500.jpg",
    "summary": "Thornberry has announced her candidacy, joining Bridget Phillipson and Bell Ribeiro-Addy as contenders. The trio is set to compete for a prominent position within their party. Their participation signals a competitive race ahead.",
    "published": "2025-09-09T10:40:50Z"
  },
  {
    "title": "Asa Tribe scores 200 for Glamorgan, Leicestershire v Gloucestershire and more: county cricket – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/09/somerset-v-yorkshire-leicestershire-v-gloucestershire-and-more-county-cricket-day-two-live",
    "image": "https://media.guim.co.uk/30a67c3c28eb60df9ed6b6e7f19997ab9671df1a/1252_442_2948_2358/500.jpg",
    "summary": "Tanya Aldred provides live updates from the county grounds on day two of the current round of fixtures. Stay tuned for the latest news and developments from the matches. Follow along for insights and highlights.",
    "published": "2025-09-09T10:35:57Z"
  },
  {
    "title": "Former PMs say they use subsidy only for public duties after Boris Johnson revelations",
    "url": "https://www.theguardian.com/uk-news/2025/sep/09/former-pms-subsidy-public-duties-boris-johnson",
    "image": "https://media.guim.co.uk/f1698a15855fba75f4f05bdfd5b8e819701bc482/0_0_3750_3000/500.jpg",
    "summary": "Gordon Brown and several former leaders are advocating for changes to rules regarding allowances, stating they do not utilize these funds for commercial work. They argue for transparency and appropriate use of public money. The call for reform highlights concerns about the integrity of the allowance system.",
    "published": "2025-09-09T10:35:26Z"
  },
  {
    "title": "François Bayrou to resign as French PM as government collapses to spark crisis – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/sep/09/france-crisis-government-emmanuel-macron-europe-latest-live-news-updates",
    "image": "https://media.guim.co.uk/2b201e033b7874ab22e5971b3bbb51c02ae9f458/743_0_3717_2973/500.jpg",
    "summary": "The French government collapsed as President Emmanuel Macron's ally secured support from only 194 MPs, facing opposition from 364. This significant vote indicates a loss of confidence in the government. The political landscape in France is now left uncertain following this outcome.",
    "published": "2025-09-09T10:33:01Z"
  },
  {
    "title": "Peru accused of violating human rights after government rejects reserve for uncontacted peoples",
    "url": "https://www.theguardian.com/global-development/2025/sep/09/peru-accused-of-violating-human-rights-after-government-rejects-yavari-mirim-reserve-for-uncontacted-peoples",
    "image": "https://media.guim.co.uk/2b2382d52ea7c9d024023ec01a268576ab764e80/346_0_4320_3456/500.jpg",
    "summary": "Campaigners expressed disbelief as ministers voted against the establishment of the Yavari Mirim reserve, which spans 1.2 million hectares, after two decades of discussions. The decision marks a significant setback for conservation efforts in the region. Activists are calling for renewed action and support to protect the area.",
    "published": "2025-09-09T10:32:15Z"
  }
]