[
  {
    "title": "Australia news live: PM coy on prospect of Trump meeting and insists ‘it is journalists who are obsessed by this’",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/15/australia-news-live-updates-albanese-png-climate-crisis-defence-rooftop-solar-power-energy-politics-ntwnfb",
    "image": "https://media.guim.co.uk/9d91b35d7b159ecb51267244de7e36c4ef2dfd5c/293_0_5775_4620/500.jpg",
    "summary": "Please provide the news article or information you'd like summarized.",
    "published": "2025-09-15T07:29:44Z"
  },
  {
    "title": "First annual drop in UK house asking prices since January 2024",
    "url": "https://www.theguardian.com/business/live/2025/sep/15/uk-house-prices-drop-tax-budget-rents-financial-markets-business-live-news-updates",
    "image": "https://media.guim.co.uk/7e293b77e2e84fc6f159a41a8f27fa6d25fa86f7/404_0_3941_3152/500.jpg",
    "summary": "Stay updated with continuous updates on global economic trends and financial markets, focusing on key developments and impacts. Coverage includes insights on stock performance, interest rates, and economic indicators. Stay informed to navigate the evolving landscape of finance and economics.",
    "published": "2025-09-15T07:26:18Z"
  },
  {
    "title": "Cos takes centre stage at New York fashion week and Gwyneth Paltrow rebrands",
    "url": "https://www.theguardian.com/fashion/2025/sep/15/cos-new-york-fashion-week-gwyneth-paltrow-rebrands",
    "image": "https://media.guim.co.uk/5fbcf5b7e25e90faf123911513a1994757b02f26/600_0_3000_2400/500.jpg",
    "summary": "A high street brand has launched a new brutalist collection, signaling a shift away from fast fashion. Meanwhile, Gwyneth Paltrow is simplifying her style by moving away from gimmicky fashion choices. Both are reflecting a broader trend towards more sustainable and thoughtful design in the fashion industry.",
    "published": "2025-09-15T07:24:37Z"
  },
  {
    "title": "Premier League: 10 talking points from the weekend’s action",
    "url": "https://www.theguardian.com/football/2025/sep/15/premier-league-10-talking-points-from-the-weekend-action",
    "image": "https://media.guim.co.uk/cd139453a9548798c791ed58fa3113dba247fbac/0_0_5000_4000/500.jpg",
    "summary": "Newcastle's new striker impresses with his performance, solidifying his impact on the team. Emiliano Martínez regains favor with Aston Villa, boosting his standing within the squad. Meanwhile, Noni Madueke celebrates a standout week, marking significant achievements in his career.",
    "published": "2025-09-15T07:00:56Z"
  },
  {
    "title": "‘Did he really play on Petula Clark’s Downtown?’ Stewart Lee on his guitar hero Derek Bailey",
    "url": "https://www.theguardian.com/music/2025/sep/15/petula-clarks-downtown-stewart-lee-improv-guitar-hero-derek-bailey",
    "image": "https://media.guim.co.uk/2876089af5d7736fe56e1d74b36e17c4c1768239/267_0_3149_2519/500.jpg",
    "summary": "Stewart Lee honors the eccentric life of a genius in improvised music who shunned composition and questioned the purpose of recorded music. The celebration highlights the performer's unique approach to artistry. This tribute reflects on their impact and legacy in the world of music.",
    "published": "2025-09-15T07:00:56Z"
  }
]