[
  {
    "title": "Middlesbrough stand Edwards down from game; Spurs v Manchester United buildup – matchday live ",
    "url": "https://www.theguardian.com/football/live/2025/nov/08/tottenham-v-manchester-united-buildup-premier-league-and-wsl-news-matchday-live",
    "image": "https://media.guim.co.uk/f01521a118f54b11affc5d327e11008226629c33/500_163_2046_1637/500.jpg",
    "summary": "Join us for the latest news and engaging discussions ahead of today's events. Get previews and insights to enhance your experience. Don't miss out on what’s coming up!",
    "published": "2025-11-08T10:15:25Z"
  },
  {
    "title": "Australia v India: fifth men’s Twenty20 international – live",
    "url": "https://www.theguardian.com/sport/live/2025/nov/08/australia-v-india-fifth-mens-twenty20-international-cricket-live-updates",
    "image": "https://media.guim.co.uk/5b848a3598ff6bfdfb2f4a6e2b7a567483d4d785/308_0_2797_2237/500.jpg",
    "summary": "Australia aims to equalize the T20 series in the final game at the Gabba, facing off against their rivals. James Wallace will provide live updates on the match as it unfolds. Fans are eager to see if Australia can secure the victory.",
    "published": "2025-11-08T10:11:39Z"
  },
  {
    "title": "Guitar Hero at 20 – how a plastic axe bridged the gap between rock generations",
    "url": "https://www.theguardian.com/games/2025/nov/08/guitar-hero-at-20-gap-between-rock-generations-harmonix-redoctane",
    "image": "https://media.guim.co.uk/647e72e5d8ece1edfad9cdec2e992c4b26c412d9/123_0_1845_1476/500.jpg",
    "summary": "Guitar Hero's innovative controllers allowed players to experience rock stardom from home. The game's popularity revived the fame of numerous bands featured in its tracklist. This blend of gaming and music brought a new wave of appreciation for guitar-based rock.",
    "published": "2025-11-08T10:00:05Z"
  },
  {
    "title": "Old fishing nets from France become vital protection against Russian drones in Ukraine",
    "url": "https://www.theguardian.com/world/2025/nov/08/old-fishing-nets-vital-protection-against-russian-drones-ukraine",
    "image": "https://media.guim.co.uk/d10d67541351f1aa1ae0cd397b2aacfc0c79becd/264_0_2430_1944/500.jpg",
    "summary": "Fishers from the Brittany coast are utilizing horse-hair nets to help in efforts to capture weapons. This initiative aims to shield both civilians and soldiers amid ongoing conflicts. The innovative use of fishing nets highlights the community's involvement in enhancing safety and security.",
    "published": "2025-11-08T10:00:05Z"
  },
  {
    "title": "World’s longest-married couple reveals key to a lasting relationship: ‘We love each other’",
    "url": "https://www.theguardian.com/us-news/2025/nov/08/worlds-longest-married-couple-advice",
    "image": "https://media.guim.co.uk/cfde73c46453bce544e37dd4f93cb0dcbec30e80/213_0_2133_1707/500.jpg",
    "summary": "Eleanor, 107, and Lyle Gittens, 108, have been married for 83 years after meeting at a basketball game in 1941. The couple resides in Miami and showcases a remarkable bond that spans over eight decades. Their enduring love story is a testament to their long-lasting partnership.",
    "published": "2025-11-08T10:00:04Z"
  }
]