[
  {
    "title": "Any Ukraine peace plan needs Kyiv and Europe ‘on board’, says EU – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/nov/20/ukraine-russia-peace-plan-european-union-donald-trump-vladimir-putin-kaja-kallas-europe-live-news-updates",
    "image": "https://media.guim.co.uk/4511cac94105cf022e2569f5db6db82676cf8612/523_0_2658_2126/500.jpg",
    "summary": "EU foreign policy chief Kaja Kallas voiced concerns over reports of a clandestine agreement between Moscow and Washington aimed at ending the war. This revelation raises questions about the implications for European security and the ongoing conflict. Kallas emphasized the need for transparency and a unified European stance in response to such developments.",
    "published": "2025-11-20T09:21:26Z"
  },
  {
    "title": "Markets rally after Nvidia’s strong results calm AI bubble fears, and investors await US jobs report – business live",
    "url": "https://www.theguardian.com/business/live/2025/nov/20/markets-rally-nvidia-results-ai-bubble-us-jobs-report-ftse-pound-dollar-business-live-news",
    "image": "https://media.guim.co.uk/24cdfdb66bee1881b7fbca7cc39c1b8a13b2edff/120_0_3388_2710/500.jpg",
    "summary": "Investors reacted positively to a chipmaker's results that exceeded forecasts, indicating strong performance in the sector. This upbeat financial news alleviated some market concerns. Attention is now shifting to the delayed US employment report, which is expected to provide further insights into the economy.",
    "published": "2025-11-20T09:15:15Z"
  },
  {
    "title": "Justice department has 30 days to release all Epstein files after Trump signs bill – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/nov/20/donald-trump-jeffrey-epstein-justice-department-zohran-mamdani-news-updates-us-politics-live",
    "image": "https://media.guim.co.uk/460a2faeeb7cd06a361c8b8256c2d0bfeb055895/1081_0_5421_4337/500.jpg",
    "summary": "Donald Trump criticizes Democrats while trying to influence public perception regarding his connections to the deceased sex offender Jeffrey Epstein. He aims to deflect scrutiny by shifting the focus onto political opponents. Trump's strategy includes emphasizing their alleged wrongdoing in order to diminish the impact of his own associations.",
    "published": "2025-11-20T09:08:33Z"
  },
  {
    "title": "Coalition to help Labor rush through new nature laws if environmental protections dropped",
    "url": "https://www.theguardian.com/australia-news/2025/nov/20/coalition-to-help-labor-rush-through-new-nature-laws-if-environmental-protections-dropped",
    "image": "https://media.guim.co.uk/271f251e621f488998e4c7df4bf234ce65d087cf/120_0_3139_2512/500.jpg",
    "summary": "Sussan Ley has proposed a plan to facilitate the passage of legislation aimed at amending the Environmental Protection and Biodiversity Conservation Act. This offer provides a straightforward route for lawmakers to enact changes during the final week of parliamentary sessions. The move is expected to expedite discussions on environmental regulations.",
    "published": "2025-11-20T09:00:02Z"
  },
  {
    "title": "Edinburgh TV Festival could leave Edinburgh",
    "url": "https://www.theguardian.com/media/2025/nov/20/edinburgh-tv-festival-could-move-cost-working-class-voices",
    "image": "https://media.guim.co.uk/e2de910785c695acd3967cd8d462b112ec656ac0/483_0_2915_2331/500.jpg",
    "summary": "Organizers of events are exploring alternative venues across the UK due to rising costs and concerns regarding the underrepresentation of working-class voices in the industry. This shift aims to make events more accessible and inclusive. The search highlights ongoing challenges faced in the sector, especially regarding economic barriers.",
    "published": "2025-11-20T09:00:02Z"
  }
]