[
  {
    "title": "Spanish government moves to ban smoking on bar terraces",
    "url": "https://www.theguardian.com/world/2025/sep/09/spanish-government-moves-ban-smoking-bar-terraces",
    "image": "https://media.guim.co.uk/0ec7eee3bf688aa024507ba454a82988e095d9cd/525_0_5820_4656/500.jpg",
    "summary": "A new tobacco law aims to prevent minors from using vape products and prohibits the sale of single-use electronic cigarettes. This legislation seeks to address youth vaping and reduce access to disposable vape devices. The measures are part of broader efforts to promote public health and curb tobacco use among young individuals.",
    "published": "2025-09-09T14:36:29Z"
  },
  {
    "title": "Qatar condemns ‘criminal assault’ as Israel launches airstrikes against Hamas leaders in Doha – Middle East crisis live",
    "url": "https://www.theguardian.com/world/live/2025/sep/09/israel-gaza-city-evacuation-order-idf-military-offensive-live-updates-middle-east-crisis-latest-news",
    "image": "https://media.guim.co.uk/194b78f6b7777ba65dde174e77716e009ae0bbba/117_0_1849_1479/500.jpg",
    "summary": "Ceasefire negotiators from a militant group have reportedly survived targeted attacks aimed at disrupting peace talks. The incidents highlight ongoing tensions in the conflict zone. Efforts to reach a lasting resolution remain precarious as violence continues.",
    "published": "2025-09-09T14:33:26Z"
  },
  {
    "title": "Birthday note apparently from Trump to Epstein branded ‘sickening’ – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/09/donald-trump-jeffrey-epstein-birthday-note-letter-latest-live-us-politics-news",
    "image": "https://media.guim.co.uk/b0e5d7e8b7aa33fd498746bbd3662c425557d965/603_29_1913_1531/500.jpg",
    "summary": "White House officials are attempting to undermine a note related to Donald Trump, asserting that his signature on the document is not authentic. They aim to diminish the note's credibility as part of ongoing investigations. This move highlights the ongoing tensions surrounding Trump's actions and communications.",
    "published": "2025-09-09T14:31:40Z"
  },
  {
    "title": "Lucy Powell to stand for Labour deputy leadership after reshuffle sacking – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/09/bridget-phillipson-labour-deputy-leader-uk-politics-latest-news-updates-keir-starmer",
    "image": "https://media.guim.co.uk/71dd443f76d633f41513ec955a012134bcd99a24/0_0_5906_4724/500.jpg",
    "summary": "The Education Secretary faces competition from notable candidates including Emily Thornberry, Bell Ribeiro-Addy, Lucy Powell, Alison McGovern, and Paula Barker. This context suggests a significant political contest ahead. The outcome may influence educational policies and leadership.",
    "published": "2025-09-09T14:29:50Z"
  },
  {
    "title": "Photo of novelty check suggests Epstein ‘sold’ Trump a woman for $22,500",
    "url": "https://www.theguardian.com/us-news/2025/sep/09/trump-epstein-photo-check-woman",
    "image": "https://media.guim.co.uk/6bb4d135b154c0e74a5e310f7075f8fc822b9f8a/238_182_860_688/500.jpg",
    "summary": "A birthday scrapbook photo surfaced showing President Trump and a convicted sex offender together, alongside a check signed by Trump. This image has drawn public attention due to the associations it implies. The situation raises questions regarding Trump's relationships and past interactions.",
    "published": "2025-09-09T14:29:22Z"
  }
]