[
  {
    "title": "Belgian drone sightings could be linked to talks on using frozen Russian assets, says German minister – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/nov/07/europe-latest-news-updates-belgium-airports-brussels-liege-drones-russia-orban-trump-ukraine",
    "image": "https://media.guim.co.uk/a3e148971a80ff674a76ab324642cd8ca4c250cf/621_0_3662_2930/500.jpg",
    "summary": "Boris Pistorius has cautioned that Russia is actively trying to create doubt and division across Europe. He emphasized that these efforts include attempts to manipulate elections within the region. The warning highlights ongoing concerns regarding Russian influence in European democratic processes.",
    "published": "2025-11-07T13:27:19Z"
  },
  {
    "title": "Tuchel ‘delighted’ to recall Bellingham and Foden; Wolves target Edwards not at Boro training: football news – live",
    "url": "https://www.theguardian.com/football/live/2025/nov/07/thomas-tuchel-england-squad-jude-bellingham-weekend-team-news-and-more-football-live",
    "image": "https://media.guim.co.uk/906a70bbe6de1dfef1fffb2212c5a4b49e5f2b4c/0_0_5000_4000/500.jpg",
    "summary": "England manager Thomas Tuchel has announced his latest squad ahead of a busy weekend filled with Premier League matches. The selection highlights his strategic choices as teams prepare for crucial fixtures. Fans and analysts alike are eager to see how the squad performs in this competitive period.",
    "published": "2025-11-07T13:25:08Z"
  },
  {
    "title": "Flight cancellations take effect amid government shutdown – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/nov/07/donald-trump-government-shutdown-air-traffic-flights-snap-viktor-orban-hungary-ukraine-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/fdc3bcd5f82150d9843568f7aa5b686d9a73ecc4/309_0_7105_5684/500.jpg",
    "summary": "Airlines began reducing services before a directive was issued to cut traffic at 40 major airports. The directive took effect at 6am ET today. This move aims to manage air traffic congestion amidst ongoing challenges.",
    "published": "2025-11-07T13:23:55Z"
  },
  {
    "title": "Passengers face global disruption as flights cut amid US government shutdown",
    "url": "https://www.theguardian.com/world/2025/nov/07/passengers-face-global-disruption-as-flights-cut-amid-us-government-shutdown",
    "image": "https://media.guim.co.uk/aa52e8a3420802bce3621a6e5513d87444acdca3/381_0_2414_1931/500.jpg",
    "summary": "Travelers are facing disruptions as the longest shutdown on record persists, with no clear resolution in sight. Many are being forced to modify their travel plans due to the ongoing uncertainty. The prolonged situation has created widespread frustration among those affected.",
    "published": "2025-11-07T13:23:53Z"
  },
  {
    "title": "Minister defends Lammy over mistaken prisoner releases as sex offender is recaptured – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/nov/07/uk-politics-latest-news-david-lammy-prisoners-labour-keir-starmer",
    "image": "https://media.guim.co.uk/b6359f3b609c171c0e308a5ba15b1cf0d7009ba7/323_0_4152_3323/500.jpg",
    "summary": "The accidental release of Brahim Kaddour-Cherif has intensified scrutiny on the justice secretary, following a similar incident with an Epping sex offender. This situation raises concerns about public safety and the effectiveness of the justice system. Calls for accountability and reforms are growing as a result.",
    "published": "2025-11-07T13:23:00Z"
  }
]