[
  {
    "title": "Palmer fit to start against Arsenal, Gueye red card appeal rejected – football live",
    "url": "https://www.theguardian.com/football/live/2025/nov/28/premier-league-news-europa-league-reaction-previews-and-more-football-live",
    "image": "https://media.guim.co.uk/0e30b458e27f21ee2f3bd5b38a1f8f356bf5deba/0_810_3878_3103/500.jpg",
    "summary": "A rolling report is underway, providing updates on the latest football news and reactions ahead of the weekend's matches. Writers will offer insights and analysis as events unfold. Stay tuned for continuous coverage.",
    "published": "2025-11-28T17:16:49Z"
  },
  {
    "title": "Susan Loppert obituary",
    "url": "https://www.theguardian.com/culture/2025/nov/28/susan-loppert-obituary",
    "image": "https://media.guim.co.uk/763bee0c054bf36e88efa665c48d3874da22cc07/62_268_871_697/500.jpg",
    "summary": "The director has launched an ambitious initiative to bring art and performance into Chelsea and Westminster Hospital. The program aims to enhance the healing environment for patients and staff through creative expression. This effort highlights the importance of art in healthcare settings.",
    "published": "2025-11-28T17:11:34Z"
  },
  {
    "title": "Zelenskyy chief of staff resigns after property raid by Ukraine’s anti-corruption agencies – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/nov/28/europe-latest-news-andriy-yermak-anti-corruption-zelenskyy-ukraine-russia-war-peace-talks-putin",
    "image": "https://media.guim.co.uk/8585aa23df8935d5526042ba9469ac78ca2439ce/192_0_1434_1147/500.jpg",
    "summary": "Ukrainian President Volodymyr Zelenskyy addressed the resignation of his chief of staff, Andriy Yermak, seeking to dispel rumors and speculation surrounding the decision. Zelenskyy emphasized the importance of transparency in government matters. The resignation has sparked discussions regarding its implications for Ukraine's leadership and ongoing challenges.",
    "published": "2025-11-28T17:06:58Z"
  },
  {
    "title": "David Young obituary",
    "url": "https://www.theguardian.com/theguardian/2025/nov/28/david-young-obituary",
    "image": "https://media.guim.co.uk/4700f49ec35e1454696638957f17fad3c1e19668/0_287_1200_960/500.jpg",
    "summary": "An esteemed English lecturer and linguist has passed away, leaving behind a legacy of influential textbooks on grammar and language structure. His works are widely consulted in the field, shaping the understanding of language for students and educators alike. His contributions to linguistics will be remembered for their impact on language education.",
    "published": "2025-11-28T17:04:39Z"
  },
  {
    "title": "Daniel Farke happy to take flak for players but Leeds slump piles on pressure",
    "url": "https://www.theguardian.com/football/2025/nov/28/daniel-farke-leeds-united-slump",
    "image": "https://media.guim.co.uk/595517806d43232eafa7ca0ec18b74be602e7e96/171_0_1933_1546/500.jpg",
    "summary": "Leeds United faces a challenging visit to Etihad Stadium, struggling due to insufficient summer recruitment. The team's poor performance is raising concerns about the future of their German manager. This situation puts additional pressure on the club as they navigate a difficult period.",
    "published": "2025-11-28T17:02:53Z"
  }
]