[
  {
    "title": "Labour announces plans to lift 550,000 children out of poverty – UK politics live ",
    "url": "https://www.theguardian.com/politics/live/2025/dec/05/labour-child-poverty-keir-starmer-nigel-farage-reform",
    "image": "https://media.guim.co.uk/4c98ab731c2fe8f13d41d15c70d6016406710eb5/804_71_4425_3540/500.jpg",
    "summary": "Labour leader Keir Starmer has unveiled a child poverty strategy, describing it as a \"moral mission.\" The plan includes initiatives to improve access to childcare and assist families in transitioning out of temporary housing. Starmer emphasizes the importance of addressing child poverty in the UK.",
    "published": "2025-12-05T11:19:27Z"
  },
  {
    "title": "Australia v England: Ashes second Test, day two – live",
    "url": "https://www.theguardian.com/sport/live/2025/dec/05/australia-vs-england-live-ashes-second-2nd-test-day-two-aus-v-eng-cricket-scores-updates-gabba-brisbane",
    "image": "https://media.guim.co.uk/79fa11a0baabb42a1707b84c5fb6b95bf32438fa/206_0_1751_1401/500.jpg",
    "summary": "In the ongoing match at the Gabba, the tourists were bowled out for 334 runs. Joe Root played a standout innings, remaining unbeaten with a century. Follow the second day's updates from our writers for more highlights.",
    "published": "2025-12-05T11:17:38Z"
  },
  {
    "title": "Ukraine war live: Putin says ‘many agreements’ signed with Modi amid US trade pressure – latest updates",
    "url": "https://www.theguardian.com/world/live/2025/dec/05/vladimir-putin-narendra-modi-russia-india-us-ukraine-trade-latest-news-updates",
    "image": "https://media.guim.co.uk/b3d1c7955d90e0cc08d2d69859f8e9bed4d624fd/357_0_2953_2362/500.jpg",
    "summary": "During his visit to India, Putin assured that Russia is prepared to maintain uninterrupted fuel supplies to the nation. This commitment reinforces Russia's role as a key energy partner for India. The statement highlights the ongoing collaboration between the two countries amidst global energy challenges.",
    "published": "2025-12-05T11:15:06Z"
  },
  {
    "title": "Cloudflare outage hits major web services including X, LinkedIn and Zoom – business live",
    "url": "https://www.theguardian.com/business/live/2025/dec/05/uk-house-prices-affordability-stock-markets-us-inflation-ftse-pound-business-live-news-updates",
    "image": "https://media.guim.co.uk/f11c500caeb6f5871ee44741e6a134786df63b97/500_0_5000_4000/500.jpg",
    "summary": "Cloudflare is currently investigating problems affecting its Cloudflare Dashboard and associated APIs. The issues may impact user access and functionality. Users are being advised to stay updated for further developments.",
    "published": "2025-12-05T11:13:46Z"
  },
  {
    "title": "Home Office admits facial recognition tech issue with black and Asian subjects",
    "url": "https://www.theguardian.com/technology/2025/dec/05/home-office-facial-recognition-tech-issue-black-asian-subjects",
    "image": "https://media.guim.co.uk/e24a5e342105469017ec2a3b8a6c952a32266224/551_0_5000_4000/500.jpg",
    "summary": "Concerns have been raised regarding a technology that produces a higher rate of false positives for specific demographic groups in certain configurations. This has prompted calls for a thorough review of the system to address potential biases. Advocates stress the importance of ensuring fairness and accuracy in technological applications.",
    "published": "2025-12-05T11:11:18Z"
  }
]