[
  {
    "title": "Manchester United v Burnley, Tottenham v Bournemouth: Premier League, EFL and more – live",
    "url": "https://www.theguardian.com/football/live/2025/aug/30/manchester-united-v-burnley-tottenham-v-bournemouth-premier-league-efl-and-more-live",
    "image": "https://media.guim.co.uk/9d4348cd92c783913e327029b285cfa04db2f8d4/679_0_5000_4000/500.jpg",
    "summary": "Emillia Hawkins provides updates on the latest developments in football, covering the Premier League, EFL, Bundesliga, and more. Fans can stay informed on scores and highlights from various leagues. Tune in for comprehensive coverage of all the action on the pitch.",
    "published": "2025-08-30T13:04:08Z"
  },
  {
    "title": "Chelsea v Fulham: Premier League – live",
    "url": "https://www.theguardian.com/football/live/2025/aug/30/chelsea-v-fulham-premier-league-live",
    "image": "https://media.guim.co.uk/f09edcd3b6212b5d3e5ca6b5e8dc0aa7fc83d873/199_0_3001_2401/500.jpg",
    "summary": "Rob Smyth provides a live minute-by-minute report on the west London derby taking place at Stamford Bridge. Fans can expect real-time updates and insights throughout the match. Stay tuned for key moments and developments in this exciting local rivalry.",
    "published": "2025-08-30T13:03:44Z"
  },
  {
    "title": "Ukrainian lawmaker shot dead in Lviv as Zelenskyy says hunt for killer is under way – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/aug/30/russia-ukraine-war-live-news-updates-zaporizhzhia",
    "image": "https://media.guim.co.uk/4544c9b3811d17420911e256253b15d66c51d746/308_0_3076_2462/500.jpg",
    "summary": "Ukrainian President stated that all available forces and resources are actively involved in the investigation to find the killer. He emphasized the importance of swiftly bringing the perpetrator to justice. Ongoing efforts aim to resolve the case effectively.",
    "published": "2025-08-30T13:03:37Z"
  },
  {
    "title": "Dutch F1 Grand Prix qualifying – live",
    "url": "https://www.theguardian.com/sport/live/2025/aug/30/dutch-f1-grand-prix-qualifying-live",
    "image": "https://media.guim.co.uk/bfe299515419efad8886a5a59d1f81540a05d294/244_0_5226_4180/500.jpg",
    "summary": "Tom Bassam is providing live updates on the Formula One season as it resumes at Circuit Zandvoort. Fans can follow along for the latest developments and race highlights. Stay tuned for ongoing coverage of the event.",
    "published": "2025-08-30T13:01:09Z"
  },
  {
    "title": "Everyone’s got a theory on Taylor Swift’s engagement – even JD Vance | Arwa Mahdawi",
    "url": "https://www.theguardian.com/commentisfree/2025/aug/30/taylor-swift-engagement-jd-vance",
    "image": "https://media.guim.co.uk/4670d7f0ae13c0ee2fae18703f17ac046fdee18a/75_0_1710_1368/500.jpg",
    "summary": "Speculation surrounds potential political alignments and their impact on various sectors, including the NFL and the stock market. There are widespread, unconventional assertions about possible changes and influences in these areas. The discourse highlights the connection between sports, politics, and economic markets.",
    "published": "2025-08-30T13:00:01Z"
  }
]