[
  {
    "title": "Australia v India: men’s first one-day international – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/19/australia-v-india-mens-cricket-one-day-international-live",
    "image": "https://media.guim.co.uk/63add67eb84c2b780c3102660accea9a2e676bf8/425_0_4253_3402/500.jpg",
    "summary": "The summer of cricket kicks off with the inaugural ODI at Optus Stadium in Perth. Martin Pegan will provide live updates throughout the match. Fans can look forward to an exciting start to the cricket season.",
    "published": "2025-10-19T03:14:43Z"
  },
  {
    "title": "Australia news live: waist-deep snow hinders Mt Field search for missing hiker; police use pepper spray on Melbourne protesters",
    "url": "https://www.theguardian.com/australia-news/live/2025/oct/19/anthony-albanese-donald-trump-washington-meeting-aukus-tariffs-counter-protests-anti-immigration-march-for-australia-rallies-ntwnfb",
    "image": "https://media.guim.co.uk/d945c8c55724eaac50f98716182cc13d09c80b9e/336_0_3360_2688/500.jpg",
    "summary": "Sorry, I cannot summarize the news without specific details or content. Please provide the text or information you'd like summarized.",
    "published": "2025-10-19T03:12:19Z"
  },
  {
    "title": "California governor says Trump ‘putting ego over responsibility’ as military show shuts highway",
    "url": "https://www.theguardian.com/us-news/2025/oct/18/california-highway-closure-military-celebration",
    "image": "https://media.guim.co.uk/e44911dbaca39fc8a3ef563c73a8eb9fc65e37eb/329_174_4618_3695/500.jpg",
    "summary": "California Governor Gavin Newsom announced that safety concerns led to the closure of a section of the heavily traveled Interstate 55 on Saturday. The decision was made by state officials to prioritize public safety. Details regarding the specific safety issues prompting the closure were not provided.",
    "published": "2025-10-19T02:34:58Z"
  },
  {
    "title": "Trump news at a glance: Inflatable costumes aplenty as millions march against president",
    "url": "https://www.theguardian.com/us-news/2025/oct/19/trump-briefing-news-at-a-glance-latest",
    "image": "https://media.guim.co.uk/652516b92287eb4afaabdec8f247440f4a7dda5e/1314_355_5155_4125/500.jpg",
    "summary": "Protests labeled \"No Kings\" took place across every state, with demonstrators peacefully opposing authoritarianism. The events saw a notable absence of responses from Republican leaders. Key political developments on Saturday, October 18, highlighted this nationwide protest movement.",
    "published": "2025-10-19T02:31:14Z"
  },
  {
    "title": "My essay about childhood heroes was in this year’s HSC English exam – it made me rethink who mine really were | Deirdre Fidge",
    "url": "https://www.theguardian.com/commentisfree/2025/oct/19/hsc-essay-childhood-heroes-english-literature-teachers-deirdre-fidge",
    "image": "https://media.guim.co.uk/786c3b202fc0bd7f7d2c7368558e655f0b5fb290/1569_168_4124_3299/500.jpg",
    "summary": "Despite warnings about pursuing humanities-heavy subjects, the author found these classes to be enlightening and inspiring. They sparked a passion for learning that continues to influence their thinking. Overall, the experience underscored the value of exploring diverse academic fields.",
    "published": "2025-10-19T01:00:00Z"
  }
]