[
  {
    "title": "Fast-moving wildfire destroys multiple structures in historic California Gold Rush town",
    "url": "https://www.theguardian.com/us-news/2025/sep/03/california-wildfires-chinese-camp",
    "image": "https://media.guim.co.uk/95472574a31c041a76c2be34086d78e3e945e811/412_0_4821_3855/500.jpg",
    "summary": "A fire in Chinese Camp, a historic town established by Chinese miners in the 1850s, was reportedly ignited by lightning, according to authorities. The blaze has raised concerns among local residents and officials. Firefighters are working to contain the situation and prevent further damage.",
    "published": "2025-09-03T19:24:21Z"
  },
  {
    "title": "US Open tennis 2025: Auger-Aliassime v De Minaur, Anisimova v Swiatek on day 11 – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/03/us-open-tennis-2025-auger-aliassime-v-de-minaur-anisimova-v-swiatek-on-day-11-live",
    "image": "https://media.guim.co.uk/e9b459fae2b4f5f392ec3e23a9e24459715e9f5e/486_391_3470_2776/500.jpg",
    "summary": "Daniel Harris is providing live updates on the singles quarter-finals at Flushing Meadows. Fans can follow the ongoing matches and get real-time news. Stay tuned for exciting developments as the tournament progresses.",
    "published": "2025-09-03T19:22:34Z"
  },
  {
    "title": "Only two more Republicans needed to force vote on Epstein files release, bill co-sponsor says – live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/03/donald-trump-immigration-tariffs-epstein-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/966119b82ed9b3bd7935028173318e2c72db156e/767_0_4248_3398/500.jpg",
    "summary": "Donald Trump dismissed the ongoing attention on Jeffrey Epstein's files as a \"Democrat hoax that never ends.\" This remark comes as a bipartisan group of lawmakers is pushing for a vote on legislation related to the Epstein case. The controversy continues to generate political debate and division.",
    "published": "2025-09-03T19:18:26Z"
  },
  {
    "title": "Manchester United and Manchester City agree deal to swap Clinton and Park",
    "url": "https://www.theguardian.com/football/2025/sep/03/manchester-united-jess-park-manchester-city-wsl-transfers",
    "image": "https://media.guim.co.uk/c7246066b360448e2e517748f9106a4f135ff403/0_95_2888_2310/500.jpg",
    "summary": "Manchester City reportedly tried to sign Grace Clinton from Manchester United in August, but their offer was rejected. Subsequently, Manchester United suggested a swap deal that would involve bringing Jess Park to their side. Discussions around the potential transfer continue between the local rivals.",
    "published": "2025-09-03T19:09:12Z"
  },
  {
    "title": "Roblox to extend age checks in attempt to curb adults talking with children",
    "url": "https://www.theguardian.com/games/2025/sep/03/roblox-age-checks-adults-children-safety",
    "image": "https://media.guim.co.uk/364b963d442ecda4f691fa72170769a777be06aa/0_0_3333_2666/500.jpg",
    "summary": "A company has announced updates to its gaming platform aimed at eliminating \"bad actors\" following concerns about child safety and unsupervised interactions. These changes are intended to enhance the overall safety of the gaming environment for young users. The initiative reflects growing awareness and responses to potential risks in online gaming.",
    "published": "2025-09-03T19:06:02Z"
  }
]