[
  {
    "title": "Scotland v Denmark: World Cup 2026 qualifying – live",
    "url": "https://www.theguardian.com/football/live/2025/nov/18/scotland-v-denmark-world-cup-2026-qualifying-live",
    "image": "https://media.guim.co.uk/36462bea07b6b7ddbd14db5157f9849d00948198/761_0_4927_3943/500.jpg",
    "summary": "Scotland and Denmark face off at Hampden Park, with the match holding significant stakes as the winner secures automatic qualification for the World Cup. The game is being reported on a minute-by-minute basis by Rob Smyth. Fans are eagerly anticipating this crucial encounter.",
    "published": "2025-11-18T18:30:47Z"
  },
  {
    "title": "Trump defends Mohammed bin Salman over killing of Jamal Khashoggi, claiming Saudi crown prince ‘knew nothing about it’ and ‘things happen’ - live",
    "url": "https://www.theguardian.com/world/live/2025/nov/18/donald-trump-mbs-saudi-arabia-meeting-f35-jets-latest",
    "image": "https://media.guim.co.uk/eff19c5c7096d3aaa8a77b9b3a71cc515d836b96/688_0_4335_3468/500.jpg",
    "summary": "President plans to sell F-35 stealth jets to Saudi Arabia during Crown Prince's first visit to the U.S. since the 2018 murder of journalist Jamal Khashoggi. This sale is significant in light of ongoing concerns regarding human rights issues in the kingdom. The visit marks a noteworthy moment in U.S.-Saudi relations.",
    "published": "2025-11-18T18:25:54Z"
  },
  {
    "title": "Cop30 live: Ministers from global north and south unite in call for a roadmap away from fossil fuels",
    "url": "https://www.theguardian.com/environment/live/2025/nov/18/cop30-climate-protests-latest-news-live-updates-brazil-belem",
    "image": "https://media.guim.co.uk/33adf97862b2e7d19e9ee3ffa319b4def763fe53/458_0_4583_3667/500.jpg",
    "summary": "Representatives from Germany, the UK, the Marshall Islands, and other nations have united to advocate for a comprehensive roadmap to transition away from fossil fuels. This initiative aims to address climate change and promote sustainable energy practices. The coalition emphasizes the need for collaborative global action to achieve these goals.",
    "published": "2025-11-18T18:25:01Z"
  },
  {
    "title": "House begins debate on release of Epstein files; Mike Johnson says he’ll back release – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/nov/18/house-vote-jeffrey-epstein-files-donald-trump-republicans-democrats-us-politics-live-news",
    "image": "https://media.guim.co.uk/160648c5e628d6c1d5463a797c324c36b335584b/329_0_3110_2488/500.jpg",
    "summary": "Donald Trump has reversed his stance and supports the release of files related to convicted sex offender Jeffrey Epstein. This decision follows increasing public interest in Epstein's connections and the potential implications for various individuals. The move is expected to facilitate a vote on the disclosure of these documents.",
    "published": "2025-11-18T18:23:12Z"
  },
  {
    "title": "‘I’m missing so much of my son’s life’: the families split by Labour’s asylum crackdown",
    "url": "https://www.theguardian.com/uk-news/2025/nov/18/families-split-by-labour-asylum-crackdown",
    "image": "https://media.guim.co.uk/3b95fd5cc35a6961592ce33da35fb89e0c7e21f1/1365_0_6827_5464/500.jpg",
    "summary": "The UK government is implementing stricter regulations for families of asylum seekers. A mother shares the emotional struggle of being separated from her son, who is growing up without her support. This situation highlights the challenges faced by families affected by new immigration policies.",
    "published": "2025-11-18T18:17:39Z"
  }
]