[
  {
    "title": "First annual drop in UK house asking prices since January 2024",
    "url": "https://www.theguardian.com/business/live/2025/sep/15/uk-house-prices-drop-tax-budget-rents-financial-markets-business-live-news-updates",
    "image": "https://media.guim.co.uk/b87c1709752e74dfedbeafd95d09476194ffe5ab/681_0_4320_3456/500.jpg",
    "summary": "This news features continuous updates on the latest developments in the economy and financial markets. Key topics include fluctuating stock prices, economic indicators, and policy changes. The coverage aims to provide insights for investors and stakeholders navigating the financial landscape.",
    "published": "2025-09-15T09:36:52Z"
  },
  {
    "title": "Trump threatens to call national emergency in Washington DC over Ice cooperation – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/15/donald-trump-politics-washington-dc-national-emergency-ice-charlie-kirk-live-news-updates",
    "image": "https://media.guim.co.uk/be55a3a43c721979621ff247058474aa7a4a8c69/414_0_5000_4000/500.jpg",
    "summary": "The President has pledged to federalize the capital city following the mayor's announcement that local police will not cooperate with Immigration and Customs Enforcement (ICE) during immigration enforcement efforts. This move aims to address tensions between local authorities and federal immigration policies. The situation highlights ongoing debates over immigration enforcement and the authority of local versus federal agencies.",
    "published": "2025-09-15T09:36:13Z"
  },
  {
    "title": "Starmer facing fresh questions over Mandelson emails to Epstein – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/15/keir-starmer-peter-mandelson-labour-reform-tories-uk-politics-live-news-updates",
    "image": "https://media.guim.co.uk/e6ca981e440c9b84157f83965be795310d492cce/170_0_1706_1365/500.jpg",
    "summary": "The Prime Minister faces significant scrutiny regarding his knowledge before last week's Prime Minister's Questions, where he expressed support for the former US ambassador. Critics are demanding clarity on his awareness of any issues related to the ambassador prior to his public backing. This mounting pressure raises questions about accountability and transparency in his leadership.",
    "published": "2025-09-15T09:35:35Z"
  },
  {
    "title": "Surrey v Nottinghamshire, Sussex v Yorkshire, and more: county cricket, day one – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/15/surrey-v-nottinghamshire-sussex-v-yorkshire-and-more-county-cricket-day-one-live",
    "image": "https://media.guim.co.uk/56c7d18a40a9dd3399d29d21be9b1b62a41e7f67/545_0_4868_3894/500.jpg",
    "summary": "Tanya Aldred will provide updates from the Oval on the latest County Championship fixtures. Fans can expect real-time coverage and insights. Stay tuned for all the action and developments in the matches.",
    "published": "2025-09-15T09:35:27Z"
  },
  {
    "title": "‘Forget Adolescence – this is the real victory!’ The biggest shocks from the Emmy awards",
    "url": "https://www.theguardian.com/tv-and-radio/2025/sep/15/forget-adolescence-this-is-the-real-victory-the-biggest-shocks-from-the-emmy-awards",
    "image": "https://media.guim.co.uk/27ad1c6c99fca50c2b95d627a274902b2ac39c68/813_0_2587_2070/500.jpg",
    "summary": "Seth Rogen shone brightly at the event, overshadowing the focus on adolescence. The highlight of the night was the recognition of the most awarded comedy of all time. Rogen's presence underscored the impact of comedy within the evening's celebrations.",
    "published": "2025-09-15T09:33:32Z"
  }
]