[
  {
    "title": "Benfica 0-2 Arsenal: Women’s Champions League – as it happened",
    "url": "https://www.theguardian.com/football/live/2025/oct/16/benfica-v-arsenal-womens-champions-league-live",
    "image": "https://media.guim.co.uk/0b921146054de6ee2f83f2764aac3be6da39041e/3222_842_2200_1760/500.jpg",
    "summary": "Beth Mead and Alessia Russo secured a hard-fought victory for Arsenal in Lisbon. Their goals were crucial in overcoming a challenging match. The win highlights Arsenal's resilience and skill in competitive play.",
    "published": "2025-10-16T21:15:43Z"
  },
  {
    "title": "Sam Fender wins 2025 Mercury prize for his album People Watching",
    "url": "https://www.theguardian.com/music/2025/oct/16/mercury-prize-winner-sam-fender-people-watching",
    "image": "https://media.guim.co.uk/23703de61c772d0efae6f316955ca0b48cf066b5/417_0_4167_3334/500.jpg",
    "summary": "Geordie singer-songwriter's latest album has topped the UK album chart. This success has culminated in a series of large-scale stadium concerts scheduled for this summer. The singer's rising popularity is evident with this remarkable achievement.",
    "published": "2025-10-16T21:14:01Z"
  },
  {
    "title": "Australia news live: Ley challenges Albanese over Trump meeting; storm warning for Sydney",
    "url": "https://www.theguardian.com/australia-news/live/2025/oct/17/australia-news-live-sussan-ley-anthony-albanese-trump-meeting-foi-climate-laws-ntwnfb",
    "image": "https://media.guim.co.uk/99064e784e22d4b81763d913748a54062a6e2c0a/0_0_4913_3931/500.jpg",
    "summary": "Sure! Please provide the news article or details you would like me to summarize.",
    "published": "2025-10-16T21:13:08Z"
  },
  {
    "title": "Trump moves to push employers on IVF coverage and lower fertility drug costs",
    "url": "https://www.theguardian.com/us-news/2025/oct/16/trump-ivf-announcement",
    "image": "https://media.guim.co.uk/fb28973d136cf80d452b0060c7856b34f85be2dd/263_0_3838_3071/500.jpg",
    "summary": "President announces initiatives aimed at increasing the birthrate, suggesting they will result in \"many more beautiful American children.\" However, it's uncertain whether companies will participate in the proposed plans. The announcement has sparked discussions about the effectiveness of such measures.",
    "published": "2025-10-16T21:08:20Z"
  },
  {
    "title": "John Bolton, Trump ally turned critic, indicted on federal charges  – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/16/trump-latest-shutdown-vote-jd-vance-republicans-democrats",
    "image": "https://media.guim.co.uk/92fa2697697fb0e465adab04e4c979b8e74ae568/375_0_3455_2764/500.jpg",
    "summary": "Former National Security Adviser Michael Flynn has been indicted by a grand jury in Maryland. The charges stem from his alleged involvement in illegal lobbying activities. This development marks a significant legal challenge for Flynn amid ongoing investigations related to his actions while in office.",
    "published": "2025-10-16T21:07:40Z"
  }
]