[
  {
    "title": "Justice department will release Epstein files within 30 days, says US attorney general – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/nov/19/us-congress-epstein-files-donald-trump-saudi-arabia-redistricting-latest-news-updates",
    "image": "https://media.guim.co.uk/ab112c869b28d2d647fc8f754d5adade2334ef7f/484_0_3091_2473/500.jpg",
    "summary": "Pam Bondi addressed the press following the US Senate's approval of a bill to release certain files. However, she indicated that an agency might withhold material related to a Trump-ordered investigation. The potential suppression of information raises concerns about transparency and accountability.",
    "published": "2025-11-19T22:18:51Z"
  },
  {
    "title": "Arsenal v Real Madrid: Women’s Champions League – live",
    "url": "https://www.theguardian.com/football/live/2025/nov/19/arsenal-v-real-madrid-womens-champions-league-live",
    "image": "https://media.guim.co.uk/dec7484751b117c9ce2b075127e693073dd0362c/1777_705_2432_1946/500.jpg",
    "summary": "Alessia Russo scored two goals, leading Arsenal to a comeback victory against Real. The match showcased Arsenal's resilience as they overcame a challenging opponent. Scott Murray provided a detailed minute-by-minute report of the thrilling game.",
    "published": "2025-11-19T22:18:43Z"
  },
  {
    "title": "Australia news live: NSW Liberals inch towards leadership spill; Ley to highlight fuel and energy security in major defence speech",
    "url": "https://www.theguardian.com/australia-news/live/2025/nov/20/australia-news-live-volcano-java-labor-nature-laws-coalition-sussan-ley-anthony-albanese-nsw-leadership-spill-liberal-chaos-ntwnfb",
    "image": "https://media.guim.co.uk/500a570bcab3b480699baf8297281ddd6d9e5d78/1172_0_7857_6286/500.jpg",
    "summary": "Please provide the news article or details you would like summarized, and I will be happy to assist!",
    "published": "2025-11-19T22:15:54Z"
  },
  {
    "title": "Cop30 live: Scientists warn countries must act decisively to protect people and life or risk ‘suffering for billions’ – as it happened",
    "url": "https://www.theguardian.com/environment/live/2025/nov/19/cop30-live-brazilian-president-lula-climate-summit-belem-latest-news-updates",
    "image": "https://media.guim.co.uk/35357afced045243f6ac8a856c43cd9dc01e4699/646_0_6455_5164/500.jpg",
    "summary": "President Lula is working to broker agreements among negotiating countries on climate action. Meanwhile, planetary scientists emphasize the urgent need for significant reductions in emissions. The call for swift action highlights the growing urgency of addressing climate change.",
    "published": "2025-11-19T22:10:31Z"
  },
  {
    "title": "Turner: The Secret Sketchbooks review – the sheer number of pornographic drawings is a big shock",
    "url": "https://www.theguardian.com/tv-and-radio/2025/nov/19/turner-the-secret-sketchbooks-review-bbc-two-iplayer",
    "image": "https://media.guim.co.uk/fbdac24d7997cd9900c7ef8a6fb39d718425a82c/0_811_3288_2629/500.jpg",
    "summary": "JMW Turner left approximately 37,000 sketches upon his death, many of which have seldom been viewed. Among these are a significant number of explicit sketches that may provide insights into the enigmatic artist's life and character. The unveiling of these works prompts questions about their implications for understanding Turner.",
    "published": "2025-11-19T22:00:05Z"
  }
]