[
  {
    "title": "Lucas Paquetá faces fine after being found guilty of two misconduct charges ",
    "url": "https://www.theguardian.com/football/2025/sep/02/lucas-paqueta-faces-fine-guilty-misconduct-charges-west-ham",
    "image": "https://media.guim.co.uk/abdee028dda2ac90f77242d816bf8e9363934c4c/944_0_3283_2626/500.jpg",
    "summary": "West Ham forward cleared of spot-fixing allegations in July faces a separate sanctions hearing. The hearing will decide his specific punishment. Further details on the case are awaited as the process unfolds.",
    "published": "2025-09-02T20:29:09Z"
  },
  {
    "title": "Lawyers say men deported by US to Eswatini are being imprisoned illegally",
    "url": "https://www.theguardian.com/us-news/2025/sep/02/lawyers-say-men-deported-by-us-to-eswatini-are-being-imprisoned-illegally",
    "image": "https://media.guim.co.uk/8f469b9a2940dbb354606dd7ace13fdcb422aa5e/695_0_2813_2250/500.jpg",
    "summary": "A group of men from Laos, Vietnam, Cuba, Jamaica, and Yemen has been released after completing their criminal sentences. Their nationality highlights the diverse backgrounds of individuals involved in the justice system. The release signals a step towards reintegration into society for these individuals.",
    "published": "2025-09-02T20:13:30Z"
  },
  {
    "title": "US Open quarter-finals: Alcaraz brushes past Lehecka, Pegula beats Krejcikova – as it happened",
    "url": "https://www.theguardian.com/sport/live/2025/sep/02/us-open-tennis-2025-pegula-alcaraz-quarter-finals-day-ten-live",
    "image": "https://media.guim.co.uk/2e41a729c8402f7e8c83dacd794c276ee8267589/0_0_5000_4000/500.jpg",
    "summary": "Carlos Alcaraz and Jessica Pegula have advanced to the semi-finals of their tournament without losing a single set. Both players showcased their dominance in their respective matches. They continue to impress with their strong performances.",
    "published": "2025-09-02T20:03:11Z"
  },
  {
    "title": "Corrections and clarifications",
    "url": "https://www.theguardian.com/news/2025/sep/02/corrections-and-clarifications",
    "summary": "Ofsted inspections have come under scrutiny following recent reports highlighting inconsistencies and concerns regarding their effectiveness. Critics argue that the inspection process may not accurately reflect the quality of education in schools. Ezz al-Din al-Masri has raised important questions about the need for reform in the inspection system to ensure accountability and support for educational institutions.",
    "published": "2025-09-02T20:00:02Z"
  },
  {
    "title": "Trump announces Space Command will move from Colorado to Alabama – live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/02/congress-returns-government-shutdown-funding-trump-announcement-us-politics-live-latest-updates",
    "image": "https://media.guim.co.uk/37dd38e8ca0e0fcabf8e02a039a62a031d60968c/694_509_4364_3491/500.jpg",
    "summary": "The president designated Huntsville, Alabama, as \"Rocket City\" during his first public appearance in several days. This honor highlights the city's significant contributions to aerospace and rocket development. The announcement emphasizes the pride and recognition associated with Huntsville’s achievements in the field.",
    "published": "2025-09-02T19:54:01Z"
  }
]