[
  {
    "title": "Anderson set for first England call-up, Simons to join Spurs and more: football news – live",
    "url": "https://www.theguardian.com/football/live/2025/aug/29/mourinho-sacked-by-fenerbahce-simmons-to-join-spurs-and-more-football-news-live",
    "image": "https://media.guim.co.uk/182aa86540e51d4d033f724750a140cde435a96e/495_0_2500_2000/500.jpg",
    "summary": "As the weekend approaches, join our writers for the latest updates and insights from the top flight. Stay informed with real-time news leading into the exciting matches ahead. Don't miss out on the action as the countdown begins!",
    "published": "2025-08-29T10:37:05Z"
  },
  {
    "title": "Backlash as White House chooses Robert F Kennedy Jr deputy to run CDC – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/aug/29/cdc-robert-f-kennedy-jr-donald-trump-federal-reserve-lisa-cook-latest-us-politics-news-live-updates",
    "image": "https://media.guim.co.uk/413dc232b37a3613e5c8b3e89e532ae1c69565d8/1429_0_7200_5760/500.jpg",
    "summary": "Senators expressed anger over the recent appointment of Jim O’Neill as the new director of the US Centers for Disease Control and Prevention, replacing Susan Monarez. Concerns were raised regarding O’Neill's qualifications and the potential impact on public health. The decision has sparked significant debate among lawmakers and public health advocates.",
    "published": "2025-08-29T10:35:36Z"
  },
  {
    "title": "Zelenskyy calls for more pressure on Russia so ‘murderers do not feel impunity’ after Thursday’s Kyiv strikes – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/aug/29/ukraine-russia-war-zelenskyy-putin-latest-europe-news-updates-live",
    "image": "https://media.guim.co.uk/c0b037fed46853506ce40735ee8c95e5bbbe0dc6/278_0_4169_3334/500.jpg",
    "summary": "EU defense ministers are set to convene to address the escalating pressures on Russia amid ongoing tensions. Estonian Prime Minister Kaja Kallas has criticized President Putin for undermining peace initiatives. The discussions aim to formulate a coordinated European response to Russia's actions.",
    "published": "2025-08-29T10:30:07Z"
  },
  {
    "title": "Immediate closure of asylum hotels could lead to migrants ‘living destitute in the streets’, says minister – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/aug/29/latest-live-uk-politics-news-updates-asylum-hotels-labour-conservatives-reform",
    "image": "https://media.guim.co.uk/ce98a439324cf0ec721f78c26607e0cdcd8d57b5/137_0_2501_2001/500.jpg",
    "summary": "Stephen Kinnock cautions that a \"disorderly discharge\" from current agreements could exacerbate existing issues. He highlights the potential for greater instability and negative outcomes if proper protocols are not followed. Kinnock urges careful management to avoid worsening the situation.",
    "published": "2025-08-29T10:22:57Z"
  },
  {
    "title": "UK bank shares fall as City fears budget tax raid – business live",
    "url": "https://www.theguardian.com/business/live/2025/aug/29/uk-business-confidence-rises-economy-fears-stock-market-bonds-inflation-business-live-news-updates",
    "image": "https://media.guim.co.uk/f9f48faa306af40f2e67443a8e4d50574e623b44/608_0_4264_3412/500.jpg",
    "summary": "Calls for a tax on bank profits, reminiscent of the Thatcher era, have emerged in the UK as a means to raise billions of pounds. This proposal has caused a stir in the financial markets, leading to a decline in bank share prices. The move aims to address economic challenges and generate additional revenue for public services.",
    "published": "2025-08-29T10:22:47Z"
  }
]