[
  {
    "title": "Liverpool travel to Manchester City, Premier League buildup and more – matchday live",
    "url": "https://www.theguardian.com/football/live/2025/nov/09/liverpool-travel-to-manchester-city-premier-league-buildup-and-more-matchday-live",
    "image": "https://media.guim.co.uk/66cda8a0623858319074a7d0ea823f4a72958e16/0_0_5000_4000/500.png",
    "summary": "Join us for news updates and discussions before the day's events begin. Stay informed with previews of what's to come. Don't miss out on the latest information!",
    "published": "2025-11-09T08:22:05Z"
  },
  {
    "title": "Arundell has god-given talents – it would be a dereliction of duty not to harness them",
    "url": "https://www.theguardian.com/sport/2025/nov/09/arundell-has-god-given-talents-it-would-be-a-dereliction-of-duty-not-to-harness-them",
    "image": "https://media.guim.co.uk/33cc21b5d960ec4872b82a6b7e044f4037d811ea/451_0_4508_3607/500.jpg",
    "summary": "Steve Borthwick faces a challenge in coaching emerging talent Henry Arundell to maximize his speed and potential. Developing Arundell is a key test of Borthwick’s coaching abilities. Success in this endeavor could significantly impact the player's career trajectory.",
    "published": "2025-11-09T08:00:27Z"
  },
  {
    "title": "Developers met ministers dozens of times over planning bill while ecologists were shut out",
    "url": "https://www.theguardian.com/politics/2025/nov/09/developers-met-ministers-dozens-of-times-over-planning-bill-while-ecologists-were-shut-out",
    "image": "https://media.guim.co.uk/b2fa224f6632e69f64ab5361fca2a9ef8d6777e7/259_0_3050_2440/500.jpg",
    "summary": "Leading ecologists warn that the push to construct 1.5 million new homes in the UK has overlooked significant threats to wildlife. They argue that the environmental impacts of this rapid development are being ignored in favor of housing demands. Urgent action and consideration of ecological consequences are needed to protect biodiversity.",
    "published": "2025-11-09T08:00:27Z"
  },
  {
    "title": "‘Never lose hope’: how a new Afghanistan women’s team helps refugees cope with trauma",
    "url": "https://www.theguardian.com/football/2025/nov/09/afghanistan-womens-football-team-refugees",
    "image": "https://media.guim.co.uk/516497b9a6c5c1a6b7e0c166bd36c664c548efcd/541_0_4640_3712/500.jpg",
    "summary": "Afghan Women United is a team formed by female athletes who fled Afghanistan, highlighting their resilience and determination. This initiative represents a significant stride in breaking through substantial obstacles faced by women in sports. It aims to empower these players and promote their visibility in the global sports community.",
    "published": "2025-11-09T08:00:27Z"
  },
  {
    "title": "Drax still burning 250-year-old trees sourced from forests in Canada, experts say",
    "url": "https://www.theguardian.com/business/2025/nov/09/drax-still-burning-250-year-old-trees-sourced-from-forests-in-canada-experts-say",
    "image": "https://media.guim.co.uk/073a055500cb5b3ab35bf173cb10c74b26fb94a5/48_0_2620_2096/500.jpg",
    "summary": "A report by Stand.earth reveals that a subsidiary of a power plant has been receiving truckloads of whole logs at its biomass pellet sites. This practice raises concerns about the sustainability and environmental impact of biomass fuel sourcing. The findings could prompt further scrutiny of the company's operations and their ecological footprint.",
    "published": "2025-11-09T08:00:26Z"
  }
]