[
  {
    "title": "Slavia Prague v Arsenal: Champions League – live",
    "url": "https://www.theguardian.com/football/live/2025/nov/04/slavia-prague-v-arsenal-champions-league-live",
    "image": "https://media.guim.co.uk/6b2b2ee3763857c8957cfd47436b458b101f695b/259_0_4273_3420/500.jpg",
    "summary": "Niall McVeigh provides a minute-by-minute report on the Gunners' match as they aim to extend their winning streak while keeping a clean sheet. Fans can follow live updates to see if the team continues their impressive defensive performance. The excitement builds as the match unfolds.",
    "published": "2025-11-04T19:15:19Z"
  },
  {
    "title": "Tottenham v Copenhagen, PSG v Bayern Munich, and more: Champions League – live",
    "url": "https://www.theguardian.com/football/live/2025/nov/04/tottenham-v-copenhagen-psg-v-bayern-munich-and-more-champions-league-live",
    "image": "https://media.guim.co.uk/14c0253233e4ec9a76c72ac527afcbe86fab1936/303_0_4700_3760/500.jpg",
    "summary": "Rob Smyth will provide live updates on goals and important match events from Tuesday's Champions League games. Tune in for real-time coverage and analysis of the action. Don't miss out on the excitement as teams compete for glory in Europe!",
    "published": "2025-11-04T19:15:18Z"
  },
  {
    "title": "Police investigate four knife incidents possibly linked to Cambridgeshire train attack ",
    "url": "https://www.theguardian.com/uk-news/2025/nov/03/boy-stabbiing-knifeman-barbers-cambridgeshire-train-attack-huntingdon",
    "image": "https://media.guim.co.uk/875be0297672581db59327ea87224e8b0c1cf465/985_0_5000_4000/500.jpg",
    "summary": "Anthony Williams, 32, appeared in court facing attempted murder charges, raising questions about the officers involved in his arrest. The case has attracted significant attention as details emerge surrounding the incident. Investigations into the officers' actions are ongoing.",
    "published": "2025-11-04T19:14:28Z"
  },
  {
    "title": "US elections 2025 live: Mamdani refuses to be ‘intimidated’ by Trump jibes as New York City, New Jersey, Virginia and California vote",
    "url": "https://www.theguardian.com/us-news/live/2025/nov/04/us-elections-2025-live-new-york-city-new-jersey-virginia-california-latest-news-updates-live",
    "image": "https://media.guim.co.uk/88a9be04ff4e347897e06aabd63cfa5e1dbf3434/293_0_2500_2000/500.jpg",
    "summary": "A New York mayoral candidate responded strongly after President Biden referred to any Jewish individual voting for him as \"a stupid person.\" The remark sparked backlash and highlighted tensions surrounding political endorsements within the Jewish community. The candidate aims to clarify their stance and support among Jewish voters.",
    "published": "2025-11-04T19:14:17Z"
  },
  {
    "title": "Liverpool v Real Madrid: Champions League – live",
    "url": "https://www.theguardian.com/football/live/2025/nov/04/liverpool-v-real-madrid-champions-league-live",
    "image": "https://media.guim.co.uk/9c29f50ea70e171ceb22ccee5e66c17a21b47abf/490_0_4063_3251/500.jpg",
    "summary": "Scott Murray is providing live updates as two of football's major teams face off at Anfield. Fans can follow along for minute-by-minute coverage of the match. The event promises intense competition between the prominent rivals.",
    "published": "2025-11-04T19:13:32Z"
  }
]