[
  {
    "title": "Australia v India: fourth men’s Twenty20 international – live",
    "url": "https://www.theguardian.com/sport/live/2025/nov/06/australia-v-india-mens-cricket-twenty20-international-live-updates",
    "image": "https://media.guim.co.uk/32846786b2381c311687d6cd17e962f716617193/0_0_3780_3024/500.jpg",
    "summary": "The T20 series between the two teams is currently tied at 1-1 as they prepare for their penultimate match. Martin Pegan will provide updates on the game. Fans can expect an exciting showdown as both sides aim to take the lead in the series.",
    "published": "2025-11-06T09:21:10Z"
  },
  {
    "title": "Bank of England to make ‘finely balanced decision’ on whether to cut interest rates at midday – business live",
    "url": "https://www.theguardian.com/business/live/2025/nov/06/bank-of-england-interest-rates-andrew-bailey-stock-markets-pound-budget-business-live-news",
    "image": "https://media.guim.co.uk/cf2749c6401a2fc1124fba5bf11661e1d65ffbe6/1032_0_5908_4727/500.jpg",
    "summary": "Analysts anticipate that the Bank of England (BoE) may lower interest rates in today's announcement. This speculation comes amid ongoing economic challenges and financial developments. Continuous updates are being provided to track the evolving situation.",
    "published": "2025-11-06T09:15:53Z"
  },
  {
    "title": "Belgium holds emergency security council meeting to address drone sightings – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/nov/06/europe-latest-live-news-updates-belgium-drones",
    "image": "https://media.guim.co.uk/b26f7f5c26cc80f85fc2e10d0a82b076d81f4ca6/329_0_6880_5504/500.jpg",
    "summary": "Security services suspect that a state actor, likely Russia, is responsible for unauthorized drone flights over military bases and airports. These incursions have raised concerns about potential threats to national security and military operations. Authorities are investigating the extent and implications of these drone activities.",
    "published": "2025-11-06T09:11:59Z"
  },
  {
    "title": "England prison chiefs summoned to urgent meeting with ministers over wrongful releases",
    "url": "https://www.theguardian.com/society/2025/nov/06/england-prison-chiefs-meeting-ministers-wrongful-releases",
    "image": "https://media.guim.co.uk/b06b0840abd4cce02f44db412b83da23788eee43/338_0_3045_2437/500.jpg",
    "summary": "The justice minister announced plans for a digital team to modernize the outdated paper-based system, which has contributed to the wrongful release of 22 individuals each month. This overhaul aims to improve accuracy in the justice process. The initiative is part of broader reforms to enhance legal efficiency and accountability.",
    "published": "2025-11-06T09:02:35Z"
  },
  {
    "title": "Train Dreams review – Joel Edgerton superb in Malickian story of trees, grief and railroads",
    "url": "https://www.theguardian.com/film/2025/nov/06/train-dreams-reviewjoel-edgerton-denis-johnson",
    "image": "https://media.guim.co.uk/ee2d7591a2cfc3299fbe7f87066d8391365af557/511_0_6177_4943/500.jpg",
    "summary": "Clint Bentley's adaptation showcases a logger navigating transformative changes in a visually striking sunset setting. The film highlights the director's impressive ability to evoke emotion and power through storytelling. Overall, it presents a compelling narrative on personal and environmental evolution.",
    "published": "2025-11-06T09:00:50Z"
  }
]