[
  {
    "title": "US Open tennis 2025: injured Draper withdraws, Raducanu on day four – live",
    "url": "https://www.theguardian.com/sport/live/2025/aug/27/us-open-tennis-2025-raducanu-djokovic-and-pegula-in-action-on-day-four-live",
    "image": "https://media.guim.co.uk/2594a80a2dfc6566ecbe4d909f5c916fa7144db5/703_0_3651_2921/500.jpg",
    "summary": "Join Daniel Harris for live updates on an eventful day of action at Flushing Meadows, featuring exciting developments and ongoing competitions. Stay tuned for the latest highlights and key moments from the venue. Don't miss out on the thrilling atmosphere of the event!",
    "published": "2025-08-27T19:24:00Z"
  },
  {
    "title": "Club Brugge v Rangers, Grimsby v Manchester United and more: Champions League and Carabao Cup – live",
    "url": "https://www.theguardian.com/football/live/2025/aug/27/club-brugge-v-rangers-grimsby-v-manchester-united-and-more-champions-league-and-carabao-cup-live",
    "image": "https://media.guim.co.uk/4095e24ac40ee0b149a6a2c489d28e5649f0dcaa/101_0_1698_1358/500.jpg",
    "summary": "Simon Burnton will provide live updates on Wednesday's Champions League qualifiers and the Carabao Cup matches. Fans can follow the developments and key moments from these exciting football fixtures. Stay tuned for real-time coverage of all the action.",
    "published": "2025-08-27T19:23:46Z"
  },
  {
    "title": "‘Alligator Alcatraz’ to be vacated in compliance with court order to shut it",
    "url": "https://www.theguardian.com/us-news/2025/aug/27/alligator-alcatraz-immigration-detention-florida-desantis",
    "image": "https://media.guim.co.uk/4a95cd1cd6e544745d5d8ab3fd7b245e5c2ac7cb/434_0_5001_4000/500.jpg",
    "summary": "A state official's email has confirmed that a prison will be closed despite Governor Ron DeSantis's appeal against the decision. The move has drawn attention as it highlights tensions between state officials and the governor. The closure signals a significant shift in the state's correctional policies.",
    "published": "2025-08-27T19:22:21Z"
  },
  {
    "title": "Fulton county election board faces $10,000 a day fine for not appointing Republicans",
    "url": "https://www.theguardian.com/us-news/2025/aug/27/fulton-county-commissioners-jail-time-election-board-appointments",
    "image": "https://media.guim.co.uk/62ed57f13e14faf414eebd2cb238f7e124cb4b0d/1027_635_4154_3322/500.jpg",
    "summary": "Democrats opposed the appointment of two candidates identified with election denialism and efforts to challenge voter registration. This move reflects concerns over maintaining the integrity of the electoral process. The decision highlights ongoing partisan divisions surrounding voting rights and election administration.",
    "published": "2025-08-27T19:16:24Z"
  },
  {
    "title": "DC mayor says she ‘greatly appreciates’ Trump’s surge of federal officers but adds there is ‘break in trust’ with residents – live",
    "url": "https://www.theguardian.com/us-news/live/2025/aug/27/donald-trump-tariffs-india-us-politics-latest-updates-news",
    "image": "https://media.guim.co.uk/d177295067471293c059b67a1e36b203dcf55799/563_0_4513_3610/500.jpg",
    "summary": "Muriel Bowser stated that she and the president did not discuss his potential plan to extend federal oversight. Such an extension would require approval from Congress. The lack of dialogue on this topic highlights differing priorities.",
    "published": "2025-08-27T19:08:36Z"
  }
]