[
  {
    "title": "Australia news live: Greens label Chalmers’ super tax plan ‘a gift to the super-rich’; Victoria police to be restructured as commissioner admits ‘crime problem’",
    "url": "https://www.theguardian.com/australia-news/live/2025/oct/13/australia-news-live-qantas-hack-data-leak-scam-warning-nsw-sydney-potholes-social-media-ban-anika-wells-albanese-sussan-ley-labor-liberal-coalition-ntwnfb",
    "image": "https://media.guim.co.uk/62c583b76bf79e1a23b826591d187440e3c9ab8a/464_0_6880_5504/500.jpg",
    "summary": "It seems like you haven't provided the news content you'd like summarized. Please share the text, and I'll be happy to help!",
    "published": "2025-10-13T04:22:55Z"
  },
  {
    "title": "Gaza ceasefire live: Israeli hostages due to be released as Trump says ‘war is over’ and flies to Middle East",
    "url": "https://www.theguardian.com/world/live/2025/oct/13/gaza-ceasefire-live-updates-israel-hostages-release-hamas-trump-middle-east",
    "image": "https://media.guim.co.uk/0dd046a65799a4d82be460f1daeb08007faaa040/831_0_4167_3335/500.jpg",
    "summary": "The US president is set to arrive in Israel around the time Hamas is expected to release 20 Israeli hostages. In a reciprocal move, Israel plans to free approximately 2,000 Palestinian detainees. Stay tuned for further updates on this evolving situation.",
    "published": "2025-10-13T04:22:04Z"
  },
  {
    "title": "‘A hunger for wild, physical sensation’: Alan Hollinghurst on painter and writer Denton Welch who died tragically young",
    "url": "https://www.theguardian.com/artanddesign/2025/oct/13/alan-hollinghurst-denton-welch",
    "image": "https://media.guim.co.uk/e6aff03b730fe5f91e6bff6ec5a5491836c961f1/32_0_2812_2250/500.jpg",
    "summary": "A young painter, recovering from serious injuries after a biking accident, turned to writing with remarkable intensity. His artwork is being showcased, prompting novelist Alan Hollinghurst to acknowledge and celebrate his impressive talent. The painter's dual creative expressions highlight his resilience and artistic prowess.",
    "published": "2025-10-13T04:01:10Z"
  },
  {
    "title": "A new island erupted from the sea – can it show us how nature works without human interference?",
    "url": "https://www.theguardian.com/environment/2025/oct/13/nature-volcanic-island-surtsey-iceland-ecosystems-aoe",
    "image": "https://media.guim.co.uk/a0838b6f19c6e7a0dea6b87bcf4d8bf33b166cc1/259_0_4667_3732/500.jpg",
    "summary": "The volcanic island of Surtsey, which formed in the 1960s, serves as a crucial case study for scientists exploring ecosystem recovery. Research on its development provides insights into restoring damaged environments globally. This unique site continues to inform ecological restoration efforts through its natural progression.",
    "published": "2025-10-13T04:00:12Z"
  },
  {
    "title": "Trump calls climate science a ‘con job’. That could make tackling the crisis a whole lot easier | Francesco Grillo",
    "url": "https://www.theguardian.com/commentisfree/2025/oct/13/donald-trump-withdrawal-paris-agreement-tackling-climate-crisis-easier",
    "image": "https://media.guim.co.uk/775f1cf985e5db35d1e46a7222d131ee0c43baae/0_26_3224_2579/500.jpg",
    "summary": "Europe and Brazil have a unique chance to successfully host Cop30 without US influence, according to Francesco Grillo from the European University Institute in Florence. This moment allows them to foster collaboration and address global challenges. Grillo suggests that this could play a significant role in reshaping the global order.",
    "published": "2025-10-13T04:00:12Z"
  }
]