[
  {
    "title": "NFL week 10 live: Indianapolis Colts v Atlanta Falcons in Berlin – live",
    "url": "https://www.theguardian.com/sport/live/2025/nov/09/nfl-week-10-live-vikings-ravens-jets-browns-dolphins-bills-live",
    "image": "https://media.guim.co.uk/443de1c90a43b78b33d7226e03032a3bbd853c28/175_0_2027_1621/500.jpg",
    "summary": "Seven NFL games are set to begin at 6 PM UK time, starting with the matchup between Atlanta and Indianapolis in Berlin. Graham Searles will provide comprehensive coverage of the event. Fans can look forward to an exciting evening of football action.",
    "published": "2025-11-09T16:21:38Z"
  },
  {
    "title": "Brentford 3-1 Newcastle, Aston Villa 4-0 Bournemouth and more: Premier League clockwatch – live",
    "url": "https://www.theguardian.com/football/live/2025/nov/09/crystal-palace-v-brighton-brentford-v-newcastle-and-more-premier-league-clockwatch-live",
    "image": "https://media.guim.co.uk/a6d4a7fd9d11f4111c2b38d352e8617c0ccc1ad7/369_0_4063_3249/500.jpg",
    "summary": "Brentford, Aston Villa, and Nottingham Forest celebrated home victories in recent matches. Meanwhile, a derby at Selhurst Park ended in a draw. Reactions from writers highlight the key moments and performances from these games.",
    "published": "2025-11-09T16:19:30Z"
  },
  {
    "title": "Flight cancellations rise as Sean Duffy warns travel could reduce to a ‘trickle’",
    "url": "https://www.theguardian.com/us-news/2025/nov/09/flight-cancellations-government-shutdown",
    "image": "https://media.guim.co.uk/ac146cc79e022f87a2ac0b8629f6173e8bd0b9c0/473_0_4733_3787/500.jpg",
    "summary": "Over 2,500 flights have been canceled due to ongoing issues, prompting the transportation secretary to warn that flight reductions could escalate to 20% if the shutdown continues. This disruption highlights the significant impact on air travel and related services. Travelers are advised to stay updated on flight statuses as the situation evolves.",
    "published": "2025-11-09T16:18:35Z"
  },
  {
    "title": "Late Thiago double earns comeback win for Brentford against 10-man Newcastle",
    "url": "https://www.theguardian.com/football/2025/nov/09/brentford-newcastle-premier-league-match-report",
    "image": "https://media.guim.co.uk/0e4d089ba2890e0b17e2c8a6311f62fc2655197a/488_117_3063_2450/500.jpg",
    "summary": "Brentford defeated Newcastle 3-1, with Kevin Schade scoring a goal. Newcastle initially took the lead with a goal from Harvey Barnes, but Dan Burn's red card shifted the match's momentum. Brentford capitalized on the situation to secure the victory.",
    "published": "2025-11-09T16:17:08Z"
  },
  {
    "title": "Carlos Alcaraz up and running at ATP Finals with win over Alex de Minaur",
    "url": "https://www.theguardian.com/sport/2025/nov/09/atp-finals-carlos-alcaraz-alex-de-minaur-zverev-shelton-tennis",
    "image": "https://media.guim.co.uk/31fb0dcf51aa136363a521c5e343ebc80fe8e155/405_0_4045_3236/500.jpg",
    "summary": "Carlos Alcaraz won his opening match at the ATP Finals in Turin, defeating Alex de Minaur with a score of 7-6 (5), 6-2. This victory sets a positive tone for Alcaraz’s campaign in the prestigious tournament. The match showcased Alcaraz's strong performance, particularly in the second set.",
    "published": "2025-11-09T16:16:20Z"
  }
]