[
  {
    "title": "Home Office says injunction against Epping hotel would have ‘serious impact’ on UK’s ability to house asylum seekers - UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/aug/28/latest-uk-politics-news-keir-starmer-rachel-reeves-labour-live-updates",
    "image": "https://media.guim.co.uk/ce98a439324cf0ec721f78c26607e0cdcd8d57b5/137_0_2501_2001/500.jpg",
    "summary": "The Director of Asylum Support testified during a court of appeal hearing that closing the Bell Hotel could set a dangerous precedent. He warned that such a move might incite public disorder in other areas. The implications of this closure are significant for asylum policies and community stability.",
    "published": "2025-08-28T15:35:13Z"
  },
  {
    "title": "Trump’s border czar says there will be a ‘ramp up’ of Ice operations in Democratic-led cities – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/aug/28/cdc-susan-monarez-trump-news-updates-us-politics-live",
    "image": "https://media.guim.co.uk/7f889abfd676bfeef05e9a62dc73b0a35a85ba77/333_0_3333_2667/500.jpg",
    "summary": "Tom Homan announced that ICE plans to enhance its operations in Chicago and other Democratic-led cities following Labor Day. He defended the decision to expand federal presence in Washington, D.C. under the current administration. The move reflects the agency's focus on increasing enforcement in areas with differing immigration policies.",
    "published": "2025-08-28T15:34:57Z"
  },
  {
    "title": "Activists blend science and folklore as they try to revive Somerset’s eel population ",
    "url": "https://www.theguardian.com/uk-news/2025/aug/28/activists-blend-science-and-folklore-as-they-try-to-revive-somersets-eel-population",
    "image": "https://media.guim.co.uk/3134505d3167027c44015a69b6ab285b7708d356/98_0_464_371/464.jpg",
    "summary": "Hugh Fearnley-Whittingstall and Feargal Sharkey are supporting a campaign aimed at saving the UK's native songbird, the nightingale. This bird historically inspired place names, songs, and stories. The campaign highlights the urgent need for conservation efforts to protect this iconic species.",
    "published": "2025-08-28T15:32:41Z"
  },
  {
    "title": "US Open tennis 2025: Iga Swiatek, Jannik Sinner and Naomi Osaka in action on day five – live",
    "url": "https://www.theguardian.com/sport/live/2025/aug/28/us-open-tennis-2025-swiatek-sinner-osaka-musetti-day-five-live",
    "image": "https://media.guim.co.uk/287417a046db367d2d9ac751cefbda31f95d1f70/303_0_4568_3655/500.jpg",
    "summary": "Daniel Harris provides live updates from the second round of events in New York. Stay tuned for ongoing coverage and key highlights. Follow along to catch the latest developments.",
    "published": "2025-08-28T15:31:44Z"
  },
  {
    "title": "Police warn over misinformation after incident involving Dundee girl, 12",
    "url": "https://www.theguardian.com/uk-news/2025/aug/28/police-scotland-warn-misinformation-12-year-old-girl-dundee",
    "image": "https://media.guim.co.uk/26abf632b549273e1257dae7cb7e3b645357fcc6/0_0_5906_4724/500.jpg",
    "summary": "Alleged footage circulating on social media is gaining attention, with prominent figures like Elon Musk and Tommy Robinson sharing it. This has sparked discussions and debates among users regarding the video's content and context. The situation highlights the influence of social media in amplifying narratives and misinformation.",
    "published": "2025-08-28T15:30:11Z"
  }
]