[
  {
    "title": "Strictly Come Dancing: week six results – live",
    "url": "https://www.theguardian.com/tv-and-radio/live/2025/nov/01/strictly-come-dancing-week-six-live",
    "image": "https://media.guim.co.uk/7aa4ad5f0a7f638d28fdc5dc997c1c30da9ce108/0_1003_3304_2644/500.jpg",
    "summary": "In this year's Halloween Spooktacular, Lewis Cope achieved the first perfect score of 40, while Karen Carney impressed with her performance themed around Peaky Blinders. Several pairs struggled at the bottom of the leaderboard, raising questions about who will face elimination. The competition intensifies as contestants vie for survival in the show.",
    "published": "2025-11-02T19:13:04Z"
  },
  {
    "title": "India beat South Africa by 52 runs to win Women’s Cricket World Cup final – live reaction",
    "url": "https://www.theguardian.com/sport/live/2025/nov/02/india-v-south-africa-womens-cricket-world-cup-final-live",
    "image": "https://media.guim.co.uk/0280e2a0e1f3fb983d3af7ee5cc3d355d3b6d14d/631_690_1366_1092/500.jpg",
    "summary": "India has claimed its inaugural Women's World Cup title following a significant 52-run victory. The match marks a historic milestone for the Indian women's cricket team. Join Tim de Lisle for further reactions and insights.",
    "published": "2025-11-02T19:13:04Z"
  },
  {
    "title": "NFL week nine: Colts v Steelers, Falcons v Patriots, Texans v Broncos and more – live",
    "url": "https://www.theguardian.com/sport/live/2025/nov/02/nfl-week-nine-colts-v-steelers-falcons-v-patriots-chiefs-bills-live",
    "image": "https://media.guim.co.uk/734c68a81f7e403f3cbf568c18da3a96f02b8f0b/0_0_6459_5168/500.jpg",
    "summary": "Graham Searles provides updates on a busy day filled with sports events. The highlights include key moments and matches leading up to the highly anticipated Chiefs vs. Bills game. This matchup is set to be a thrilling conclusion to the day's action.",
    "published": "2025-11-02T19:12:22Z"
  },
  {
    "title": "Southampton sack Will Still after dropping into Championship relegation zone",
    "url": "https://www.theguardian.com/football/2025/nov/02/southampton-sack-will-still-after-dropping-into-championship-relegation-zone",
    "image": "https://media.guim.co.uk/d4af42d4e7a0422f7666c93b1ae82627249150d5/276_0_2375_1901/500.jpg",
    "summary": "Southampton has fired head coach Will Still following the team's decline into the Championship relegation zone. The decision comes amid disappointing performances and results. The club will now search for a new manager to stabilize their position.",
    "published": "2025-11-02T19:10:52Z"
  },
  {
    "title": "Coco Gauff’s serving troubles return in WTA Finals defeat against Pegula",
    "url": "https://www.theguardian.com/sport/2025/nov/02/coco-gauffs-serving-troubles-return-in-wta-finals-defeat-against-pegula",
    "image": "https://media.guim.co.uk/ca663a3223ee2022af7aad0565094c0b979dfc15/443_0_3439_2751/500.jpg",
    "summary": "Jessica Pegula triumphed over Coco Gauff with a score of 6-3, 6-7 (4), 6-2 in a hard-fought match. Aryna Sabalenka also secured a straight-set victory against Jasmine Paolini in her opening match in Riyadh. Both players delivered strong performances in the tournament.",
    "published": "2025-11-02T19:07:32Z"
  }
]