[
  {
    "title": "Premier League returns with Postecoglou taking Nottingham Forest to Arsenal – matchday live",
    "url": "https://www.theguardian.com/football/live/2025/sep/13/premier-league-returns-with-postecoglou-taking-nottingham-forest-to-arsenal-matchday-live",
    "image": "https://media.guim.co.uk/23dd2966a3097db39c29561d6a635ae8a072a9d4/0_0_5000_4000/500.jpg",
    "summary": "Tom Bassam shares excitement for the impending return of the Premier League. Arsenal is gearing up to face Nottingham Forest in the lunchtime kickoff. Fans are eagerly awaiting the match as the season resumes.",
    "published": "2025-09-13T09:24:27Z"
  },
  {
    "title": "US college campuses have faced hoax calls about gunmen since Charlie Kirk shooting – live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/13/charlie-kirk-suspect-tyler-robinson-erika-kirk-us-politics-latest-news-donald-trump",
    "image": "https://media.guim.co.uk/a1160b34a9b2a41b02beffb129ff464cc9bef1ff/678_0_5924_4739/500.jpg",
    "summary": "Several historically Black colleges were placed on lockdown or canceled classes in response to threats received, following the recent fatal shooting of Charlie Kirk. Law enforcement is investigating these threats and ensuring campus safety. The incidents highlight ongoing concerns about security at educational institutions.",
    "published": "2025-09-13T09:24:08Z"
  },
  {
    "title": "Brisbane v Gold Coast: AFL 2025 second semi-final – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/13/afl-2025-second-semi-final-brisbane-v-gold-coast-live",
    "image": "https://media.guim.co.uk/a8633e40c7af2ad3327b440e827588aa849f8375/170_0_4709_3769/500.jpg",
    "summary": "The Brisbane Lions face off against the Gold Coast Suns at the Gabba, competing for a spot in the preliminary final against Collingwood. Updates and goal-by-goal reports will be provided by Geoff Lemon. The match promises to be a tense showdown with significant stakes.",
    "published": "2025-09-13T09:20:33Z"
  },
  {
    "title": "World Athletics Championships: 100m heats, women’s 10,000m final and more on night one – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/13/world-athletics-championships-100m-heats-womens-10000m-final-and-more-on-night-one-live",
    "image": "https://media.guim.co.uk/4668e8c4e2f527cd20c1f9a90d7c114655efe7b5/472_59_2639_2111/500.jpg",
    "summary": "John Brewin provides live updates from the inaugural evening session in Tokyo. Stay tuned for the latest developments and highlights. Follow for in-depth coverage of the event.",
    "published": "2025-09-13T09:19:45Z"
  },
  {
    "title": "Starmer’s team has ‘gone into the bunker’ since cabinet reshuffle, says Labour MP – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/13/uk-politics-latest-news-unite-the-kingdom-march-far-right-rally-london-labour-keir-starmer",
    "image": "https://media.guim.co.uk/aeb340f70dde2810175815d42830148a9e371293/734_482_3266_2613/500.jpg",
    "summary": "Following Angela Rayner's resignation and Peter Mandelson's dismissal, Labour MPs are questioning Sir Keir Starmer's leadership and potential challenges to his position as Prime Minister. The developments have sparked discussions about the future direction of the party. Tensions within Labour hint at growing uncertainty around Starmer's leadership stability.",
    "published": "2025-09-13T09:08:41Z"
  }
]