[
  {
    "title": "Thomas Partey could play for Villarreal at Tottenham on eve of court hearing",
    "url": "https://www.theguardian.com/football/2025/sep/15/thomas-partey-villarreal-tottenham-champions-league-football-court-hearing",
    "image": "https://media.guim.co.uk/6fae9da49e1b8d1b6d506880a28aa4c86269ba53/278_0_3211_2569/500.jpg",
    "summary": "Thomas Partey is set to appear in Southwark crown court on Wednesday to face rape charges. This comes just after his new club, Villarreal, begins their Champions League campaign against Tottenham on Tuesday. The situation raises questions about his participation and focus during this critical time.",
    "published": "2025-09-15T20:27:35Z"
  },
  {
    "title": "Surrey restrict Notts batters as weather hits schedule: county cricket – as it happened",
    "url": "https://www.theguardian.com/sport/live/2025/sep/15/surrey-v-nottinghamshire-sussex-v-yorkshire-and-more-county-cricket-day-one-live",
    "image": "https://media.guim.co.uk/027cb4b2165737228df1f412442457907b2fa7e3/0_0_4518_3616/500.jpg",
    "summary": "On day one, Surrey bowled out their Division One rivals for 231 runs at the Oval. This strong performance reinforces Surrey's position as the league leaders. The match highlights Surrey's dominance in the competition.",
    "published": "2025-09-15T20:27:10Z"
  },
  {
    "title": "No ‘funky rugby’: new England coach Lee Blackett targets substance over style",
    "url": "https://www.theguardian.com/sport/2025/sep/15/lee-blackett-england-attack-coach-rugby-world-cup-2027",
    "image": "https://media.guim.co.uk/4046346126fb955e7ab82ac96471b35f075d4149/408_0_3515_2813/500.jpg",
    "summary": "Steve Borthwick's new attack coach is optimistic about building a winning culture for the team. With the 2027 World Cup approaching, he feels there is sufficient time to implement changes. The focus is on enhancing performance and success ahead of the tournament.",
    "published": "2025-09-15T20:18:44Z"
  },
  {
    "title": "Vance urges people to go hard against anyone ‘justifying or celebrating’ Charlie Kirk’s killing – live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/15/donald-trump-politics-washington-dc-national-emergency-ice-charlie-kirk-live-news-updates",
    "image": "https://media.guim.co.uk/aef7e68e1b24d06d0ca8cf103cbf1f34c0976c2c/33_0_3190_2552/500.jpg",
    "summary": "JD Vance stated that the Trump administration would take action against individuals who celebrate the death of conservative commentator Charlie Kirk and promote political violence. He emphasized a commitment to countering hostility directed at their supporters. Vance's remarks highlight a broader defense of conservative values amidst increasing political tensions.",
    "published": "2025-09-15T20:16:54Z"
  },
  {
    "title": "What do the circus and US politics have in common? Ask these Black and brown circus artists ",
    "url": "https://www.theguardian.com/culture/2025/sep/15/international-black-indigenous-circus-philadelphia",
    "image": "https://media.guim.co.uk/7fa88f30432238b3b4fd57e81a316e1713e74a1c/342_0_4561_3648/500.jpg",
    "summary": "International Black Indigenous Circus Week takes place in Philadelphia, celebrating diverse circus arts through various performances and panels. Artists specializing in aerial skills, juggling, and clowning come together to showcase their talents. The event aims to highlight and honor the contributions of Black and Indigenous performers in the circus community.",
    "published": "2025-09-15T20:04:43Z"
  }
]