[
  {
    "title": "Trump hints at ‘something good’ after Ukraine peace talks as EU says ‘work remains’ – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/nov/24/ukraine-russia-war-peace-talks-europe-us-trump-germany-latest-updates",
    "image": "https://media.guim.co.uk/2652d12c781637ae1bfff112ebf12968267f63f2/565_0_5160_4128/500.jpg",
    "summary": "EU leaders acknowledged recent advancements in various areas but stressed that significant challenges remain unresolved. German politician Friedrich Merz highlighted that achieving peace is a gradual process that cannot be expedited. The discussions reflect ongoing efforts towards stability amid persistent obstacles.",
    "published": "2025-11-24T13:32:09Z"
  },
  {
    "title": "US reportedly ready for next phase of Venezuela military operations – live",
    "url": "https://www.theguardian.com/us-news/live/2025/nov/24/us-politics-trump-venezuela-marjorie-tayor-greene-latest-updates",
    "image": "https://media.guim.co.uk/bd47ce712adff823ff5ff656368093e9e741d82d/133_0_3277_2621/500.jpg",
    "summary": "The Trump administration has designated Venezuelan leader Nicolás Maduro as a member of a foreign terrorist organization. This designation could pave the way for new sanctions against Venezuela. The move aims to apply further pressure on Maduro's regime amidst ongoing political and economic turmoil in the country.",
    "published": "2025-11-24T13:28:25Z"
  },
  {
    "title": "Badenoch says growth being held up because ‘the state is too big’ and claims she is getting better at being Tory leader – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/nov/24/budget-labour-rachel-reeves-criticism-conservatives-nigel-farage-latest-news-updates",
    "image": "https://media.guim.co.uk/abd9c9598419a0dac5c8858ce536b162cc8856f3/264_0_4020_3216/500.jpg",
    "summary": "Kemi Badenoch addressed the CBI conference, highlighting a growing concern that a declining workforce is increasingly burdened with supporting a larger number of unemployed individuals. She emphasized the need for effective policies to address this imbalance. The comments reflect ongoing challenges in the job market and economic landscape.",
    "published": "2025-11-24T13:27:27Z"
  },
  {
    "title": "UK wildfires devastated more areas in 2025 than at any time since records began, figures show",
    "url": "https://www.theguardian.com/world/2025/nov/24/uk-wildfires-more-areas-in-2025-than-since-records-began",
    "image": "https://media.guim.co.uk/27ae0445cce1a30b08e56e31a18066b015b0ff89/421_0_3750_3000/500.jpg",
    "summary": "Firefighters in the UK are urging for long-term funding to address growing challenges posed by climate change. They warn that the nation is inadequately prepared to handle increasing fire risks and extreme weather events. This call to action emphasizes the urgent need for enhanced resources and support for firefighting efforts.",
    "published": "2025-11-24T13:23:50Z"
  },
  {
    "title": "Bad Omens review – anthemic songs and pillars of fire dampened by arena nerves",
    "url": "https://www.theguardian.com/music/2025/nov/24/bad-omens-review-ovo-hydro-glasgow",
    "image": "https://media.guim.co.uk/3f768e3c998563bf5e7c9ff3846bdfdff6d8efa7/455_0_4553_3644/500.jpg",
    "summary": "Noah Sebastian showcases impressive vocal versatility, seamlessly transitioning between crooning, screaming, and whispering. However, the US metalcore band's performance on stage struggles with chemistry. Overall, their dynamic range isn't enough to create a cohesive live experience.",
    "published": "2025-11-24T13:21:08Z"
  }
]