[
  {
    "title": "Australia v England: Ashes second Test, day four – live",
    "url": "https://www.theguardian.com/sport/live/2025/dec/07/australia-vs-england-live-ashes-second-2nd-test-day-four-aus-v-eng-cricket-scores-updates-gabba-brisbane",
    "image": "https://media.guim.co.uk/016bb1f8ea7ef7189e3620bf15702504082081cf/1437_187_3368_2694/500.jpg",
    "summary": "England faces a challenging situation in Brisbane as they attempt to turn the tide in a tough match. Join James Wallace for live updates and an over-by-over report from the Gabba. The team will need a remarkable performance to secure victory.",
    "published": "2025-12-07T08:24:17Z"
  },
  {
    "title": "Premier League buildup, FA Cup second round updates, and more – live",
    "url": "https://www.theguardian.com/football/live/2025/dec/07/premier-league-buildup-fa-cup-second-round-updates-and-more-live",
    "image": "https://media.guim.co.uk/9b6a91e516d60b8e80c79f7e65ac248e188ca955/0_0_5000_4000/500.jpg",
    "summary": "Join our writers for coverage leading up to the FA Cup matches featuring Brighton against West Ham and Fulham facing Crystal Palace. Stay updated on the latest developments in Scottish and European football as well. Don't miss out on the excitement of these key matchups!",
    "published": "2025-12-07T08:10:49Z"
  },
  {
    "title": "From bricklayer to mayor: Steve Rotheram is quietly building a Liverpool success story ",
    "url": "https://www.theguardian.com/politics/2025/dec/07/from-bricklayer-to-mayor-steve-rotheram-is-quietly-building-a-liverpool-success-story",
    "image": "https://media.guim.co.uk/0e710542a9ff193ae84e169b96332c0838dd9f88/522_0_5217_4174/500.jpg",
    "summary": "A highly regarded figure known for his effective leadership is set to embark on ambitious initiatives for his city. He is recognized as having the ideal position within the community. The plans aim to significantly enhance the local area and its opportunities.",
    "published": "2025-12-07T08:00:16Z"
  },
  {
    "title": "Gambling addicts risk losing ‘life-saving’ help due to funding overhaul, say UK charities",
    "url": "https://www.theguardian.com/society/2025/dec/07/gambling-addicts-funding-uk-charities-levy-system",
    "image": "https://media.guim.co.uk/e0a9190678e0ad16cb8762592b7eca7652c3546c/995_0_5021_4016/500.jpg",
    "summary": "Specialist clinics and support groups are urging the government for emergency assistance due to delays linked to a new levy system. They highlight that these delays are negatively impacting patient care and access to necessary services. There is a growing concern that immediate action is needed to alleviate the strain on healthcare providers.",
    "published": "2025-12-07T08:00:15Z"
  },
  {
    "title": "Don’t use ‘admin’: UK’s top 20 most-used passwords revealed as scams soar",
    "url": "https://www.theguardian.com/money/2025/dec/07/uk-top-20-most-used-passwords-scams-cybersecurity",
    "image": "https://media.guim.co.uk/5a7606cf38d1606752b721bfed098b36e4290f8e/937_0_4685_3748/500.jpg",
    "summary": "Experts are concerned that easy-to-guess passwords and security figures remain widespread, posing significant risks to cybersecurity. This trend not only compromises individual and organizational security but also provides hackers with more opportunities for unauthorized access. The reliance on simple passwords highlights the need for improved security practices and awareness.",
    "published": "2025-12-07T07:00:15Z"
  }
]