[
  {
    "title": "European defence company shares and gas prices fall after US and Ukraine discuss Russia peace plan – business live",
    "url": "https://www.theguardian.com/business/live/2025/nov/24/bhp-walks-away-takeover-approach-anglo-mining-merger-uk-budget-cbi-ftse-pound-business-live-news",
    "image": "https://media.guim.co.uk/6797c69e1e249d8761d0831bc75b874ed8f2d080/301_0_4164_3333/500.jpg",
    "summary": "BHP has faced another rejection from mining rival Anglo American in its pursuit of a merger or acquisition. This ongoing situation highlights the competitive nature of the mining industry and the challenges faced by BHP. The news comes amidst broader developments in the economic and financial landscape.",
    "published": "2025-11-24T08:28:35Z"
  },
  {
    "title": "Teenager dies after being stabbed in Sydney’s north-west ",
    "url": "https://www.theguardian.com/australia-news/2025/nov/24/teenager-dies-after-being-stabbed-in-sydneys-north-west-ntwnfb",
    "image": "https://media.guim.co.uk/8fae3335b5e3af4f9c1bfb011b6dcd2ab1126055/893_0_4796_3837/500.jpg",
    "summary": "A 17-year-old boy with stab wounds received treatment from NSW paramedics but tragically died at the scene. Authorities are investigating the circumstances surrounding the incident. The case has raised concerns about youth violence in the area.",
    "published": "2025-11-24T08:16:37Z"
  },
  {
    "title": "Tom Brady’s part-time side hustle with the Raiders is an unholy mess",
    "url": "https://www.theguardian.com/sport/2025/nov/24/las-vegas-raiders-tom-brady-nfl",
    "image": "https://media.guim.co.uk/0f9c339965e5a559559f451f672bea74f7e93f07/645_60_2775_2220/500.jpg",
    "summary": "The all-time greatest quarterback is recognized for his unwavering focus during his playing career. Analysts suggest he should apply the same intensity to his post-retirement endeavors. This approach could enhance his success in future ventures.",
    "published": "2025-11-24T08:15:31Z"
  },
  {
    "title": "Premier League: 10 talking points from the weekend’s football",
    "url": "https://www.theguardian.com/football/2025/nov/24/premier-league-10-talking-points-from-the-weekends-football",
    "image": "https://media.guim.co.uk/edc7bc9a0091dd1e9dc01844caca4439ca8705fc/0_0_5000_4000/500.jpg",
    "summary": "Tottenham Hotspur faced criticism for their negative play, resulting in a disappointing outcome. Sean Dyche's strategic gameplan led to a significant victory over Liverpool. Meanwhile, Wharton's standout performance continued to highlight his impressive skills.",
    "published": "2025-11-24T08:00:33Z"
  },
  {
    "title": "Jack and the Beanstalk review – sass, sparkle and fee-fi-fo fun sock it to the baddies",
    "url": "https://www.theguardian.com/stage/2025/nov/24/jack-and-the-beanstalk-review-lyric-hammersmith",
    "image": "https://media.guim.co.uk/fcde32ac47a41c322993665e30b79210a69f15a8/0_525_2638_2111/500.jpg",
    "summary": "In a dark twist, a powerful computer and a menacing headmaster devise a plot against shy Jack and his classmates. Concurrently, the Fairy Godfather becomes infatuated with a mysterious woman. The story intertwines elements of danger and romance in a whimsical setting.",
    "published": "2025-11-24T08:00:32Z"
  }
]