[
  {
    "title": "Cambridgeshire train stabbing: 10 people injured in attack; police arrest two suspects – latest updates",
    "url": "https://www.theguardian.com/uk-news/live/2025/nov/02/cambridgeshire-train-stabbing-life-threatening-injuries-arrests-latest-updates",
    "image": "https://media.guim.co.uk/c8fb9faf5e3abb41a9f3bd7f074385fa02a6c37c/0_0_4076_3261/500.jpg",
    "summary": "Nine individuals have been hospitalized with life-threatening injuries following an incident that has prompted police to involve counter-terror officers in the investigation. Authorities are actively working to uncover details surrounding the event. Updates are expected as the situation develops.",
    "published": "2025-11-02T05:18:16Z"
  },
  {
    "title": "World Series Game 7: LA Dodgers 5-4 Toronto Blue Jays (11 innings) – as it happened",
    "url": "https://www.theguardian.com/sport/live/2025/nov/01/world-series-game-7-los-angeles-dodgers-v-toronto-blue-jays-live-updates",
    "image": "https://media.guim.co.uk/5608bb8465d1a2f52a3e05e0e9a74b156bbbd648/493_0_3613_2890/500.jpg",
    "summary": "The Dodgers clinched the World Series title by defeating the Blue Jays in Game 7 on Saturday night. This victory marked a dramatic comeback for the Dodgers. Bryan Armen Graham reported on the thrilling match.",
    "published": "2025-11-02T05:04:11Z"
  },
  {
    "title": "Tory patience wears thin as Badenoch’s critics count down to May elections",
    "url": "https://www.theguardian.com/politics/2025/nov/02/tory-patience-wears-thin-as-badenochs-critics-count-down-to-may-elections",
    "image": "https://media.guim.co.uk/7b6d37615ca29cb180e0c38fe7288992534546c6/143_0_3366_2693/500.jpg",
    "summary": "As the party faces challenges and Reform gains momentum, allies of Jenrick are preparing to adjust their strategy for a potential reset after the elections. Concerns about the party's direction are growing, prompting discussions on a new approach. This shift reflects a broader need for recalibration within the party amidst changing political dynamics.",
    "published": "2025-11-02T05:00:54Z"
  },
  {
    "title": "The Jeremy Bamber twist: does Britain’s most notorious murderer finally have an alibi?",
    "url": "https://www.theguardian.com/uk-news/2025/nov/02/the-jeremy-bamber-twist-does-britains-most-notorious-murderer-finally-have-an-alibi",
    "image": "https://media.guim.co.uk/4382459cc7c0584d464812c1be619bb3ad219a10/0_227_1364_1091/500.jpg",
    "summary": "Audio footage released by New Yorker magazine this week appears to support the innocence of Bamber, who has spent 40 years in prison. The evidence may pave the way for his potential release. Legal experts are now evaluating the implications of this new information.",
    "published": "2025-11-02T05:00:53Z"
  },
  {
    "title": "Decision to scrap net zero commitment shows Nationals ‘profoundly out of touch’, critics say – as it happened",
    "url": "https://www.theguardian.com/australia-news/live/2025/nov/02/nationals-net-zero-party-room-meeting-coalition-labor-murray-watt-anthony-albanese-apec-mark-butler-medicare-bulk-billing-ntwnfb",
    "image": "https://media.guim.co.uk/ceeb7d2904cfe298c6c4bb71c70bf6417262d794/360_0_6880_5504/500.jpg",
    "summary": "The blog has officially announced its closure. No further posts or updates will be provided. Readers are thanked for their support throughout its operation.",
    "published": "2025-11-02T04:57:08Z"
  }
]