[
  {
    "title": "White House reportedly picks Kennedy deputy to replace fired CDC chief",
    "url": "https://www.theguardian.com/us-news/2025/aug/28/cdc-chief-fired-white-house-monarez-trump",
    "image": "https://media.guim.co.uk/23c16f57ce0e0c22c5b98bec66961ab2d196bb35/333_0_3333_2667/500.jpg",
    "summary": "Susan Monarez claims that only former President Trump can dismiss her from her role, following the resignation of four other senior CDC leaders over concerns about political interference. Their departures highlight ongoing tensions within the agency regarding external influences on public health policy. Monarez’s statement underscores her commitment to remaining in her position despite the turmoil.",
    "published": "2025-08-28T21:20:10Z"
  },
  {
    "title": "RFK Jr ally reportedly chosen to lead CDC as departing officials hit out at vaccine messaging – live",
    "url": "https://www.theguardian.com/us-news/live/2025/aug/28/cdc-susan-monarez-trump-news-updates-us-politics-live",
    "image": "https://media.guim.co.uk/0163b0ac35ffe3e3f62334fc0538fefd79563d98/451_0_4511_3609/500.jpg",
    "summary": "Deputy Health Secretary Jim O’Neill is set to take over as the interim director of the CDC. This change comes as CDC staffers unite in support of officials who have recently resigned. The situation reflects ongoing challenges within the agency amidst leadership transitions.",
    "published": "2025-08-28T21:17:05Z"
  },
  {
    "title": "US Open tennis 2025: Swiatek and Osaka through, Sinner in action on day five – as it happened",
    "url": "https://www.theguardian.com/sport/live/2025/aug/28/us-open-tennis-2025-swiatek-sinner-osaka-musetti-day-five-live",
    "image": "https://media.guim.co.uk/faf8e797ae61d150d41d911d009565e5bfe1f245/132_0_2988_2390/500.jpg",
    "summary": "Iga Swiatek and Jannik Sinner advance to the third round of the tournament, alongside Naomi Osaka, Lorenzo Musetti, and Andrey Rublev. Each player showcased strong performances to secure their progression. The competition continues to heat up as top talents remain in the running.",
    "published": "2025-08-28T20:22:32Z"
  },
  {
    "title": "Corrections and clarifications",
    "url": "https://www.theguardian.com/news/2025/aug/28/corrections-and-clarifications",
    "summary": "Bank of England Governor Andrew Bailey announced a projection indicating the UK adult population is expected to grow significantly over the next few years. This increase is projected to impact the economy and labor market, highlighting the need for policies that address demographic changes. The announcement comes amid ongoing discussions about economic stability and growth in the UK.",
    "published": "2025-08-28T20:00:55Z"
  },
  {
    "title": "Minneapolis school shooting: police say locked doors saved ‘countless lives’",
    "url": "https://www.theguardian.com/us-news/2025/aug/28/minnneapolis-wakes-to-aftermath-of-catholic-school-shooting",
    "image": "https://media.guim.co.uk/c0149b41d2c6de261ec75ad316b78daeeab7f0f3/350_0_2500_2000/500.jpg",
    "summary": "A shooter attempted to enter a church to execute an attack but was thwarted when the doors were locked after mass had begun. Officials confirmed the thwarted incident, highlighting the importance of security measures. No injuries were reported as the attacker was unable to gain access.",
    "published": "2025-08-28T19:59:06Z"
  }
]