[
  {
    "title": "Starmer urged to apologise as MP says rioting by Maccabi Tel Aviv fans justifies their ban from Aston Villa game – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/oct/20/uk-politics-latest-news-updates-prince-andrew-covid-starmer-labour-reform-education",
    "image": "https://media.guim.co.uk/e82c26268e851cd523310fffe7cb476642b4ba3e/0_0_5000_4000/500.jpg",
    "summary": "Independent MP Ayoub Khan commented on the cancellation of the Tel Aviv football derby between Hapoel and Maccabi due to rioting. He emphasized the need for dialogue and understanding among fans to prevent such violence in the future. Khan called for stronger measures to ensure safety in sports events.",
    "published": "2025-10-20T11:16:11Z"
  },
  {
    "title": "China’s economic growth slows amid Trump tariff war and property woes",
    "url": "https://www.theguardian.com/business/2025/oct/20/china-economic-growth-trump-tariff-war-property-gdp",
    "image": "https://media.guim.co.uk/73f80dabc25a1c47b7b87dc34b6626a09f94177f/0_0_5461_4369/500.jpg",
    "summary": "The GDP increased by 4.8% year-on-year between July and September, showing a slight decline from the 5.2% growth rate observed in the second quarter. This indicates a slowing economic expansion during the third quarter. Overall, the figures highlight ongoing economic challenges despite steady growth.",
    "published": "2025-10-20T11:13:00Z"
  },
  {
    "title": "Zelenskyy says he would join Trump-Putin summit in Hungary if invited – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/oct/20/zelenskyy-trump-putin-russia-ukraine-war-eu-france-latest-news-updates",
    "image": "https://media.guim.co.uk/7f50f8118db3cfa760d016680c884cb41e67cac3/661_0_3373_2699/500.jpg",
    "summary": "Ukrainian President Zelensky criticized the selection of Budapest for a key meeting amid ongoing tensions in the region. This condemnation comes as former President Trump proposed that Ukraine should consider ceding land to achieve an end to the war. The remarks highlight the complex diplomatic challenges facing Ukraine in its conflict with Russia.",
    "published": "2025-10-20T11:12:35Z"
  },
  {
    "title": "‘Signs of recovery’ claims Amazon Web Services after internet outage hits many websites and apps – business live",
    "url": "https://www.theguardian.com/business/live/2025/oct/20/china-economic-growth-gdp-low-house-prices-fall-stock-markets-ftse-business-live-news",
    "image": "https://media.guim.co.uk/c243af906d58094cf7e7337e109f67c64d00da26/492_0_4240_3393/500.jpg",
    "summary": "Several popular online services, including Fortnite, Roblox, SnapChat, Lloyds Bank, and Ring doorbells, experienced disruptions due to a widespread online outage. Users reported difficulty accessing these platforms and services. The cause of the outage has not yet been specified.",
    "published": "2025-10-20T11:05:03Z"
  },
  {
    "title": "Gaza ceasefire live: Trump’s envoys arrive in Israel amid scramble to shore up fragile truce – Middle East crisis live",
    "url": "https://www.theguardian.com/world/live/2025/oct/20/gaza-ceasefire-israel-hamas-palestine-hostages-middle-east-crisis-live-news-updates",
    "image": "https://media.guim.co.uk/4d421cd7593d209915c3d8bfb3af4dffd31e91bc/602_0_4560_3648/500.jpg",
    "summary": "US envoy Steve Witkoff and Jared Kushner, son-in-law of former President Trump, are currently in Israel. Vice President JD Vance is expected to arrive tomorrow. The visit highlights ongoing diplomatic efforts in the region.",
    "published": "2025-10-20T11:02:33Z"
  }
]