[
  {
    "title": "Military sites could be used as temporary accommodation for asylum seekers, minister says – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/07/latest-live-uk-politics-news-updates-keir-starmer-labour-nigel-farage-kemi-badenoch-angela-rayner-updates",
    "image": "https://media.guim.co.uk/2b4149b365d2e46627adc4c2d627e1a2dcd33a57/212_0_5442_4353/500.jpg",
    "summary": "Labour leader Keir Starmer plans to intensify his campaign efforts as the government contemplates revising human rights laws to counter the rising influence of Reform UK. Starmer aims to capitalize on potential missteps by the government to strengthen Labour’s position. The proposed changes could significantly impact the political landscape as the party positions itself for future elections.",
    "published": "2025-09-07T09:27:02Z"
  },
  {
    "title": "England v South Africa: third men’s one-day international – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/07/england-v-south-africa-third-mens-one-day-international-live",
    "image": "https://media.guim.co.uk/d89402bb8b970470ba0d407b69fb6519f8c8a770/790_0_4770_3816/500.jpg",
    "summary": "South Africa has secured victory in the three-match ODI series against England. The upcoming match at the Utilita Bowl provides England an opportunity to salvage some pride. Writers will cover the event to capture the action as it unfolds.",
    "published": "2025-09-07T09:24:19Z"
  },
  {
    "title": "Merseyside derby in WSL, England reaction and Germany v Northern Ireland – matchday live",
    "url": "https://www.theguardian.com/football/live/2025/sep/07/merseyside-derby-in-wsl-england-reaction-and-germany-v-northern-ireland-matchday-live",
    "image": "https://media.guim.co.uk/3342438d93190f4f8805a32db14d81dc78d896c6/0_0_5000_4000/500.jpg",
    "summary": "The latest football news highlights an upcoming busy schedule in the Women's Super League (WSL) alongside Northern Ireland's World Cup qualifier match against Germany. Teams are preparing for key clashes that could impact league standings and international ambitions. Fans are eagerly awaiting the matches as excitement builds in both competitions.",
    "published": "2025-09-07T09:03:56Z"
  },
  {
    "title": "‘I never hold back’: Sally Mann on her controversial family photos and becoming a writer",
    "url": "https://www.theguardian.com/artanddesign/2025/sep/07/sally-mann-interview-controversial-family-photos-becoming-a-writer",
    "image": "https://media.guim.co.uk/49a1b2d9ee47e0969d67b79cf23f4d6a0b093e26/1213_508_6195_4956/500.jpg",
    "summary": "Renowned US photographer Sally Mann gained prominence through her controversial photobook \"Immediate Family,\" which thrust her into America's culture wars. She has now released a new book offering guidance for artists, focusing on what not to do in their careers. Mann's insights draw from her own experiences and challenges in the art world.",
    "published": "2025-09-07T09:01:16Z"
  },
  {
    "title": "Colourful new community artwork in Dorset steals Cerne Giant’s limelight",
    "url": "https://www.theguardian.com/uk-news/2025/sep/07/cerne-giant-consequences-colourful-sibling-steals-limelight-dorset",
    "image": "https://media.guim.co.uk/69ae16ca6770be4ec34d9d1675f889f9aa3f00bf/429_143_2213_1770/500.jpg",
    "summary": "A massive figure has been created in the West Country as a result of a collaborative project involving local community groups and schools. This initiative aims to engage and unite residents while celebrating local culture. The project highlights the strength of community involvement in public art endeavors.",
    "published": "2025-09-07T09:00:16Z"
  }
]