[
  {
    "title": "Keir Starmer says digital ID cards are an ‘enormous opportunity’ and will make it tougher to work illegally - UK politics live ",
    "url": "https://www.theguardian.com/politics/live/2025/sep/26/keir-starmer-digital-id-cards-immigration-borders-reform-uk-politics-live",
    "image": "https://media.guim.co.uk/4b97cc6b081483fb8c46eaac32defe55d8031476/0_0_4164_3333/500.jpg",
    "summary": "The Prime Minister announced plans for a mandatory digital ID system stored on individuals' phones to verify their right to work. This initiative aims to streamline employment verification processes. The implementation will enhance security and efficiency in the workforce.",
    "published": "2025-09-26T07:16:22Z"
  },
  {
    "title": "Australia news live: Trump tariff announcement wipes $1bn from CSL value; regulator pulls two more sunscreens from shelves",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/26/australia-news-live-afl-grand-final-could-spread-queensland-measles-outbreak-albanese-heads-for-uk-talks-ntwnfb",
    "image": "https://media.guim.co.uk/23e55ca4616555f8a28f0a45f5756218c8b4a134/1277_0_6385_5108/500.jpg",
    "summary": "Unfortunately, I can't access live updates or specific news articles at this moment. However, if you provide me with the content or details of the news, I'd be happy to help summarize it for you!",
    "published": "2025-09-26T07:11:25Z"
  },
  {
    "title": "Trump rattles investors with new tariffs on pharmaceuticals, trucks and kitchen cabinets – business live",
    "url": "https://www.theguardian.com/business/live/2025/sep/26/trump-investors-tariffs-pharmaceuticals-trucks-kitchen-cabinets-markets-uk-borrowing-costs-business-live-news",
    "image": "https://media.guim.co.uk/18785b5cfaa5ea180ea7358591ec393cf0ff6ee1/195_0_4344_3477/500.jpg",
    "summary": "Economic and financial news is being continuously reported, highlighting key developments and trends. Updates include market fluctuations, policy changes, and significant corporate announcements. Analysts aim to provide insights into how these factors impact global economies.",
    "published": "2025-09-26T07:07:03Z"
  },
  {
    "title": "Baltimore SO/Alsop: Clyne, Abstractions album review – Clyne writes accessible and attractive music",
    "url": "https://www.theguardian.com/music/2025/sep/26/baltimore-soalsop-clyne-abstractions-album-review",
    "image": "https://media.guim.co.uk/eea03f0a70c28b0a64c6d61ee92d54e7d84cde98/1001_0_5949_4760/500.jpg",
    "summary": "Marin Alsop's latest recording presents a comprehensive overview of Anna Clyne's orchestral compositions. The album highlights the evolution of Clyne's distinctive style over time. With Alsop's interpretation, listeners can appreciate the depth and richness of Clyne's works.",
    "published": "2025-09-26T07:01:00Z"
  },
  {
    "title": "Chess: Kai Hanache, 13, beats three grandmasters at UK blitz qualifier",
    "url": "https://www.theguardian.com/sport/2025/sep/26/chess-kai-hanache-13-beats-three-grandmasters-uk-blitz-qualifier",
    "image": "https://media.guim.co.uk/6192e79119cd3597e6ce57e86e3da0806dc2f358/0_163_960_768/500.jpg",
    "summary": "A schoolboy achieved significant success in a chess tournament by defeating three international masters and making a substantial rating gain. Despite his impressive performance, he ultimately finished as the runner-up in the final match. His accomplishments have garnered attention in the chess community.",
    "published": "2025-09-26T07:00:59Z"
  }
]