[
  {
    "title": "Ryder Cup 2025: Europe extend lead to 5½-2½ over USA after day-one fourballs – live updates",
    "url": "https://www.theguardian.com/sport/live/2025/sep/26/ryder-cup-2025-day-one-golf-europe-usa-bethpage-black-live",
    "image": "https://media.guim.co.uk/edc0a159ccb5b64ef5eb29bd87ecd3426d12560a/2300_63_4979_3983/500.jpg",
    "summary": "Europe has made an impressive start at Bethpage Black in their title defense, showcasing strong performances. Live updates provide hole-by-hole coverage as the event unfolds. Follow our writers for the latest insights and developments.",
    "published": "2025-09-26T22:16:01Z"
  },
  {
    "title": "Elon Musk and Peter Thiel mentioned in Epstein documents released by Democrats",
    "url": "https://www.theguardian.com/us-news/2025/sep/26/democrats-jeffrey-epstein-documents",
    "image": "https://media.guim.co.uk/05a374b0faf9fbc85a4ee28c28cd4f577198adb2/239_0_2393_1916/500.jpg",
    "summary": "A newly released six-page batch of documents, heavily redacted, includes mentions of Prince Andrew and Steve Bannon. The details surrounding their references remain unclear due to the redactions. This revelation has sparked renewed interest in their respective controversies.",
    "published": "2025-09-26T22:13:22Z"
  },
  {
    "title": "Democrats release tranche of Jeffrey Epstein records, including diaries and flight logs – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/26/james-comey-fbi-indictment-donald-trump-executive-orders-tariffs-us-politics-live",
    "image": "https://media.guim.co.uk/20f07dd53b3392c858bee1649b5d229fd1e34f8b/420_0_4774_3817/500.jpg",
    "summary": "Partially redacted documents have surfaced that reference prominent figures including Steve Bannon, Peter Thiel, Elon Musk, and Prince Andrew. The specific context of their involvement remains unclear due to the redactions. The release of these documents has sparked interest and speculation regarding their connections.",
    "published": "2025-09-26T22:10:04Z"
  },
  {
    "title": "Five Great Reads: a stroke while swimming, Matthew McConaughey, and 10 endangered British puddings",
    "url": "https://www.theguardian.com/australia-news/2025/sep/27/five-great-reads-stroke-while-swimming-matthew-mcconaughey-endangered-british-puddings",
    "image": "https://media.guim.co.uk/993a93b350cfa2ed3a490ecb2c31d6b11bf2e5b9/752_0_6827_5464/500.jpg",
    "summary": "Guardian Australia has compiled a weekend summary highlighting key reads from the past week, curated by Claire Keenan. The selection covers significant news stories and insights. This wrap aims to provide readers with a concise overview of important events and discussions.",
    "published": "2025-09-26T21:58:31Z"
  },
  {
    "title": "Liverpool defender Giovanni Leoni out for rest of season with ACL injury",
    "url": "https://www.theguardian.com/football/2025/sep/26/liverpools-giovanni-leoni-out-for-the-season-with-acl-injury",
    "image": "https://media.guim.co.uk/6a018a92ffeeaf94c474270cd9f8cc7a9fab2a06/464_0_3433_2746/500.jpg",
    "summary": "Arne Slot announced that 18-year-old Giovanni Leoni will miss the remainder of the season. Leoni suffered a torn anterior cruciate ligament during his debut match for Liverpool. This injury is a significant setback for the young player.",
    "published": "2025-09-26T21:48:55Z"
  }
]