[
  {
    "title": "Streeting says Starmer should sack aides responsible for hostile briefings against him – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/nov/12/keir-starmer-wes-streeting-labour-leadership-pmqs-kemi-badenoch-conservatives-uk-politics-live-news",
    "image": "https://media.guim.co.uk/a370c11e85b730378a959cb73c454049f2c0082f/816_0_4080_3264/500.jpg",
    "summary": "The health secretary expressed that he does not foresee any situation where he would contest Keir Starmer for leadership. This statement reveals his commitment to supporting the current leadership. The remark highlights the stability within the party regarding leadership aspirations.",
    "published": "2025-11-12T11:17:30Z"
  },
  {
    "title": "The Spin | Why the first ball of the Ashes is an end and a beginning",
    "url": "https://www.theguardian.com/sport/2025/nov/12/the-ashes-first-ball-series-spin-newsletter",
    "image": "https://media.guim.co.uk/ff2a1f728a740e8b5cfad39e81d606d76affad58/289_106_2026_1621/500.jpg",
    "summary": "Zak Crawley's four off Pat Cummins sets a confident tone for the series, while Rory Burns' duck highlights potential struggles. The contrasting performances in the opening delivery foreshadow the challenges and excitement to come. Overall, it signals the dynamic between the two teams will be pivotal throughout the series.",
    "published": "2025-11-12T11:15:22Z"
  },
  {
    "title": "Trump reiterates threat to sue BBC over speech edit: ‘You can’t allow people to do that’ – latest updates",
    "url": "https://www.theguardian.com/media/live/2025/nov/12/bbc-donald-trump-panorama-tim-davie-board-robbie-gibb-latest-news-updates",
    "image": "https://media.guim.co.uk/f94d2f44b16b678187729198da22a0b588d04be6/1328_768_3939_3151/500.jpg",
    "summary": "The US president alleges that a broadcaster has misled the public and considers it his responsibility to initiate legal proceedings against them. He emphasizes the need for accountability in media practices. The situation highlights ongoing tensions between government officials and media outlets.",
    "published": "2025-11-12T11:14:21Z"
  },
  {
    "title": "FTSE 100 index has 10,000-point mark in sight after hitting new high – business live",
    "url": "https://www.theguardian.com/business/live/2025/nov/12/softbank-shares-nvidia-sale-ai-valuations-ftse-100-yen-stock-markets-business-live-news",
    "image": "https://media.guim.co.uk/1a4e00dd53e74be9e6a38aa502ceda64826638a6/103_0_2930_2344/500.jpg",
    "summary": "The UK's blue-chip share index is approaching the 10,000 point milestone, indicating strong market performance. Economic and financial news continues to evolve, reflecting investor confidence. Ongoing coverage tracks these developments closely.",
    "published": "2025-11-12T11:06:48Z"
  },
  {
    "title": "Predators review – grimly compelling look at reality TV revenge hunt for child abusers",
    "url": "https://www.theguardian.com/film/2025/nov/12/predators-review-grimly-compelling-look-at-reality-tv-revenge-hunt-for-child-abusers",
    "image": "https://media.guim.co.uk/224ab39fcb3b43f036e2657097ee12f538359218/423_0_1800_1440/500.jpg",
    "summary": "David Osit's documentary explores the unsettling impact of televised shaming depicted in the hit show \"To Catch a Predator.\" It delves into the consequences of public exposure and the societal fascination with punishing offenders on screen. The film critiques the ethics of such entertainment and its effects on individuals and communities.",
    "published": "2025-11-12T11:00:23Z"
  }
]