[
  {
    "title": "Thousands of anti-Trump protesters march in London as king and senior royals host US president in Windsor – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/sep/17/donald-trump-uk-state-visit-king-charles-windsor-politics-latest-news-updates-labour-keir-starmer",
    "image": "https://media.guim.co.uk/450e777ece049f0c36ae99fb18a04be50795d650/143_0_4728_3783/500.jpg",
    "summary": "Anti-Trump protesters gathered in London during the US president's visit for events in Windsor ahead of a state banquet. Demonstrators expressed their opposition to Trump's policies and actions. The protest highlighted ongoing tensions and divisions surrounding his presidency.",
    "published": "2025-09-17T17:29:33Z"
  },
  {
    "title": "Nick Clegg: multibillion-dollar transatlantic tech agreement ‘sloppy seconds from Silicon Valley’ ",
    "url": "https://www.theguardian.com/politics/2025/sep/17/nick-clegg-multibillion-dollar-transatlantic-tech-agreement-sloppy-seconds-from-silicon-valley",
    "image": "https://media.guim.co.uk/58416d4dc13f7c3214bade6da587d261b575ff12/86_1216_3683_2946/500.jpg",
    "summary": "Meta's former president of global affairs criticized a deal coinciding with Trump's state visit, arguing it would increase the UK's dependence on US technology companies. This sentiment highlights concerns over the country's tech sovereignty. The discussion underscores ongoing tensions around international tech relations.",
    "published": "2025-09-17T17:29:25Z"
  },
  {
    "title": "EU calls for closer ties with India despite Modi’s links to Russia",
    "url": "https://www.theguardian.com/world/2025/sep/17/eu-calls-for-closer-ties-with-india-despite-modi-ties-to-russia",
    "image": "https://media.guim.co.uk/27c14860571d0ab3a7eb3f2a0e2cdf5b49c9fa65/917_536_4516_3615/500.jpg",
    "summary": "The EU's top diplomat expressed concerns after India participated in Russian military exercises that are perceived as a significant threat to European security. This involvement raises tensions between India and the EU amid ongoing geopolitical challenges. The situation highlights the complexities of international relations in the context of military alliances.",
    "published": "2025-09-17T17:28:39Z"
  },
  {
    "title": "Ex-US health official warns of RFK Jr’s risk to public health: ‘We’re going to see kids dying of vaccine-preventable diseases’ – live",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/17/donald-trump-charlie-kirk-free-speech-nyt-cdc-rfk-epstein-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/588ddd7fb1bd97b4757b8f5ad8de5098e0fbfcb6/917_0_4583_3667/500.jpg",
    "summary": "Dr. Debra Houry and Susan Monarez warned that the United States is inadequately prepared to prevent chronic diseases and tackle future pandemics. They highlighted the need for improved public health strategies and infrastructure. Their comments underscore the urgency of addressing these health challenges to protect public well-being.",
    "published": "2025-09-17T17:28:26Z"
  },
  {
    "title": "The Guardian view on Christianity and the UK far right: churches must stand up to the false prophets of division | Editorial",
    "url": "https://www.theguardian.com/commentisfree/2025/sep/17/the-guardian-view-on-christianity-and-the-uk-far-right-churches-must-stand-up-to-the-false-prophets-of-division",
    "image": "https://media.guim.co.uk/b6aa154da44cf443a1220355082670f312cbd413/0_0_5000_4000/500.jpg",
    "summary": "Symbols of Christian nationalism were highly visible at the recent 'unite the kingdom' march. The presence of these symbols appeared more politically motivated than rooted in genuine religious belief. The event reflects a trend where faith is used as a tool for political expression.",
    "published": "2025-09-17T17:25:19Z"
  }
]