[
  {
    "title": "Reeves to ditch income tax hike in UK budget; China suffers slowdown in factory output – business live",
    "url": "https://www.theguardian.com/business/live/2025/nov/14/reeves-income-tax-uk-budget-china-factory-output-retail-sales-bonds-stock-economy-business-live-news",
    "image": "https://media.guim.co.uk/9252d2e6ed6172d5a0f3f369f5559c57b4bf3dc7/467_0_4648_3721/500.jpg",
    "summary": "The UK chancellor has decided not to increase income tax in the upcoming budget on November 26. Meanwhile, China is facing economic challenges as new data reveals sluggish factory output and declining retail sales. These developments reflect contrasting fiscal strategies and economic conditions in the two nations.",
    "published": "2025-11-14T08:21:14Z"
  },
  {
    "title": "Global markets fall after tech sell-off and fears over Chinese economy",
    "url": "https://www.theguardian.com/business/2025/nov/14/global-markets-fall-after-tech-sell-off-chinese-economy-fears",
    "image": "https://media.guim.co.uk/fc609763156847d70de60825e73743e51f47fb86/870_0_6074_4860/500.jpg",
    "summary": "Wall Street experienced its worst day in a month, leading to heightened market concerns. This decline coincides with an unprecedented slump in investment in China. Investors are reacting to these economic indicators, raising uncertainty about future market stability.",
    "published": "2025-11-14T08:18:34Z"
  },
  {
    "title": "Storm Claudia: torrential rain expected in parts of England and Wales",
    "url": "https://www.theguardian.com/uk-news/2025/nov/14/storm-claudia-torrential-rain-england-wales-weather",
    "image": "https://media.guim.co.uk/e11f0a19f194c717b6a1ada32fef0cc9a94b8c17/249_0_3575_2860/500.jpg",
    "summary": "The Met Office has issued an amber weather warning due to expected persistent and heavy rain, strong winds, and thunderstorms on Friday. Residents are advised to prepare for potentially severe weather impacts. Authorities are closely monitoring the situation as conditions could lead to disruptions.",
    "published": "2025-11-14T08:06:29Z"
  },
  {
    "title": "Stand aside Australia, New Zealand are now England’s No 1 sporting rival | Emma John",
    "url": "https://www.theguardian.com/sport/2025/nov/14/stand-aside-australia-new-zealand-are-now-englands-no-1-sporting-rival",
    "image": "https://media.guim.co.uk/84694f8d9d0c0c46b2e55bacc6a13edc8e5a7b97/631_309_2847_2277/500.jpg",
    "summary": "New Zealand's successful teamwork in sports showcases their remarkable collaboration and achievements. This success may invoke feelings of envy, especially among rival Australians. The unity and performance of Kiwi athletes highlight their prowess on the international stage.",
    "published": "2025-11-14T08:00:23Z"
  },
  {
    "title": "Outsiders sense Chess World Cup glory after host of big names make early exits",
    "url": "https://www.theguardian.com/sport/2025/nov/14/outsiders-sense-chess-world-cup-glory-after-big-names-make-early-exits",
    "image": "https://media.guim.co.uk/d69b0a69f25bf6367f6ca6c7bd5ee71fb5f98d72/518_176_6555_5244/500.jpg",
    "summary": "In a surprising upset, 15 of the world's top 20 chess players were eliminated in the first four rounds of a prestigious tournament. Notable casualties included reigning champion Gukesh Dommaraju, Germany's Vincent Keymer, and American player Hans Niemann. This shocking outcome has reshaped expectations for the remainder of the event.",
    "published": "2025-11-14T08:00:23Z"
  }
]