[
  {
    "title": "NRL 2025 grand final: Melbourne Storm v Brisbane Broncos – rugby league live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/05/nrl-2025-grand-final-melbourne-storm-v-brisbane-broncos-rugby-league-live",
    "image": "https://media.guim.co.uk/92696d29c9b63c853e5933b5fc03a3aff74b5729/527_0_3460_2768/500.jpg",
    "summary": "The Storm and Broncos are facing off in the men's decider at Accor Stadium. Follow Jonathan Howcroft for minute-by-minute updates on the match. Excitement builds as the teams compete for the championship title.",
    "published": "2025-10-05T09:15:28Z"
  },
  {
    "title": "Gaza ceasefire talks live: negotiators due in Cairo",
    "url": "https://www.theguardian.com/world/live/2025/oct/05/gaza-ceasefire-israel-palestine-hamas-trump-cairo-negotiations-middle-east-crisis-live-news-updates",
    "image": "https://media.guim.co.uk/b1933ca7d0714a17c283bd1c621f7a575a22e5d2/960_0_4800_3840/500.jpg",
    "summary": "Israeli Prime Minister Netanyahu expressed optimism about announcing a hostage deal with Hamas soon. Meanwhile, Hamas has shown agreement with certain elements of Trump's proposed plan for Gaza. This development could signal a shift in negotiations and regional dynamics.",
    "published": "2025-10-05T09:12:36Z"
  },
  {
    "title": "Badenoch says her migration plan ‘credible’, but won’t say where 150,000 people a year being removed will go – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/oct/05/conservative-tory-conference-kemi-badenoch-echr-immigration-uk-politics-live-news-updates",
    "image": "https://media.guim.co.uk/00662208f0f1523415b8edeb215074d7ea6440c0/431_0_5000_4000/500.jpg",
    "summary": "The Conservative leader faced intense questioning regarding her proposal to remove certain policies before the party conference set to begin today. Critics have expressed concerns about the implications of these removals. The discussion highlights divisions within the party as they prepare for the upcoming conference.",
    "published": "2025-10-05T09:12:30Z"
  },
  {
    "title": "Rachel Reeves’s second budget needs a narrative of fairness to justify tax rises | Heather Stewart",
    "url": "https://www.theguardian.com/business/2025/oct/05/rachel-reeves-second-budget-narrative-fairness-tax-rises",
    "image": "https://media.guim.co.uk/691bee7d4fc203f6c44f94508c3683c32597c9ae/857_0_4737_3789/500.jpg",
    "summary": "The chancellor is urged to adopt a language of solidarity and social justice. This approach contrasts with the current government's tendency to avoid such themes. Emphasizing these concepts could help address pressing social issues.",
    "published": "2025-10-05T09:08:39Z"
  },
  {
    "title": "Postecoglou searching for Forest win, WSL action and Ipswich v Norwich – matchday live",
    "url": "https://www.theguardian.com/football/live/2025/oct/05/postecoglou-nottingham-forest-wsl-ipswich-norwich-matchday-live",
    "image": "https://media.guim.co.uk/42ba77261cee77e46e1fea7309b8a53ae5c0e6f2/0_0_5000_4000/500.png",
    "summary": "Join our writers as they cover the latest football news, provide match previews, and engage in lively discussions throughout a day filled with exciting football action. Stay updated on key events and insights from the world of soccer. Don't miss out on the game day excitement!",
    "published": "2025-10-05T09:07:09Z"
  }
]