[
  {
    "title": "Starmer braced for backlash from Labour MPs as Mahmood sets out asylum plans – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/nov/17/immigration-asylum-keir-starmer-labour-shabana-mahmood-uk-politics-live-news-updates",
    "image": "https://media.guim.co.uk/b9480ee3e605bd2159ea380ec01ae275c5381921/362_0_2203_1762/500.jpg",
    "summary": "The Home Secretary is set to reveal significant changes to asylum policies in the UK, including a requirement for asylum seekers to wait 20 years before being eligible for permanent settlement. This move aims to tighten immigration controls and deter irregular entry. The announcement is part of the government's broader strategy to reform the asylum system.",
    "published": "2025-11-17T10:11:28Z"
  },
  {
    "title": "Japan and Switzerland’s economies contract as exports are hit by US tariffs; WPP shares jump amid ‘takeover interest’ – business live",
    "url": "https://www.theguardian.com/business/live/2025/nov/17/japan-economy-contracts-exports-us-tariffs-trade-war-ftse-stock-markets-business-live-news",
    "image": "https://media.guim.co.uk/110fa6852c2e76d690e4f0fad2c2c02b9c473381/142_0_4200_3360/500.jpg",
    "summary": "This news provides ongoing updates on recent developments in the economy and financial markets. It covers key trends, market performance, and economic indicators. Readers can expect timely insights into significant financial events and their potential impact.",
    "published": "2025-11-17T10:10:30Z"
  },
  {
    "title": "Trump continues Taylor Greene attacks despite his call to release Epstein files – US politics live",
    "url": "https://www.theguardian.com/us-news/live/2025/nov/17/donald-trump-jeffrey-epstein-files-republicans-democrats-world-cup-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/55009d4f4ebdf186063eccd7252347312f154b5e/446_0_3220_2576/500.jpg",
    "summary": "The President reiterates claims that a former ally is a “traitor,” while simultaneously encouraging fellow Republicans to support the release of documents connected to a sex offender. This contradictory stance raises questions about his loyalty and political strategy. The call for document release highlights ongoing controversies within the party.",
    "published": "2025-11-17T10:09:56Z"
  },
  {
    "title": "Explosion on Polish railway was ‘unprecedented act of sabotage,’ says PM – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/nov/17/ukraine-russia-france-poland-zelenskyy-macron-eu-europe-news-latest-updates",
    "image": "https://media.guim.co.uk/9e22fdcf80e2da35fccff603abae2e7409f7e7a8/142_0_1066_853/500.jpg",
    "summary": "Donald Tusk has expressed grave concerns, stating that his \"worst fears\" have been confirmed regarding damage to the route utilized for delivering aid to Ukraine. This situation raises alarms about the ongoing challenges faced in providing necessary support. The deteriorating infrastructure poses a significant setback to humanitarian efforts in the region.",
    "published": "2025-11-17T10:08:30Z"
  },
  {
    "title": "Ousted Bangladesh PM Sheikh Hasina sentenced to death for crimes against humanity",
    "url": "https://www.theguardian.com/world/2025/nov/17/ousted-bangladesh-pm-sheikh-hasina-found-guilty-of-crimes-against-humanity",
    "image": "https://media.guim.co.uk/7c2be7fc94896006e5f64aa8557f3655439007da/163_0_4838_3871/500.jpg",
    "summary": "Former Prime Minister Sheikh Hasina was sentenced in absentia by a Dhaka court for her role in a deadly crackdown on a student-led uprising that occurred last year. The ruling comes amid ongoing tensions and protests related to governance and civil rights in the country. Hasina's government has faced criticism for its handling of dissent and political opposition.",
    "published": "2025-11-17T10:05:44Z"
  }
]