[
  {
    "title": "Nottinghamshire v Warwickshire, Hampshire v Surrey and more: county cricket – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/26/nottinghamshire-v-warwickshire-surrey-v-hampshire-and-more-county-cricket-final-round-live",
    "image": "https://media.guim.co.uk/32a88844c6240c9ea0c9343b41ee291ac1b2dab7/95_0_3799_3038/500.jpg",
    "summary": "Day three of the season's final round saw excitement at Trent Bridge as teams competed for the title. Updates included crucial matches and standout performances. Tanya Aldred provided on-the-ground insights from the event.",
    "published": "2025-09-26T13:26:58Z"
  },
  {
    "title": "Haaland fit for City, Liverpool’s Leoni out for season, Palmer out for three weeks – live",
    "url": "https://www.theguardian.com/football/live/2025/sep/26/premier-league-and-wsl-team-news-europa-league-reaction-and-more-live",
    "image": "https://media.guim.co.uk/b247e2c9cc19b1a1afa67e95ea18fe40871de0fb/765_325_4044_3234/500.jpg",
    "summary": "This weekend's football features extensive coverage, including news, previews, and commentary from our writers. Fans can expect insightful analysis ahead of an action-packed weekend in the Premier League and Women's Super League. Stay tuned for updates and expert opinions on the upcoming matches.",
    "published": "2025-09-26T13:26:37Z"
  },
  {
    "title": "Ryder Cup 2025: USA v Europe day one updates – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/26/ryder-cup-2025-day-one-golf-europe-usa-bethpage-black-live",
    "image": "https://media.guim.co.uk/474cb9a963d112333c53d6741297a298e4426658/292_0_4333_3467/500.jpg",
    "summary": "Live coverage of the opening foursomes and fourballs at Bethpage Back is underway. Writers provide hole-by-hole updates on the competition. Stay tuned for the latest developments in the event.",
    "published": "2025-09-26T13:25:43Z"
  },
  {
    "title": "Russia has bad intentions towards the whole world, Polish PM says, as EU countries and Ukraine discuss ‘drone wall’ – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/sep/26/denmark-drone-sightings-airport-russia-ukraine-europe-live-news",
    "image": "https://media.guim.co.uk/21841a2384b07d2f60f395036e7d2e668e841dcb/94_0_3860_3088/500.jpg",
    "summary": "European countries are set to convene today to address the escalating threat of incursions. The discussions aim to formulate strategies and enhance cooperation among nations. This meeting highlights rising security concerns across the region.",
    "published": "2025-09-26T13:24:28Z"
  },
  {
    "title": "Benjamin Netanyahu addresses UN general assembly as dozens of delegates walk out - Middle East crisis live",
    "url": "https://www.theguardian.com/world/live/2025/sep/26/gaza-israel-benjamin-netanyahu-un-united-nations-unga-west-bank-donald-trump-middle-east-crisis-live",
    "image": "https://media.guim.co.uk/8f4b46901e04fe3c16ac60e9715fee3f49516e29/312_0_2864_2291/500.jpg",
    "summary": "Israeli Prime Minister is delivering a speech at the United Nations in New York. He is likely discussing key issues such as security, diplomacy, and regional conflicts. The address aims to strengthen Israel's position on the global stage and garner international support.",
    "published": "2025-09-26T13:23:33Z"
  }
]