[
  {
    "title": "Starmer condemns Farage for failing to take action against Reform MP’s ‘racist’ comments about black and Asian people – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/oct/27/asylum-hotel-report-steve-reed-wes-streeting-epping-offender-prison-news-updates-politics-live",
    "image": "https://media.guim.co.uk/7462ea9f9a775cb1e2de07aa1b403e2f81274a02/36_0_3666_2933/500.jpg",
    "summary": "Nigel Farage has declined to label Sarah Pochin's comments as racist, describing them instead as \"ugly\" and \"clumsy.\" He suggests they should be interpreted within the broader context of \"DEI madness.\" Farage's stance highlights ongoing debates around race and diversity in public discourse.",
    "published": "2025-10-27T17:15:16Z"
  },
  {
    "title": "Hurricane Melissa strengthens to category 5 as communities in Jamaica warned of ‘potentially unimaginable impact’ – live",
    "url": "https://www.theguardian.com/world/live/2025/oct/27/hurricane-melissa-jamaica-cuba-caribbean-haiti-dominican-republic-live-news-latest-updates",
    "image": "https://media.guim.co.uk/54c51997407bf0b5b5b7fce4a2fda5f88f0f5d2a/525_64_1187_949/500.jpg",
    "summary": "Authorities are urging Jamaicans to seek shelter immediately due to severe weather threats. Neighboring countries, including Cuba, Haiti, and the Dominican Republic, are also at risk. The situation calls for heightened preparedness in the region.",
    "published": "2025-10-27T17:12:53Z"
  },
  {
    "title": "Adult education should be for life, not just a job | Letters",
    "url": "https://www.theguardian.com/education/2025/oct/27/adult-education-should-be-for-life-not-just-a-job",
    "image": "https://media.guim.co.uk/d00d98c6c562a95304cb21f258d5eb86b9092c52/912_0_4680_3744/500.jpg",
    "summary": "Readers share their perspectives on a recent editorial concerning the government's white paper on post-16 education. They express varied opinions and concerns regarding the proposed changes and their implications for students and educational institutions. The discussion highlights the importance of addressing diverse viewpoints in the evolving educational landscape.",
    "published": "2025-10-27T17:07:59Z"
  },
  {
    "title": "A costly lesson for Labour in Caerphilly | Letters",
    "url": "https://www.theguardian.com/politics/2025/oct/27/a-costly-lesson-for-labour-in-caerphilly",
    "image": "https://media.guim.co.uk/940f1a297c1da7cff0ad55504552782119d50c4a/1068_0_6257_5006/500.jpg",
    "summary": "Readers express their opinions on Plaid Cymru's recent success in the Welsh byelection, highlighting the significance of the party's win for Welsh politics. Many commend the achievement as a positive step for Welsh representation. Others discuss the implications for future elections and the continued push for increased devolution.",
    "published": "2025-10-27T17:06:51Z"
  },
  {
    "title": "Here’s why Poland’s birth rate is falling | Letters",
    "url": "https://www.theguardian.com/world/2025/oct/27/heres-why-polands-birth-rate-is-falling",
    "image": "https://media.guim.co.uk/0cfd1bcf8957111a0a17717730f460a13286b694/500_0_2500_2000/500.jpg",
    "summary": "Marta Zboralska expresses concerns regarding the country's abortion laws, highlighting that women fear inadequate medical care in case of complications. She emphasizes the impact of these laws on women's health and wellbeing. The letter sheds light on the anxiety surrounding reproductive rights in the nation.",
    "published": "2025-10-27T17:06:33Z"
  }
]