[
  {
    "title": "Australia politics live: Barnaby Joyce denies allegations of ‘verbal tirade’ after formal complaint lodged by Nationals staffer; question time under way",
    "url": "https://www.theguardian.com/australia-news/live/2025/oct/30/anthony-albanese-donald-trump-meeting-murray-watt-epbc-nature-laws-press-club-parliament-labor-coalition-sussan-ley-ntwnfb",
    "image": "https://media.guim.co.uk/07d491846e02ff98bbfe184d802bd2dbc3174a58/331_0_4131_3305/500.jpg",
    "summary": "Please provide the specific news article or details you would like summarized, and I will gladly assist you!",
    "published": "2025-10-30T03:08:55Z"
  },
  {
    "title": "Hurricane Melissa death toll rises as storm wreaks destruction across Caribbean – latest updates",
    "url": "https://www.theguardian.com/world/live/2025/oct/29/hurricane-melissa-live-updates-strengthens-cuba-extensive-damage-parts-of-jamaica",
    "image": "https://media.guim.co.uk/556fba4f8b291c7c54388fc5d148ebad70038534/403_0_3613_2891/500.jpg",
    "summary": "Four people have been confirmed dead in Jamaica, while dozens have died in Haiti due to severe weather conditions. A hurricane warning is currently in effect for regions, including Bermuda. The situation remains critical as the storm impacts the Caribbean.",
    "published": "2025-10-30T03:05:06Z"
  },
  {
    "title": "Trump directs Pentagon to match Russia and China in nuclear weapons testing",
    "url": "https://www.theguardian.com/us-news/2025/oct/29/trump-pentagon-us-nuclear-weapons",
    "image": "https://media.guim.co.uk/e7100f84f6e8796bb1d3d6be8e26b04ae4b86843/158_0_1198_958/500.jpg",
    "summary": "US President issued a warning on Truth Social following Russia's nuclear-powered weapons tests, escalating tensions. This comes just before his upcoming meeting with Chinese leader Xi Jinping. The post reflects concerns over global security and military advancements.",
    "published": "2025-10-30T03:02:04Z"
  },
  {
    "title": "Donald Trump and Xi Jinping hold meeting in South Korea amid hopes for trade deal – live updates",
    "url": "https://www.theguardian.com/world/live/2025/oct/30/donald-trump-xi-jinping-meeting-live-updates",
    "image": "https://media.guim.co.uk/bd1c513361c5ea2ab97bd963b56b8b81e60cde38/0_1161_5159_4127/500.jpg",
    "summary": "The summit held on the sidelines of the APEC meeting marks the first direct engagement between the leaders of the US and China since 2019. This meeting follows heightened tensions stemming from Trump's trade war. It aims to address various issues affecting the bilateral relationship.",
    "published": "2025-10-30T02:57:38Z"
  },
  {
    "title": "Queensland to create public register of sex offenders as Daniel Morcombe’s parents ‘hope it will go national’ ",
    "url": "https://www.theguardian.com/australia-news/2025/oct/30/queensland-to-create-public-register-of-sex-offenders-as-daniel-morcombes-parents-hope-it-will-go-national",
    "image": "https://media.guim.co.uk/9189832de3782638ba023101b782ccc093e38bed/729_375_3536_2830/500.jpg",
    "summary": "Bruce and Denise Morcombe are urging other states to follow Queensland's lead as the LNP prepares to pass 'Daniel's law.' This legislation will permit the public naming of certain child sexual abusers. The Morcombes advocate for broader action to enhance child safety.",
    "published": "2025-10-30T02:53:36Z"
  }
]