[
  {
    "title": "Anglo American agrees mining mega merger; Londoners face commuting struggles as tube strike enters second day – business live",
    "url": "https://www.theguardian.com/business/live/2025/sep/09/anglo-mining-mega-merger-londoners-commuting-struggles-tube-strike-second-day-business-live",
    "image": "https://media.guim.co.uk/0f9e2319cb4a332a06ce7286b1ad347dd702ad5a/291_0_3487_2790/500.jpg",
    "summary": "A merger is set to create a $53 billion mining giant, prompting concerns over potential job cuts as the new headquarters will be relocated to Vancouver. Employees worry about impacts on employment and operations. The deal highlights significant changes in the mining industry landscape.",
    "published": "2025-09-09T09:34:26Z"
  },
  {
    "title": "François Bayrou to resign as French PM as government collapses to spark crisis – Europe live",
    "url": "https://www.theguardian.com/world/live/2025/sep/09/france-crisis-government-emmanuel-macron-europe-latest-live-news-updates",
    "image": "https://media.guim.co.uk/2b201e033b7874ab22e5971b3bbb51c02ae9f458/743_0_3717_2973/500.jpg",
    "summary": "The French government has collapsed after a vote of confidence in President Emmanuel Macron's administration. An ally of Macron gained support from only 194 MPs, while 364 voted against. This defeat highlights significant political challenges for Macron's leadership.",
    "published": "2025-09-09T09:33:46Z"
  },
  {
    "title": "Somerset v Yorkshire, Leicestershire v Gloucestershire and more: county cricket day two – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/09/somerset-v-yorkshire-leicestershire-v-gloucestershire-and-more-county-cricket-day-two-live",
    "image": "https://media.guim.co.uk/30a67c3c28eb60df9ed6b6e7f19997ab9671df1a/1252_442_2948_2358/500.jpg",
    "summary": "Tanya Aldred provides live updates on day two of the latest county cricket fixtures. The rolling report covers key moments and events from various matches. Stay tuned for ongoing developments throughout the day.",
    "published": "2025-09-09T09:33:09Z"
  },
  {
    "title": "A racist mob menacing refugee children and our town. Read this and see what lies ahead, unless we act now | Anonymous",
    "url": "https://www.theguardian.com/commentisfree/2025/sep/09/racist-mob-menacing-refugee-children-far-right",
    "image": "https://media.guim.co.uk/eca24ee213eda2e8b3b31b03a6d0d73e7c5416af/250_0_2500_2000/500.jpg",
    "summary": "Last weekend, ordinary people took a stand against the growing far-right movement and rising hate. The current atmosphere of national toxicity has been likened to the intense divisions seen in the 1970s. The resurgence of such animosity has prompted public opposition and concern.",
    "published": "2025-09-09T09:32:08Z"
  },
  {
    "title": "Between Moon Tides: citizen scientists saving the saltmarsh sparrow documentary",
    "url": "https://www.theguardian.com/global/ng-interactive/2025/sep/09/between-moon-tides-citizen-scientists-saving-the-saltmarsh-sparrow-documentary",
    "image": "https://media.guim.co.uk/10719a1aec58660b11174f3c9ed2e5ab9ecfb2b4/576_0_1701_1361/500.jpg",
    "summary": "In Rhode Island, septuagenarian Deirdre is determined to prevent the extinction of the saltmarsh sparrow, which faces critical threats from rising tides that flood nests. Experts warn that without intervention, the species could be extinct by 2050. Efforts are underway this year to save these vulnerable birds.",
    "published": "2025-09-09T09:30:56Z"
  }
]