[
  {
    "title": "Australia news live: Alan Joyce secures final $3.8m bonus two years after leaving Qantas",
    "url": "https://www.theguardian.com/australia-news/live/2025/sep/05/australia-news-live-albanese-trump-tariffs-meeting-porepunkah-police-officer-funerals-ntwnfb",
    "image": "https://media.guim.co.uk/780c7fe0e8da9491cfad02181153bf2b6896bdc9/745_0_6008_4807/500.jpg",
    "summary": "To provide a summary, I would need more context or specific details about the news you're referring to. Please share the content or key points of the news article, and I'll be happy to help!",
    "published": "2025-09-05T03:03:45Z"
  },
  {
    "title": "US Open tennis 2025 women’s semi-finals: Osaka v Anisimova; Sabalenka beats Pegula – live",
    "url": "https://www.theguardian.com/sport/live/2025/sep/04/us-open-tennis-womens-semi-finals-sabalenka-pegula-osaka-anisimova-live",
    "image": "https://media.guim.co.uk/edcae77cca34ff0c5497777d09ca502261407bd0/198_0_2791_2233/500.jpg",
    "summary": "Beau Dure is providing live updates on the women’s singles semi-finals at Flushing Meadows. Fans can follow the ongoing matches and get insights throughout the event. Stay tuned for the latest developments in this major tennis competition.",
    "published": "2025-09-05T03:01:22Z"
  },
  {
    "title": "Neo-Nazi Thomas Sewell refused bail as magistrate says he is a danger to community",
    "url": "https://www.theguardian.com/australia-news/2025/sep/05/neo-nazi-thomas-sewell-refused-bail-melbourne-ntwnfb",
    "image": "https://media.guim.co.uk/e690a20783aa26103c1362900ed13f178a4e8fe9/492_0_4906_3927/500.jpg",
    "summary": "Sewell, accused of orchestrating an attack on the Indigenous burial site Camp Sovereignty in Melbourne, has been remanded in custody after his court appearance. The incident has drawn significant attention due to the cultural importance of the site. Legal proceedings are ongoing as Sewell faces serious charges.",
    "published": "2025-09-05T02:50:34Z"
  },
  {
    "title": "Lithgow’s old railway yard is for sale – transport experts say it could have a big and green future",
    "url": "https://www.theguardian.com/australia-news/2025/sep/05/lithgow-nsw-railway-yard-sale",
    "image": "https://media.guim.co.uk/c9c22d776bb64c9537e814228b4e3b99d14d0e4b/1063_147_3161_2530/500.jpg",
    "summary": "There is a growing call for the New South Wales locomotive workshop to be returned to government control. The aim is to retrofit diesel trains and boost local manufacturing efforts to meet the 50% Australian-made quotas. Advocates believe this move will strengthen the state's rail industry and support job creation.",
    "published": "2025-09-05T02:28:17Z"
  },
  {
    "title": "The Lark review – Noni Hazlehurst is wonderful as a salty publican in this elegiac one-woman play",
    "url": "https://www.theguardian.com/stage/2025/sep/05/the-lark-review-noni-hazlehurst-arts-centre-melbourne",
    "image": "https://media.guim.co.uk/79bf121192a7f28e8858fe05d6375be527a12881/790_0_3421_2737/500.jpg",
    "summary": "Daniel Keene's monodrama presents a poignant depiction of a vanishing Australia, focusing on the character Rose, portrayed by Hazlehurst, as she bids farewell to her beloved pub. The venue, symbolic of community and history, faces impending demolition. The work highlights themes of loss and change in contemporary society.",
    "published": "2025-09-05T02:12:57Z"
  }
]