[
  {
    "title": "Europe live: New French PM to be named ‘in days’ as Bayrou loses confidence vote amid political turmoil",
    "url": "https://www.theguardian.com/world/live/2025/sep/08/europe-live-macron-france-prime-minister-francois-bayrou-confidence-vote-latest-news",
    "image": "https://media.guim.co.uk/27d25520fffb3884efcb6e72485f947141dc0929/132_0_5380_4304/500.jpg",
    "summary": "French President Emmanuel Macron plans to name a successor to François Bayrou following a significant vote, where over 350 lawmakers opposed Bayrou's position. This move reflects growing tensions within the French government. The decision comes as Macron seeks to solidify his administration's leadership amidst political challenges.",
    "published": "2025-09-08T19:23:38Z"
  },
  {
    "title": "Belarus v Scotland: World Cup 2026 qualifying Group C – live",
    "url": "https://www.theguardian.com/football/live/2025/sep/08/belarus-v-scotland-world-cup-2026-qualifying-group-c-live",
    "image": "https://media.guim.co.uk/e8f01473ad8de23bd5da8950337a6a4b16a427c9/340_154_2321_1857/500.jpg",
    "summary": "Steve Clarke's team seeks their first win in the group, facing a potential challenge from the world's 97th-ranked team. The match promises excitement as both sides aim for a strong performance. Michael Butler will provide live updates throughout the game.",
    "published": "2025-09-08T19:23:36Z"
  },
  {
    "title": "New Orleans archdiocese increases sex abuse settlement offer to at least $230m",
    "url": "https://www.theguardian.com/us-news/2025/sep/08/new-orleans-archdiocese-sex-abuse-settlement-bankruptcy",
    "image": "https://media.guim.co.uk/1b10508b3d29cfbe71539145307b47f70a62a5c1/659_0_4251_3400/500.jpg",
    "summary": "A church has secured a $50 million loan to expand its financial guarantees as part of an effort to address the concerns of a significant group of clergy abuse victims. This move is aimed at improving compensation and support for those affected by abuse within the church. The decision reflects the institution's ongoing attempts to rectify past injustices and foster reconciliation.",
    "published": "2025-09-08T19:09:02Z"
  },
  {
    "title": "US supreme court backs Trump on aggressive immigration raids – live updates",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/08/donald-trump-immigration-hyundai-tariffs-us-politics-live-news-updates",
    "image": "https://media.guim.co.uk/176e8758304c8d935223d4f6e1714433ce3bec83/683_0_6827_5464/500.jpg",
    "summary": "A court has permitted federal agents to conduct raids in Southern California aimed at deporting individuals, with a focus on targeting people based on their race or language. This decision has raised concerns about discrimination and civil rights violations. Critics argue it may foster fear within immigrant communities.",
    "published": "2025-09-08T19:08:19Z"
  },
  {
    "title": "‘Leave now,’ Netanyahu tells Gaza City residents as he says Israeli forces readying for ground ‘manoeuvre’ – Middle East crisis live",
    "url": "https://www.theguardian.com/world/live/2025/sep/08/middle-east-crisis-live-jerusalem-shooting-israel-threatens-gaza-city-powerful-hurricane-latest-news",
    "image": "https://media.guim.co.uk/694e2904ced8a9df937a5ffbd3a7cebecfe7e279/594_0_5099_4079/500.jpg",
    "summary": "Israeli Prime Minister addressed residents of a heavily impacted city, emphasizing their prior warnings about impending threats. He reaffirmed the government's stance on the situation, indicating a need for vigilance. The remarks highlight the ongoing tensions and challenges faced by the region.",
    "published": "2025-09-08T19:06:16Z"
  }
]