[
  {
    "title": "Newcastle v Nottingham Forest, Everton v Crystal Palace and more: Premier League clockwatch – live",
    "url": "https://www.theguardian.com/football/live/2025/oct/05/newcastle-nottingham-forest-everton-crystal-palace-premier-league-clockwatch-live",
    "image": "https://media.guim.co.uk/8cd278e6c70a5e2749f2bf8e4b5da9fedd949d14/204_0_3608_2887/500.jpg",
    "summary": "Rob Smyth will provide live updates and goal announcements from four Premier League matches in his \"Clockwatch\" segment. Fans can stay informed about the latest happenings and scores during these games. Tune in for timely coverage and insights.",
    "published": "2025-10-05T14:14:52Z"
  },
  {
    "title": "Badenoch addresses Tory conference after pledge to deport 150,000 a year – UK politics live",
    "url": "https://www.theguardian.com/politics/live/2025/oct/05/conservative-tory-conference-kemi-badenoch-echr-immigration-uk-politics-live-news-updates",
    "image": "https://media.guim.co.uk/e3cd560e9fc1b080fc7b5ccf1008ca80a3d75b49/549_0_5000_4000/500.jpg",
    "summary": "The party leader did not provide clarification on the destination options for individuals affected by recent decisions. This lack of transparency has raised concerns among constituents. Critics are calling for more concrete information regarding the next steps for those impacted.",
    "published": "2025-10-05T14:14:26Z"
  },
  {
    "title": "Prix de l’Arc de Triomphe 2025: horse racing – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/05/prix-de-larc-de-triomphe-2025-longchamp-horse-racing-live",
    "image": "https://media.guim.co.uk/8b201214cf5df7bafc216a228007027828db856e/580_0_3683_2946/500.jpg",
    "summary": "Flat racing is taking place at Longchamp, marking a significant event in the racing calendar. Tony Paley will provide ongoing updates throughout the day. Stay tuned for the latest highlights and developments from the races.",
    "published": "2025-10-05T14:13:15Z"
  },
  {
    "title": "Gaza ceasefire talks live: Trump warns Hamas faces ‘complete obliteration’ if it refuses to cede power",
    "url": "https://www.theguardian.com/world/live/2025/oct/05/gaza-ceasefire-israel-palestine-hamas-trump-cairo-negotiations-middle-east-crisis-live-news-updates",
    "image": "https://media.guim.co.uk/547b7a5cc18105a953b48919cda03551a19b5e0f/886_0_4554_3642/500.jpg",
    "summary": "Negotiators are traveling to Egypt following Hamas's agreement to certain elements of Trump's plan for Gaza. This development may pave the way for renewed discussions regarding the region's future. The implications of this agreement could significantly influence the ongoing Israeli-Palestinian conflict.",
    "published": "2025-10-05T14:10:19Z"
  },
  {
    "title": "Singapore Grand Prix 2025: Russell wins as Verstappen holds off Norris to take second – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/05/singapore-grand-prix-2025-f1-live",
    "image": "https://media.guim.co.uk/9aee2463069a8c4e62e9d8e37d0d03ebf4e67f48/1022_0_6268_5015/500.jpg",
    "summary": "Dominic Booth provides a lap-by-lap report on the race at Marina Bay, focusing on pole-sitter George Russell. The report assesses Russell's ability to fend off various title challengers. Fans are invited to follow along to see if he can secure the win.",
    "published": "2025-10-05T14:10:17Z"
  }
]