[
  {
    "title": "Charlie Kirk memorial begins as Trump and Vance expected among thousands of attendees - latest updates",
    "url": "https://www.theguardian.com/us-news/live/2025/sep/21/charlie-kirk-funeral-memorial-time-updates-arizona",
    "image": "https://media.guim.co.uk/884734b8e7c89e0b353c6877f994759baded9ec2/0_0_5000_4000/500.jpg",
    "summary": "President Biden is traveling to Glendale, Arizona, while prominent far-right figures such as Steve Bannon and Lauren Boebert participate in a nearby event. Their presence highlights ongoing political tensions and divisions within the U.S. political landscape. The gathering underscores the contrasting narratives shaping the current political discourse.",
    "published": "2025-09-21T18:38:04Z"
  },
  {
    "title": "What role has Britain played in the history of Israel and Palestine?",
    "url": "https://www.theguardian.com/world/2025/sep/21/what-role-has-britain-played-in-the-history-of-israel-and-palestine",
    "image": "https://media.guim.co.uk/4cb4100d2999d15aa313ef3f45873301ac56e015/173_0_4688_3750/500.jpg",
    "summary": "In the early to mid-1900s, British politicians were instrumental in the establishment of the Israeli state, significantly impacting the region's demographics. Their actions contributed to the displacement of the Palestinian population. This historical context highlights the complex interplay of colonialism and national identity in the Middle East.",
    "published": "2025-09-21T18:35:32Z"
  },
  {
    "title": "Arsenal 1-1 Manchester City: Premier League – as it happened",
    "url": "https://www.theguardian.com/football/live/2025/sep/21/arsenal-v-manchester-city-premier-league-live-score-updates",
    "image": "https://media.guim.co.uk/5c7c32c452745164a24921cc4f89aca2ff8f1fb0/19_0_2714_2171/500.jpg",
    "summary": "Gabriel Martinelli scored a last-minute goal, equalizing for Arsenal against Manchester City. His strike thwarted Erling Haaland's earlier stunning goal that had put City in the lead. As a result, Arsenal secured a draw, preventing City from claiming an away victory.",
    "published": "2025-09-21T18:33:30Z"
  },
  {
    "title": "Lando Norris defiant after failing to take advantage of Piastri’s Azerbaijan crash",
    "url": "https://www.theguardian.com/sport/2025/sep/21/lando-norris-oscar-piastri-mclaren-azerbaijan-grand-prix-formula-one",
    "image": "https://media.guim.co.uk/31ca7b5838361627c9d82ed12d86b3a5b703800d/432_146_4142_3314/500.jpg",
    "summary": "Lando Norris finished seventh in the Baku Grand Prix following Oscar Piastri's early exit. He expressed that he is giving his best performance, regardless of others' perceptions. Norris remains focused on his own efforts rather than external opinions.",
    "published": "2025-09-21T18:12:09Z"
  },
  {
    "title": "Arsenal 1-1 Manchester City: Premier League player ratings",
    "url": "https://www.theguardian.com/football/2025/sep/21/arsenal-1-1-manchester-city-premier-league-player-ratings",
    "image": "https://media.guim.co.uk/a985e6fee07e2158219bba44050e28771dcada7c/430_0_2914_2331/500.jpg",
    "summary": "Eberechi Eze and Gabriel Martinelli made significant contributions as substitutes for Arsenal in their recent match. Erling Haaland was the standout performer of the game, showcasing his exceptional skills. The match highlighted the impact of both emerging talents and established stars in the league.",
    "published": "2025-09-21T18:10:08Z"
  }
]