[
  {
    "title": "Crystal Palace v Brighton, Brentford v Newcastle and more: Premier League clockwatch – live",
    "url": "https://www.theguardian.com/football/live/2025/nov/09/crystal-palace-v-brighton-brentford-v-newcastle-and-more-premier-league-clockwatch-live",
    "image": "https://media.guim.co.uk/324ebc9a8ee3cc723b0de7bc6a8e5aa7d830ab3d/1157_0_5024_4020/500.jpg",
    "summary": "Rivalry matches are set as teams clash at Selhurst Park, with Leeds visiting Nottingham Forest and Aston Villa welcoming Bournemouth. Fans can follow live updates from these exciting encounters. Stay tuned for more developments in the games.",
    "published": "2025-11-09T13:23:35Z"
  },
  {
    "title": "WSL latest updates, Premier League buildup and more – matchday live",
    "url": "https://www.theguardian.com/football/live/2025/nov/09/liverpool-travel-to-manchester-city-premier-league-buildup-and-more-matchday-live",
    "image": "https://media.guim.co.uk/bb6279c22a0c80af13985b401566ab9053ec80ac/1215_0_6075_4860/500.jpg",
    "summary": "Join us for insightful news and engaging discussions as we preview the day's upcoming events before the action starts. Don't miss out on the latest updates and analyses! Be part of the conversation.",
    "published": "2025-11-09T13:22:17Z"
  },
  {
    "title": "ATP Finals tennis: Carlos Alcaraz v Alex de Minaur – live",
    "url": "https://www.theguardian.com/sport/live/2025/nov/09/atp-finals-tennis-carlos-alcaraz-alex-de-minaur-live",
    "image": "https://media.guim.co.uk/c490142ff7064bb59176113e85a149e99df7790e/0_211_2191_1754/500.jpg",
    "summary": "The season-ending tennis tournament kicks off in Turin, featuring world No. 2 facing Australia's Alex de Minaur. Daniel Harris will provide the latest updates on the match. Fans can expect an exciting start to the competition.",
    "published": "2025-11-09T13:21:55Z"
  },
  {
    "title": "Richard Ashcroft review – uplifting epics and rocket-boosted confidence reminiscent of 90s Verve heyday",
    "url": "https://www.theguardian.com/music/2025/nov/09/richard-ashcroft-review-coop-live-manchester-uk-tour",
    "image": "https://media.guim.co.uk/fd8c9c668397ac9c63a7c179bdef4104687f1572/923_0_6827_5464/500.jpg",
    "summary": "The singer, known for his signature sunglasses, aims to elevate both himself and the audience during his performance. The show builds up to an emotional sing-along reminiscent of a grand Last Night of the Proms. This experience leaves attendees feeling uplifted and connected.",
    "published": "2025-11-09T13:06:57Z"
  },
  {
    "title": "California’s drying Salton Sea harms the lungs of people living nearby, say researchers",
    "url": "https://www.theguardian.com/us-news/2025/nov/09/california-salton-sea-drying-health-effects",
    "image": "https://media.guim.co.uk/eee07930b922553e2d04b828b7ff645a6d17591a/0_0_3713_2970/500.jpg",
    "summary": "Experts have raised concerns that sea dust may carry endotoxic bacteria membranes due to fertilizer runoff. This contamination could pose health risks when inhaled or ingested. Further investigation is needed to understand the implications for public health and environmental safety.",
    "published": "2025-11-09T13:00:33Z"
  }
]