[
  {
    "title": "‘Let’s embrace change’: Nuno believes West Ham can turn season around",
    "url": "https://www.theguardian.com/football/2025/oct/03/west-ham-nuno-espirito-santo-arsenal",
    "image": "https://media.guim.co.uk/35904e6b91cdacb6e2db2e95d1ad2cb282e9351b/0_86_2003_1602/500.jpg",
    "summary": "Nuno Espírito Santo expressed confidence in West Ham's players, noting their willingness to improve. He emphasized the importance of embracing this change. The manager is optimistic about the team's potential for transformation.",
    "published": "2025-10-03T22:11:46Z"
  },
  {
    "title": "Arkansas man seeks to have visa status restored after being arrested for ‘Opium’ perfume bottle",
    "url": "https://www.theguardian.com/us-news/2025/oct/03/arkansas-arrest-ysl-opium-perfume-immigration-visa",
    "image": "https://media.guim.co.uk/3dad06cdc2d9ad24b55b4916a2530a49785f5090/0_95_1536_1229/500.jpg",
    "summary": "Police arrested Kapil Raghu after suspecting that a bottle he possessed contained drugs. He was subsequently taken into custody by Immigration and Customs Enforcement (ICE). The incident highlights a potential overlap between drug-related issues and immigration enforcement.",
    "published": "2025-10-03T22:07:06Z"
  },
  {
    "title": "Five Great Reads: Blake’s extraordinary father, trying to live forever, and Italy’s pasta grannies",
    "url": "https://www.theguardian.com/australia-news/2025/oct/04/five-great-reads-blake-johnston-father-living-through-war-trying-to-live-forever-italy-pasta-grannies",
    "image": "https://media.guim.co.uk/8bed89117952e1c6fc90cda284ffe2e8328e0c8f/671_1007_4882_3905/500.jpg",
    "summary": "Guardian Australia has compiled a weekend wrap featuring key articles from the past week, curated by Claire Keenan. The selection highlights significant news and insights. Readers can catch up on essential topics that shaped the week.",
    "published": "2025-10-03T22:00:01Z"
  },
  {
    "title": "Trump says Hamas is ready for peace and Israel ‘must immediately stop bombing of Gaza’ – live",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/03/shutdown-congress-trump-senate-latest-updates",
    "image": "https://media.guim.co.uk/9b4205aea3f4fabc735b6ffe16d553a37b6532ec/580_0_5802_4644/500.jpg",
    "summary": "Donald Trump has expressed support for Hamas's response to his Gaza plan, indicating that he values their engagement. However, Hamas has stated that further negotiations are needed to finalize specific details. This highlights the ongoing complexities of the situation in Gaza and the challenges of reaching an agreement.",
    "published": "2025-10-03T21:58:25Z"
  },
  {
    "title": "Sean ‘Diddy’ Combs sentenced to more than four years in prison and given $500,000 fine – live updates",
    "url": "https://www.theguardian.com/us-news/live/2025/oct/03/sean-diddy-combs-sentencing-trial-conviction-latest-updates",
    "image": "https://media.guim.co.uk/275587ab041d168427a6e4ce98fef167deb4dc24/105_0_2812_2250/500.jpg",
    "summary": "Combs, convicted for transporting individuals for the purpose of prostitution, has been sentenced in New York. The case highlighted issues related to human trafficking and exploitation. The sentencing aims to deter similar offenses and promote justice for victims.",
    "published": "2025-10-03T21:58:08Z"
  }
]