[
  {
    "title": "England v New Zealand: Women’s Cricket World Cup – live",
    "url": "https://www.theguardian.com/sport/live/2025/oct/26/england-v-new-zealand-womens-cricket-world-cup-live",
    "image": "https://media.guim.co.uk/f1fed4002df7f51d0ec05b2ab24755cdf226dd0b/255_0_3823_3058/500.jpg",
    "summary": "England is pursuing a target of 169 runs to defeat New Zealand in their final group match in Visakhapatnam. The match features live updates from writers providing an over-by-over report. Fans are eagerly watching as England aims for a win to advance in the tournament.",
    "published": "2025-10-26T08:21:31Z"
  },
  {
    "title": "Clásico buildup, Hearts v Celtic, Arsenal host Crystal Palace and more – matchday live",
    "url": "https://www.theguardian.com/football/live/2025/oct/26/clasico-buildup-hearts-v-celtic-arsenal-host-crystal-palace-and-more-matchday-live",
    "image": "https://media.guim.co.uk/89de0d3e0b41600a9c8a83ec248a7e59587ca79d/0_0_5000_4000/500.jpg",
    "summary": "Emillia Hawkins will host a segment featuring news, previews, and discussions. The focus is on preparing for an upcoming day filled with significant events. Join in for insights and updates as the action unfolds.",
    "published": "2025-10-26T08:20:18Z"
  },
  {
    "title": "New Zealand beat England by four wickets in first men’s ODI – as it happened",
    "url": "https://www.theguardian.com/sport/live/2025/oct/26/new-zealand-v-england-first-mens-odi-live",
    "image": "https://media.guim.co.uk/744de63198392411825501060a9302013ff9d51b/236_0_3331_2666/500.jpg",
    "summary": "Daryl Mitchell scored an unbeaten 78 to help New Zealand chase down England's total of 223. England's innings was bolstered by Harry Brook's impressive 135 runs. Ultimately, Mitchell's performance led the hosts to victory.",
    "published": "2025-10-26T08:06:55Z"
  },
  {
    "title": "Mitchell steers New Zealand home with Brook’s 135 not enough to save England",
    "url": "https://www.theguardian.com/sport/2025/oct/26/cricket-new-zealand-england-first-mens-odi-report",
    "image": "https://media.guim.co.uk/7a724613ace1d4a0cf82700494df0eccae66c2bc/0_165_3035_2429/500.jpg",
    "summary": "New Zealand triumphed in a thrilling first ODI characterized by struggles from both top-order teams. Harry Brook was the standout performer for England, contributing the majority of their runs. The match featured a mix of excitement and unpredictability throughout.",
    "published": "2025-10-26T08:03:35Z"
  },
  {
    "title": "Peer trying to derail UK smoking ban discussed bill with relative at tobacco firm",
    "url": "https://www.theguardian.com/business/2025/oct/26/uk-smoking-ban-lord-strathcarron-relative-british-american-tobacco",
    "image": "https://media.guim.co.uk/556e1ae055c3c7116659801bbdcad6f69dbc9531/324_0_2077_1661/500.jpg",
    "summary": "Lord Strathcarron revealed that he and a high-ranking relative at British American Tobacco had conversations regarding a bill intended to regulate the tobacco industry. Strathcarron intends to weaken this legislation. The discussions raise concerns about potential conflicts of interest and influence on public policy.",
    "published": "2025-10-26T08:00:58Z"
  }
]